{
    "title": "Democrats' next political high-wire act: Selling their $3.5T budget deal",
    "text": [
        {
            "id": 0,
            "text": "Even as they closed in on their budget agreement, Senate Democrats knew that a deal among Budget panel members wouldn't guarantee support among their entire caucus."
        },
        {
            "id": 1,
            "text": "Biden's appearance at their Wednesday lunch meeting is aimed at helping things along."
        },
        {
            "id": 2,
            "text": "“The key is, we’ve just got to get to a place where we know we got all 50 Dems,” said Sen. Tim Kaine (D-Va.)."
        },
        {
            "id": 3,
            "text": "“We’re getting close, but as you know, there’s multiple steps to getting close on kind of a general agreement ..."
        },
        {
            "id": 4,
            "text": "that’s not the same as then getting close on the bill itself.”"
        },
        {
            "id": 5,
            "text": "Democratic leaders are gaming out several scenarios for muscling through the behemoth one-party spending bill given their razor-thin majorities in the House and Senate."
        },
        {
            "id": 6,
            "text": "Among the scenarios under consideration earlier this week was for House Democrats to vote on the party’s budget blueprint first, reasserting the lower chamber’s role in a process that has publicly been seen as more Senate-driven, according to several Democratic aides."
        },
        {
            "id": 7,
            "text": "By Wednesday, however, that approach seemed less likely."
        },
        {
            "id": 8,
            "text": "There’s also the question of whether Senate Majority Leader Chuck Schumer will put the bipartisan infrastructure bill — assuming a deal is reached — up for a vote before the budget blueprint."
        },
        {
            "id": 9,
            "text": "Schumer has insisted that Democrats will vote on the bipartisan physical infrastructure deal before leaving for the August recess, while also beginning the process for the party’s other priorities."
        },
        {
            "id": 10,
            "text": "Speaker Nancy Pelosi, meanwhile, vowed her chamber won’t even consider the bipartisan infrastructure bill until the Senate not only passes its budget but also the filibuster-proof legislation that the fiscal blueprint is designed to set in motion."
        },
        {
            "id": 11,
            "text": "During his opening remarks Wednesday, Schumer touted the $3.5 trillion agreement but acknowledged \"this is only the first step in the long road we will have to travel and must travel.\""
        },
        {
            "id": 12,
            "text": "The dizzying maneuvering on how to time the bills underscores the high stakes for Democratic leaders."
        },
        {
            "id": 13,
            "text": "One misstep could alienate a vital faction of the party and doom their chances at passing Biden’s next big legislative priority."
        },
        {
            "id": 14,
            "text": "“It’s going to be really hard."
        },
        {
            "id": 15,
            "text": "It’s going to take people that may disagree but feel that they’ll vote for it because it’s the best thing for the country,” said Sen. Jon Tester (D-Mont.) of the effort to pass both the bipartisan bill and Democrats’ social spending package."
        },
        {
            "id": 16,
            "text": "“I’m glad I don’t have Chuck’s job.”"
        },
        {
            "id": 17,
            "text": "While Senate Budget Committee Democrats now have an agreement on a top-line number, they still need to release policy details."
        },
        {
            "id": 18,
            "text": "Sen. Joe Manchin (D-W.Va.) said Tuesday before the agreement was reached that he wanted to see the package fully paid for."
        },
        {
            "id": 19,
            "text": "Sen. Mark Warner (D-Va.), a moderate on the Budget Committee, said Tuesday evening that that criteria was met but provided no specifics."
        },
        {
            "id": 20,
            "text": "A spokesperson for Sen. Kyrsten Sinema said that the Arizona Democrat \"will give careful consideration to any idea that can strengthen Arizona's economy and help Arizona families get ahead.”"
        },
        {
            "id": 21,
            "text": "Senate Democrats can’t afford a single defection on the forthcoming mega-bill, while Pelosi can only lose three or four votes in her caucus."
        },
        {
            "id": 22,
            "text": "Before that measure can move forward, Democrats must pass a budget."
        },
        {
            "id": 23,
            "text": "Their problems start there."
        },
        {
            "id": 24,
            "text": "Several House progressives have said they’d prefer a scenario in which they vote on that resolution first."
        },
        {
            "id": 25,
            "text": "But at least six House centrists have united to back the opposite approach, saying they are willing to block consideration of the budget altogether unless it clears the Senate first, according to a Democratic aide close to the moderate wing."
        },
        {
            "id": 26,
            "text": "Many are reluctant to cast what could be a tough vote without knowing what Manchin and Sinema will accept — and are especially unwilling to cast it twice."
        },
        {
            "id": 27,
            "text": "Their biggest concern is that the party’s budget blueprint could change substantially in the Senate, where an all-night marathon of amendments could have unforeseen political consequences for vulnerable House Democrats already fretting about losing their majority."
        },
        {
            "id": 28,
            "text": "But progressives in the House argue that they'd be going first only after the Senate and House get on the same page."
        },
        {
            "id": 29,
            "text": "“It wouldn’t be like, 'Here’s our wish list, and maybe the Senate will vote for it or maybe they won’t.'"
        },
        {
            "id": 30,
            "text": "It would be the agreement largely being in place,” said Rep. Pramila Jayapal (D-Wash.), who leads the Congressional Progressive Caucus."
        },
        {
            "id": 31,
            "text": "In interviews, Senate Democrats did not express a preference for which chamber should vote first on the party-line package and said they’re instead focusing on reaching a complete agreement first — and Tuesday night's $3.5 trillion agreement is just the first step toward."
        },
        {
            "id": 32,
            "text": "“I kind of always assumed we would have to go first because it’s just a lot harder to get to 50, so from a practical standpoint, it feels like the Senate might need to go first, but I guess I don’t have a personal preference,” said Sen. Chris Murphy (D-Conn.)."
        },
        {
            "id": 33,
            "text": "During a private caucus lunch Tuesday, Schumer said he told Democrats not to “draw lines in the sand.\""
        },
        {
            "id": 34,
            "text": "He's going to bear the biggest burden when it comes to selling House counterparts on a separate and bipartisan $1 trillion infrastructure plan, with a key assist from Pelosi."
        },
        {
            "id": 35,
            "text": "Even that depends on whether the five Republicans who negotiated the deal can solidify soft support from others in the GOP, a challenge that will depend in large part on how the Congressional Budget Office scores the bill’s funding mechanisms."
        },
        {
            "id": 36,
            "text": "Importantly, Democrats involved in the bipartisan talks were still short of an actual bill even as Budget Committee Democrats celebrated their breakthrough on a top-line number."
        },
        {
            "id": 37,
            "text": "The bipartisan group working on the $1 trillion infrastructure package is aiming to resolve outstanding issues among members by Thursday."
        },
        {
            "id": 38,
            "text": "Tester, who helped negotiate the bipartisan accord, said Tuesday that senators are “still not out of the woods” on it."
        },
        {
            "id": 39,
            "text": "Burgess Everett, Andrew Desiderio and Nicholas Wu contributed to this report."
        }
    ]
}