{
    "title": "Issa releases Kerry from commitment to testify on Benghazi",
    "text": [
        {
            "id": 0,
            "text": "While accusing Secretary of State John F. Kerry of trying to “squirm his way” out of a commitment to appear before his committee, House Oversight and Government Reform (OGR) Committee Chairman Darrell E. Issa said Friday he will no longer try to force Mr. Kerry to testify on Benghazi at a June 12 hearing."
        },
        {
            "id": 1,
            "text": "Mr. Issa, California Republican, had subpoenaed Mr. Kerry twice to appear before committee."
        },
        {
            "id": 2,
            "text": "After some jockeying over scheduling, the State Department implied that Mr. Kerry would appear before either Mr. Issa’s committee to testify about the Sept. 11, 2012, terrorist attack or a select committee on Benghazi chaired by GOP Rep. Trey Gowdy of South Carolina — but not both."
        },
        {
            "id": 3,
            "text": "Mr. Issa said in a statement Friday that Mr. Kerry and others’ attempts to use the June 12 hearing as a “shield” against the select committee meant it was time to reassess."
        },
        {
            "id": 4,
            "text": "“It’s been disappointing to watch a long serving former senator, like Secretary Kerry, squirm his way to what I’m doing today — releasing him from the upcoming hearing commitment he made only after we issued him a subpoena,” Mr. Issa said."
        },
        {
            "id": 5,
            "text": "Mr. Issa said no matter how long it takes, getting the truth about what happened in the attack, which claimed the lives of four Americans, is what matters and that the select committee “is the House of Representatives’ commitment to getting this truth.”"
        },
        {
            "id": 6,
            "text": "“While Speaker [John] Boehner and I had both originally concluded that Secretary Kerry needed to promptly testify and explain why his Department had withheld subpoenaed documents, neither of us immediately recognized how opponents of congressional oversight would use this as an opportunity to distract from the Select Committee’s effort,” Mr. Issa said."
        },
        {
            "id": 7,
            "text": "State Department spokeswoman Jen Psaki said Friday the department was “mystified by the decision to cancel the briefing and also mystified by the language in the press release that was just issued.”"
        },
        {
            "id": 8,
            "text": "“Our view is that these issues have been pored over in depth to an extensive degree, and our focus, as you’ve heard the secretary say, should be on what we can do together with Congress to protect the men and women serving overseas,” she said."
        },
        {
            "id": 9,
            "text": "She said they haven’t received a specific request from the select committee yet but remain committed to being cooperative, and that Mr. Kerry values the role of oversight."
        },
        {
            "id": 10,
            "text": "Another State Department spokeswoman, Marie Harf, said last week that Mr. Kerry was prepared to testify before Mr. Issa’s committee on either June 12 or June 20 and that the department believed there were more appropriate witnesses but was trying to be cooperative."
        },
        {
            "id": 11,
            "text": "“We have been clear that we’re willing to work with the committee despite the fact that the Benghazi oversight has been consolidated under the select committee,” she said."
        },
        {
            "id": 12,
            "text": "“We believe the secretary’s appearance before [oversight] will eliminate any need for the secretary to appear a second time before the select committee.”"
        },
        {
            "id": 13,
            "text": "Sign up for Daily Newsletters Manage Newsletters"
        },
        {
            "id": 14,
            "text": "Copyright © 2021"
        },
        {
            "id": 15,
            "text": "The Washington Times, LLC."
        },
        {
            "id": 16,
            "text": "Click here for reprint permission."
        }
    ]
}