{
    "title": "Feinstein: Obama maybe ‘too cautious’ on ISIS, but plans are underway",
    "text": [
        {
            "id": 0,
            "text": "The chairwoman of the Senate Intelligence Committee said Sunday that President Obama is notably cautious — “maybe, in this instance, too cautious” — but insisted the U.S. and its allies will coalesce behind a plan to beat back the Islamic State in Iraq and Syria before their well-funded sources take Baghdad."
        },
        {
            "id": 1,
            "text": "Mr. Obama raised eyebrows last week when he admitted that the U.S. does not have a strategy yet to defeat the movement."
        },
        {
            "id": 2,
            "text": "But Sen. Dianne Feinstein, California Democrat, noted that Mr. Obama and Secretary of State John Kerry are equipped to bring allies together at this week’s NATO conference in Wales."
        },
        {
            "id": 3,
            "text": "The stakes are high, she noted, as the Islamic State has shown its brutality by sweeping through Iraq and killing American journalist James Foley\n\n“I believe it’s potentially very serious,” she told “Meet the Press.”"
        },
        {
            "id": 4,
            "text": "“They have announced that they don’t intend to stop."
        },
        {
            "id": 5,
            "text": "They have announced that they will come after us if they can, that they will, quote, spill our blood."
        },
        {
            "id": 6,
            "text": "They have, indeed, done that by beheading Mr. Foley and who knows how many others that are unknown."
        },
        {
            "id": 7,
            "text": "This is a vicious, vicious movement, and it has to be confronted.”"
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        }
    ]
}