{
    "title": "Senate Passes Bill Making Juneteenth a National Holiday",
    "text": [
        {
            "id": 0,
            "text": "Senator John Cornyn (R., Texas) speaks before the Senate Judiciary Committee in Washington, D.C., on February 22, 2021."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "The Senate passed legislation Tuesday that designates Juneteenth, the anniversary of the emancipation of those who were enslaved in the United States, a national holiday."
        },
        {
            "id": 3,
            "text": "Democratic Senate Majority Leader Chuck Schumer reportedly asked for unanimous consent to advance the bill and no members of either party objected."
        },
        {
            "id": 4,
            "text": "The bill’s leading co-sponsor was Republican Texas senator John Cornyn, who wrote a statement on Twitter applauding the bipartisan approval of the measure."
        },
        {
            "id": 5,
            "text": "“Happy that my bill to recognize Juneteenth as a national holiday just passed the Senate."
        },
        {
            "id": 6,
            "text": "It has been a state holiday in Texas for more than 40 years."
        },
        {
            "id": 7,
            "text": "Now more than ever, we need to learn from our history and continue to form a more perfect union,” Cornyn tweeted."
        },
        {
            "id": 8,
            "text": "The news of the legislation’s passing in the Senate chamber comes after Republican Senator Ron Johnson clarified that he had no intention to block it."
        },
        {
            "id": 9,
            "text": "He did comment, however, that he took issue with the “cost and lack of the debate,” claiming it “seems strange” that having taxpayers provide federal employees paid time off is now required to celebrate the end of slavery.”"
        },
        {
            "id": 10,
            "text": "“I support celebrating the end of slavery, emancipation,” Johnson told the Huffington Post."
        },
        {
            "id": 11,
            "text": "“I just think it’s kind of odd that now apparently the only way to do that is to give 2 million federal workers a paid day off, cost American taxpayers $600 million.”"
        },
        {
            "id": 12,
            "text": "Similar legislation was introduced in 2020, with then-Democratic Senator Kamala Harris collaborating with Cornyn to author it."
        },
        {
            "id": 13,
            "text": "The 2021 bill, titled the Juneteenth National Independence Day Act, has 60 Senate cosponsors, including 18 Republicans, meaning it has sufficient support necessary to end a filibuster."
        },
        {
            "id": 14,
            "text": "A companion House bill proposed by Democratic Representative Sheila Jackson Lee garnered Republican co-sponsorship as well."
        },
        {
            "id": 15,
            "text": "Juneteenth commemorates the Union Army’s June 16, 1865 declaration in Galveston, Texas that slavery had been outlawed in the United States, liberating America’s remaining enslaved African Americans."
        },
        {
            "id": 16,
            "text": "Former President Abraham Lincoln signed the Emancipation Proclamation two years prior."
        },
        {
            "id": 17,
            "text": "All 50 states except South Dakota honor and celebrate Juneteenth as a holiday."
        },
        {
            "id": 18,
            "text": "The African American community has long recognized the day as one of great cultural magnitude and significance."
        },
        {
            "id": 19,
            "text": ""
        }
    ]
}