{
    "title": "No Copies of Clinton Emails on Server, Lawyer Says",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — An examination of the server that housed the personal email account that Hillary Rodham Clinton used exclusively when she was secretary of state showed that there are no copies of any emails she sent during her time in office, her lawyer told a congressional committee on Friday."
        },
        {
            "id": 1,
            "text": "After her representatives determined which emails were government-related and which were private, a setting on the account was changed to retain only emails sent in the previous 60 days, her lawyer, David Kendall, said."
        },
        {
            "id": 2,
            "text": "He said the setting was altered after she gave the records to the government."
        },
        {
            "id": 3,
            "text": "“Thus, there are no hdr22@clintonemail.com emails from Secretary Clinton’s tenure as secretary of state on the server for any review, even if such review were appropriate or legally authorized,” Mr. Kendall said in a letter to the House select committee investigating the 2012 attacks in Benghazi, Libya."
        },
        {
            "id": 4,
            "text": "The committee subpoenaed the server this month, asking Mrs. Clinton to hand it over to a third party so it could determine which emails were personal and which were government records."
        },
        {
            "id": 5,
            "text": "At a news conference this month, Mrs. Clinton appeared to provide two answers about whether she still had copies of her emails."
        },
        {
            "id": 6,
            "text": "First, she said that she “chose not to keep” her private personal emails after her lawyers had examined the account and determined on their own which ones were personal and which were State Department records."
        },
        {
            "id": 7,
            "text": "But later, she said that the server, which contained personal communication by her and her husband, former President Bill Clinton, “will remain private.”"
        },
        {
            "id": 8,
            "text": "The server was kept at their home in Chappaqua, N.Y., which is protected around the clock by the Secret Service."
        },
        {
            "id": 9,
            "text": "Mrs. Clinton’s disclosure on Friday only heightened suspicions by the committee’s chairman, Representative Trey Gowdy, Republican of South Carolina, about how she handled her emails, and it is likely to lead to more tension between her and the committee."
        },
        {
            "id": 10,
            "text": "Mr. Gowdy said in a written statement that it appeared that Mrs. Clinton deleted the emails after Oct. 28, when the State Department first asked her to turn over emails that were government records."
        },
        {
            "id": 11,
            "text": "“Not only was the secretary the sole arbiter of what was a public record, she also summarily decided to delete all emails from her server, ensuring no one could check behind her analysis in the public interest,” Mr. Gowdy said."
        },
        {
            "id": 12,
            "text": "Mrs. Clinton’s “unprecedented email arrangement with herself and her decision nearly two years after she left office to permanently delete all emails” had deprived Americans of a full record of her time in office, he added."
        },
        {
            "id": 13,
            "text": "Mr. Gowdy said that Mrs. Clinton would have to answer questions from Congress about her decision, but he did not say whether that would be at a hearing or a private interview."
        },
        {
            "id": 14,
            "text": "A spokesman for Mrs. Clinton said in a statement, “She’s ready and willing to come and appear herself for a hearing open to the American public.”"
        },
        {
            "id": 15,
            "text": "The spokesman, Nick Merrill, added that Mrs. Clinton’s representatives “have been in touch with the committee and the State Department to make clear that she would like her emails made public as soon as possible.”"
        },
        {
            "id": 16,
            "text": "The ranking Democrat on the committee, Elijah E. Cummings of Maryland, defended Mrs. Clinton’s disclosure."
        },
        {
            "id": 17,
            "text": "Donald J. Trump officially accepted the Republican party's nomination on July 22."
        },
        {
            "id": 18,
            "text": "Hillary Clinton was officially nominated on July 26 at the Democratic Convention."
        },
        {
            "id": 19,
            "text": "“This confirms what we all knew — that Secretary Clinton already produced her official records to the State Department, that she did not keep her personal emails, and that the select committee has already obtained her emails relating to the attacks in Benghazi,” Mr. Cummings said."
        },
        {
            "id": 20,
            "text": "In the letter, Mr. Kendall offered a defense for the process Mrs. Clinton had used to differentiate between personal messages and government records."
        },
        {
            "id": 21,
            "text": "He said that those procedures were consistent with guidelines from the National Archives and the State Department, which say that an individual can make the decision about what should be preserved as a federal record."
        },
        {
            "id": 22,
            "text": "So, Mr. Kendall contended, the process Mrs. Clinton used was “not an ‘arrangement’ that is ‘unprecedented’ or ‘unique,’ but instead the normal procedure carried out by tens of thousands of agency officials and employees in the ordinary course.”"
        },
        {
            "id": 23,
            "text": "Mrs. Clinton’s review of her emails, however, did not occur when she was secretary of state or shortly after she left office."
        },
        {
            "id": 24,
            "text": "Last October, nearly two years after she left office, the State Department sent her a letter requesting all government records, like emails, she may have possessed."
        },
        {
            "id": 25,
            "text": "In response, she provided the State Department in December with about 30,000 printed emails that she said were government records."
        },
        {
            "id": 26,
            "text": "She has said that an additional 30,000 emails were personal."
        },
        {
            "id": 27,
            "text": "It appears that Mrs. Clinton still has copies of the emails she deemed public records."
        },
        {
            "id": 28,
            "text": "Attached to Mr. Kendall’s letter was one sent to him by the State Department this week."
        },
        {
            "id": 29,
            "text": "A letter from the under secretary of state for management, Patrick F. Kennedy, said that the department understood that she wanted to keep copies of those documents."
        },
        {
            "id": 30,
            "text": "Mr. Kennedy said that the agency had consulted with the National Archives, and that allowing her “access to the documents is in the public interest as it will promote informed discussion” as she responds to congressional and other inquiries."
        },
        {
            "id": 31,
            "text": "Mrs. Clinton cannot make the emails public without the State Department’s approval."
        },
        {
            "id": 32,
            "text": "Mr. Kennedy said that if the State Department determined that any of the documents were classified, “additional steps will be required to safeguard and protect the information.”"
        },
        {
            "id": 33,
            "text": "Mrs. Clinton has said she had no classified information in her emails."
        }
    ]
}