{
    "title": "All Eyes On The Supreme Court As Decisions on Marriage, Obamacare Loom",
    "text": [
        {
            "id": 0,
            "text": "All eyes are on the Supreme Court Thursday as the country anxiously awaits decisions from the Justices on two major cases regarding Obamacare and gay marriage."
        },
        {
            "id": 1,
            "text": "With the Court's season quickly coming to a close at the end of June, earlier this day an additional day was added for the release of opinions."
        },
        {
            "id": 2,
            "text": "Final decisions on remaining cases with be issued Thursday, Friday and Monday June 29."
        },
        {
            "id": 3,
            "text": "The two major cases with high impact on the country as a whole economically, socially and politically are King v. Burwell and Obergefell v. Hodges."
        },
        {
            "id": 4,
            "text": "At issue from SCOTUS blog:\n\nKing v. Burwell:\n\nWhether the Internal Revenue Service may permissibly promulgate regulations to extend tax-credit subsidies to coverage purchased through exchanges established by the federal government under Section 1321 of the Patient Protection and Affordable Care Act."
        },
        {
            "id": 5,
            "text": "King v. Burwell is yet another case arising out of the Affordable Care Act."
        },
        {
            "id": 6,
            "text": "In 2012, the Court rejected a challenge to the ACA’s individual mandate, which requires everyone in the United States to obtain health insurance or pay a penalty."
        },
        {
            "id": 7,
            "text": "Many people get health insurance through their employers, but the people who don’t – because they are self-employed or unemployed, for example – can purchase it through an online marketplace, known as an “exchange.”"
        },
        {
            "id": 8,
            "text": "The drafters of the ACA had originally expected each state to set up its own exchange, but after many states declined to do so, the federal government stepped in to create them instead."
        },
        {
            "id": 9,
            "text": "Obergefell v. Hodges:\n\n1) Does the Fourteenth Amendment require a state to license a marriage between two people of the same sex? 2)"
        },
        {
            "id": 10,
            "text": "Does the Fourteenth Amendment require a state to recognize a marriage between two people of the same sex when their marriage was lawfully licensed and performed out-of-state?"
        },
        {
            "id": 11,
            "text": "Should the subsidies in King v. Burwell be struck down by the Court, Obamacare will suffer a tremendous blow."
        },
        {
            "id": 12,
            "text": "Just a few weeks ago, an irritated President Obama said the case should have never been taken up and that he expects the court to rule in favor of the law."
        },
        {
            "id": 13,
            "text": "Keep in mind that Obamacare architect Jonathan Gruber has been seen multiple times saying the law was written so that people who live in states without state exchanges cannot receive federal subsidies for their health insurance."
        },
        {
            "id": 14,
            "text": "A number of Christian pastors have vowed \"civil disobedience\" should gay marriage be upheld in states that have voted to ban it and many have warned a ruling against traditional marriage could jeopardize the tax exempt status of churches around the country."
        },
        {
            "id": 15,
            "text": "From CNN:\n\nNew Mexico Pastor Steve Smothermon says he is ready to go to jail to protect his religious freedom."
        },
        {
            "id": 16,
            "text": "And he is not the only one."
        },
        {
            "id": 17,
            "text": "Smothermon is one of more than 50,000 people who have signed a pledge to engage in social disobedience if the U.S. Supreme Court issues a ruling this month that would legalize same sex marriage across the country."
        },
        {
            "id": 18,
            "text": "\"We want to help people, but we are not going to be forced by the government and society or the politically correct to say we are going to believe in it,\" said Smothermon, senior pastor of Legacy Church in Albuquerque."
        },
        {
            "id": 19,
            "text": "\"If they said, 'Listen pastor, we are going to put you in jail if you don't honor this.'"
        },
        {
            "id": 20,
            "text": "I am going to say, 'Then put me in jail.' \""
        },
        {
            "id": 21,
            "text": "Decisions are released at 10 a.m."
        },
        {
            "id": 22,
            "text": "et."
        }
    ]
}