{
    "title": "House Passes Bill To Give Back Pay To Federal Workers Furloughed In Government Shutdown",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON --"
        },
        {
            "id": 1,
            "text": "The U.S. House of Representatives agreed on at least one issue as the government shutdown entered its fifth day Saturday: Federal employees will receive back pay for the time they were out of work."
        },
        {
            "id": 2,
            "text": "The Federal Employee Retroactive Pay Fairness Act sailed through the lower chamber by a vote of 407-0 Saturday morning."
        },
        {
            "id": 3,
            "text": "The bipartisan bill, co-sponsored by Virginia Reps. Jim Moran (D) and Frank Wolf (R), was expected to pass, since Congress has typically granted back pay to furloughed workers after previous government shutdowns."
        },
        {
            "id": 4,
            "text": "Approximately 800,000 federal workers considered \"nonessential\" are currently being furloughed, without pay."
        },
        {
            "id": 5,
            "text": "Workers deemed essential who are right now working without pay will be compensated for their work during the shutdown, though their paychecks could be delayed."
        },
        {
            "id": 6,
            "text": "Only back pay for furloughed workers requires congressional approval."
        },
        {
            "id": 7,
            "text": "Senate Majority Leader Harry Reid (D-Nev.) said Saturday that House Republicans were sending a \"cruel\" message to federal workers by offering them pay but refusing to allow them to return to their jobs."
        },
        {
            "id": 8,
            "text": "\"What the Republicans in the House are telling -- because they're the ones that set the agenda -- all these federal workers [is] ... even though we don't like federal workers and we haven't given you a raise in three years, what we're going to do now is give you a paid vacation,\" Reid said."
        },
        {
            "id": 9,
            "text": "\"It's really cruel to tell workers they'll receive back pay once the government opens and then refuse to open the government."
        },
        {
            "id": 10,
            "text": "Let's open the government,\" he added."
        },
        {
            "id": 11,
            "text": "\"Hundreds of thousands of furloughed federal servants want to work."
        },
        {
            "id": 12,
            "text": "They should be allowed to work.\""
        },
        {
            "id": 13,
            "text": "The Senate is nonetheless expected to take up the pay measure, which was formally backed by the White House Friday."
        },
        {
            "id": 14,
            "text": "The only other bill to make it through the impasse over funding for the government has guaranteed pay to U.S. troops; President Barack Obama signed that measure into law hours before the shutdown took effect."
        },
        {
            "id": 15,
            "text": "Even as lawmakers came together to secure retroactive pay for federal workers, they continued to berate each other for failing to end the shutdown."
        },
        {
            "id": 16,
            "text": "Rep. Hal Rogers (R-Ky.) mocked the Senate for making an exception for back pay, while ignoring a series of targeted spending bills to reopen some of the government."
        },
        {
            "id": 17,
            "text": "\"The Senate has plans to take up this bill."
        },
        {
            "id": 18,
            "text": "Stop the presses,\" Rogers said."
        },
        {
            "id": 19,
            "text": "In recent days, House Republicans passed measures that would restore funding to the parts of the government that have gained the most visibility, such as Veterans Affairs, parks and museums and the National Guard."
        },
        {
            "id": 20,
            "text": "The Democratic-controlled Senate has criticized the House GOP's piecemeal approach, which faces a veto threat from the Obama administration."
        },
        {
            "id": 21,
            "text": "White House press secretary Jay Carney argued retroactive pay was different from how to resolve funding for the government."
        },
        {
            "id": 22,
            "text": "\"The back pay is not piecemeal,\" Carney told reporters Friday."
        },
        {
            "id": 23,
            "text": "\"That’s something that Congresses have done every time there’s been a shutdown, as I understand it.\""
        },
        {
            "id": 24,
            "text": "He added the back pay was conditioned for when Republicans open the government."
        },
        {
            "id": 25,
            "text": "President Barack Obama and Democrats have continued to call on House Speaker John Boehner (R-Ohio) to bring up a clean bill, with no strings attached, pointing out he has the votes to reopen the entire government."
        },
        {
            "id": 26,
            "text": "Federal workers have been hit hard by the shutdown, which comes on top of a three-year freeze on cost-of-living raises in their paychecks, imposed by a Congress making efforts to reduce the deficit."
        },
        {
            "id": 27,
            "text": "Rep. Elijah Cummings (D-Md.) pointed out that federal workers have also suffered the brunt of sequestration, the draconian cuts that came out of the last budget impasse and went into effect on March 1."
        },
        {
            "id": 28,
            "text": "\"Our federal employees have been under relentless and unfair attack and have sacrificed so much in recent years,\" he said."
        },
        {
            "id": 29,
            "text": "\"The least we can do is give them the assurance that they will receive back pay.\""
        },
        {
            "id": 30,
            "text": ""
        }
    ]
}