{
    "title": "Clinton Foundation to restrict foreign donations",
    "text": [
        {
            "id": 0,
            "text": "Responding to concerns from activists across the political spectrum, the Clinton Foundation board voted Wednesday to tighten its policy on accepting foreign donations  -- and to make its operations more transparent."
        },
        {
            "id": 1,
            "text": "The new rules mean that other countries would be prohibited from making large donations to the Foundation, including those that contributed in recent years such as Saudi Arabia, Qatar and the Dominican Republic."
        },
        {
            "id": 2,
            "text": "Minassian said that those countries had contributed funds used for general program, except for the Dominican Republic which contributed to a special fund working to combat AIDS."
        },
        {
            "id": 3,
            "text": "The new policy is unlikely to quiet criticism of the foundation's vast donor network, as Republicans seize on the unusual opportunity of a presidential candidate who retains a connection to philanthropy that accepts foreign dollars."
        },
        {
            "id": 4,
            "text": "Clinton herself has taken steps to separate herself from the foundation, which was founded by her husband but also now formally bears her name as well."
        },
        {
            "id": 5,
            "text": "As she announced she was running for president Sunday, the foundation said that she had resigned from the organization's board."
        },
        {
            "id": 6,
            "text": "The new policy is more restrictive than the one adopted by the foundation at the time Hillary Clinton was secretary of state."
        },
        {
            "id": 7,
            "text": "However, it does nothing to restrict donations from foreign individuals or companies, including those affiliated with foreign governments."
        },
        {
            "id": 8,
            "text": "A Washington Post review found that a third of the foundation's largest donors came from out of the country."
        },
        {
            "id": 9,
            "text": "The most significant change is the requirement that the foundation will disclose its contributors four times a year, starting in July, rather than only once a year."
        },
        {
            "id": 10,
            "text": "However, the new policy will continue the practice of not specifying exactly how much each donor has provided nor the exact date on which the contribution was made."
        },
        {
            "id": 11,
            "text": "The governments from which the foundation will continue to accept donations have been major givers to the foundation through the years."
        },
        {
            "id": 12,
            "text": "Australia, for instance, has given more than $15 million."
        },
        {
            "id": 13,
            "text": "Norway has given more than $10 million, the Netherlands has given more than $5 million."
        },
        {
            "id": 14,
            "text": "The Foundation also announced that officials will stop holding Clinton Global Initiative events outside the United States -- except for a long-planned event set for Morocco in  May."
        },
        {
            "id": 15,
            "text": "Foreign governments may attend the U.S.-based meetings, and the foundation will accept admission fees."
        },
        {
            "id": 16,
            "text": "The agreement reached with the Obama administration in 2009 prior to Clinton's confirmation as secretary included a provision that allowed the foundation to continue to accept donations from governments that had been giving in the past, providing they did not substantially increase their giving."
        },
        {
            "id": 17,
            "text": "But it could also accept new government donations, provided they were cleared by a State Department ethics officer."
        },
        {
            "id": 18,
            "text": "The foundation, however, said it never availed itself of that process."
        },
        {
            "id": 19,
            "text": "In one instance, it said a donation from the government of Algeria was accepted without the ethics review -- they said by accident."
        },
        {
            "id": 20,
            "text": "The move, first reported by The Wall Street Journal, is likely to win applause from some Clinton supporters who had privately expressed concern about the organization's dependence on foreign donors."
        },
        {
            "id": 21,
            "text": "However some critics are likely not to be completely satisfied."
        },
        {
            "id": 22,
            "text": "Last week, longtime campaign finance reform advocate Fred Wertheimer said in an interview with The Post that the foundation should cease accepting money from all foreign entities, including governments, individuals and corporations."
        }
    ]
}