{
    "title": "Donald Trump Tells N.R.A. Hillary Clinton Wants to Let Violent Criminals Go Free",
    "text": [
        {
            "id": 0,
            "text": "LOUISVILLE, Ky. — Donald J. Trump accused Hillary Clinton on Friday of wanting to let violent criminals out of prison and “disarm” law-abiding citizens in unsafe neighborhoods, and warned that women, in particular, would be at greater risk if she were elected president."
        },
        {
            "id": 1,
            "text": "Accepting the endorsement of the National Rifle Association at its annual convention here, Mr. Trump — who has not always been the staunchest opponent of stricter gun controls — said the November election would be a referendum on the Second Amendment."
        },
        {
            "id": 2,
            "text": "He claimed,  hyperbolically, that Mrs. Clinton, his likely Democratic opponent, “wants to take away your guns.”"
        },
        {
            "id": 3,
            "text": "“Crooked Hillary Clinton is the most anti-gun, anti-Second Amendment candidate ever to run for office,” he said."
        },
        {
            "id": 4,
            "text": "Mrs. Clinton has called for tightened restrictions on guns, but not for abolishing the right to own them."
        },
        {
            "id": 5,
            "text": "Mr. Trump, whose record of sexist remarks, among other things, has left him at a potentially crippling disadvantage among female voters, polls show, appealed directly to women in his speech, imbuing his defense of gun rights with an undercurrent of fear."
        },
        {
            "id": 6,
            "text": "“In trying to overturn the Second Amendment, Hillary Clinton is telling everyone — and every woman living in a dangerous community — that she doesn’t have the right to defend herself,” Mr. Trump said."
        },
        {
            "id": 7,
            "text": "“So you have a woman living in a community, a rough community, a bad community — sorry, you can’t defend yourself.”"
        },
        {
            "id": 8,
            "text": "If Mr. Trump’s comments seemed reminiscent of an era when crime rates were far higher — the Willie Horton ads attacking Michael S. Dukakis, the Democratic nominee, in the 1988 presidential race came to mind — they also appeared somewhat at odds with the broad bipartisan consensus on the need to reduce incarceration rates and prison populations: Mr. Trump sought to frighten voters about the idea of criminals being released from prison."
        },
        {
            "id": 9,
            "text": "Donald J. Trump is set to be the Republican standard-bearer, but when it comes to some of his policies, he is out of sync with many Republican leaders in Congress."
        },
        {
            "id": 10,
            "text": "He said Mrs. Clinton’s agenda was “to release the violent criminals from jail,” freeing them to roam the streets and put “innocent Americans at risk.”"
        },
        {
            "id": 11,
            "text": "He even tried out a new epithet for Mrs. Clinton: “heartless Hillary.”"
        },
        {
            "id": 12,
            "text": "Calling Mrs. Clinton and her husband, former President Bill Clinton, “heartless hypocrites,” he dared them to “let their bodyguards immediately disarm,” an apparent reference to their Secret Service protection."
        },
        {
            "id": 13,
            "text": "“Let’s see how good they do,” Mr. Trump said."
        },
        {
            "id": 14,
            "text": "“Let’s see how they feel walking around without their guns and their bodyguards."
        },
        {
            "id": 15,
            "text": "In the meantime, nobody else can have the guns, right?”"
        },
        {
            "id": 16,
            "text": "Mr. Trump’s efforts to shore up his support among the N.R.A.’s more than five million members could help him in the Rust Belt states that he would need to carry to win the White House."
        },
        {
            "id": 17,
            "text": "But Mrs. Clinton must strike a more delicate balance on the issue: In the Democratic primaries against Senator Bernie Sanders of Vermont, who has a mixed record on gun control, she has taken an aggressive tack against firearm manufacturers and sellers."
        },
        {
            "id": 18,
            "text": "In a general election contest with Mr. Trump, however, Mrs. Clinton would vie with him for the loyalties of white voters in a number of battleground states where support for gun rights runs deep."
        },
        {
            "id": 19,
            "text": "Indeed, in recent weeks, as she campaigned before largely white, working-class audiences in Appalachian and Great Lakes states, she has de-emphasized gun control and focused more on job creation and economic aid for financially struggling communities."
        },
        {
            "id": 20,
            "text": "But on Saturday, Mrs. Clinton will speak at a dinner of the Trayvon Martin Foundation’s “Circle of Mothers” in Fort Lauderdale, Fla., a group offering support to women who have lost a child to gun violence."
        },
        {
            "id": 21,
            "text": "And she is expected to press the issue to win over voters in Los Angeles, Oakland and other California cities before that state’s primary on June 7."
        },
        {
            "id": 22,
            "text": "Maya Harris, a senior policy adviser to Mrs. Clinton, dismissed Mr. Trump’s attacks on Friday, saying he was “peddling falsehoods.”"
        },
        {
            "id": 23,
            "text": "There is deep concern among Republicans about political divisions and the future of the party, a new Times/CBS News poll shows."
        },
        {
            "id": 24,
            "text": "We want to hear from the party’s longtime members or those who have just registered as Republicans."
        },
        {
            "id": 25,
            "text": "“Along with the vast majority of Americans, Hillary Clinton believes there are common-sense steps we can take at the federal level to keep guns out of the hands of criminals while respecting the Second Amendment,” Ms. Harris said."
        },
        {
            "id": 26,
            "text": "Since announcing his presidential bid, Mr. Trump — who himself has a concealed carry permit and whose two oldest sons are avid hunters — has fashioned himself a fierce advocate of gun rights."
        },
        {
            "id": 27,
            "text": "He has released a policy paper on the Second Amendment, has called for making concealed carry permits valid in all 50 states and routinely tells his audiences, as he did again here on Friday, that terrorist attacks like those last year in Paris and San Bernardino, Calif., might have been prevented if more people were armed."
        },
        {
            "id": 28,
            "text": "But his support for gun rights has not always been so absolutist."
        },
        {
            "id": 29,
            "text": "In his 2000 book, “The America We Deserve,” he wrote that he “generally” opposed gun control, but criticized the N.R.A.’s outsize lobbying power, saying, “I support the ban on assault weapons and I support a slightly longer waiting period to purchase a gun.”"
        },
        {
            "id": 30,
            "text": "After President Obama spoke in 2012 at a vigil for those killed in the school shootings in Newtown, Conn., Mr. Trump wrote on Twitter: “President Obama spoke for me and every American in his remarks in #Newtown, Connecticut.”"
        },
        {
            "id": 31,
            "text": "On Friday, however, Mr. Trump took his support for gun rights an additional step."
        },
        {
            "id": 32,
            "text": "In January, he said he wanted to end gun-free zones in schools."
        },
        {
            "id": 33,
            "text": "In his speech here, he said he wanted to do away with them entirely."
        },
        {
            "id": 34,
            "text": "“We’re getting rid of gun-free zones,” he said, arguing that more guns would mean less gun violence, as his audience cheered."
        },
        {
            "id": 35,
            "text": "Officially throwing the N.R.A.’s support to Mr. Trump, Chris W. Cox, executive director of the group’s political and lobbying arm, warned that Mrs. Clinton would appoint liberal justices to the Supreme Court who would roll back gun rights."
        },
        {
            "id": 36,
            "text": "Current polls show an uphill battle for Donald Trump should he and Hillary Clinton face off in the general election."
        },
        {
            "id": 37,
            "text": "“We have to unite and we have to unite right now,” Mr. Cox said."
        },
        {
            "id": 38,
            "text": "(He also played a clip of Mrs. Clinton talking about the Second Amendment, but not before “accidentally” playing a video showing Mrs. Clinton barking like a dog.)"
        },
        {
            "id": 39,
            "text": "The Secret Service prevented attendees from bringing knives and guns — ordinarily commonplace accessories at the convention — into the hall where Mr. Trump was speaking, prompting some grumbling."
        },
        {
            "id": 40,
            "text": "There was also some grumbling about the presidential campaign, despite the N.R.A.’s endorsement."
        },
        {
            "id": 41,
            "text": "Dan Kelsey, 57, an I.T. consultant and N.R.A. member from Columbus, Ohio, said he was not excited about Mr. Trump or Mrs. Clinton, and was worried that Mr. Trump might shift his position on the Second Amendment."
        },
        {
            "id": 42,
            "text": "“He talks a good game, but I’m not sure what his core values are,” Mr. Kelsey said."
        },
        {
            "id": 43,
            "text": "“He’s a good entertainer and marketer, but I don’t know what he really believes.”"
        },
        {
            "id": 44,
            "text": "Yet to other members of the group, Mr. Trump’s promises to support the Second Amendment were reassurance enough."
        },
        {
            "id": 45,
            "text": "Dianne Jennings, 67, a certified N.R.A. pistol instructor from Dayton, Ohio, said she had “nothing nice to say” about Mrs. Clinton: “Basically, I detest her.”"
        },
        {
            "id": 46,
            "text": "Ms. Jennings said that she found Mr. Trump “entertaining” and “not politically correct” and that she thought he would do a good job as president."
        },
        {
            "id": 47,
            "text": "“I think people are just terrified of his persona, but I think he has a lot of different personas,” she said, “and he can use the right one in the right situation.”"
        }
    ]
}