{
    "title": "Obama Delivers Emotional Eulogy For Beau Biden",
    "text": [
        {
            "id": 0,
            "text": "President Barack Obama on Saturday delivered an emotional tribute to Vice President Joe Biden's son Beau, who died last week."
        },
        {
            "id": 1,
            "text": "\"Beau Biden was an original,\" Obama said at a service for Biden in Wilmington, Delaware. \""
        },
        {
            "id": 2,
            "text": "He was a good man, a man of character, a man who loved deeply and was loved in return.\""
        },
        {
            "id": 3,
            "text": "Joseph \"Beau\" Biden III, the former attorney general of Delaware and a member of the state's Army National Guard."
        },
        {
            "id": 4,
            "text": ", died of brain cancer on May 30."
        },
        {
            "id": 5,
            "text": "He was 46."
        },
        {
            "id": 6,
            "text": "A procession carrying a casket of Beau Biden enters St. Anthony of Padua Church in Wilmington, Del., Saturday, June 6, 2015, for funeral services."
        },
        {
            "id": 7,
            "text": "Obama praised Biden's leadership, calling him the \"consummate public servant\" who \"did in 46 years what most of us couldn't do in 146 years.\""
        },
        {
            "id": 8,
            "text": "“He was a soldier who dodged glory and exuded true humility,\" Obama said."
        },
        {
            "id": 9,
            "text": "\"A prosecutor who defended the defenseless."
        },
        {
            "id": 10,
            "text": "The rare politician who collected more fans than foes and the rare public figure who prioritized his private life above all else.”"
        },
        {
            "id": 11,
            "text": "The president also spoke of the tragedy that shaped Biden's early years."
        },
        {
            "id": 12,
            "text": "In December 1972, Beau, his mother and siblings were in a car accident while Christmas shopping."
        },
        {
            "id": 13,
            "text": "The accident killed the vice president's first wife, Neilia Biden, and the couple's 18-month-old daughter Naomi, called Amy by her family."
        },
        {
            "id": 14,
            "text": "Beau and Hunter, then toddlers, were hospitalized."
        },
        {
            "id": 15,
            "text": "After the accident, Joe Biden, then recently elected to the U.S. Senate, traveled home to Delaware each night to be with his children."
        },
        {
            "id": 16,
            "text": "\"It's no secret that a lot of what made Beau the way he was is how much he loved and admired his dad,\" Obama said."
        },
        {
            "id": 17,
            "text": "“From his dad he learned how to get back up after life knocked him down,\" he said."
        },
        {
            "id": 18,
            "text": "“He learned how to make everybody else feel like we matter -- because his dad taught him that everybody matters."
        },
        {
            "id": 19,
            "text": "\"resident Barack Obama hugs Vice President Joe Biden during funeral services for Biden's son, Beau Biden, Saturday, June 6, 2015, at St. Anthony of Padua Church in Wilmington, Del. (Yuri Gripas/Pool Photo via AP)\n\nA crowd of 1,000 gathered at St. Anthony of Padua Roman Catholic Church to mourn Biden, who served as Delaware's attorney general from 2007 to 2015."
        },
        {
            "id": 20,
            "text": "He had planned to run for governor of the state in 2016."
        },
        {
            "id": 21,
            "text": "In addition to Obama and his family, the crowd included Bill and Hillary Clinton, Attorney General Loretta Lynch, Senate Majority Leader Mitch McConnell (R-Ky.) and other members of congress."
        },
        {
            "id": 22,
            "text": "After hearing Biden was a fan of his music, Coldplay singer Chris Martin volunteered to sing at the service."
        },
        {
            "id": 23,
            "text": "Biden's siblings, Ashley and Hunter, also eulogized their brother."
        },
        {
            "id": 24,
            "text": "“Your problems were Beau’s problems."
        },
        {
            "id": 25,
            "text": "But he seemed to carry them so effortlessly,\" Hunter Biden said of his brother."
        },
        {
            "id": 26,
            "text": "U.S. Vice President Joe Biden (C) and his wife Dr. Jill Biden (R) arrive with family for a mass of Christian burial at St. Anthony of Padua Church for their son, former Delaware Attorney General Beau Biden, on June 6, 2015 in Wilmington, Delaware."
        },
        {
            "id": 27,
            "text": "Biden was first diagnosed with brain cancer in 2013, three years after suffering a minor stroke."
        },
        {
            "id": 28,
            "text": "After surgery and chemotherapy, he was given a clean bill of health by his doctor in November 2013, but the cancer returned earlier this year."
        },
        {
            "id": 29,
            "text": "In May, he was admitted to Walter Reed Medical Center in Bethesda, Maryland, for treatment."
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": "President Barack Obama pauses while delivering the eulogy in honor of former Delaware Attorney General Beau Biden, Saturday, June 6, 2015, at St. Anthony of Padua Church in Wilmington, Del."
        }
    ]
}