{
    "title": "In Nevada caucuses, Trump gets a third straight win",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump swept to a convincing victory in the Nevada presidential caucuses here Tuesday evening, building a broad coalition that left his top two rivals trailing far behind and accelerating his march to the Republican nomination."
        },
        {
            "id": 1,
            "text": "An angry electorate hungry for a political outsider in the White House catapulted Trump to his third straight win in the GOP primary race as the billionaire mogul used visceral rhetoric to tap into anxieties about the economy, terrorism and illegal immigration."
        },
        {
            "id": 2,
            "text": "The breadth of Trump’s support was staggering, with Sens. Marco Rubio (Fla.) and Ted Cruz (Tex.) running more than 20 percentage points behind him in second and third place respectively, despite their aggressive campaigning across Nevada in the closing days."
        },
        {
            "id": 3,
            "text": "Retired neurosurgeon Ben Carson and Ohio Gov. John Kasich, who did not mount a serious campaign here, were far behind in single digits."
        },
        {
            "id": 4,
            "text": "“If you listen to the pundits, we weren’t expected to win too much — and now we’re winning, winning, winning the country,” a triumphant Trump declared to supporters at his Las Vegas victory party."
        },
        {
            "id": 5,
            "text": "Vowing to continue his streak and quickly secure the nomination, Trump added: “It’s going to be an amazing two months."
        },
        {
            "id": 6,
            "text": "We might not even need the two months, folks.”"
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": "The Nevada results underscored the challenge for Trump’s opponents to slow his momentum heading into next week’s"
        },
        {
            "id": 14,
            "text": "Super Tuesday, when 11 states will hold primaries and caucuses in a single day."
        },
        {
            "id": 15,
            "text": "Cruz and Rubio, who have been fighting bitterly to become the chief alternative to Trump, were dealt a serious blow by Nevada’s voters."
        },
        {
            "id": 16,
            "text": "After watching with disappointment as returns rolled in, Cruz all but ignored Rubio as he addressed supporters at his Las Vegas caucus night party."
        },
        {
            "id": 17,
            "text": "He argued that the real race for the nomination had come down to him and Trump."
        },
        {
            "id": 18,
            "text": "“The undeniable reality that the first four states have shown is that the only campaign that has beaten Donald Trump and the only campaign that can beat Donald Trump is this campaign,” Cruz said, referencing his win in the kick-off Iowa caucuses."
        },
        {
            "id": 19,
            "text": "Rubio, who jetted out of Nevada Tuesday morning for campaign events in Minnesota and Michigan, made no public comments on the results."
        },
        {
            "id": 20,
            "text": "His advisers had been hopeful that he might finish strongly here, perhaps even win, considering that he spent part of his childhood in Las Vegas and enjoyed the support of much of the state’s political establishment."
        },
        {
            "id": 21,
            "text": "High voter turnout apparently overwhelmed organizers at some caucus locations."
        },
        {
            "id": 22,
            "text": "There were isolated reports of double voting, dwindling supplies of paper ballots and what a Republican Party official described as “chaos” at a couple of caucus sites here in Clark County, the state’s biggest population center."
        },
        {
            "id": 23,
            "text": "Some volunteer caucus officials collecting ballots wore Trump campaign T-shirts and hats, sparking an outcry and allegations of voter intimidation on social media."
        },
        {
            "id": 24,
            "text": "The Nevada Republican Party’s caucus rules allow precinct workers to wear campaign paraphernalia."
        },
        {
            "id": 25,
            "text": "“Volunteers went through extensive training & are doing a great job,” read a statement from the party."
        },
        {
            "id": 26,
            "text": "Early entrance polling reported by CNN showed that Trump’s victory here was commanding, across most demographic groups and among voters of every ideology."
        },
        {
            "id": 27,
            "text": "Nearly six in 10 caucus-goers said they were angry at the federal government, and a similar percentage wanted the next president to be a political outsider."
        },
        {
            "id": 28,
            "text": "Trump reveled in the breadth of his winning coalition."
        },
        {
            "id": 29,
            "text": "“We won the evangelicals, we won with young, we won with old, we won with highly educated, we won with poorly educated — I love the poorly educated,” Trump said, referencing the network entrance polls."
        },
        {
            "id": 30,
            "text": "“And you know what I really am happy about, because I’ve been saying it for a long time?"
        },
        {
            "id": 31,
            "text": "Forty-six percent with Hispanics."
        },
        {
            "id": 32,
            "text": "Number one with Hispanics!"
        },
        {
            "id": 33,
            "text": "I’m really happy about that.”"
        },
        {
            "id": 34,
            "text": "Trump, who visited caucus sites Tuesday night to motivate his supporters, had led every recent public poll by double digits."
        },
        {
            "id": 35,
            "text": "Enormous crowds packed his rallies, including one Monday night in Las Vegas that drew an estimated 8,000 people."
        },
        {
            "id": 36,
            "text": "Trump’s nationalist call to deport illegal immigrants and wall them off resonated with Nevada’s working-class whites resentful of the booming Latino population."
        },
        {
            "id": 37,
            "text": "But a Trump win was not seen as a done deal."
        },
        {
            "id": 38,
            "text": "The state’s caucuses are peculiar and unpredictable — and Cruz and Rubio labored to spring a surprise."
        },
        {
            "id": 39,
            "text": "Cruz worked Nevada harder than any other candidate, flying immediately to the state after South Carolina’s primary Saturday and making nine crowded campaign stops."
        },
        {
            "id": 40,
            "text": "Yet a message seemingly tailored to Nevada’s libertarian-leaning Republicans — with a particular focus on the federal control of land in the state — did not appear to resonate as Cruz might have hoped."
        },
        {
            "id": 41,
            "text": "And the day before the caucuses was squandered when Cruz fired his communications director, Rick Tyler, who had published a false smear of Rubio on Facebook."
        },
        {
            "id": 42,
            "text": "The Cruz roadshow had a slapdash feel, recycling video endorsements from Iowa, one of which ended with: “People of Iowa, it is time to believe again.”"
        },
        {
            "id": 43,
            "text": "In Carson City, when state Attorney General Adam Laxalt needed to stall for Cruz’s arrival, he announced a “short video” — and the audience groaned."
        },
        {
            "id": 44,
            "text": "In a television ad and in speeches, he promised to hand over to the state the 85 percent of Nevada land controlled by the federal government."
        },
        {
            "id": 45,
            "text": "The idea drew applause — and some protesters — but did not move votes."
        },
        {
            "id": 46,
            "text": "Like the Cruz campaign, Rubio’s thought it could exploit Trump’s weak state-level organization with a carefully tailored strategy."
        },
        {
            "id": 47,
            "text": "Rubio targeted Nevada’s well-organized Mormon community, which propelled Mitt Romney to victory here in 2012, as well as seniors who populate the many retirement communities around Las Vegas."
        },
        {
            "id": 48,
            "text": "He also played up his local roots."
        },
        {
            "id": 49,
            "text": "He lived briefly as a child in Las Vegas, where his father tended bar at a casino and his mother cleaned rooms at a hotel."
        },
        {
            "id": 50,
            "text": "During that time, his family temporarily converted to Mormonism."
        },
        {
            "id": 51,
            "text": "Dozens of extended family members still live here."
        },
        {
            "id": 52,
            "text": "“He has more family members in Nevada than in Florida,” Lt. Gov. Mark Hutchison, Rubio’s state campaign chairman, said Sunday night at a rally in North Las Vegas."
        },
        {
            "id": 53,
            "text": "All along, however, Nevada was Trump’s to lose."
        },
        {
            "id": 54,
            "text": "He focused on big rallies in Las Vegas and the Reno area — the state’s two main population centers — but he had a ground organization, as well."
        },
        {
            "id": 55,
            "text": "Trump’s campaign bought limited television advertising time in Las Vegas."
        },
        {
            "id": 56,
            "text": "In its main spot, which also ran in South Carolina, a man whose son was murdered by an undocumented immigrant said that Trump is “the only one” he trusts to secure the border."
        },
        {
            "id": 57,
            "text": "Rubio campaigned across Nevada with a broader message, trying to appeal to a more diverse cross-section of the electorate, and entrance polls suggested he won among voters who decided in the final days."
        },
        {
            "id": 58,
            "text": "Many of the state’s top elected officials backed Rubio, including Sen. Dean Heller."
        },
        {
            "id": 59,
            "text": "Gov. Brian Sandoval, who has angered conservatives over a state tax increase, decided to stay on the sidelines, though he caucused for Rubio on Tuesday night."
        },
        {
            "id": 60,
            "text": "Rubio attracted some star power, too."
        },
        {
            "id": 61,
            "text": "Donnie Wahlberg, a founding member of New Kids on the Block, a boy band popular in the late 1980s and early 1990s, endorsed him at his Sunday night rally."
        },
        {
            "id": 62,
            "text": "“I have never, ever voted for a Republican presidential candidate — that is, until this year, thanks to Marco Rubio,” Wahlberg said."
        },
        {
            "id": 63,
            "text": "Rubio also had the support of Rick Harrison, a celebrated Las Vegas pawn shop owner and host of the “Pawn Stars” reality-television show."
        },
        {
            "id": 64,
            "text": "“I really think he’s got a shot at winning on Tuesday,” Harrison told the Sunday night crowd."
        },
        {
            "id": 65,
            "text": ""
        }
    ]
}