{
    "title": "Attorney General Merrick Garland announces an investigation into the Minneapolis Police Department.",
    "text": [
        {
            "id": 0,
            "text": "The Justice Department will investigate the policies and operations of the Minneapolis Police Department, Attorney General Merrick B. Garland announced on Wednesday, a day after the former officer Derek Chauvin was convicted of murder in the death of George Floyd in a rare rebuke of police violence."
        },
        {
            "id": 1,
            "text": "“The Justice Department has opened a civil investigation to determine whether the Minneapolis Police Department engages in a pattern or practice of unconstitutional or unlawful policing,” Mr. Garland said in brief remarks at the Justice Department."
        },
        {
            "id": 2,
            "text": "Such investigations are often the precursors to court-approved deals between the Justice Department and local governments that create and enforce a road map for training and operational changes."
        },
        {
            "id": 3,
            "text": "Mr. Garland’s announcement came a day after the conviction of Mr. Chauvin, who was fired by the Minneapolis Police Department last year after gruesome video of him kneeling on Mr. Floyd’s neck for more than nine minutes sparked protests across the nation."
        },
        {
            "id": 4,
            "text": "The inquiry into the department is separate from the existing Justice Department investigation into whether Mr. Chauvin violated Mr. Floyd’s civil rights."
        },
        {
            "id": 5,
            "text": "It will be led by lawyers and staff in the Justice Department’s civil rights division and the U.S. attorney’s office in Minnesota."
        },
        {
            "id": 6,
            "text": "Investigators will seek to determine whether the Minneapolis Police Department engages in a pattern or practice of using excessive force, including during protests; whether it engages in discriminatory conduct; and whether its treatment of those with behavioral health disabilities is unlawful."
        },
        {
            "id": 7,
            "text": "They will also review the department’s policies, training, supervision and use-of-force investigations, and whether its current systems of accountability are effective at ensuring that police officers act lawfully."
        },
        {
            "id": 8,
            "text": "If the investigators find that the police department has engaged in unlawful policing, Mr. Garland said the Justice Department would issue a public report."
        },
        {
            "id": 9,
            "text": "It also has the option to bring a civil suit against the department and enter into a settlement agreement, or consent decree, to ensure that prompt and effective action is taken to bring the department’s practices into compliance with the law."
        },
        {
            "id": 10,
            "text": "When the officers use kicks, chokeholds, punches, takedowns, Mace spray, Tasers and the like, the person subject to that force is black about 60 percent of the time."
        },
        {
            "id": 11,
            "text": "On Friday, Mr. Garland restored the robust use of consent decrees, rescinding a Trump administration policy that largely curbed their use."
        },
        {
            "id": 12,
            "text": "The Obama administration had repeatedly used the tool to address police misconduct."
        },
        {
            "id": 13,
            "text": "The restoration of consent decrees was one of the Biden administration’s first significant moves to hold police forces accountable in cases where they are found to have violated federal laws."
        },
        {
            "id": 14,
            "text": "“Most of our nation’s law enforcement officers do their difficult jobs honorably and lawfully,” Mr. Garland said."
        },
        {
            "id": 15,
            "text": "“I strongly believe that good officers do not want to work in systems that allow bad practices.”"
        },
        {
            "id": 16,
            "text": "The challenges that the nation faces in addressing systemic racial inequities “are deeply woven into our history,” Mr. Garland said, adding that it would take time and effort by all to build “trust between community and law enforcement.”"
        }
    ]
}