{
    "title": "Veterans Affairs Secretary in the Hot Seat on Capitol Hill Over Medical Wait Times and Deaths",
    "text": [
        {
            "id": 0,
            "text": "Veterans Affairs Secretary Eric Shinseki will face tough questions today during a Senate Veterans Affairs Committee hearing on Capitol Hill as details surrounding secret lists and veteran deaths as a result of long wait times continue to emerge."
        },
        {
            "id": 1,
            "text": "According to prepared remarks, Shinseki will say the alleged problems in the system are unacceptable and if substantiated he will take “responsible and timely action” to remedy the situation."
        },
        {
            "id": 2,
            "text": "“I am personally angered and saddened by any adverse consequence that a veteran might experience while in, or as a result of, our care,” he plans to say."
        },
        {
            "id": 3,
            "text": "According to the prepared remarks, Shinseki will note he has already placed three employees at the Phoenix VA center on leave over the allegations that as many as 40 veterans may have died because of delayed treatment at that hospital."
        },
        {
            "id": 4,
            "text": "He will note he ordered an inspector general investigation into the matter and a nationwide review into scheduling policy."
        },
        {
            "id": 5,
            "text": "At this point, at least two dozen veterans have died as a result of delayed health care and the practice of secret lists to fudge the numbers occurred in Colorado, Arizona, Texas, North Carolina and Wyoming."
        },
        {
            "id": 6,
            "text": "Earlier this month, Shinseki ordered a nationwide audit of practices at VA facilities."
        },
        {
            "id": 7,
            "text": "The White House is arguing these are isolated incidents."
        },
        {
            "id": 8,
            "text": "A number of veterans groups, including the American Legion and Concerned Veterans for America, have called on Shinseki to resign."
        }
    ]
}