{
    "title": "Mueller’s Team Members ‘Accidentally’ Wiped Phones Clean of Data",
    "text": [
        {
            "id": 0,
            "text": "Justice Department records obtained and published by Judicial Watch on Friday show that senior members of Special Counsel Robert Mueller’s team repeatedly and “accidentally” wiped data off phones assigned to them, according to the conservative watchdog group."
        },
        {
            "id": 1,
            "text": "Judicial Watched obtained 87 pages from the DOJ in response to a September 2019 Freedom of Information Act lawsuit against the DOJ and the FBI for a December 17, 2018, request for:\n\nAll records related to the hardware, software and contents of mobile phones issued to FBI officials Peter Strzok and Lisa Page for their use while they served on the investigative team of Special Counsel Robert Mueller;\n\nAll records of communication (whether on government or non-.gov email accounts and whether using real names or aliases), with FBI officials relating to the hardware, software and contents of mobile phones issued to FBI officials Peter Strzok and Lisa Page for their use while they served on the investigative team of Special Counsel Robert Mueller."
        },
        {
            "id": 2,
            "text": "According to the records Judicial Watch received, 27 phones used by members of the Special Counsel team were reported wiped clean of all data prior to a review by the Special Counsel of phones used by Mueller’s teams for records-preservation purposes."
        },
        {
            "id": 3,
            "text": "Twenty of those phones were reported wiped clean of data due to “accidental wipe,” often from entering the wrong password too many times."
        },
        {
            "id": 4,
            "text": "Several other phones were wiped after they were placed in airplane mode and could not be unlocked because the password was allegedly forgotten, including two belonging to lead prosecutor Andrew Weissmann, and phones belonging to two of his deputies, Kyle Freeny and Rush Atkinson."
        },
        {
            "id": 5,
            "text": "One phone was wiped clean without explanation."
        },
        {
            "id": 6,
            "text": "Both phones used by Strzok and Page had been “restored to factory settings.”"
        },
        {
            "id": 7,
            "text": "Strzok and Page, who were engaged in an extramarital affair, both served on the Special Counsel team when it was stood up in May 2017, and left later that summer."
        },
        {
            "id": 8,
            "text": "The DOJ inspector general investigating the FBI for potential bias first discovered a gap in text message data collection from between December 15, 2016, through May 17, 2017, from phones issued to Strzok and Page, and tried to recover those messages."
        },
        {
            "id": 9,
            "text": "The IG also asked the Special Counsel’s office for phones that had been assigned to Strzok and Page."
        },
        {
            "id": 10,
            "text": "Strzok’s phone had already been “reset to factory settings” and “reconfigured for the new user to whom the device was issued,” and Page’s phone had already been reset but not reassigned."
        },
        {
            "id": 11,
            "text": "According to the DOJ records, Page’s phone was first “not found.”"
        },
        {
            "id": 12,
            "text": "Then after it was found and given to the IG, it had already been “restored to factory settings.”"
        },
        {
            "id": 13,
            "text": "A Special Counsel records officer who had reviewed Strzok’s phone upon his exit had written: “No substantive texts, notes or reminders.”"
        },
        {
            "id": 14,
            "text": "Justice Watch President Tom Fitton said in a statement, “The pandemic of ‘wiped’ phones among the Mueller team requires a criminal investigation of this destruction of evidence and potential obstruction of justice and other crimes.”"
        },
        {
            "id": 15,
            "text": "“The DOJ and FBI hid these records for nearly two years – which only adds to appearance of a cover-up,” he said."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": ""
        }
    ]
}