{
    "title": "Trump: 'The American workforce is the best in the world'",
    "text": [
        {
            "id": 0,
            "text": "The president’s Labor Day “thank you” is directed to a mighty number of recipients."
        },
        {
            "id": 1,
            "text": "According to the Bureau of Labor Statistics, there are 147.4 million people who work full- or part-time in the U.S. President Trump has a message for them."
        },
        {
            "id": 2,
            "text": "“The American workforce is the best in the world and, since day one of my administration, I have been standing up for the American worker."
        },
        {
            "id": 3,
            "text": "As recent global challenges have tested our mettle, the dedication of our workforce has once again proven that Americans’ resolve will never be overcome,” Mr. Trump says in a proclamation honoring those who labor in every profession, nationwide."
        },
        {
            "id": 4,
            "text": "Mr. Trump also cites those fields that have come to the forefront during the coronavirus pandemic."
        },
        {
            "id": 5,
            "text": "“In particular, we celebrate every American who has worked tirelessly to ensure we maintain our way of life in this unprecedented time."
        },
        {
            "id": 6,
            "text": "These vital workers include medical professionals, grocery store and pharmacy clerks, farmers, meatpackers, truckers, factory workers, and the many employees who are important to the supply chain that makes essential goods and medications accessible to all Americans."
        },
        {
            "id": 7,
            "text": "Essential workers and volunteers like these and others have enabled my administration to respond swiftly to the coronavirus pandemic and have safeguarded the prospects of countless American businesses and the lives and personal health of millions of people,” the president said."
        },
        {
            "id": 8,
            "text": "“On this Labor Day, we express our deep gratitude to workers of every generation who helped create the greatest economy in the world and the workers whose tireless efforts will ensure our country and workforce bounce back with full force as we defeat the virus."
        },
        {
            "id": 9,
            "text": "Together, we will continue the great American comeback.”"
        },
        {
            "id": 10,
            "text": "ANOTHER TRUMP FILM"
        },
        {
            "id": 11,
            "text": "Arriving Monday: “Citizen Trump,” an independent documentary film about President Trump, written and directed by Robert Orlando."
        },
        {
            "id": 12,
            "text": "He says he as inspired to take on the project after learning that the president’s favorite film is “Citizen Kane.”"
        },
        {
            "id": 13,
            "text": "“In this cinematic feast, we witness Trump, like Kane, trying to escape unglamorous beginnings."
        },
        {
            "id": 14,
            "text": "A decades-long effort to rise as aspiring Hollywood mogul, real estate player, darling of gossip columnists, casino owner, dabbler in politics, and reality TV star."
        },
        {
            "id": 15,
            "text": "With each new stage, it was a rehearsal for his role as president,” said production notes for the new movie."
        },
        {
            "id": 16,
            "text": "“Truth-be-told, Kane was crushed by scandal, Trump was not."
        },
        {
            "id": 17,
            "text": "He triumphed above front-page divorces, bankruptcies, unprecedented media attack and political chaos."
        },
        {
            "id": 18,
            "text": "Will the election end his star power?"
        },
        {
            "id": 19,
            "text": "Trump knew from early on that he who controls the story controls the world, and the high myopia of public discourse blinds us to what truly matters,” Mr. Orlando said in a statement."
        },
        {
            "id": 20,
            "text": "“If you’re a liberal here hoping for a Michael Moore-style documentary aimed at the Left, forget it, and if you’re a conservative looking for something that Dinesh D’Souza would create, you’re likewise out of luck,” wrote Paul Kengor in a review of the film for The American Spectator."
        },
        {
            "id": 21,
            "text": "“As for Trump devotees, be forewarned as well: this film does not, by any stretch, portray Donald J. Trump positively."
        },
        {
            "id": 22,
            "text": "My take is that it’s quite negative toward Trump."
        },
        {
            "id": 23,
            "text": "And you can’t blame this on a hack left-wing filmmaker,” Mr. Kengor said, noting that Mr. Orlando has created films about George S. Patton, Ronald Reagan and Pope John Paul II."
        },
        {
            "id": 24,
            "text": "Mr. Kengor says audiences are likely to leave the film in a thoughtful frame of mind."
        },
        {
            "id": 25,
            "text": "Look for the online premiere of the film at CitizenTrumpFilm.com."
        },
        {
            "id": 26,
            "text": "A LABOR DAY SALE. President Trump‘s official online campaign shop is offering 30% off all purchases on Labor Day."
        },
        {
            "id": 27,
            "text": "The items include hats and apparel, of course, along with glassware, face masks, pet collars and leashes, coffee mugs and can coolers, yard signs, bumper stickers, a kid’s coloring book and more."
        },
        {
            "id": 28,
            "text": "Use the code TRUMP30 at check-out time."
        },
        {
            "id": 29,
            "text": "MARSHA BLACKBURN HAS A SAY"
        },
        {
            "id": 30,
            "text": "A new book has arrived from Sen. Marsha Blackburn: “The Mind of a Conservative Woman; Seeking the Best for Family and Country,” which cites a media-driven culture that is biased against conservative women and only friendly to their liberal counterparts."
        },
        {
            "id": 31,
            "text": "“The left can’t believe that a female could actually choose not to be a member of the National Organization for Women, that they might be pro-life, or that they might stand for conservative and constitutional values."
        },
        {
            "id": 32,
            "text": "They can’t believe that you don’t need the federal government to lead you through life."
        },
        {
            "id": 33,
            "text": "The media and the D.C. establishment are stunned that conservative women even exist,” writes the Tennessee Republican."
        },
        {
            "id": 34,
            "text": "“We do exist, though, and I’ll tell you why."
        },
        {
            "id": 35,
            "text": "It is because most American women want freedom,” she says, warning against the liberal practice of creating “a bitter, snarling, grasping war of interest groups that serves no one well and makes us all morally smaller.”"
        },
        {
            "id": 36,
            "text": "The book features a foreword by Newt Gingrich and well wishes from a half-dozen women who are indeed conservative."
        },
        {
            "id": 37,
            "text": "“A new era is upon us."
        },
        {
            "id": 38,
            "text": "The era of conservative women everywhere,” said Kay C. James, president of the Heritage Foundation."
        },
        {
            "id": 39,
            "text": "The work is from Worthy Books, an imprint of Hachette Books which specializes in Christian authors."
        },
        {
            "id": 40,
            "text": "Some wonder about the future for Mrs. Blackburn, meanwhile."
        },
        {
            "id": 41,
            "text": "“Laying the groundwork for 2024?” asks Glenn Reynolds, founder of InstaPundit, the popular political blog."
        },
        {
            "id": 42,
            "text": "POLL DU JOUR\n\n• 75% of U.S. adults are “completely satisfied” with their relations with co-workers."
        },
        {
            "id": 43,
            "text": "• 65% are completely satisfied with the physical safety conditions in their workplace."
        },
        {
            "id": 44,
            "text": "• 63% are completely satisfied with their boss or immediate supervisor."
        },
        {
            "id": 45,
            "text": "• 60% are completely satisfied with the amount of work they are required to do."
        },
        {
            "id": 46,
            "text": "• 54% are completely satisfied with the amount of vacation they receive."
        },
        {
            "id": 47,
            "text": "• 48% are completely satisfied with their chances of a promotion."
        },
        {
            "id": 48,
            "text": "Source: A Gallup poll of 1,031 U.S. adults conducted from July 30 TO Aug. 12 and released Wednesday."
        },
        {
            "id": 49,
            "text": "• Have a pleasant and productive Labor Day, and thanks for reading Inside the Beltway."
        },
        {
            "id": 50,
            "text": ""
        },
        {
            "id": 51,
            "text": ""
        },
        {
            "id": 52,
            "text": ""
        },
        {
            "id": 53,
            "text": ""
        }
    ]
}