{
    "title": "Trump administration expands government's deportation powers",
    "text": [
        {
            "id": 0,
            "text": "The Trump administration has expanded the government’s deportation powers, issuing guidelines urging officers at U.S. Citizenship and Immigration Services — the legal immigration agency — to begin the removal process for people who use fraudulent documents or who illegally took government benefits."
        },
        {
            "id": 1,
            "text": "USCIS officers have always had powers to begin deportation proceedings, but in the past had usually referred cases to other parts of Homeland Security for decisions on deportation."
        },
        {
            "id": 2,
            "text": "Now, though, the agency is flexing those powers, with guidance memos telling officers to look for instances where they can begin the deportation process for people they deem illegal immigrants."
        },
        {
            "id": 3,
            "text": "The memos, dated June 28, tell agency employees to be on the lookout for people who apply for naturalization or other legal immigration benefit but who have criminal records, used bogus documents, lied about their applications or had abused public benefit programs."
        },
        {
            "id": 4,
            "text": "In the past those might have been enough to reject the application, but USCIS would either drop the issue at that point or refer the case to U.S. Immigration and Customs Enforcement for possible deportation."
        },
        {
            "id": 5,
            "text": "Under the new guidelines USCIS employees are now urged to begin the deportation process themselves."
        },
        {
            "id": 6,
            "text": "That involves issuing a Notice to Appear, or NTA, which signals the beginning of the deportation process."
        },
        {
            "id": 7,
            "text": "Someone who receives an NTA then must go before an immigration judge, has the chance to appeal, and only then is deported."
        },
        {
            "id": 8,
            "text": "“For too long, USCIS officers uncovering instances of fraudulent or criminal activity have been limited in their ability to help ensure U.S. immigration laws are faithfully executed,” USCIS Director L. Francis Cissna said in announcing the changes."
        },
        {
            "id": 9,
            "text": "“This updated policy equips USCIS officers with clear guidance they need and deserve to support the enforcement priorities established by the president, keep our communities safe, and protect the integrity of our immigration system from those seeking to exploit it.”"
        },
        {
            "id": 10,
            "text": "The new guidance reclaims USCIS’s role as a gatekeeper and expands the number of government employees on the lookout for deportable migrants."
        },
        {
            "id": 11,
            "text": "“When fraud, misrepresentation, or evidence of abuse of public benefit programs is part of the record and the alien is removable, USCIS will issue an NTA upon denial of the petition or application, or other appropriate negative eligibility determination,” the guidance says."
        },
        {
            "id": 12,
            "text": "USCIS says the move is about efficiency."
        },
        {
            "id": 13,
            "text": "In the past, it had to wait on ICE to make decisions and ICE would have to track someone down to issue them an NTA."
        },
        {
            "id": 14,
            "text": "Now, USCIS will be able to do that immediately."
        },
        {
            "id": 15,
            "text": "One effect could be to discourage people with bogus claims from coming forward to apply, since they now run a greater risk of ending up in deportation proceedings."
        },
        {
            "id": 16,
            "text": "People applying under the Obama-era DACA program are exempted from the new guidance, meaning illegal immigrant “Dreamers” won’t generally have to worry about being put in deportation if their claim is rejected."
        },
        {
            "id": 17,
            "text": "The prohibition on sharing their information with ICE is also still in place, according to a second memo released Thursday."
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        }
    ]
}