{
    "title": "Bernie Sanders cements front-runner status with Nevada caucuses win",
    "text": [
        {
            "id": 0,
            "text": "Bernie Sanders has cemented his status as the Democratic front-runner to take on Donald Trump in November's US presidential election."
        },
        {
            "id": 1,
            "text": "He has a decisive lead over his rivals in the Nevada caucus, with results from over half the precincts counted."
        },
        {
            "id": 2,
            "text": "But there is a long way to go until a Democratic nominee is confirmed."
        },
        {
            "id": 3,
            "text": "Results from Saturday's vote also show former vice-president Joe Biden coming second, a better performance than in the two states which have voted so far."
        },
        {
            "id": 4,
            "text": "He had underwhelming results in Iowa and New Hampshire."
        },
        {
            "id": 5,
            "text": "Those states kicked off the four-month long primaries process, in which candidates are jostling to convince voters why they are the best candidate to challenge Mr Trump."
        },
        {
            "id": 6,
            "text": "So far, with 60% of the ballots counted in Nevada, Mr Sanders, the left-wing senator for Vermont, has 46% of the vote, ahead of Mr Biden on 19.6%."
        },
        {
            "id": 7,
            "text": "The field is then split between a number of other moderates, with Pete Buttigieg on 15.3% and Elizabeth Warren on 10.1%."
        },
        {
            "id": 8,
            "text": "Mr Sanders won in 11 of Nevada's 17 counties."
        },
        {
            "id": 9,
            "text": "Candidates who have won more than 15% of the vote will be awarded delegates, who will then go to the party's convention in July to support their Democratic candidate."
        },
        {
            "id": 10,
            "text": "Before Saturday, Mr Sanders had 21 delegates, and while he will remain a long way off the 1,990 needed to become the nominee, victory in Nevada will bring him another small step closer towards that total."
        },
        {
            "id": 11,
            "text": "The last caucuses in Iowa were plagued by technical glitches that meant results struggled to be recorded using a new app."
        },
        {
            "id": 12,
            "text": "While that app is not being used in Nevada, there are reports of volunteers struggling to connect to a telephone number used to record results."
        },
        {
            "id": 13,
            "text": "Organisers say results should start flowing soon."
        },
        {
            "id": 14,
            "text": "In a victory speech in Texas on Saturday evening, Mr Sanders praised his \"multi-generational, racial coalition\" team of supporters, and attacked Mr Trump."
        },
        {
            "id": 15,
            "text": "\"The American people are sick and tired of a president who lies all the time,\" he said."
        },
        {
            "id": 16,
            "text": "Mr Biden's campaign was in buoyant mood too, declaring that \"the comeback starts here\"."
        },
        {
            "id": 17,
            "text": "In a tweet, Mr Trump praised Mr Sanders' win, but also called him \"Crazy Bernie\"."
        },
        {
            "id": 18,
            "text": "Meanwhile Mr Buttigieg suggested on Twitter that he is the only Democratic candidate with the potential to beat Mr Sanders to the nomination."
        },
        {
            "id": 19,
            "text": "It looks like it's all down to a few key factors."
        },
        {
            "id": 20,
            "text": "Four years ago, the Nevada caucuses were the moment Hillary Clinton began to turn the tide against Bernie Sanders in his upstart bid for the Democratic presidential nomination."
        },
        {
            "id": 21,
            "text": "This time around, the results could be further evidence that the Sanders surge is very real and very durable."
        },
        {
            "id": 22,
            "text": "Caucus entrance polls show Sanders won a dominating 53% of the Hispanic vote - a demographic he struggled with against Clinton."
        },
        {
            "id": 23,
            "text": "That bodes well for the senator in the two biggest prizes coming up, Texas and California, with their sizeable Hispanic populations."
        },
        {
            "id": 24,
            "text": "Sanders also, not as surprisingly, carried a majority of those aged 18 to 27 and voters who said they wanted someone who agreed with them on the issues."
        },
        {
            "id": 25,
            "text": "If Sanders has a winning formula this time around, it could be that he has successfully diversified his coalition, while keeping his loyal support from the young and those who want a president who is with them on issues like major healthcare reform, aggressively combating climate change and addressing income inequality."
        },
        {
            "id": 26,
            "text": "The Vermont senator appears so confident in his standing that he was campaigning in California this week and spent the day of the Nevada caucuses in Texas."
        },
        {
            "id": 27,
            "text": "If there was any doubt whether Sanders was the front-runner before now - and, quite honestly, there shouldn't have been - there is no question now."
        },
        {
            "id": 28,
            "text": "All eyes turn to South Carolina's primary next Saturday."
        },
        {
            "id": 29,
            "text": "It will be the biggest of the four states to have voted before March - and the one with the largest percentage of African-American voters."
        },
        {
            "id": 30,
            "text": "This should favour Mr Biden, who is popular among African Americans, but Mr Sanders is also expected to do well, and polls suggest that billionaire hedge-fund manager Tom Steyer could claim his first delegates there."
        },
        {
            "id": 31,
            "text": "A few days later, on 3 March, is Super Tuesday, when 14 states vote."
        },
        {
            "id": 32,
            "text": "They include California and Texas, the two states with the most delegates."
        },
        {
            "id": 33,
            "text": "By the end of Super Tuesday, it may be much clearer who the Democratic candidate will be."
        },
        {
            "id": 34,
            "text": "The Super Tuesday votes will include former New York Mayor Michael Bloomberg, who is not competing in the first four Democratic leadership ballots."
        }
    ]
}