{
    "title": "Trump: 'We're going to be guarding our border with the military' until wall complete",
    "text": [
        {
            "id": 0,
            "text": "—\n\nPresident Donald Trump said Tuesday that he’s calling on the military to guard the US-Mexico border until his long-promised border wall is complete."
        },
        {
            "id": 1,
            "text": "“I told Mexico, and I respect what they did, I said, look, your laws are very powerful, your laws are very strong."
        },
        {
            "id": 2,
            "text": "We have very bad laws for our border and we are going to be doing some things, I spoke with (Defense Secretary James)"
        },
        {
            "id": 3,
            "text": "Mattis, we’re going to do some things militarily."
        },
        {
            "id": 4,
            "text": "Until we can have a wall and proper security, we’re going to be guarding our border with the military."
        },
        {
            "id": 5,
            "text": "That’s a big step,” he said during a luncheon with leaders of the Baltic states."
        },
        {
            "id": 6,
            "text": "He continued: “We cannot have people flowing into our country illegally, disappearing, and by the way never showing up for court.”"
        },
        {
            "id": 7,
            "text": "Asked to clarify his comments during a joint news conference, Trump said he is “preparing for the military to secure our border” and he would be attending a meeting on the topic of border security with Mattis and others “in a little while.”"
        },
        {
            "id": 8,
            "text": "Trump has privately floated the idea of funding construction of a border wall with Mexico through the US military budget in conversations with advisers, two sources confirmed to CNN last week."
        },
        {
            "id": 9,
            "text": "His remarks Tuesday come on the heels of multiple days of hardline immigration rhetoric from the Trump White House, with the President calling on Congress to pass strict border laws in a series of tweets beginning Sunday."
        },
        {
            "id": 10,
            "text": "This isn’t the first time there’s been talk of sending US troops to the border."
        },
        {
            "id": 11,
            "text": "Under President George W. Bush, a border deployment of the National Guard known as Operation Jump Start started in 2006 and lasted two years."
        },
        {
            "id": 12,
            "text": "The operation sent more than 6,000 troops to California, Arizona, New Mexico and Texas to repair secondary border fence, construct nearly 1,000 metal barriers and fly border protection agents by helicopter to intercept immigrants trying to enter illegally."
        },
        {
            "id": 13,
            "text": "In 2010, the Obama administration deployed National Guard troops as part of a border protection plan."
        },
        {
            "id": 14,
            "text": "Officials in 2010 said up to 1,200 National Guard troops would be in place along the US-Mexico border for up to a year to assist US Customs and Border Protection with surveillance and intelligence gathering while the agency worked to hire additional staff."
        },
        {
            "id": 15,
            "text": "And in 2014, as a surge of unaccompanied minors from Central America crossed into the United States, Texas Gov. Rick Perry announced the activation of up to 1,000 National Guard troops to help secure the southern border."
        },
        {
            "id": 16,
            "text": "Still, Trump’s statement took many Pentagon officials by surprise Tuesday, in that they know of his desire to ratchet up border security, but are not sure what he meant exactly, according to multiple Defense Department and military officials."
        },
        {
            "id": 17,
            "text": "To fulfill his wishes, border states could send National Guard activated by their own state governors, an issue long complicated by whether the states or the federal government pay for it."
        },
        {
            "id": 18,
            "text": "Alternatively, the Defense Department could send either active duty or federally activated National Guard."
        },
        {
            "id": 19,
            "text": "Federal troops require certain documents and regulations, including an operational requirement, a unit identified, a strategy, and, although perhaps not formal, an exit strategy."
        },
        {
            "id": 20,
            "text": "That option also requires identifying rotational forces."
        },
        {
            "id": 21,
            "text": "Trump also spoke Tuesday about the caravan of migrants from Central America currently moving through Mexico who plan to turn themselves in and request asylum once they make it to the US border."
        },
        {
            "id": 22,
            "text": "He has demanded a halt to the caravan in a series of tweets."
        },
        {
            "id": 23,
            "text": "“If it reaches our border, our laws are so weak and so pathetic – you (the Baltic leaders) would not understand this ‘cause I know your laws are strong at the border – it’s like we have no border,” he said."
        },
        {
            "id": 24,
            "text": "Trump said he told Mexico “very strongly” that “you’re going to have to do something about these caravans.”"
        },
        {
            "id": 25,
            "text": "While he said the US is renegotiating the NAFTA trade deal with Mexico and Canada, he emphasized that border security would have to be part of the deal."
        }
    ]
}