{
    "title": "Federal appeals court rules Trump can't block New York subpoena for his tax returns",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The Manhattan district attorney can obtain President Donald Trump's tax returns a federal appeals court ruled, dealing the president another setback in his effort to shield his tax returns from prosecutors but the case is heading to the Supreme Court in a further delay of the investigation."
        },
        {
            "id": 2,
            "text": "In a 35-page opinion, the US Second Circuit Court of Appeals broadly rejected the President's arguments that the state grand jury subpoena to his long-time accounting firm for his financial and tax records was overly broad and issued in bad faith."
        },
        {
            "id": 3,
            "text": "\"There is nothing to suggest that these are anything but run-of-the-mill documents typically relevant to a grand jury investigation into possible financial or corporate misconduct,\" the judges ruled."
        },
        {
            "id": 4,
            "text": "\"We have considered all of the President's remaining contentions on appeal and have found in them no basis for reversal,\" the ruling said."
        },
        {
            "id": 5,
            "text": "The panel of three judges dismissed the president's lawsuit with prejudice, which means he cannot revive it on these grounds."
        },
        {
            "id": 6,
            "text": "The tax returns and other financial records will not immediately be turned over to prosecutors."
        },
        {
            "id": 7,
            "text": "The appeals court stayed the enforcement of the subpoena based on a joint agreement between the Manhattan district attorney and the President's legal team."
        },
        {
            "id": 8,
            "text": "Under that arrangement, there is a 12-day briefing schedule for Trump to ask the Supreme Court to stay the ruling enforcing the subpoena."
        },
        {
            "id": 9,
            "text": "The timetable suggests it is unlikely that the district attorney will obtain the records before the presidential election."
        },
        {
            "id": 10,
            "text": ""
        }
    ]
}