{
    "title": "Supreme Court Sides With Native American Hunter As Neil Gorsuch Joins Liberal Justices",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The Supreme Court on Monday ruled in favor of a Native American elk hunter, citing an 1868 treaty between his tribe and the U.S. government as it revived his legal challenge to a conviction for hunting out of season in Bighorn National Forest in Wyoming."
        },
        {
            "id": 2,
            "text": "In a 5-4 ruling, the high court sided with Crow Tribe member Clayvin Herrera."
        },
        {
            "id": 3,
            "text": "It found that the treaty, which gave tribe members hunting rights on “unoccupied” lands, is still in force even though it was signed before Wyoming became a U.S. state in 1890."
        },
        {
            "id": 4,
            "text": "Conservative Justice Neil Gorsuch, who has a record of backing tribal rights, sided with the court’s four liberals, with the other four conservative justices in dissent."
        },
        {
            "id": 5,
            "text": "The same lineup voted in favor of tribal rights in a previous case this term, ruling that members of the Yakima Nation did not have to pay taxes for importing fuel into Washington state."
        },
        {
            "id": 6,
            "text": "Monday’s ruling does not immediately void Herrera’s conviction because the state can still argue that the Bighorn National Forest location where he and others hunted bull elk in 2014 is not “unoccupied,” meaning he would not have been able to legally hunt there."
        },
        {
            "id": 7,
            "text": "Justice Sonia Sotomayor, writing for the court, said treaty rights do not automatically disappear when a territory becomes a state."
        },
        {
            "id": 8,
            "text": "Sotomayor cited historical evidence that the Crow Tribe made a high priority of hunting rights during its treaty negotiations with the government."
        },
        {
            "id": 9,
            "text": "“Yet despite the apparent importance of the hunting right to the negotiations, Wyoming points to no evidence that federal negotiators ever proposed that the right would end at statehood,” Sotomayor wrote."
        },
        {
            "id": 10,
            "text": "“This silence is especially telling.”"
        },
        {
            "id": 11,
            "text": "ASSOCIATED PRESS Attorney Kyle Ann Gray, left, Clayvin Herrera, and attorney George Hicks pose for pictures on the steps of the Supreme Court, Tuesday, Jan. 8, 2019, in Washington."
        },
        {
            "id": 12,
            "text": "Herrera, who is from Montana, was charged with hunting elk off-season or without a state hunting license."
        },
        {
            "id": 13,
            "text": "He was convicted and received a suspended prison sentence, a fine and a three-year hunting ban."
        },
        {
            "id": 14,
            "text": "An intermediate Wyoming appeals court upheld the conviction in 2017 and the state’s Supreme Court left that ruling in place."
        },
        {
            "id": 15,
            "text": "“We are gratified that the Supreme Court held that the treaty hunting right guaranteed to the Crow Tribe and Mr. Herrera was not abrogated by Wyoming’s admission to the union or the creation of the Bighorn National Forest,” Herrera’s lawyer, George Hicks, said in a statement."
        },
        {
            "id": 16,
            "text": "It marked the court’s second ruling in favor of a hunter in the past two months."
        },
        {
            "id": 17,
            "text": "The court ruled in March that the federal government could not prevent an Alaskan man from riding his hovercraft on a river through territory overseen by the National Park Service to reach remote moose-hunting grounds in the northernmost U.S. state."
        },
        {
            "id": 18,
            "text": ""
        }
    ]
}