{
    "title": "Obama Returns to Trail With a Blue State Focus",
    "text": [
        {
            "id": 0,
            "text": "UPPER MARLBORO, Md. — President Obama jumped back on the campaign trail Sunday after a week of grim Ebola news, with a rally at a high school here aimed at lifting the fortunes of Anthony G. Brown, the state’s lieutenant governor and Democratic candidate for governor."
        },
        {
            "id": 1,
            "text": "In a jam-packed gymnasium, Mr. Obama urged the mostly African-American crowd of 8,000 to shake off any midterm malaise and show up on Nov. 4 to put Mr. Brown in the governor’s mansion."
        },
        {
            "id": 2,
            "text": "“There are no excuses."
        },
        {
            "id": 3,
            "text": "The future is up to us,” the president said, his voice rising above the roar of the enthusiastic crowd."
        },
        {
            "id": 4,
            "text": "“If you want better policies out of Washington, you’ve got to vote for them."
        },
        {
            "id": 5,
            "text": "If you want better policies in Maryland, you have to go vote for them.”"
        },
        {
            "id": 6,
            "text": "Mr. Obama accused Republicans of betting that Democrats will not show up in November."
        },
        {
            "id": 7,
            "text": "But, he insisted, “I’m banking that strategy is not going to work.”"
        },
        {
            "id": 8,
            "text": "The latest Washington Post poll in Maryland showed Mr. Brown with a nine-point lead over Larry Hogan, his Republican challenger."
        },
        {
            "id": 9,
            "text": "But the survey also showed Mr. Brown, who is black, drawing only 77 percent of African-American voters."
        },
        {
            "id": 10,
            "text": "In 2012, Mr. Obama won 97 percent of the black vote in the state, according to an exit poll conducted by Edison Research."
        },
        {
            "id": 11,
            "text": "At the rally, Mr. Obama urged the audience to reject a Republican philosophy that he said had been thoroughly discredited in recent years."
        },
        {
            "id": 12,
            "text": "“They keep on offering the same tired, worn-out theories,” Mr. Obama said of the Republicans, citing tax breaks, looser regulations and a reduced safety net."
        },
        {
            "id": 13,
            "text": "“We have tried all those things."
        },
        {
            "id": 14,
            "text": "We tried ’em before I came into office."
        },
        {
            "id": 15,
            "text": "We know they did not work.”"
        },
        {
            "id": 16,
            "text": "Before Mr. Obama’s speech ended, a steady trickle of people had departed, leaving some empty seats."
        },
        {
            "id": 17,
            "text": "And an immigration activist interrupted the speech, holding a sign demanding that “#Not1more” immigrant be deported."
        },
        {
            "id": 18,
            "text": "As the crowd bellowed the protester away, Mr. Obama suggested that he “should have been protesting the folks that are blocking” an immigration overhaul."
        },
        {
            "id": 19,
            "text": "Mr. Obama’s appearance on behalf of Mr. Brown and a rally scheduled later in the day for Pat Quinn, the Democratic governor of Illinois, were the president’s first small steps back on the campaign stage ahead of the midterm elections."
        },
        {
            "id": 20,
            "text": "The two candidates are eager for the star power that Mr. Obama still brings when it comes to firing up the core constituencies in the party: women, African-Americans, Latinos and gays."
        },
        {
            "id": 21,
            "text": "In Chicago, an energized Mr. Obama whipped up a crowd at a gymnasium at Chicago State University, urging people to support Mr. Quinn when early voting begins on Monday."
        },
        {
            "id": 22,
            "text": "“You’ve got to grab your friends."
        },
        {
            "id": 23,
            "text": "You’ve got to grab your co-workers,” Mr. Obama told about 6,200 people, adding that he planned to vote on Monday morning in Chicago."
        },
        {
            "id": 24,
            "text": "Mr. Quinn, who is running against Bruce Rauner, the Republican nominee, is a longtime Obama friend."
        },
        {
            "id": 25,
            "text": "The president described him as someone who is not slick, not packaged — someone who deserves the votes of people in Illinois."
        },
        {
            "id": 26,
            "text": "“Pat is real."
        },
        {
            "id": 27,
            "text": "He is who he is."
        },
        {
            "id": 28,
            "text": "He’s not trying to front."
        },
        {
            "id": 29,
            "text": "He’s not trying to pretend,” Mr. Obama said."
        },
        {
            "id": 30,
            "text": "“He’s out there fighting for you.”"
        },
        {
            "id": 31,
            "text": "The president has been delivering a campaign stump speech for months, but only at fund-raising events, and largely for high-dollar donors who have helped to provide Democratic candidates a financial edge this season."
        },
        {
            "id": 32,
            "text": "In those events, Mr. Obama has been unapologetic about his policies, arguing that they have repaired an economy that was in tatters, increased domestic energy production, restored home values and reduced the school dropout rate."
        },
        {
            "id": 33,
            "text": "At the fund-raisers, Mr. Obama has also been critical of Republicans in Congress, a group that he says has blocked a vision that a majority of Americans share."
        },
        {
            "id": 34,
            "text": "He has urged the donors to fight against what he calls a “congenital problem” for Democrats: their unwillingness to turn out in midterm elections as they do in presidential years."
        },
        {
            "id": 35,
            "text": "Mr. Obama’s return to the public stage with a similar message is intended to help solve that problem in the final stretch, as Democratic candidates seek to ensure that their must-have voters show up on Election Day."
        },
        {
            "id": 36,
            "text": "But the visits to Maryland and Illinois were also a reminder of where the president’s message is not welcome — the many conservative-leaning states where Democratic Senate candidates are struggling because of the president’s sinking popularity."
        },
        {
            "id": 37,
            "text": "Maryland and Illinois are, after all, heavily Democratic states where the candidates should have little trouble winning elections."
        },
        {
            "id": 38,
            "text": "The fact that Mr. Obama used his valuable time to campaign there, with only 16 days left, was proof that his power to help is severely constrained."
        },
        {
            "id": 39,
            "text": "White House officials had once hoped to help Democratic candidates drive an economic-themed message focused on the minimum wage and issues of importance to women."
        },
        {
            "id": 40,
            "text": "Instead, the president has had to attend to one crisis after another: the Russian invasion of Ukraine and the downing of a passenger plane there; the escalation of the conflict in Iraq and Syria; the beheading of Western hostages; the angry protests in Ferguson, Mo., in the wake of the killing of an unarmed black youth; and, most recently, the Ebola virus in West Africa and the United States."
        },
        {
            "id": 41,
            "text": "It is unclear exactly how those crises will affect the outcome of races next month."
        },
        {
            "id": 42,
            "text": "But it is certain that they have diverted the president’s attention from the message he had hoped to deliver."
        },
        {
            "id": 43,
            "text": "And his handling of the foreign crises is increasingly unpopular, adding to the worry among Democrats."
        }
    ]
}