{
    "title": "Obama: \"He Did in 46 Years What Most of Us Couldn’t Do in 146\"",
    "text": [
        {
            "id": 0,
            "text": "With heavy hearts, the Biden family—and their closest friends and loved ones—laid to rest Beau Biden, 46, on Saturday."
        },
        {
            "id": 1,
            "text": "He was Biden's eldest son, and the first child of an incumbent president (or vice president) to die while in office in roughly five decades."
        },
        {
            "id": 2,
            "text": "He was also an Iraq War veteran, former Attorney General of Delaware, and a rising star in the Democratic Party, rumored to be running for governor in 2016."
        },
        {
            "id": 3,
            "text": "He died on May 30th of brain cancer."
        },
        {
            "id": 4,
            "text": "At the funeral Mass earlier today, President Obama delivered the eulogy, speaking about Beau’s moral character, his deep humility, and his devotion to his wife and children."
        },
        {
            "id": 5,
            "text": "“‘A man,’ wrote an Irish poet, ‘is original when he speaks the truth that has always been known to all good men,’”"
        },
        {
            "id": 6,
            "text": "the president began."
        },
        {
            "id": 7,
            "text": "“Beau Biden was an original."
        },
        {
            "id": 8,
            "text": "He was a good man, a man of character."
        },
        {
            "id": 9,
            "text": "A man who loved deeply, and was loved in return.”"
        },
        {
            "id": 10,
            "text": "“We are here to grieve with you, but more importantly, we are here because we love you,” he said to the family, and to mourners in attendance."
        },
        {
            "id": 11,
            "text": "“To suffer such faceless, seemingly random cruelty can harden the softest hearts or shrink the sturdiest."
        },
        {
            "id": 12,
            "text": "It can make one mean or bitter or full of self-pity."
        },
        {
            "id": 13,
            "text": "Or to paraphrase an old proverb: it can make you beg for a lighter burden."
        },
        {
            "id": 14,
            "text": "But if you’re strong enough, it can also make you ask God for broader shoulders."
        },
        {
            "id": 15,
            "text": "Shoulders broad enough to bear not only your own burdens, but the burdens of others.”"
        },
        {
            "id": 16,
            "text": "“To know Beau Biden is to know which choice he made in his life,” he declared."
        },
        {
            "id": 17,
            "text": "“To know Joe, and the rest of the Biden family, is to understand why Beau lived the life he did.”"
        },
        {
            "id": 18,
            "text": "While discussing the fact that Beau’s mother and sister were tragically killed in an automobile accident when he was child, the president explained how this traumatic event both shaped – and indeed changed – his life."
        },
        {
            "id": 19,
            "text": "“Rather than use his childhood trauma as justification for a life of self-pity or self-centeredness, that very young boy made a very grown-up decision: He would live a life of meaning,” he said."
        },
        {
            "id": 20,
            "text": "“He would live a life for others."
        },
        {
            "id": 21,
            "text": "He would ask God for broader shoulders."
        },
        {
            "id": 22,
            "text": "Beau would guide and look out for his younger brother."
        },
        {
            "id": 23,
            "text": "He would embrace his new mom.”"
        },
        {
            "id": 24,
            "text": "“He would forever be the one to do the right thing,” he added."
        },
        {
            "id": 25,
            "text": "In truth, Beau Biden was a moral person, just like his father, the president said."
        },
        {
            "id": 26,
            "text": "However, while remarking on some of the similarities between father and son, Obama also noted that there were marked differences as well."
        },
        {
            "id": 27,
            "text": "“As much as Beau reminded folds of Joe, he was very much his own man,” he intoned."
        },
        {
            "id": 28,
            "text": "“He was an original."
        },
        {
            "id": 29,
            "text": "He was [the son] of an incredible family who brushed away the possibility of privilege for the harder, better reward of earning his own way."
        },
        {
            "id": 30,
            "text": "He was a soldier who dodged glory, and exuded true humility."
        },
        {
            "id": 31,
            "text": "A prosecutor who defended the defenseless; the rare politician who collected more fans than foes; and the rare public figure who prioritized his private life above all else.”"
        },
        {
            "id": 32,
            "text": "“Beau didn’t cut corners,” he added."
        },
        {
            "id": 33,
            "text": "“He turned down an appointment to be Delaware’s attorney general so he could win it fair and square."
        },
        {
            "id": 34,
            "text": "When the field was clear for him to run for the senate, he chose to finish his job as AG instead."
        },
        {
            "id": 35,
            "text": "He didn’t do these things to gain favor with a cynical public, it’s just who he was.”"
        },
        {
            "id": 36,
            "text": "Finally, the president ended his remarks by noting that while his life was tragically cut short, Beau Biden accomplished much in his 46 years on earth."
        },
        {
            "id": 37,
            "text": "“He did in 46 years what most of us couldn’t do in 146,” he averred."
        },
        {
            "id": 38,
            "text": "“He left nothing in the tank."
        },
        {
            "id": 39,
            "text": "He was a man who led a life where the means were as important as the ends."
        },
        {
            "id": 40,
            "text": "And the example he set made you want to be a better dad, or a better son, or a better brother or sister.”"
        }
    ]
}