{
    "title": "Federal Court Rules Pennsylvania's Lockdown Order Unconstitutional",
    "text": [
        {
            "id": 0,
            "text": "A federal judge on Monday has ruled that lockdown restrictions imposed by Pennsylvania Gov. Tom Wolf (D), including a ban on large gatherings and the closure of \"non-life sustaining businesses,\" are unconstitutional."
        },
        {
            "id": 1,
            "text": "While those restrictions were \"well-intentioned,\" wrote U.S. District Judge William Stickman IV, \"good intentions toward a laudable end are not alone enough to uphold governmental action against a constitutional challenge."
        },
        {
            "id": 2,
            "text": "Indeed, the greatest threats to our system of constitutional liberties may arise when the ends are laudable and the intent is good—especially in time of emergency.\""
        },
        {
            "id": 3,
            "text": "In May, Wolf and Pennsylvania Department of Health Secretary Rachel Levine were sued by a coalition of counties, federal and state elected representatives, and several small businesses over the state's coronavirus restrictions."
        },
        {
            "id": 4,
            "text": "The restrictions included a shelter-in-place order requiring people to stay in their homes, a closure of all \"non-life-sustaining\" businesses, and bans on gatherings of more than 25 people indoors, or 250 people for outdoor gatherings."
        },
        {
            "id": 5,
            "text": "The plaintiffs collectively argued that the governor's restrictions on gatherings violated the First Amendment's protections of free speech and assembly."
        },
        {
            "id": 6,
            "text": "The shelter-in-place order and closure of businesses, they contended, were a violation of their rights to substantive due process under the 14th Amendment."
        },
        {
            "id": 7,
            "text": "Wolf's lawyers had argued that the restrictions on gatherings and business openings were well within his powers to respond to a public health emergency."
        },
        {
            "id": 8,
            "text": "He also argued that the lawsuit was moot because the state had since allowed many businesses to resume, including in the counties suing the state."
        },
        {
            "id": 9,
            "text": "Because emergency orders had only been partially suspended, and not retracted in their entirety, Stickman ruled that plaintiffs were still in their right to challenge them, reports the Philadelphia Inquirer."
        },
        {
            "id": 10,
            "text": "In regards to restrictions on gatherings, Stickman ruled that these were not \"narrowly tailored\" but \"rather, they place substantially more burdens on gatherings than needed to achieve their stated purpose\" of controlling the transmission of the virus."
        },
        {
            "id": 11,
            "text": "The fact that the governor's orders allow people to visit malls, restaurants, and stores in greater numbers than what the state's restrictions on gatherings permit showed that the latter were overly broad, Stickman wrote."
        },
        {
            "id": 12,
            "text": "His opinion also cites comments from Wolf's chief of staff about how large protests—which the governor attended—didn't lead to a \"super spreader\" event as evidence that restrictions on gatherings were overly broad."
        },
        {
            "id": 13,
            "text": "Stickman similarly ruled that Wolf's order closing non-life sustaining businesses was also overly broad and arbitrary, and deprived Pennsylvanians of their right to earn a living under the 14th Amendment."
        },
        {
            "id": 14,
            "text": "Stickman also wrote that population-wide lockdowns are \"such a dramatic inversion of the concept of liberty in a free society as to be nearly presumptively unconstitutional.\""
        }
    ]
}