{
    "title": "McConnell: Power-sharing deal can proceed after Manchin, Sinema back filibuster",
    "text": [
        {
            "id": 0,
            "text": "Senate Minority Leader Mitch McConnell (R-Ky.) indicated on Monday night that a power-sharing deal could move forward after two Democrats reiterated they would not nix the 60-vote legislative filibuster."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "\"Today two Democratic Senators publicly confirmed they will not vote to end the legislative filibuster."
        },
        {
            "id": 3,
            "text": "They agree with President Biden’s"
        },
        {
            "id": 4,
            "text": "and my view that no Senate majority should destroy the right of future minorities of both parties to help shape legislation,\" McConnell said in a statement."
        },
        {
            "id": 5,
            "text": "\"The legislative filibuster was a key part of the foundation beneath the Senate’s last 50-50 power-sharing agreement in 2001."
        },
        {
            "id": 6,
            "text": "With these assurances, I look forward to moving ahead with a power-sharing agreement modeled on that precedent,\" McConnell added."
        },
        {
            "id": 7,
            "text": "The GOP leader's remarks effectively ends the days-long impasse over how to organize an evenly split 50-50 Senate, where Democrats hold the majority because Vice President Harris can break a tie."
        },
        {
            "id": 8,
            "text": "Senate Majority Leader Charles Schumer"
        },
        {
            "id": 9,
            "text": "(D-N.Y.) immediately declared victory."
        },
        {
            "id": 10,
            "text": "\"We’re glad Senator McConnell threw in the towel and gave up on his ridiculous demand."
        },
        {
            "id": 11,
            "text": "We look forward to organizing the Senate under Democratic control and start getting big, bold things done for the American people,\" said Justin Goodman, a spokesman for Schumer."
        },
        {
            "id": 12,
            "text": "McConnell's comments come after Sens. Joe Manchin (D-W.Va.) and Kyrsten Sinema (D-Ariz.) reiterated on Monday that they oppose nixing the 60-vote legislative filibuster."
        },
        {
            "id": 13,
            "text": "\"I do not support doing away with the filibuster under any condition."
        },
        {
            "id": 14,
            "text": "It's not who I am,\" Manchin told reporters."
        },
        {
            "id": 15,
            "text": "Sinema's office also reiterated on Monday that she is still not supportive of nixing the filibuster after The Washington Post incorrectly suggested that she might be open to getting rid of the 60-vote hurdle."
        },
        {
            "id": 16,
            "text": "Sinema is \"against eliminating the filibuster, and she is not open to changing her mind about eliminating the filibuster,\" a spokesperson told the Post."
        },
        {
            "id": 17,
            "text": "Their positions are not new, but their statements appear to have reassured Republicans amid growing calls from outside groups and members of the Senate Democratic caucus to nix the 60-vote filibuster."
        },
        {
            "id": 18,
            "text": "The power-sharing talks have effectively been at a standstill for days after McConnell said he wanted assurances on the fate of the legislative filibuster as part of the agreement with Schumer on organizing the 50-50 Senate."
        },
        {
            "id": 19,
            "text": "That's kept the chamber in an odd state of limbo where Democrats have the majority but Republicans control the committees."
        },
        {
            "id": 20,
            "text": "McConnell and Schumer are expected to agree to a deal that mirrors the 2001 power-sharing agreement, when the Senate was last evenly split."
        },
        {
            "id": 21,
            "text": "Under the 2001 deal, nominations or legislation that received tie votes in the committee were still sent on to the full Senate."
        },
        {
            "id": 22,
            "text": "Democrats rejected McConnell's filibuster demand last week, though they didn't indicate how they thought the situation would be resolved."
        },
        {
            "id": 23,
            "text": "Democrats don't have the votes to nix the filibuster, but they've also scoffed at McConnell trying to box them in despite no longer controlling the chamber."
        },
        {
            "id": 24,
            "text": "Schumer, in an interview with MSNBC's Rachel Maddow, which was taped before McConnell's statement, said that he thought McConnell would \"come to his senses and take our offer\" in a matter of days."
        },
        {
            "id": 25,
            "text": "\"He's not going to get his way. ..."
        },
        {
            "id": 26,
            "text": "That is universal in my caucus,\" Schumer said, adding that McConnell's move \"really angered my entire caucus.\""
        },
        {
            "id": 27,
            "text": ""
        }
    ]
}