{
    "title": "New Hampshire lawmakers override governor veto to abolish death penalty",
    "text": [
        {
            "id": 0,
            "text": "New Hampshire lawmakers on Thursday voted to outlaw the death penalty in the Granite State, overriding a veto of a bill by Gov. Chris Sununu (R)."
        },
        {
            "id": 1,
            "text": "The new law, which takes effect immediately, means that capital punishment will be repealed throughout New England."
        },
        {
            "id": 2,
            "text": "Veto overrides require a two-thirds majority, which the state Senate accomplished with its 16-8 vote on Thursday, according to The Associated Press."
        },
        {
            "id": 3,
            "text": "The state House voted to override the veto last week."
        },
        {
            "id": 4,
            "text": "Sununu vetoed the bill repealing the death penalty earlier this month."
        },
        {
            "id": 5,
            "text": "New Hampshire has not executed any inmates since 1939 and only has one inmate currently on death row, Michael Addison, who killed Officer Michael Briggs of the Manchester Police Department in 2006."
        },
        {
            "id": 6,
            "text": "The law does not apply retroactively to Briggs, but opponents of the measure have argued courts could interpret it to spare his life."
        },
        {
            "id": 7,
            "text": "The state has no facility for executions."
        },
        {
            "id": 8,
            "text": "Maine was the first New England state, and one of the first in the U.S., to outlaw capital punishment in 1887, followed by Vermont in 1972, Massachusetts and Rhode Island in 1984, and Connecticut in 2012."
        },
        {
            "id": 9,
            "text": "Before the passage of the bill, only seven scenarios qualified as capital murder in New Hampshire: the murder of a law enforcement official, correctional officer, judge or prosecutor in the line of duty; a murder during a kidnapping or attempted kidnapping; as part of a contract killing; a murder after being sentenced to life without parole; and while committing or attempting to commit aggravated felonious sexual assault, robbery or a drug offense."
        }
    ]
}