{
    "title": "Surprise Indiana win vaults Bernie Sanders toward convention",
    "text": [
        {
            "id": 0,
            "text": "Sen. Bernard Sanders captured a surprise win in the Indiana primary Tuesday, giving his campaign more fuel to fight until the Democratic National Convention in July and frustrating Hillary Clinton, who desperately wants to shift into general election mode."
        },
        {
            "id": 1,
            "text": "Networks called the race by 9:10 p.m. EDT, just over two hours after the Indiana polls closed."
        },
        {
            "id": 2,
            "text": "With 84 percent of the vote counted at 10 p.m., Mr. Sanders had 53 percent compared with 47 percent for Mrs. Clinton."
        },
        {
            "id": 3,
            "text": "The Indiana win ends an impressive string of victories for Mrs. Clinton, who captured six of the past seven contests heading into Tuesday."
        },
        {
            "id": 4,
            "text": "The Sanders victory also prolongs a race that the former first lady is eager to put behind her as she turns her attention to presumptive Republican presidential nominee Donald Trump."
        },
        {
            "id": 5,
            "text": "Despite having little realistic path to his party’s nomination, Mr. Sanders appears intent on remaining in the race to continue pushing Mrs. Clinton further left on issues such as Wall Street reform and income inequality."
        },
        {
            "id": 6,
            "text": "Speaking to supporters in Louisville, Kentucky, Mr. Sanders said his message is resonating with key constituencies in the Democratic Party, and that the platform he crafted has struck a chord across the country."
        },
        {
            "id": 7,
            "text": "He gave no indication that he is taking his foot off the gas pedal anytime soon."
        },
        {
            "id": 8,
            "text": "“I’ll tell you what is extremely exciting for me, and that is that in primary after primary, caucus after caucus, we end up winning the vote of people 45 years of age or younger, and that is important because if tells me that the ideas we are fighting for are the ideas for the future of America, and the future of the Democratic Party,” Mr. Sanders said before blasting income inequality, Wall Street, college debt and other issues that have become central themes in his stump speech."
        },
        {
            "id": 9,
            "text": "“In America today, we have millions of people working longer hours, for lower wages,” he said."
        },
        {
            "id": 10,
            "text": "“We have families today where mom is working 40 hours, dad is working 40 hours, the kids are working and they’re still not earning enough money to provide for their family."
        },
        {
            "id": 11,
            "text": "That is why we are going to create an economy that works for all of us, not just the 1 percent.”"
        },
        {
            "id": 12,
            "text": "Despite the outcome in Indiana, the race increasingly looks like Mrs. Clinton’s to lose."
        },
        {
            "id": 13,
            "text": "Heading into Tuesday’s primary, she had a substantial lead over Mr. Sanders in the delegate race, 2,165 to 1,357, according to an Associated Press tally."
        },
        {
            "id": 14,
            "text": "Among pledged delegates, Mrs. Clinton still leads 1,645 to 1,318."
        },
        {
            "id": 15,
            "text": "Among superdelegates, she is ahead 520 to 39."
        },
        {
            "id": 16,
            "text": "There are 83 pledged delegates at stake in the Indiana primary, and the state also has nine superdelegates, seven of whom have said they will support Mrs. Clinton."
        },
        {
            "id": 17,
            "text": "With such a substantial lead, Mrs. Clinton has made clear that she intends to virtually ignore attacks from the Sanders campaign and will instead focus on the general election, where she almost certainly will face Republican Donald Trump."
        },
        {
            "id": 18,
            "text": "Mr. Trump’s chief competition, Sen. Ted Cruz, dropped out of the Republican race Tuesday night after a crushing defeat in Indiana."
        },
        {
            "id": 19,
            "text": "“I’m really focused on moving into the general election,” the former first lady told MSNBC on Tuesday."
        },
        {
            "id": 20,
            "text": "“I think that’s where we have to be, because we’re going to have a tough campaign against a candidate who will literally say or do anything."
        },
        {
            "id": 21,
            "text": "And we’re going to take him on at every turn on what’s really important to the people of our country.”"
        },
        {
            "id": 22,
            "text": "But Mrs. Clinton already has stumbled in the early phase of her general election campaign."
        },
        {
            "id": 23,
            "text": "On Monday, an out-of-work coal miner confronted Mrs. Clinton in West Virginia and questioned her about past statements that more coal miners will be out of work under her administration and that the entire industry would be put “out of business” as she transitions the nation to clean energy."
        },
        {
            "id": 24,
            "text": "Mrs. Clinton was touring Appalachia ahead of next week’s West Virginia primary and the May 17 contest in Kentucky."
        },
        {
            "id": 25,
            "text": "The two states remain the heart of the U.S. coal industry, and Mrs. Clinton’s comments could carry political consequences in her contests against Mr. Sanders."
        },
        {
            "id": 26,
            "text": "At a town hall meeting in West Virginia, she tried to clarify her position."
        },
        {
            "id": 27,
            "text": "“I don’t know how to explain it other than what I said was totally out of context from what I meant because I have been talking about helping coal country for a very long time, and I did put out a plan last summer,” she said."
        },
        {
            "id": 28,
            "text": "“I didn’t mean that we were going to do it."
        },
        {
            "id": 29,
            "text": "What I said was that is going to happen unless we take action to try to help and prevent it.”"
        },
        {
            "id": 30,
            "text": "Mr. Sanders, meanwhile, has mounted a campaign aimed at persuading superdelegates to change their minds at the party convention in July, saying he has a better shot at defeating Mr. Trump in the fall than does Mrs. Clinton."
        },
        {
            "id": 31,
            "text": "Indeed, polls show him faring better against the billionaire businessman than his opponent."
        },
        {
            "id": 32,
            "text": "The Sanders campaign also continues to attack Mrs. Clinton on a host of issues, some of which could weaken her in a general election by fueling the notion that she is dishonest and untrustworthy."
        },
        {
            "id": 33,
            "text": "On Tuesday, for example, Sanders campaign manager Jeff Weaver told supporters that the Clinton campaign is skirting campaign finance laws and misleading Democratic donors by holding joint fundraisers with other Democratic Party organizations."
        },
        {
            "id": 34,
            "text": "The system allows donors to funnel hundreds of thousands of dollars into the Hillary Victory Fund, which is supposed to benefit both the Clinton campaign and state Democratic parties."
        },
        {
            "id": 35,
            "text": "A Politico investigation this week found that about 99 percent of the $61 million raised by the Hillary Victory Fund has been used on the Clinton campaign."
        },
        {
            "id": 36,
            "text": "The Sanders campaign capitalized by circulating a petition calling on Mrs. Clinton to return millions of dollars to the state party organizations."
        },
        {
            "id": 37,
            "text": "“It’s unfortunate that Hillary Clinton has benefited from tens of millions of dollars in cash transfers and advertising to campaign against us in the primary."
        },
        {
            "id": 38,
            "text": "But it’s not too late for her campaign to do the right thing by the state parties we’re going to need to win elections up and down the ticket this November,” Mr. Weaver said in an email."
        },
        {
            "id": 39,
            "text": ""
        },
        {
            "id": 40,
            "text": ""
        },
        {
            "id": 41,
            "text": ""
        },
        {
            "id": 42,
            "text": ""
        }
    ]
}