{
    "title": "Republicans barging into secure room to stall impeachment inquiry highlights another wild day",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "In Thursday’s biggest development, nearly two dozen Republican lawmakers – led by Rep. Matt Gaetz of Florida – barged into a deposition and demanded they be allowed to see the closed-door proceedings."
        },
        {
            "id": 3,
            "text": "Members of three committees planned to interview Deputy Assistant Defense Secretary Laura Cooper as part of the impeachment probe into President Donald Trump."
        },
        {
            "id": 4,
            "text": "It delayed Cooper’s testimony by hours."
        },
        {
            "id": 5,
            "text": "The chaotic scene, with Republicans flouting House rules to make a political point, represented a new and more confrontational phase of the GOP attack on House Intelligence Chairman Adam Schiff of California and the Democratic impeachment investigation, wrote Manu Raju and Jeremy Herb."
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "A lot of people, including Democrats and publications, are using the term “stormed” to refer to what these lawmakers did."
        },
        {
            "id": 8,
            "text": "But for me that conjures the image of soldiers on the beaches at Normandy."
        },
        {
            "id": 9,
            "text": "I like “barged” better, even though there was apparently a fair amount of yelling."
        },
        {
            "id": 10,
            "text": "The image of Republican congressmen storming the hearing also confused Republican Sen. Lindsey Graham of South Carolina."
        },
        {
            "id": 11,
            "text": "He tweeted:\n\n“I was initially told House GOP took the SCIF by force – basically like a GOP version of Occupy Wall Street."
        },
        {
            "id": 12,
            "text": "Apparently it was a peaceful protest."
        },
        {
            "id": 13,
            "text": "Big difference."
        },
        {
            "id": 14,
            "text": "I understand their frustration and they have good reason to be upset.”"
        },
        {
            "id": 15,
            "text": "Occupy Wall Street bad."
        },
        {
            "id": 16,
            "text": "Delay Impeachment Inquiry good."
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "A GOP congressman involved in Wednesday’s protest told CNN’s Dana Bash that the protest had been on his calendar for about a week."
        },
        {
            "id": 19,
            "text": "However, it was initially called as a traditional press conference."
        },
        {
            "id": 20,
            "text": "It wasn’t until it was actually happening that this person – obviously not an organizer – realized they were going to actually go to the SCIF."
        },
        {
            "id": 21,
            "text": "Trump, who had met with some of the lawmakers involved in the protest at the White House on Tuesday, had advance knowledge of the plans to attempt entry to the SCIF, a person familiar with the matter told CNN’s Kevin Liptak."
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": "The lawmakers entered the secure room, a SCIF – sensitive compartmented information facility – where the closed hearings are taking place and where cellphones are not allowed."
        },
        {
            "id": 24,
            "text": "Some had to clarify that their tweets to publicize the protest, which originally purported to be inside the facility, were actually posted from outside by staff members."
        },
        {
            "id": 25,
            "text": "They were brought pizza, which is allowed."
        },
        {
            "id": 26,
            "text": "They left at 2 p.m. for votes."
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": "The most effective Republican gripe about the impeachment process thus far has been about process."
        },
        {
            "id": 29,
            "text": "There was no vote to kick things off."
        },
        {
            "id": 30,
            "text": "There have not yet been open hearings or transcripts released."
        },
        {
            "id": 31,
            "text": "The argument goes that if this is a trial, the President has been robbed of due process."
        },
        {
            "id": 32,
            "text": ""
        },
        {
            "id": 33,
            "text": "It’s important to remember that Republicans who sit on the committees that are running the impeachment inquiry are in the hearings during testimony."
        },
        {
            "id": 34,
            "text": "But it’s certainly not an open process and Trump does not have attorneys there."
        },
        {
            "id": 35,
            "text": ""
        },
        {
            "id": 36,
            "text": "The Constitution says very little about how the impeachment process should play out, and the courts have tried to stay out of it."
        },
        {
            "id": 37,
            "text": "But the trial phase will come later, in the Senate, if it gets to that."
        },
        {
            "id": 38,
            "text": "Democrats like Schiff have promised there will eventually be open hearings during the process."
        },
        {
            "id": 39,
            "text": "Trump hijacked the impeachment debate with ‘no quid pro quo’\n\nI wrote about this Wednesday."
        },
        {
            "id": 40,
            "text": "These are some of the places the term “quid pro quo” does not appear:\n\nThe whistleblower complaint."
        },
        {
            "id": 41,
            "text": "The Constitution, which lays out the impeachment process."
        },
        {
            "id": 42,
            "text": "The Federalist Papers, where Alexander Hamilton expanded on impeachable offenses as, simply, “the abuse or violation of some public trust.”"
        },
        {
            "id": 43,
            "text": "Initial news stories about the whistleblower complaint, such as when The Washington Post reported on September 18 that it had been triggered by Trump’s interaction with a world leader."
        },
        {
            "id": 44,
            "text": "But Trump had been using the term “no quid pro quo” with regard to Ukraine long before the whistleblower complaint was public and before any of the published reports about his phone call with Ukrainian President Volodymyr Zelensky."
        },
        {
            "id": 45,
            "text": "He injected it into the bloodstream and now he clings to the idea – “no quid pro quo” – as his defense, regardless of what the complaint, the call transcript or the growing list of witnesses say."
        },
        {
            "id": 46,
            "text": "How Bill Taylor figured out what was going on"
        },
        {
            "id": 47,
            "text": "Jake Tapper went point by point through diplomat Bill Taylor’s testimony to show how Taylor, bit by bit, came to understand what was going on around him."
        },
        {
            "id": 48,
            "text": ""
        },
        {
            "id": 49,
            "text": ""
        },
        {
            "id": 50,
            "text": "David Chalian dissected the Bill Taylor testimony with CNN’s Sara Murray and The Daily Beast’s Matt Lewis."
        },
        {
            "id": 51,
            "text": "Who is the whistleblower?"
        },
        {
            "id": 52,
            "text": "Rep. Jim Jordan tweeted Wednesday, feeding into the theory that the whistleblower is somehow in cahoots with Democratic Rep. Adam Schiff of California, who is running the impeachment inquiry:"
        },
        {
            "id": 53,
            "text": "Only one knows who the ‘whistleblower’ is and who their sources are: @RepAdamSchiff."
        },
        {
            "id": 54,
            "text": "Why?”"
        },
        {
            "id": 55,
            "text": "The Ohio Republican was shot down pretty quickly by the whistleblower’s attorney, who wrote back:\n\n“Congressman - As far as we know, NO Member of Congress knows the whistleblower’s identity."
        },
        {
            "id": 56,
            "text": "And that’s exactly the point – to make sure federal employees can come forward to report wrongdoing anonymously and without repercussion.”"
        },
        {
            "id": 57,
            "text": "Ukrainians felt pressured early – Two weeks before he took office last spring, President Volodymyr Zelensky and his team were already discussing the pressure they felt from the Trump administration and Trump’s personal attorney Rudy Giuliani to launch investigations that would benefit Trump, according to a source familiar with discussions at the meeting."
        },
        {
            "id": 58,
            "text": "Trump’s immunity from shooting people – A Trump attorney followed the Justice Department’s policy of not charging sitting presidents with crimes, arguing in court that if the President shot someone on 5th Avenue, he could not be prosecuted until he left office."
        },
        {
            "id": 59,
            "text": "Documents decision – A federal judge granted an emergency motion from the watchdog group American Oversight seeking the release of Ukraine-related records from the State Department, including communications between Secretary of State Mike Pompeo and Rudy Giuliani, the President’s personal lawyer."
        },
        {
            "id": 60,
            "text": "What are we doing here?"
        },
        {
            "id": 61,
            "text": "The President has invited foreign powers to interfere in the US presidential election."
        },
        {
            "id": 62,
            "text": "Democrats want to impeach him for it."
        },
        {
            "id": 63,
            "text": "It is a crossroads for the American system of government as the President tries to change what’s acceptable for US politicians."
        },
        {
            "id": 64,
            "text": ""
        }
    ]
}