{
    "title": "Trump slammed by lawmakers after he called impeachment inquiry a 'lynching'",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON – President Donald Trump compared the impeachment inquiry against him to \"a lynching\" on Tuesday, drawing condemnation for comparing a congressional process to vigilante murders aimed mostly at black Americans."
        },
        {
            "id": 1,
            "text": "\"All Republicans must remember what they are witnessing here – a lynching."
        },
        {
            "id": 2,
            "text": "But we will WIN!\""
        },
        {
            "id": 3,
            "text": "Trump tweeted."
        },
        {
            "id": 4,
            "text": "African American lawmakers took particular offense at the post."
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "\"What the hell is wrong with you?\""
        },
        {
            "id": 7,
            "text": "tweeted Rep. Bobby Rush, D-Ill."
        },
        {
            "id": 8,
            "text": "\"Do you know how many people who look like me have been lynched, since the inception of this country, by people who look like you."
        },
        {
            "id": 9,
            "text": "Delete this tweet.\""
        },
        {
            "id": 10,
            "text": "Rep. Karen Bass, D-Calif., chair of the Congressional Black Caucus, said Trump \"is once again using racial rhetoric to distract from the truth – his corrupted behavior is weakening the integrity of our democracy.\""
        },
        {
            "id": 11,
            "text": "Bass added that the president \"is comparing a constitutional process to the prevalent and systematic brutal torture and murder of thousands, I repeat, thousands of African Americans in this country."
        },
        {
            "id": 12,
            "text": "It's unacceptable.\""
        },
        {
            "id": 13,
            "text": "Some Republicans also criticized Trump's metaphor."
        },
        {
            "id": 14,
            "text": "Former Florida Gov. Jeb Bush, who lost to Trump in the 2016 GOP primaries, tweeted that the president is not \"a victim\" and that \"to equate his plight to lynching is grotesque.\""
        },
        {
            "id": 15,
            "text": "White House spokesman Hogan Gidley denied that Trump considers himself a lynching victim, saying \"he's not comparing himself to those dark times.\""
        },
        {
            "id": 16,
            "text": "Instead, Gidley said, the president was criticizing his treatment by Democrats and journalists whom he said have called for his impeachment ever since he was elected\n\n\""
        },
        {
            "id": 17,
            "text": "He is not receiving due process,\" Gidley said."
        },
        {
            "id": 18,
            "text": "Gidley also said Trump has accomplished many things for African-Americans, citing low unemployment rates and a criminal justice reform bill."
        },
        {
            "id": 19,
            "text": "Trump has attacked House Democrats' impeachment investigation as political."
        },
        {
            "id": 20,
            "text": "But Tuesday was the first time he used the term \"lynching.\""
        },
        {
            "id": 21,
            "text": "In general, a lynching is the hanging of an accused person without benefit of a trial – a fate often visited on black Americans in the pre-civil rights era."
        },
        {
            "id": 22,
            "text": "The NAACP reports that from 1882 to 1968, there were 4,743 lynchings in the United States, and of these, 3,446 were black."
        },
        {
            "id": 23,
            "text": "In the decades after the Civil War and Reconstruction, the NAACP history said, \"lynchings were becoming a popular way of resolving some of the anger that whites had in relation to the free blacks.\""
        },
        {
            "id": 24,
            "text": "Impeachment inquiry:Diplomat who called Trump Ukraine policy 'crazy' to testify in impeachment probe\n\nRep. Jim Clyburn, D-S.C., who had the tweet read to him during an interview on CNN, said: \"That is one word no president ought to apply to himself."
        },
        {
            "id": 25,
            "text": "You know, I've studied presidential history quite a bit, and I don't know if we've ever seen anything quite like this.\""
        },
        {
            "id": 26,
            "text": "A few Republican lawmakers took Trump to task for his \"lynching\" comment."
        },
        {
            "id": 27,
            "text": "Rep. Adam Kinzinger, R-Ill., a frequent critic of Trump, tweeted that \"we can all disagree on the process,\" but terms like \"lynching\" should never be used."
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": "\"The painful scourge in our history has no comparison to politics, and @realDonaldTrump should retract this immediately,\" Kinzinger said."
        },
        {
            "id": 30,
            "text": "\"May God help us to return to a better way.\""
        },
        {
            "id": 31,
            "text": "House Republican leader Kevin McCarthy, R-Calif., said \"that’s not the language I would use,” though he defended Trump's complaints about the Democrat-led impeachment efforts."
        },
        {
            "id": 32,
            "text": "“It’s very clear that what the Democrats are doing here does not have due process, is not fair in the process, is not something this House has done ever in the past,\" McCarthy said."
        },
        {
            "id": 33,
            "text": "Another Republican, Sen. Lindsey Graham of South Carolina, defended the president's word choice as \"pretty well accurate.\""
        },
        {
            "id": 34,
            "text": "He told reporters that the impeachment investigation is a \"sham\" and a \"joke.\""
        },
        {
            "id": 35,
            "text": ""
        },
        {
            "id": 36,
            "text": "\"So yeah,\" Graham said, \"this is a lynching in every sense.\""
        },
        {
            "id": 37,
            "text": "Sen. Tim Scott, R-S.C., Graham's South Carolina colleague and the only African American Republican in Congress, questioned Trump's language if not his sentiment."
        },
        {
            "id": 38,
            "text": "\"There’s no question that the impeachment process is the closest thing to a political death row trial, so I get his absolute rejection of the process,\" Scott told reporters."
        },
        {
            "id": 39,
            "text": "\"I wouldn’t use the word 'lynching.'\""
        },
        {
            "id": 40,
            "text": "Historian Kevin Kruse wrote on Twitter that \"comparing impeachment proceedings to a lynching is even more insulting when you've cozied up to the very forces of white supremacy that historically have used lynching as a tool to terrorize racial minorities.\""
        },
        {
            "id": 41,
            "text": "House Democrats are investigating Trump over a whistleblower complaint that accused Trump of asking a foreign country – Ukraine – to investigate one of his domestic political opponents, former Vice President Joe Biden."
        },
        {
            "id": 42,
            "text": "As part of a series of familiar-looking tweets decrying the investigation as political, Trump also made a threat against future Democratic presidents."
        },
        {
            "id": 43,
            "text": "\"So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights,\" Trump said."
        },
        {
            "id": 44,
            "text": "The tweet came a day after Trump complained that Republicans have not been aggressive enough in defending him."
        },
        {
            "id": 45,
            "text": "\"Republicans have to get tougher and fight,\" Trump said in a Cabinet meeting Monday."
        },
        {
            "id": 46,
            "text": "\"We have some that are great fighters, but they have to get tougher and fight because the Democrats are trying to hurt the Republican Party for the (2020) election.\""
        },
        {
            "id": 47,
            "text": ""
        },
        {
            "id": 48,
            "text": ""
        }
    ]
}