{
    "title": "Dick’s Sporting Goods Will Quit Selling Assault-Style Rifles",
    "text": [
        {
            "id": 0,
            "text": "Dick’s Sporting Goods, one of the largest U.S. sports retailers, on Wednesday said its stores will stop selling all assault-style rifles and will require gun buyers to be at least 21."
        },
        {
            "id": 1,
            "text": "The moves take effect immediately at Dick’s more than 700 stores, marking a dramatic shift by a major seller of weapons and hunting gear in the aftermath of the Feb. 14 gun massacre at Marjory Stoneman Douglas High School in Parkland, Florida."
        },
        {
            "id": 2,
            "text": "“As we looked at what happened down in Parkland, we were so disturbed and saddened by what happened."
        },
        {
            "id": 3,
            "text": "We felt we really needed to do something,” the company’s CEO, Ed Stack, said on ABC’s “Good Morning America.”"
        },
        {
            "id": 4,
            "text": "Chairman and CEO of Dick's Sporting Goods tells @GStephanopoulos why the company has decided to no longer sell assault style rifles or firearms to anyone under 21 years of age, and no longer sell high capacity magazines."
        },
        {
            "id": 5,
            "text": "— Good Morning America (@GMA) February 28, 2018"
        },
        {
            "id": 6,
            "text": "The Parkland shooter used an AR-15 rifle to kill 17 people."
        },
        {
            "id": 7,
            "text": "That style weapon is among the firearms Dick’s will no longer sell."
        },
        {
            "id": 8,
            "text": "In addition, Dick’s stores will stop selling high-capacity ammunition magazines and will raise the age requirement for gun buyers to 21."
        },
        {
            "id": 9,
            "text": "Many companies have taken action since the shooting amid rising demands for tougher gun laws."
        },
        {
            "id": 10,
            "text": "Corporate entities, from airlines to rental car chains, have ended partnerships with the National Rifle Association."
        },
        {
            "id": 11,
            "text": "Stack said Dick’s discovered the Parkland gunman bought a gun at one of its stores in November."
        },
        {
            "id": 12,
            "text": "It was not the weapon used in the shooting."
        },
        {
            "id": 13,
            "text": "“We did everything by the book."
        },
        {
            "id": 14,
            "text": "We did everything that the law required and still he was able to buy a gun,” Stack said."
        },
        {
            "id": 15,
            "text": "“When we looked at that, we said, ‘The systems that are in place across the board just aren’t effective enough to keep us from selling someone a gun like that.’”"
        },
        {
            "id": 16,
            "text": "Following the 2012 gun massacre at Sandy Hook Elementary School in Newtown, Connecticut, the company removed assault-style weapons from its main stores, but continued to sell them in its Field and Stream stores."
        },
        {
            "id": 17,
            "text": "Stack said Wednesday’s decision will be permanent and will apply to all of the company’s stores."
        },
        {
            "id": 18,
            "text": "The CEO also called on Congress to pass legislation to prevent gun massacres."
        },
        {
            "id": 19,
            "text": "“We hope that they come together with the intent of really finding a solution to this problem, as opposed to just talking about it, knowing that they’re never going to do anything, to just speak to their base,” Stack said."
        },
        {
            "id": 20,
            "text": "Stack emphasized that the company supports the Second Amendment and gun ownership, and that preventing gun violence and promoting gun rights can go hand and hand."
        },
        {
            "id": 21,
            "text": "“We’ve just decided, based on what happened, and with these guns, we don’t want to be part of this story,” he said."
        }
    ]
}