{
    "title": "Trump Gets His First Official GOP Challenger With Bill Weld Announcement",
    "text": [
        {
            "id": 0,
            "text": "Former Massachusetts Gov. Bill Weld officially entered the 2020 Republican presidential primary on Monday, giving Donald Trump the first serious intra-party challenge to a sitting president since Pat Buchanan ran against George H.W. Bush a quarter-century ago."
        },
        {
            "id": 1,
            "text": "“I really think if we have six more years of the same stuff we’ve had out of the White House the last two years, that would be a political tragedy and I would fear for the republic,” Weld said during an appearance on CNN."
        },
        {
            "id": 2,
            "text": "“I would be ashamed of myself if I didn’t raise my hand and run.”"
        },
        {
            "id": 3,
            "text": "The only incumbent presidents who have lost reelection in the past 50 years have been those who faced credible opposition from their own parties: Gerald Ford in 1976, Jimmy Carter in 1980 and Bush in 1992."
        },
        {
            "id": 4,
            "text": "None of their challengers ― Ronald Reagan, Ted Kennedy or Buchanan ― wound up taking the nomination, but in each instance, the challenge itself weakened the incumbent enough so that he lost the November election."
        },
        {
            "id": 5,
            "text": "“The existence of a credible challenger itself has been deadly,” said Fergus Cullen, a former New Hampshire GOP chairman who opposes Trump’s reelection."
        },
        {
            "id": 6,
            "text": "“Is there a market for an alternative?"
        },
        {
            "id": 7,
            "text": "The answer is clearly yes."
        },
        {
            "id": 8,
            "text": "But how big is that market?"
        },
        {
            "id": 9,
            "text": "Is it 10%?"
        },
        {
            "id": 10,
            "text": "Is it 20%?"
        },
        {
            "id": 11,
            "text": "Is it 3%, which is what Buchanan got?”"
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": "Cullen said he doesn’t know how well Weld can do ― or, for that matter, how well Maryland Gov. Larry Hogan (R) or former Ohio Gov. John Kasich (R) might do ― although he said most voters who support a challenger aren’t really doing it to support that challenger."
        },
        {
            "id": 14,
            "text": "“It wasn’t really about Buchanan; it wasn’t really about Ted Kennedy or Ronald Reagan."
        },
        {
            "id": 15,
            "text": "It was about the incumbent,” Cullen said."
        },
        {
            "id": 16,
            "text": "Neither Hogan nor Kasich has announced a firm intention to run or even opened an exploratory committee, as Weld did in February."
        },
        {
            "id": 17,
            "text": "Hogan is scheduled to speak on April 23 at the “Politics and Eggs” breakfast, a Saint Anselm College institution where presidential campaigns are frequently launched."
        },
        {
            "id": 18,
            "text": "Kasich is expected to decide on a challenge later in the year."
        },
        {
            "id": 19,
            "text": "Any Republican opponent to Trump, though, is not running merely against Trump but against the entire Republican National Committee, which at its last meeting passed a resolution supporting ― but not explicitly endorsing ― Trump."
        },
        {
            "id": 20,
            "text": "Trump is already raising money in conjunction with the RNC ― pulling in a total of $30.3 million in the first three months of 2019, according to the campaign’s filing with the Federal Election Commission on Monday evening."
        },
        {
            "id": 21,
            "text": "That represents a markedly increased pace from the $67.6 million it raised in 2017 and 2018 combined."
        },
        {
            "id": 22,
            "text": "A number of RNC officials, meanwhile, are trying to ensure that Trump has a smooth road to renomination."
        },
        {
            "id": 23,
            "text": "Chairwoman Ronna McDaniel is currently traveling the Pacific to meet with Republican delegates in U.S. territories that have voting RNC delegations."
        },
        {
            "id": 24,
            "text": "An RNC rule allows the names of candidates who secure the support of at least five delegations to be placed for nomination at the 2020 convention."
        },
        {
            "id": 25,
            "text": "In addition to the 50 states, the District of Columbia and Puerto Rico, RNC delegations come from Guam, American Samoa, the Northern Marianna Islands and the U.S. Virgin Islands ― places whose small size can make them ripe for strategic campaigning."
        },
        {
            "id": 26,
            "text": "On her way back home, McDaniel is scheduled to stop in Hawaii for a Wednesday fundraiser with the Hawaii Republican Party."
        },
        {
            "id": 27,
            "text": "“The fix is in,” said Rick Tyler, a GOP consultant who worked for Texas Sen. Ted Cruz’s presidential primary campaign in 2016."
        },
        {
            "id": 28,
            "text": "“It’s a rigged game."
        },
        {
            "id": 29,
            "text": "The whole RNC is a rigged game."
        },
        {
            "id": 30,
            "text": "There is no distinction between the Trump campaign and the RNC.”"
        },
        {
            "id": 31,
            "text": "Tyler, though, said that Trump and his hand-picked chairwoman are doing exactly what you’d expect an incumbent president to do."
        },
        {
            "id": 32,
            "text": "“The sooner he can get his delegates locked up, and there’s no possibility of a successful challenge, the sooner he can focus on the Democrats."
        },
        {
            "id": 33,
            "text": "It would be malpractice not to,” Tyler said of McDaniel’s trip."
        },
        {
            "id": 34,
            "text": "“It’s basic blocking and tackling.”"
        },
        {
            "id": 35,
            "text": "For its part, the RNC denied that McDaniel’s trip had anything to do with preventing opposition to Trump."
        },
        {
            "id": 36,
            "text": "“The notion that the chairwoman would fly 20,000 miles to fend off a non-existent primary challenger to a president with 95% support among Republicans is silly,” said RNC press secretary Blair Ellis."
        },
        {
            "id": 37,
            "text": "“Trips like these help boost fundraising for local Republican parties, and ensure that Republicans in territories know their voice is heard.”"
        },
        {
            "id": 38,
            "text": "While Trump does have high support nationally among Republicans, polls in the early primary states shows that a significant number of Republicans would welcome a challenger."
        },
        {
            "id": 39,
            "text": "A recent New Hampshire poll, in fact, found that 51% of Republicans wanted a contested primary."
        },
        {
            "id": 40,
            "text": "It is those voters Weld is hoping to persuade, with the idea that if he can win the New Hampshire primary, or even finish unexpectedly strongly, that will fuel support in subsequent states by showing that Trump is vulnerable."
        },
        {
            "id": 41,
            "text": "Something akin to that occurred in 1992, when conservative commentator Buchanan mounted a last-minute challenge to Bush in New Hampshire."
        },
        {
            "id": 42,
            "text": "He lost by some 15 points, but did finish with 37% of the vote, shocking Bush and the party."
        },
        {
            "id": 43,
            "text": "Bush went on to win the nomination handily, but his perceived weakness in that early primary encouraged billionaire Ross Perot to enter the race as an independent, which in the end helped put Democrat Bill Clinton in the White House."
        },
        {
            "id": 44,
            "text": "Weld, who is 73, began his career out of law school with the House Judiciary Committee investigating Watergate."
        },
        {
            "id": 45,
            "text": "Seven years later, at age 36, he was appointed the U.S. attorney for Massachusetts by President Reagan."
        },
        {
            "id": 46,
            "text": "Five years after that, Weld moved to Washington to take charge of the Justice Department’s entire criminal division."
        },
        {
            "id": 47,
            "text": "In 1990, back in Boston, he ran an unlikely race for governor in a solidly Democratic state and won ― becoming the first Republican chief executive there in 16 years."
        },
        {
            "id": 48,
            "text": "Four years later, he won reelection with 71% of the vote."
        },
        {
            "id": 49,
            "text": ""
        },
        {
            "id": 50,
            "text": "In 1996, he took on Democratic Sen. John Kerry, but he came up 6 percentage points short in the Senate race."
        },
        {
            "id": 51,
            "text": "The following year, Clinton nominated Weld to be U.S. ambassador to Mexico and he resigned the governorship."
        },
        {
            "id": 52,
            "text": "But the chairman of the Senate Foreign Relations Committee, then-Sen. Jesse Helms (R-N.C.), would not let the nomination through."
        },
        {
            "id": 53,
            "text": "Weld remained out of politics for nearly 20 years, until he joined former New Mexico Gov. Gary Johnson’s presidential ticket in 2016 as a Libertarian."
        },
        {
            "id": 54,
            "text": "CORRECTION:"
        },
        {
            "id": 55,
            "text": "An earlier version of this article said that Trump raised $30.3 million in the first three months of 2020."
        },
        {
            "id": 56,
            "text": "It was the first three months of 2019."
        }
    ]
}