{
    "title": "Background checks brokered: Sens. Toomey and Manchin reach gun deal",
    "text": [
        {
            "id": 0,
            "text": "With a Senate gun-control showdown looming, Sens. Joe Manchin and Pat Toomey have reached a deal on background checks for firearm purchases, NBC News reported Wednesday morning."
        },
        {
            "id": 1,
            "text": "Mr. Manchin, West Virginia Democrat, and Mr. Toomey, Pennsylvania Republican, both have “A” ratings from the National Rifle Association, potentially giving the the deal the kind of political weight needed to achieve a bipartisan vote capable of overcoming a filibuster."
        },
        {
            "id": 2,
            "text": "The details of the package aren’t yet clear and will be announced later on Wednesday, according to NBC."
        },
        {
            "id": 3,
            "text": "The agreement comes as Senate Majority Leader Harry Reid sets a Senate vote on gun-control measures for Thursday."
        },
        {
            "id": 4,
            "text": "It will be first such vote in either chamber of Congress since the December massacre at Sandy Hook Elementary School in Newtown, Conn."
        },
        {
            "id": 5,
            "text": "While Mr. Toomey, a first-term senator and former Club For Growth president, has reached across the aisle on guns, other Republicans are plotting a different course."
        },
        {
            "id": 6,
            "text": "A number of senators, including Rand Paul, Ted Cruz and Marco Rubio, may filibuster any gun-control measures."
        },
        {
            "id": 7,
            "text": "Senate Minority Leader Mitch McConnell has also indicated he may be join the filibuster."
        },
        {
            "id": 8,
            "text": "Democrats and some Republicans oppose such a strategy."
        },
        {
            "id": 9,
            "text": "“I think it’s disgraceful for anyone to say we’re going to filibuster a gun bill,” Sen. Kirsten Gillibrand, New York Democrat, said during an appearance on MSNBC’s “Morning Joe” on Wednesday morning."
        },
        {
            "id": 10,
            "text": "At least nine Republican senators have signaled they’ll vote with Democrats to bring the bill to the floor, though it’s unclear whether all Democrats will support the package."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        }
    ]
}