{
    "title": "Sessions vows to battle bias following FBI texting controversy",
    "text": [
        {
            "id": 0,
            "text": "Attorney General Jeff Sessions Jefferson (Jeff) Beauregard SessionsOvernight Hillicon Valley — Apple issues security update against spyware vulnerability Stanford professors ask DOJ to stop looking for Chinese spies at universities in US Overnight Energy & Environment — Democrats detail clean electricity program MORE on Friday pledged to fight bias at the Justice Department as some Republicans raise concerns about political prejudice among the ranks of the FBI."
        },
        {
            "id": 1,
            "text": "In a speech to law enforcement officials in Norfolk, Va., Sessions said his mission was simply to enforce the law and vowed to root out political bias among federal law enforcement."
        },
        {
            "id": 2,
            "text": "\"It means absolutely eliminating political bias or favoritism — in either direction — from our investigations and prosecutions,\" Sessions said."
        },
        {
            "id": 3,
            "text": "\"That sort of thinking is the antithesis of what the department stands for, and I won’t tolerate it.\""
        },
        {
            "id": 4,
            "text": "ADVERTISEMENT"
        },
        {
            "id": 5,
            "text": "\""
        },
        {
            "id": 6,
            "text": "It means identifying mistakes of the past, and correcting them for the future."
        },
        {
            "id": 7,
            "text": "When we find problems, we’re addressing them head on, not sweeping them under the rug.\""
        },
        {
            "id": 8,
            "text": "Sessions's comments came amid allegations by some Republicans of pervasive bias at the FBI, a notion fueled by the release of text messages exchanged between two FBI officials, Peter Strzok and Lisa Page, expressing sentiments critical of President Trump Donald TrumpJan."
        },
        {
            "id": 9,
            "text": "6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE."
        },
        {
            "id": 10,
            "text": "Strzok was removed from special counsel Robert Mueller Robert (Bob)"
        },
        {
            "id": 11,
            "text": "MuellerSenate Democrats urge Garland not to fight court order to release Trump obstruction memo Why a special counsel is guaranteed if Biden chooses Yates, Cuomo or Jones as AG Barr taps attorney investigating Russia probe origins as special counsel MORE's investigation into Russian meddling in the 2016 election after the Justice Department became aware of the text messages, though scrutiny from GOP lawmakers about the text exchanges has continued to intensify."
        },
        {
            "id": 12,
            "text": "The texts, which Republicans have homed in on this week, come amid a broader focus on the part of GOP lawmakers and the Trump administration about the integrity of certain FBI officials."
        },
        {
            "id": 13,
            "text": "Republicans have been pushing for the release of a classified memo alleging FBI misconduct, setting up a likely clash between Trump and the Justice Department."
        }
    ]
}