{
    "title": "With Tanks and Flyovers, Trump Celebrates Military in July 4 Salute",
    "text": [
        {
            "id": 0,
            "text": "With U.S. fighter jets flying overhead, President Donald Trump praised the military and reveled in a show of pomp and patriotism on Thursday in a celebration of Independence Day that critics accused him of turning into a political event."
        },
        {
            "id": 1,
            "text": "Trump, a Republican who was inspired to stage the flashy affair after seeing a similar display in France, dismissed concerns ahead of the ceremony about the expense and militaristic overtones of the event outside the 97-year-old Lincoln Memorial, a symbol of national unity."
        },
        {
            "id": 2,
            "text": "\"Our nation is stronger today than it ever was before."
        },
        {
            "id": 3,
            "text": "It is its strongest now,\" Trump said from a platform in front of the famous memorial, echoing a theme he uses at campaign rallies."
        },
        {
            "id": 4,
            "text": "Flanked by Bradley fighting vehicles, Trump otherwise steered clear of divisive political rhetoric, in a departure from the majority of his speeches."
        },
        {
            "id": 5,
            "text": "At times, an enthusiastic crowd could be heard chanting: \"USA! USA! USA!\""
        },
        {
            "id": 6,
            "text": "Trump, 73, praised American military might despite having himself avoided the draft during the Vietnam War with bone spurs in his feet."
        },
        {
            "id": 7,
            "text": "With well-planned choreography, he told stories about each military branch before separate, dramatic flyovers of their respective military aircraft."
        },
        {
            "id": 8,
            "text": "\"We celebrate our history, our people, and the heroes who proudly defend our flag: the brave men and women of the United States military,\" Trump said."
        },
        {
            "id": 9,
            "text": "\"For over 65 years, no enemy Air Force has managed to kill a single American soldier."
        },
        {
            "id": 10,
            "text": "Because the skies belong to the United States of America.\""
        },
        {
            "id": 11,
            "text": "Not all the choreography appeared to go off as planned."
        },
        {
            "id": 12,
            "text": "A flyover by Air Force One, which Trump had teased earlier in the day on Twitter, occurred unannounced and without fanfare."
        },
        {
            "id": 13,
            "text": "But a low and spectacular flyover by six F-18s known as the \"Blue Angels\" at the conclusion of Trump's speech thrilled the crowd."
        },
        {
            "id": 14,
            "text": "Some people shouted \"Four More Years!\""
        },
        {
            "id": 15,
            "text": "in support of the president."
        },
        {
            "id": 16,
            "text": "Trump paid tribute to the U.S. Border Patrol and U.S. Immigration and Customs Enforcement, two agencies that have played leading roles in carrying out his tough immigration policies."
        },
        {
            "id": 17,
            "text": "He cited as great Americans both Harriet Tubman and Frederick Douglass, African-Americans who campaigned for the abolition of slavery more than 100 years ago."
        },
        {
            "id": 18,
            "text": "MILLIONS OF DOLLARS, WORRIES ABOUT CROWDS"
        },
        {
            "id": 19,
            "text": "Earlier in the day thousands of supporters wearing Trump's signature \"Make America Great Again\" hats"
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ", along with opponents questioning the cost of the event, poured into the U.S. capital despite scorching temperatures and intermittent rain, while a diapered \"Baby Trump\" balloon sat next to a banner calling Trump a traitor."
        },
        {
            "id": 22,
            "text": "Protesters burned a U.S. flag in front of the White House."
        },
        {
            "id": 23,
            "text": "Ahead of the speech, Democrats accused the president of staging an out-of-place campaign rally, aware he has a history of veering off script with sharp partisan attacks even at events that are not meant to be overtly political."
        },
        {
            "id": 24,
            "text": "Trump supporters and opponents carried American flags and wore red, white and blue outfits."
        },
        {
            "id": 25,
            "text": "\"I think what Trump's doing with the tanks, all the flyovers, I think it's great,\" said Brandon Lawrence, his face painted with the colors of the American flag."
        },
        {
            "id": 26,
            "text": "Some at the White House had worried about the crowd size, according to an administration official."
        },
        {
            "id": 27,
            "text": "In January 2017 Trump fumed about reports that the crowd at his inauguration ceremony in front of the Capitol was smaller than it was for President Barack Obama."
        },
        {
            "id": 28,
            "text": "Perhaps with the crowd size in mind, Trump sent out tweets urging people to attend and saying the event would be \"one of the biggest celebrations in the history of our Country."
        },
        {
            "id": 29,
            "text": "\" As it happened, the crowd lined both sides of the reflecting pool in front of the memorial, and Trump later called it a \"great crowd,\" tweeting: \"A great crowd of tremendous Patriots this evening, all the way back to the Washington Monument!"
        },
        {
            "id": 30,
            "text": "Opponents were not impressed."
        },
        {
            "id": 31,
            "text": ""
        },
        {
            "id": 32,
            "text": "\"This is costing us millions and millions of dollars."
        },
        {
            "id": 33,
            "text": "We the taxpayers are paying for it, for Donald Trump to use our military as a prop."
        },
        {
            "id": 34,
            "text": "And that's just not right,\" said Medea Benjamin, co-founder of the women-led peace group Code Pink, before the event."
        },
        {
            "id": 35,
            "text": "Republican political groups were given prime tickets for Trump's speech, and the Washington Post reported that the U.S. National Park Service diverted $2.5 million in park entrance fees to help pay for the event."
        },
        {
            "id": 36,
            "text": "Democratic presidential candidate Senator Bernie Sanders weighed in with criticism: \"This is what authoritarians do: @realDonaldTrump is taking $2.5 million away from our National Park Service to glorify himself with a spectacle of military tanks rolling through Washington,\" he wrote in a tweet."
        },
        {
            "id": 37,
            "text": "Former Vice President Joe Biden, leading in opinion polls in the race for the 2020 Democratic presidential nomination, said in Iowa: \"Donald Trump, I believe, is incapable of celebrating what makes America great, because I don't think he gets it.\""
        },
        {
            "id": 38,
            "text": "Trump played down the expense."
        },
        {
            "id": 39,
            "text": "\"The cost of our great Salute to America tomorrow will be very little compared to what it is worth."
        },
        {
            "id": 40,
            "text": "We own the planes, we have the pilots, the airport is right next door (Andrews), all we need is the fuel,\" he posted on Twitter on Wednesday."
        },
        {
            "id": 41,
            "text": "\"We own the tanks and all."
        },
        {
            "id": 42,
            "text": "Fireworks are donated by two of the greats."
        },
        {
            "id": 43,
            "text": "Nice!\""
        },
        {
            "id": 44,
            "text": "Andrews is the name of a nearby military base."
        },
        {
            "id": 45,
            "text": "The July 4th holiday celebrates the U.S. founders' declaring independence from Britain in 1776."
        }
    ]
}