{
    "title": "John Boehner, Mitch McConnell Offer Opposing Sequester Messages",
    "text": [
        {
            "id": 0,
            "text": "House Speaker John Boehner and Senate Minority Leader Mitch McConnell offered different views of the sequester cuts that took effect late Friday night after lawmakers failed to reach a deal to avoid them."
        },
        {
            "id": 1,
            "text": "On NBC's Meet The Press, Boehner criticized the cuts, calling them \"silly\" and \"random.\""
        },
        {
            "id": 2,
            "text": "\"I am concerned about its impact on our economy and its impact on our military."
        },
        {
            "id": 3,
            "text": "Listen, we've known about his problem for 16 months."
        },
        {
            "id": 4,
            "text": "We've known the sequester was coming,\" he said."
        },
        {
            "id": 5,
            "text": "\"I’ve watched leaders from both parties kick this can down the road."
        },
        {
            "id": 6,
            "text": "We’re out of road to kick the can down.\""
        },
        {
            "id": 7,
            "text": "Boehner said he believed cuts were needed, but that \"there are smarter ways to cut spending than this silly sequester that the president demanded... we need to address the long-term spending problem."
        },
        {
            "id": 8,
            "text": "But we can't cut our way to prosperity.”"
        },
        {
            "id": 9,
            "text": "When asked how the cuts would affect economic growth, Boehner said, \"I don't know whether it's going to hurt the economy or not."
        },
        {
            "id": 10,
            "text": "I don't think anyone quite understands how the sequester is really going to work.”"
        },
        {
            "id": 11,
            "text": "The House Speaker insisted he did everything he could to avoid the cuts and blamed the president and the Democrats for not reaching a deal."
        },
        {
            "id": 12,
            "text": "\"There's no one in this town who's tried harder to come to an agreement with the president and deal with this long-term spending problem,\" he said."
        },
        {
            "id": 13,
            "text": "McConnell struck a different tone on CNN's State Of The Union, calling Friday's cuts “modest.\""
        },
        {
            "id": 14,
            "text": "\"We have a $16 trillion national debt,” he said."
        },
        {
            "id": 15,
            "text": "“Our debt is as big as our economy."
        },
        {
            "id": 16,
            "text": "That alone makes us look like a Western European country..."
        },
        {
            "id": 17,
            "text": "I think the American people know we have a spending addiction in Washington.\""
        },
        {
            "id": 18,
            "text": "McConnell said that Senate Republicans are open to discussing how to rework the cuts, but put his foot down on raising taxes."
        },
        {
            "id": 19,
            "text": "The first of the automatic spending cuts took effect on Friday after months of unproductive negotiations between the White House and Republicans."
        },
        {
            "id": 20,
            "text": "The cuts, totaling $1.2 trillion, were designed during the 2011 debt ceiling crisis in hopes that it would force Congress to reach a deal to balance the budget."
        },
        {
            "id": 21,
            "text": "A Congressional Budget Office official said that the cuts could cost 750,000 jobs."
        },
        {
            "id": 22,
            "text": "Last month, Boehner called the cuts \"ugly and dangerous.\""
        }
    ]
}