{
    "title": "Trump defends describing self as 'nationalist,' says it's about American pride, prosperity",
    "text": [
        {
            "id": 0,
            "text": "President Trump said Tuesday he’s a proud “nationalist” for American superiority and rejected a reporter’s suggestion that the word is a sneaky signal to white supremacists."
        },
        {
            "id": 1,
            "text": "“I’m somebody that loves our country, when I say I’m a nationalist,” Mr. Trump said at his desk in the Oval Office."
        },
        {
            "id": 2,
            "text": "“I’m proud of our country.”"
        },
        {
            "id": 3,
            "text": "The president first embraced the term at a huge campaign rally Monday night in Houston, where the crowd roared its approval."
        },
        {
            "id": 4,
            "text": "After the rally, CNN host Don Lemon commented on the president’s use of the term: “It is a favorite of the ‘alt-right’ and is loaded with nativist and racial undertones.”"
        },
        {
            "id": 5,
            "text": "When Mr. Trump met with reporters at the White House on Tuesday, CNN reporter Jim Acosta confronted the president about his use of the word."
        },
        {
            "id": 6,
            "text": "“There is a concern that you are sending coded language, or a dog whistle to some Americans out there, that what you really mean is you’re a white nationalist,” Mr. Acosta said."
        },
        {
            "id": 7,
            "text": "“I’ve never even heard that."
        },
        {
            "id": 8,
            "text": "I cannot imagine that,” Mr. Trump replied."
        },
        {
            "id": 9,
            "text": "Asked by Mr. Acosta if he had never heard of white nationalists, the president corrected the reporter."
        },
        {
            "id": 10,
            "text": "“I’ve never heard that theory about being a nationalist,” he said."
        },
        {
            "id": 11,
            "text": "“I’ve heard them all."
        },
        {
            "id": 12,
            "text": "And I am a nationalist."
        },
        {
            "id": 13,
            "text": "It’s a word that hasn’t been used too much."
        },
        {
            "id": 14,
            "text": "I think it should be brought back."
        },
        {
            "id": 15,
            "text": "“I don’t like it when Germany’s paying 1 percent of [gross domestic product] to NATO, and we’re paying 4.3 percent."
        },
        {
            "id": 16,
            "text": "That’s not fair."
        },
        {
            "id": 17,
            "text": "I don’t like it, as an example, when we’re protecting Europe, and we’re paying for almost the entire cost of NATO."
        },
        {
            "id": 18,
            "text": "We have great respect for those countries."
        },
        {
            "id": 19,
            "text": "But on top of that, I don’t like it when they put up barriers to our farmers, where our farmers cannot sell into Europe.”"
        },
        {
            "id": 20,
            "text": "The president is hitting the European Union with tariffs on imported goods, seeking leverage to make a more favorable trade agreement for U.S. producers."
        },
        {
            "id": 21,
            "text": "“I am very proud of our country,” Mr. Trump said."
        },
        {
            "id": 22,
            "text": "“We cannot continue to allow ourselves to be duped on military and also duped on trade."
        },
        {
            "id": 23,
            "text": "All I want for our country is to be treated well, to be treated with respect."
        },
        {
            "id": 24,
            "text": "In that sense, I am absolutely a nationalist and I’m proud of it.”"
        },
        {
            "id": 25,
            "text": "Earlier, in a White House meeting with county officials from California, Alaska and Hawaii, Mr. Trump talked about his renegotiated trade deal with Mexico and Canada to replace the North American Free Trade Agreement."
        },
        {
            "id": 26,
            "text": "He again raised the concept of “nationalism” in terms of the U.S. getting a fair deal, saying of the Clinton-era NAFTA, “We still have empty factories all over the place from that devastation.”"
        },
        {
            "id": 27,
            "text": "“You’re not going to have companies leaving anymore,” he said of the new trade agreement."
        },
        {
            "id": 28,
            "text": "“They have a disincentive to leave."
        },
        {
            "id": 29,
            "text": "I don’t want them to leave.”"
        },
        {
            "id": 30,
            "text": "“Call me a nationalist if you’d like, but I don’t want companies leaving, I don’t want them firing all their people, going to another country, making a product, sending it into our country tax-free, no charge, no tariff, no nothing."
        },
        {
            "id": 31,
            "text": "And in the meantime, we end up with empty plants, unemployment all over the place."
        },
        {
            "id": 32,
            "text": "We end up with nothing."
        },
        {
            "id": 33,
            "text": "So those deals are not happening anymore.”"
        },
        {
            "id": 34,
            "text": "Sign up for Daily Newsletters Manage Newsletters"
        },
        {
            "id": 35,
            "text": "Copyright © 2021"
        },
        {
            "id": 36,
            "text": "The Washington Times, LLC."
        },
        {
            "id": 37,
            "text": "Click here for reprint permission."
        }
    ]
}