{
    "title": "Justice Dept.: U.S. report finds racial bias in Ferguson police",
    "text": [
        {
            "id": 0,
            "text": "The Justice Department will conclude that there is a “pattern of police bias and excessive force” at the Ferguson, Missouri, police department, but is unlikely to directly charge former Officer Darren Wilson in the death of teenager Michael Brown, reported news agencies who were briefed on the report Tuesday."
        },
        {
            "id": 1,
            "text": "The full report is expected to be released this week, possibly as soon as Wednesday."
        },
        {
            "id": 2,
            "text": "The DOJ has been investigating Ferguson law enforcement agencies following the August death of Mr. Brown during an altercation with Officer Wilson."
        },
        {
            "id": 3,
            "text": "After a grand jury decided not to press charges against Mr. Wilson, many civil rights advocates had turned their hopes to the DOJ’s investigation instead."
        },
        {
            "id": 4,
            "text": "The Justice Department appeared to brief reporters from the Washington Post, New York Times, Associated Press and CNN on Tuesday before the report is officially released."
        },
        {
            "id": 5,
            "text": "According to a law enforcement official who spoke on a condition of anonymity, the DOJ’s report will say that Ferguson police have disproportionately used force against black citizens and violated their constitutional rights."
        },
        {
            "id": 6,
            "text": "Those violations include making arrests without a probably cause; charging black citizens with petty crimes, usually in an attempt to generate revenue from fines; and pulling over black citizens for traffic stops without suspicion of wrongdoing."
        },
        {
            "id": 7,
            "text": "DOJ investigators conducted hundreds of interviews and reviewed more than 35,000 pages of documents and Ferguson police department records."
        },
        {
            "id": 8,
            "text": "The Washington Post reported that while blacks make up 67 percent of Ferguson’s population, they have been disproportionately targeted by the police, accounting for 93 percent of all arrests between 2012 and 2014, as well as 90 percent of all citations issued and 85 percent of all people stopped by police."
        },
        {
            "id": 9,
            "text": "The review by federal officials also seems to have uncovered disparaging comments officers made about President Barack Obama."
        },
        {
            "id": 10,
            "text": "A November 2008 e-mail questioned whether Mr. Obama could be president because “what black man holds a steady job for four years.”"
        },
        {
            "id": 11,
            "text": "Attorney General Eric Holder had promised last week that the results of the DOJ’s investigation would be released before he stepped down."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        }
    ]
}