{
    "title": "Can Gary Johnson, the Libertarian Nominee, Swing the Election?",
    "text": [
        {
            "id": 0,
            "text": "In Gary Johnson’s first run for the presidency in 2012, as the Libertarian Party candidate, he won just under 1 percent of the popular vote."
        },
        {
            "id": 1,
            "text": "He did not surpass 3 percent in any state."
        },
        {
            "id": 2,
            "text": "That’s not exactly a strong showing."
        },
        {
            "id": 3,
            "text": "But 2016 could prove more favorable because of the unpopularity of both major party candidates, Hillary Clinton and Donald Trump."
        },
        {
            "id": 4,
            "text": "Mr. Johnson is at roughly 10 percent in recent polls, well above where he was in 2012."
        },
        {
            "id": 5,
            "text": "The question, of course, is whether it will have any impact."
        },
        {
            "id": 6,
            "text": "Is This a Lot?"
        },
        {
            "id": 7,
            "text": "American presidential elections are not set up to favor third parties."
        },
        {
            "id": 8,
            "text": "The first-past-the-post voting methods, in which the winner of the state gets all its electoral votes, make it hard for third parties to get a foothold."
        },
        {
            "id": 9,
            "text": "(In political science, this is a concept known as Duverger’s Law.)"
        },
        {
            "id": 10,
            "text": "Historically, winning 10 percent is an achievement."
        },
        {
            "id": 11,
            "text": "Since George Wallace won 13.5 percent in 1968, only Ross Perot in 1992 earned more than 10 percent of the vote nationwide."
        },
        {
            "id": 12,
            "text": "But it’s worth noting that Mr. Perot, while getting 19 percent, did not get a plurality of votes in any state, so he was awarded no electoral votes."
        },
        {
            "id": 13,
            "text": "Will It Last?"
        },
        {
            "id": 14,
            "text": "Third-party candidacies have a history of fading."
        },
        {
            "id": 15,
            "text": "Since 1968, all of the major third-party candidates have seen their polling averages decline closer to the election."
        },
        {
            "id": 16,
            "text": "The problem is that voting for a third party is often viewed as a wasted vote, which more people accept as Election Day draws near."
        },
        {
            "id": 17,
            "text": "The one exception is, again, Mr. Perot’s 1992 campaign."
        },
        {
            "id": 18,
            "text": "His support began to erode early in the summer and continued to shrink after he left the race abruptly in mid-July."
        },
        {
            "id": 19,
            "text": "But after he rebooted his campaign on Oct. 1, with only a little more than four weeks until Election Day, his polling average doubled."
        },
        {
            "id": 20,
            "text": "Often, the timing of the major party conventions can affect the standing of third-party candidates in the polls."
        },
        {
            "id": 21,
            "text": "The party convention typically serves to consolidate the disaffected portions of the party (such as die-hard supporters of Bernie Sanders or Ted Cruz)."
        },
        {
            "id": 22,
            "text": "In turn, support for third-party candidates declines."
        },
        {
            "id": 23,
            "text": "But this isn’t always the case."
        },
        {
            "id": 24,
            "text": "While John Anderson’s polling support was cut in half between the end of the 1980 major party conventions and Election Day, Ralph Nader’s polling average actually increased slightly(from 3.9 to 4.4 percent) between the 2000 conventions and Election Day, although he wound up with 2.7 percent of the vote."
        },
        {
            "id": 25,
            "text": "The Upshot’s presidential forecast, updated daily."
        },
        {
            "id": 26,
            "text": "Does It Matter?"
        },
        {
            "id": 27,
            "text": "Whether Mr. Johnson’s candidacy could damage the Trump or Clinton campaign more remains unclear."
        },
        {
            "id": 28,
            "text": "Polls show no significant difference in the Clinton-Trump margin between those that include Mr. Johnson and those that don’t."
        },
        {
            "id": 29,
            "text": "His message — fiscal conservatism, liberal social policies and military isolationism — could appeal to people in either party, and there are enough disaffected voters in either party to provide a solid base of support."
        },
        {
            "id": 30,
            "text": "Mr. Johnson’s strongest polling so far has come from the West — his home state, New Mexico; Colorado; and Utah, a solid Republican state whose Mormon population has proved to be especially unreceptive to Mr. Trump."
        },
        {
            "id": 31,
            "text": "For any third-party presidential campaign, there are two big hurdles."
        },
        {
            "id": 32,
            "text": "Mr. Johnson has already passed the first one: getting on the ballot in every state."
        },
        {
            "id": 33,
            "text": "The second — getting into the debates — could prove far more challenging."
        },
        {
            "id": 34,
            "text": "The eligibility requirements, set by the nonpartisan Commission on Presidential Debates, state that a candidate has to hit 15 percent in five national surveys a few weeks before the debate to earn a place on the stage."
        },
        {
            "id": 35,
            "text": "That threshold can make or break a candidacy."
        },
        {
            "id": 36,
            "text": "No third-party candidate has been invited to the presidential debates since Mr. Perot in 1992."
        },
        {
            "id": 37,
            "text": "Jill Stein, the Green Party’s presumptive nominee, is on the ballot in roughly half the states, with plans to be on many more; she is polling in the low-single digits and is a long shot to make the debates."
        },
        {
            "id": 38,
            "text": "The first debate is scheduled for Sept. 26."
        },
        {
            "id": 39,
            "text": "If Mr. Johnson can increase his standing in the polls by five points in the next six weeks or so, he could have a major impact on the race."
        },
        {
            "id": 40,
            "text": "Even if he can’t, there is always the potential for a third party to swing a close election in one candidate’s favor."
        }
    ]
}