{
    "title": "DOJ's top election crimes prosecutor quits in protest after Barr tells federal attorneys to probe unsupported allegations of voting irregularities",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The Justice Department's top election crimes prosecutor resigned Monday in protest after Attorney General William Barr told federal prosecutors that they should examine allegations of voting irregularities before states move to certify results in the coming weeks."
        },
        {
            "id": 2,
            "text": "Richard Pilger, director of the elections crimes branch in the Justice Department's Public Integrity Section, told colleagues in an email that the attorney general was issuing \"an important new policy abrogating the forty-year-old Non-Interference Policy for ballot fraud investigations in the period prior to elections becoming certified and uncontested.\""
        },
        {
            "id": 3,
            "text": "Pilger also forwarded the memo to colleagues in his resignation letter."
        },
        {
            "id": 4,
            "text": "Pilger will remain a prosecutor in the Justice unit that investigates public corruption."
        },
        {
            "id": 5,
            "text": "Barr's densely worded memo had told prosecutors they could take investigative steps such as interviewing witnesses during a period that they would normally need permission from the elections crimes section."
        },
        {
            "id": 6,
            "text": "It's not clear what practical effect the policy would have in an election in which President Donald Trump trails President-elect Joe Biden by tens of thousands of votes in several key states."
        },
        {
            "id": 7,
            "text": "Barr didn't provide any indication that the Justice Department has come up with evidence to support Trump's claim of massive fraud in last week's election."
        },
        {
            "id": 8,
            "text": ""
        }
    ]
}