{
    "title": "Federal judge rules Pennsylvania's coronavirus orders are unconstitutional",
    "text": [
        {
            "id": 0,
            "text": "A federal judge ruled on Monday that Pennsylvania Gov. Tom Wolf Tom WolfWhere election review efforts stand across the US Pennsylvania AG sues to block GOP subpoenas in election probe Pennsylvania GOP authorizes subpoenas in election probe MORE’s (D) coronavirus orders, which shut down the state, closed businesses and limited gatherings, were unconstitutional."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "U.S. District Judge William Stickman IV, a Trump appointee, said in his opinion that COVID-19 orders from Wolf and Pennsylvania Secretary of Health Rachel Levine violated and continue to violate the First Amendment right to freedom of assembly and the due process and equal protection clauses of the 14th Amendment."
        },
        {
            "id": 3,
            "text": "The efforts to stop the spread of the coronavirus “were undertaken with the good intention of addressing a public health emergency,” Stickman wrote."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "“But even in an emergency, the authority of government is not unfettered,” he added."
        },
        {
            "id": 6,
            "text": "“There is no question that this Country has faced, and will face, emergencies of every sort,” he wrote."
        },
        {
            "id": 7,
            "text": "“But the solution to a national crisis can never be permitted to supersede the commitment to individual liberty that stands as the foundation of the American experiment.”"
        },
        {
            "id": 8,
            "text": "Four Pennsylvania counties — Butler, Fayette, Greene and Washington — along with Rep. Mike Kelly George (Mike) Joseph KellyHouse Ethics panel reviewing Rep. Malinowski's stock trades Lobbying world Lobbying world MORE (R-Pa.), three state representatives, and seven businesses and their owners challenged the state government’s coronavirus orders."
        },
        {
            "id": 9,
            "text": "Their lawsuit was filed in May, when these counties were in the “red” phase that required residents to stay at home."
        },
        {
            "id": 10,
            "text": "Lyndsay Kensinger, a spokesperson for the governor's office, said the administration was \"disappointed\" by the ruling and will file an appeal."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": "\"The actions taken by the administration were mirrored by governors across the country and saved, and continue to save lives in the absence of federal action,\" she said in a statement."
        },
        {
            "id": 13,
            "text": "\"This decision is especially worrying as Pennsylvania and the rest of the country are likely to face a challenging time with the possible resurgence of COVID-19 and the flu in the fall and winter.\""
        },
        {
            "id": 14,
            "text": "Kensinger clarified that the ruling related to the business closure order, the stay at home orders and indoor and outdoor gathering limitations, not the other orders such as the mandatory mask order."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "Previous rulings have rejected several challenges to Wolf’s coronavirus orders."
        },
        {
            "id": 17,
            "text": "In July, the Pennsylvania Supreme Court ruled the state legislature could not end the coronavirus shutdown."
        },
        {
            "id": 18,
            "text": "Other governors across the country took similar steps early in the coronavirus pandemic, with most states implementing stay-at-home orders and shutting down businesses."
        },
        {
            "id": 19,
            "text": "Pennsylvania has since lifted most of the coronavirus restrictions but still limits indoor gatherings to 25 people, outdoor gatherings to 250 people and indoor dining to 25 percent occupancy."
        },
        {
            "id": 20,
            "text": "The indoor dining capacity is expected to rise to 50 percent on Sept. 21, according to CBS Pittsburgh."
        },
        {
            "id": 21,
            "text": "Pennsylvania has documented 140,842 confirmed COVID-19 cases and 7,869 deaths since the beginning of the pandemic."
        },
        {
            "id": 22,
            "text": "The New York Times categorizes Pennsylvania as a state where cases are “lower and staying low,” with a seven-day average of 676 new cases per day."
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}