{
    "title": "Libertarian Candidates Pitch Themselves As Antidote To Partisanship",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "Libertarian Party candidates Gary Johnson and Bill Weld pitched themselves as the antidote to Washington partisanship in a CNN town hall, hoping to appeal to voters frustrated with both the Republican and the Democratic presidential nominees."
        },
        {
            "id": 2,
            "text": "Both are former Republican governors — Johnson from New Mexico and Weld from Massachusetts — and told CNN's Anderson Cooper they align with most voters on both fiscal and social issues."
        },
        {
            "id": 3,
            "text": "\"We want the government out of your pocketbook and out of your bedroom, and the polling shows that a majority of Americans think that,\" said Weld, the party's vice presidential nominee."
        },
        {
            "id": 4,
            "text": "Johnson, who ran for the GOP nomination in 2012 before becoming the Libertarian nominee four years ago, said if they are elected, the two longtime lawmakers will almost act as co-presidents — sharing a staff and \"planning to do this as a partnership.\""
        },
        {
            "id": 5,
            "text": "\"Two heads for the price of one, and that it would be a plus for the country, believing that,\" the former New Mexico governor said."
        },
        {
            "id": 6,
            "text": "\"I think it would be refreshing to have a party that was not terribly partisan holding the White House, and we would hire the best people from the Democratic Party, the smartest people from the Republican Party and the best people from the Libertarian Party,\" Weld added."
        },
        {
            "id": 7,
            "text": "The two bemoaned the rules that, as of now, would keep them off the presidential debate stage come this fall."
        },
        {
            "id": 8,
            "text": "A third-party candidate must hit at least 15 percent in polling, and the Libertarian ticket is at 9 percent in the latest CNN/ORC poll."
        },
        {
            "id": 9,
            "text": "The Green Party's Jill Stein is at 5 percent in that same survey."
        },
        {
            "id": 10,
            "text": "A third-party candidate hasn't made it onto the stage since independent Ross Perot in 1992, but with both Republican nominee Donald Trump and Democratic nominee Hillary Clinton still struggling to unite their parties' bases while being dragged down by high disapproval ratings, there is a rare opening."
        },
        {
            "id": 11,
            "text": "And Johnson and Weld are aiming to fill that void."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": "\"The idea that we should not be at those debates expressing what is a majority point of view in the country can only be laid at the door of the two-party monopoly, the duopoly, that has a stranglehold on power in Washington,\" Weld said."
        },
        {
            "id": 14,
            "text": "\"That's the Rs and the Ds, who sometimes seem to exist mainly for the express purpose of killing each other.\""
        },
        {
            "id": 15,
            "text": "Johnson stood by his characterization that Clinton was \"beholden\" to special interests and slammed her high fees for speaking to Wall Street groups."
        },
        {
            "id": 16,
            "text": "He argued there is a conflict of interest between the former secretary of state and her family's Clinton Foundation that \"smacks of pay-to-play.\""
        },
        {
            "id": 17,
            "text": "But Weld had harsher words for Trump and the way the GOP candidate has reacted to criticism from the family of a Muslim-American soldier killed in Iraq."
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": "\"He's a showman."
        },
        {
            "id": 20,
            "text": "He's a pied piper."
        },
        {
            "id": 21,
            "text": "He's the music man,\" Weld said about the billionaire real estate magnate."
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": "\"More recently, it's gotten more serious, and the noun that comes to my mind is a screw loose.\""
        },
        {
            "id": 24,
            "text": "Johnson dismissed the idea that they would play spoiler this fall, though."
        },
        {
            "id": 25,
            "text": "\"A wasted vote is voting for somebody that you don't believe in, and if we're going to continue to vote for the lesser of two evils, that's still evil,\" he told a questioner."
        },
        {
            "id": 26,
            "text": "Johnson did depart from typical libertarian orthodoxy in one instance."
        },
        {
            "id": 27,
            "text": "Previously, he has said that \"religious freedom, as a category\" was \"a black hole,\" and he said he wouldn't back any state religious freedom laws, such as ones that would protect people like wedding photographers or bakers from having to provide services for a gay wedding."
        },
        {
            "id": 28,
            "text": "\"I fear that under the guise of religious liberty, the LGBT community is being discriminated against,\" Johnson said."
        },
        {
            "id": 29,
            "text": "\"There can be a balance between the two, but I don't want to support discrimination in any form whatsoever.\""
        },
        {
            "id": 30,
            "text": "Shetamia Taylor, a woman who was wounded in the Dallas police attack last month, asked Johnson about the Black Lives Matter movement."
        },
        {
            "id": 31,
            "text": "And the Libertarian nominee gave a rare acknowledgement that, as a white man, he had been slow to realize there was a problem between minorities and law enforcement."
        },
        {
            "id": 32,
            "text": "\"My head's been in the sand on this."
        },
        {
            "id": 33,
            "text": "I think we've all had our heads in the sand, and let's wake up,\" Johnson said."
        },
        {
            "id": 34,
            "text": "\"This discrimination does exist.\""
        },
        {
            "id": 35,
            "text": "On the subject of foreign policy, Johnson said the two weren't pushing for an isolationist approach, simply one that was more hesitant to enter into foreign skirmishes."
        },
        {
            "id": 36,
            "text": "\"We both reject the notion that libertarians are isolationists,\" Johnson said."
        },
        {
            "id": 37,
            "text": "\"We're not isolationists."
        },
        {
            "id": 38,
            "text": "We're non-interventionists."
        },
        {
            "id": 39,
            "text": "We don't want to get involved in regime change that has the potential to make the world less safe.\""
        }
    ]
}