{
    "title": "Obamacare signup delayed -- for 2015",
    "text": [
        {
            "id": 0,
            "text": "White House spokesman Jay Carney denied Friday that next year’s midterm elections are the reason behind the administration’s decision to postpone the 2014 opening date for 2015 enrollment in Obamacare – from October 15 to November 15."
        },
        {
            "id": 1,
            "text": "Pushing back the start date, Carney said, will give insurers more time to get an idea of their new pool of customers before they set their 2015 rates."
        },
        {
            "id": 2,
            "text": "Some critics, including Sen. Chuck Grassley, R-Iowa, said that the move was simply a political ploy and that any changes to health care plans, such as premium increases, for example, should be public before the election."
        },
        {
            "id": 3,
            "text": "But Carney said the administration expects more people to sign up for health care insurance at the end of the current, initial open enrollment period – which ends March 31, 2014 – in part because of the website problems, so starting the next enrollment window later in the year would buy insurers more time to assess the situation."
        },
        {
            "id": 4,
            "text": "“What was already going to be a back-loaded process is going to be more back-loaded, and that’s going to leave insurers a lot of data to sort through in a short period of time,” he said."
        },
        {
            "id": 5,
            "text": "The Department of Health and Human Services has also extended the sign-up period from roughly seven weeks to eight."
        },
        {
            "id": 6,
            "text": "The new deadline is January 15, 2015, Carney said."
        },
        {
            "id": 7,
            "text": "The two-month window is a lot shorter than the current six-month window for 2014 coverage, he said."
        },
        {
            "id": 8,
            "text": "Asked why the administration won’t change the more pressing March 31, 2014, deadline, as even some Senate Democrats have asked, Carney said the administration still believes the remaining four months is enough time to get people signed up for insurance."
        },
        {
            "id": 9,
            "text": "Young adults are less likely than their older counterparts to take out a health insurance policy, but even without that issue, enrollment in Obamacare has been minute overall, particularly via the federal sign-up website HealthCare.gov."
        },
        {
            "id": 10,
            "text": "Exact numbers are hard to pin down in the 36 states using the site."
        },
        {
            "id": 11,
            "text": "But as of November 2, just 26,794 people had enrolled in the HealthCare.gov states."
        },
        {
            "id": 12,
            "text": "’s current tally for this group stands at less than 45,000 enrollees, but that’s based on just a handful of states that have provided updates."
        },
        {
            "id": 13,
            "text": "In the 14 states running their own sign-up methods, the numbers look better but still dismal."
        },
        {
            "id": 14,
            "text": "At least 133,000 people had enrolled at last count."
        },
        {
            "id": 15,
            "text": "Many more have taken advantage of the expansion of Medicaid."
        },
        {
            "id": 16,
            "text": "Sticker shock"
        },
        {
            "id": 17,
            "text": "The Department of Health and Human Services hopes that the added time will encourage insurers to get coverage details right and make their plans more affordable, while consumers have more time to flush the devil out of the details."
        },
        {
            "id": 18,
            "text": "Some consumers were not only hit with high premiums during the rollout but also with deductibles above flood stage."
        },
        {
            "id": 19,
            "text": "People picking the bronze plan, which has the lowest premiums, will shell out about $5,000 before insurers foot the bills."
        },
        {
            "id": 20,
            "text": "Even then, policyholders will cover plenty out of pocket, like doctor visits, lab tests and medications."
        },
        {
            "id": 21,
            "text": "“All we ever heard about Obamacare is that it would lower our deductibles and premiums,” said Jennifer Slafter, 40 of Mabel, Minnesota."
        },
        {
            "id": 22,
            "text": "“That’s just not what’s happened.”"
        },
        {
            "id": 23,
            "text": "Slafter and her husband, Steve, are scrambling to find affordable care for themselves and their two children."
        },
        {
            "id": 24,
            "text": "The exchange’s BlueCross BlueShield plan was $1,087 a month with a $6,000 deductible, while a Medica plan was $877 a month with a $12,700 deductible."
        },
        {
            "id": 25,
            "text": "Both are steeper than their current plan."
        },
        {
            "id": 26,
            "text": "Battle ahead"
        },
        {
            "id": 27,
            "text": "As a side effect, the enrollment delay could also give everyone more time to contend with the political battle over Obamacare and whatever changes to the Affordable Care Act that might result."
        },
        {
            "id": 28,
            "text": "Republicans on Capitol Hill have distributed a digital playbook among their ranks to align talking points against Obamacare."
        },
        {
            "id": 29,
            "text": "The strategy memo is titled “Because of Obamacare …"
        },
        {
            "id": 30,
            "text": "I lost my insurance” and includes videos, fliers and social media posts."
        },
        {
            "id": 31,
            "text": "The American people are handing President Obama a beating over the many glitches in the rollout of the Affordable Care Act, with his approval ratings in polls bouncing down a staircase from one low point to the next."
        },
        {
            "id": 32,
            "text": "Obamacare is even less popular."
        }
    ]
}