{
    "title": "Republican Tax Bill in Final Sprint Across Finish Line",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — The day after suffering a political blow in the Alabama special Senate election, congressional Republicans sped forward with the most sweeping tax rewrite in decades, announcing an agreement on a final bill that would cut taxes for businesses and individuals and signal the party’s first major legislative achievement since assuming political control this year."
        },
        {
            "id": 1,
            "text": "Party leaders in the House and Senate agreed in principle to bridge the yawning gaps between their competing versions of the $1.5 trillion tax bill, keeping Republicans on track for final votes next week with the aim of delivering a bill to President Trump’s desk by Christmas."
        },
        {
            "id": 2,
            "text": "The House and Senate versions of the tax bill started from the same core principles — sharply cutting taxes on businesses, while reducing rates and eliminating some breaks for individuals — but diverged on several crucial details."
        },
        {
            "id": 3,
            "text": "In the end, more of the Senate bill appeared to be included in the final version, though lawmakers continued to make significant changes from the legislation that passed either the House or the Senate."
        },
        {
            "id": 4,
            "text": "The changes included a slightly higher corporate tax rate of 21 percent, rather than the 20 percent in the legislation that passed both chambers, and a lower top individual tax rate of 37 percent for the wealthiest Americans, who currently pay 39.6 percent."
        },
        {
            "id": 5,
            "text": "But the bill will still scale back some popular tax breaks, including the state and local tax deduction and the deductibility of mortgage interest."
        },
        {
            "id": 6,
            "text": "In a break from the House bill, the agreement would allow taxpayers to continue to deduct high out-of-pocket medical expenses, and it would retain a provision allowing graduate students who receive tuition waivers to avoid paying taxes on that benefit."
        },
        {
            "id": 7,
            "text": "Also included in the consensus bill is the Senate’s repeal of the Affordable Care Act requirement that most Americans have health insurance or pay a penalty and a provision that opens the Arctic National Wildlife Refuge in Alaska to energy exploration."
        },
        {
            "id": 8,
            "text": "Still unclear is the overall cost of the revised legislation, which cannot exceed the $1.5 trillion bucket that lawmakers have allowed if they want to pass the bill without Democratic support."
        },
        {
            "id": 9,
            "text": "Several of the provisions added by the Senate to help pay for the overall bill were either reversed or scaled back in the consensus version, and some tax breaks eliminated by the House were added back in."
        },
        {
            "id": 10,
            "text": "The announcement that Republicans had overcome their differences to get to a consensus bill added more momentum to the sprint to the finish line."
        },
        {
            "id": 11,
            "text": "Republicans dismissed requests by Democrats to delay a vote until the new senator from Alabama, Doug Jones, is sworn in."
        },
        {
            "id": 12,
            "text": "“I see no need to wait for Doug Jones to become a senator,” said Senator Susan Collins, Republican of Maine."
        },
        {
            "id": 13,
            "text": "“We vote all the time in lame-duck sessions with retired and defeated members casting votes.”"
        },
        {
            "id": 14,
            "text": "Senator John Cornyn of Texas, the majority whip, told reporters that he was confident the final bill would be approved next week."
        },
        {
            "id": 15,
            "text": "The leaders of the tax-writing committees in the House and the Senate, Representative Kevin Brady of Texas and Senator Orrin G. Hatch of Utah, each proclaimed a bill “close” to completion."
        },
        {
            "id": 16,
            "text": "In a compromise between the bills, the deal would cap the popular deduction for interest on mortgage debt at $750,000 for newly purchased homes, a higher cap than the $500,000 limit in the House-passed bill but lower than the $1 million limit that currently exists and remains in the Senate-passed bill."
        },
        {
            "id": 17,
            "text": "The agreement would cut the corporate tax rate to 21 percent, which is lower than the current 35 percent rate but higher than the 20 percent that Mr. Trump had, until recently, said was nonnegotiable."
        },
        {
            "id": 18,
            "text": "The corporate rate would take effect in 2018, rather than 2019, as the Senate bill originally called for, according to a senior Republican congressional aide."
        },
        {
            "id": 19,
            "text": "The bill also allows individuals to somewhat choose how to use their state and local tax deduction, giving them the ability to write off up to $10,000 in property taxes, income or sales taxes paid or a combination of property and sales or property and income taxes."
        },
        {
            "id": 20,
            "text": "That move is intended to alleviate the concerns of House Republicans, particularly those from California, over the bill’s treatment of the state and local tax deduction."
        },
        {
            "id": 21,
            "text": "Lawmakers also yielded to concerns by business groups about the Senate’s last-minute inclusion of the corporate alternative minimum tax, which was added as a way to pay for the bill but faced stiff blowback from companies that said it would restrict their ability to use the research and development tax credit."
        },
        {
            "id": 22,
            "text": "In an effort to assuage concerns that wealthy individuals would face a potential tax increase, the top individual income tax rate will drop to 37 percent, down from the current rate of 39.6 percent in the Senate bill and the 38.5 percent in the House bill."
        },
        {
            "id": 23,
            "text": "And the lower rate will apply to more people, allowing those with income levels below the $1 million cutoff outlined in both the House and Senate bills to claim the marginal rate."
        },
        {
            "id": 24,
            "text": "The consensus bill will preserve the individual alternative minimum tax, which the House bill had eliminated and the Senate bill retained in a watered-down form."
        },
        {
            "id": 25,
            "text": "But it will apply to even fewer taxpayers than the Senate bill would have, the congressional aide said."
        },
        {
            "id": 26,
            "text": "The alternative tax, which was put in place to ensure high-income earners did not exploit loopholes to avoid paying taxes, would kick in for individuals earning at least $500,000 and for couples earning at least $1 million."
        },
        {
            "id": 27,
            "text": "The agreement may allow some high-earning business owners to claim an even larger tax break than the Senate bill would have."
        },
        {
            "id": 28,
            "text": "Negotiators agreed to keep the Senate’s approach to provide a tax deduction for so-called pass-through companies, whose owners pay taxes on profits through the individual code."
        },
        {
            "id": 29,
            "text": "That deduction is likely to be lower than the 23 percent deduction in the Senate-passed bill."
        },
        {
            "id": 30,
            "text": "But, the aide said, the consensus bill will include a House provision that would allow some pass-through owners with few employees — but large amounts of investment in their businesses — to bypass a limit on how much income qualifies for the preferential deduction."
        },
        {
            "id": 31,
            "text": "The consensus bill would also largely retain the Senate approach to taxing multinational companies, by levying what is effectively a minimum tax on both American-based and foreign-based companies that operate in the United States."
        },
        {
            "id": 32,
            "text": "Mr. Trump praised House and Senate negotiators in a lunch meeting at the White House."
        },
        {
            "id": 33,
            "text": "“We’re very close to getting it done; we’re very close to voting,” Mr. Trump said of the tax bill."
        },
        {
            "id": 34,
            "text": "It is not clear whether all Republican senators will roundly endorse the deal, which includes provisions that Ms. Collins and Senator Marco Rubio of Florida had raised concerns about this week."
        },
        {
            "id": 35,
            "text": "Ms. Collins has said she does not favor a lower individual rate, and Mr. Rubio has pushed for a more generous child tax credit."
        },
        {
            "id": 36,
            "text": "Republicans have resolved the differences between the two versions of their tax bill."
        },
        {
            "id": 37,
            "text": "Still, none of those concerned senators indicated on Wednesday that they were opposed to the bill taking shape under the agreement in principle, an encouraging sign for Republican leaders."
        },
        {
            "id": 38,
            "text": "The Senate bill narrowly passed 51 to 49, with Senator Bob Corker, Republican of Tennessee, voting against the legislation, and other lawmakers, like Ms. Collins, getting on board only once certain changes, including expanding the medical expense deduction, were made."
        },
        {
            "id": 39,
            "text": "Mr. Corker said on Wednesday that “nothing has alleviated the concerns” that caused him to oppose the bill, which were rooted in a desire not to add further to the national debt."
        },
        {
            "id": 40,
            "text": "The agreement was completed on Wednesday morning, hours before the first and only scheduled public meeting of the congressional conference committee formed to work out the differences between the House- and Senate-passed versions of the bill."
        },
        {
            "id": 41,
            "text": "“Let’s understand what’s happening today is a sham,” said Senator Ron Wyden of Oregon, the top Democrat on the Finance Committee."
        },
        {
            "id": 42,
            "text": "“Nobody ought to mistake this conference for real debate.”"
        },
        {
            "id": 43,
            "text": "Mr. Trump delivered what was called a closing argument for the tax bill from the White House on Wednesday afternoon, flanked by five families who each took the microphone to extol the benefits of the tax bill on their households and communities."
        },
        {
            "id": 44,
            "text": "“As a candidate, I promised we would pass a massive tax cut for the everyday working American families who are the backbone and the heartbeat of our country,” Mr. Trump said."
        },
        {
            "id": 45,
            "text": "“Now we are just days away from keeping that promise."
        },
        {
            "id": 46,
            "text": "We want to give you, the American people, a giant tax cut for Christmas.”"
        },
        {
            "id": 47,
            "text": "Mr. Trump added that if the bill were to be signed in that time frame, Americans would begin seeing tax cuts reflected in their paychecks by February, citing the Internal Revenue Service."
        },
        {
            "id": 48,
            "text": "“The cynical voices that opposed tax cuts grow smaller and weaker, and the American people grow stronger,” he said."
        }
    ]
}