{
    "title": "Mitt Romney Promises 'Millions' Of Jobs -- But Offers No Data To Back It Up ",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- Growth."
        },
        {
            "id": 1,
            "text": "That's the word, and the concept, that Mitt Romney's campaign is emphasizing in response to the Obama campaign's new attacks on Romney's tax plan."
        },
        {
            "id": 2,
            "text": "President Obama is seizing on a new think-tank study that says Romney's plan to cut tax rates for all brackets, lower the corporate rate, close loopholes and keep taxes low on investments, would require him to eliminate deductions and credits that benefit the lower- and middle-class, such as child credits and mortgage deductions."
        },
        {
            "id": 3,
            "text": "The Romney campaign is not engaging on the same playing field."
        },
        {
            "id": 4,
            "text": "When asked Thursday in a conference call how much Rommey's plan might add to the deficit before the economic-growth it projected to create was factored in, along with closing loopholes and cutting spending, the campaign declined to provide specific numbers."
        },
        {
            "id": 5,
            "text": "In a sense, the Romney campaign is handicapping itself, because Obama is now out on the campaign trail wielding specific numbers against Romney, whacking him over the head with lines like this: \"The average middle-class family with children, according to this study, would be hit with a tax increase of more than $2,000.\""
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "\"In order to afford just one $250,000 tax cut for somebody like Mr. Romney, 125 families like yours would have to pay another $2,000 in taxes each and every year,\" Obama told a crowd in Mansfield, Ohio, on Wednesday."
        },
        {
            "id": 8,
            "text": "\"Does that sound like a good plan for economic growth?\""
        },
        {
            "id": 9,
            "text": "Obama asked the crowd, which screamed back, \"No!\"\n\n\n\nThe Obama campaign even put out a web-based \"tax calculator\" on Thursday, where a user can plug in his or her income and other variables to see how much of a tax increase he or she might see if Romney is elected and implements his plan."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "This is an effective attack by the president, even if he himself has endorsed many of the same elements of a broad-based tax reform plan as Romney, though there are significant differences between them."
        },
        {
            "id": 12,
            "text": "But in response, the Romney campaign is refusing to engage in a number-by-number fight over how much its plan would impact the bottom line for each American."
        },
        {
            "id": 13,
            "text": "The campaign is instead banking on the idea that Americans are more concerned with results, specifically economic growth."
        },
        {
            "id": 14,
            "text": "The Romney camp's retort, in a nutshell, is that Romney's plan would produce growth and jobs, and that Obama's plan would not because it is focused only on an ideological/political determination to make the wealthy pay more, and not on what would actually get the economy going."
        },
        {
            "id": 15,
            "text": "Job growth, the Romney argument goes, is the best solution to help the middle class."
        },
        {
            "id": 16,
            "text": "\"The fact is that if you can create jobs then you're going to have an enormous positive impact on income distribution because people who don't have a job right now have an income of about zero,\" Romney economic adviser Kevin Hassett said on the conference call Thursday."
        },
        {
            "id": 17,
            "text": "\"And if you give people with incomes of zero jobs, then their incomes go up a lot and the income distribution improves tremendously.\""
        },
        {
            "id": 18,
            "text": "The Romney campaign was happy to be specific with one number on Thursday: the number of jobs that their plan would create."
        },
        {
            "id": 19,
            "text": "The only issue was that different advisers said different things."
        },
        {
            "id": 20,
            "text": "Writing in the Wall Street Journal, Romney economic adviser Glenn Hubbard said the Republican candidate's plan would create \"about 12 million new jobs in a Romney first term, and millions more after that due to the plan's long-run growth effects.\""
        },
        {
            "id": 21,
            "text": "But Hassett said Thursday that Romney's plan would result in \"job creation of 5 to 10 million higher than baseline over a decade.\""
        },
        {
            "id": 22,
            "text": "Hassett laid out the logic: \"It's very easy to get millions and millions of jobs out of something like the Romney plan."
        },
        {
            "id": 23,
            "text": "And that contrasts a lot with what President Obama is proposing, which is basically just a hike of marginal tax rates."
        },
        {
            "id": 24,
            "text": "I don't think there's any economist on earth that would look at something like that and say it's a jobs plan.\""
        },
        {
            "id": 25,
            "text": "But while Hassett said they had numbers to back this up, there was no such data offered on the call."
        },
        {
            "id": 26,
            "text": "\"What a small group of us have been doing is trying to establish what the economic science, the state of the art, would say that the Romney fiscal plan would do to the economy,\" Hassett said."
        },
        {
            "id": 27,
            "text": "\"And I think what we've found is the numbers are striking and interesting and based on extremely strong science.\""
        },
        {
            "id": 28,
            "text": "That, however, was the last mention of those numbers."
        },
        {
            "id": 29,
            "text": "And until such supporting data is offered, Romney's plan will be dismissed by many as vague reassurances rather than a credible proposal."
        }
    ]
}