{
    "title": "Former Colorado Gov. John Hickenlooper joins crowded 2020 Democratic field",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON – Colorado's former Gov. John Hickenlooper on Monday joined the growing field of Democratic candidates hoping to unseat President Donald Trump in 2020."
        },
        {
            "id": 1,
            "text": "The centrist Democrat made the announcement in an online video titled \"Standing Tall.\""
        },
        {
            "id": 2,
            "text": "The video touts Hickenlooper's accomplishments as governor and highlights his biography as an unemployed geologist who became a successful restaurateur."
        },
        {
            "id": 3,
            "text": "\"We need a leader who can bring people together and get stuff done."
        },
        {
            "id": 4,
            "text": "As a successful entrepreneur, mayor and governor, I’ve proven that I can build and lead amazing teams of talented people- a key ingredient to effecting real progressive change."
        },
        {
            "id": 5,
            "text": "I hope you'll join me,\" he tweeted Monday morning."
        },
        {
            "id": 6,
            "text": "The two-term governor left office in January."
        },
        {
            "id": 7,
            "text": "Before becoming governor, he served two terms as mayor of Denver."
        },
        {
            "id": 8,
            "text": "He is expected to campaign on his ability to implement Democratic goals in a politically divided state and to try to stand out from the largely progressive group of Democratic candidates by portraying himself as a pragmatist."
        },
        {
            "id": 9,
            "text": "Hickenlooper has hedged on supporting Medicare for All and the Green New Deal."
        },
        {
            "id": 10,
            "text": "\"I'm running for president because we're facing a crisis that threatens everything we stand for,\" Hickenlooper, 67, said, as the video displayed an image of Trump."
        },
        {
            "id": 11,
            "text": "\""
        },
        {
            "id": 12,
            "text": "As a skinny kid with Coke bottle glasses and a funny last name, I've stood up to my fair share of bullies.\""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "Here's a list of the candidates who have declared so far\n\nHickenlooper said, \"We need dreamers in Washington but we also need to get things done."
        },
        {
            "id": 15,
            "text": "I've proven again and again I can bring people together to produce the progressive change Washington has failed to deliver.\""
        },
        {
            "id": 16,
            "text": "On \"Good Morning America\" on Monday, Hickenlooper further detailed the crisis he believes America is facing, citing climate change and the soaring cost of health care as symptoms of a larger problem."
        },
        {
            "id": 17,
            "text": "\"This is a crisis of division,\" he said."
        },
        {
            "id": 18,
            "text": "\"And I think it's probably the worst period of division that we've had in this country since the Civil War."
        },
        {
            "id": 19,
            "text": "\"Ultimately I'm running for president because I believe not only that I can beat Donald Trump, but that I am the person that can bring people together on the other side and actually get stuff done,\" he said."
        },
        {
            "id": 20,
            "text": "The campaign video pointed to his success in bringing oil and gas companies together with environmentalists to agree on methane emission caps."
        },
        {
            "id": 21,
            "text": "The campaign video also focused on Hickenlooper's gun control efforts in the wake of the 2012 mass shooting in an Aurora, Colorado, movie theater."
        },
        {
            "id": 22,
            "text": "He signed bills requiring universal background checks and limiting magazine capacity to 15 rounds."
        },
        {
            "id": 23,
            "text": "He previously told the Fort Collins Coloradoan that he would bring a western perspective and collegiality missing from much of the national debate."
        },
        {
            "id": 24,
            "text": "It was one of the first times the former governor specifically addressed the question of whether he would run for president in 2020."
        },
        {
            "id": 25,
            "text": "\"I understand that I would be a ridiculous long shot, and we're not a big state, we don't have all the donors and giant corporations and all that stuff,\" Hickenlooper said at the time."
        },
        {
            "id": 26,
            "text": "\"I think there's a reason we've had the Number 1 economy for two years in a row."
        },
        {
            "id": 27,
            "text": "I don't think that happened by accident."
        },
        {
            "id": 28,
            "text": "I think that was a function of that unity, that feeling that we're all in this together and we're going to find solutions to our economy and our education, make sure that we have a workforce.\""
        },
        {
            "id": 29,
            "text": "Hickenlooper will be able to point to other liberal accomplishments as governor."
        },
        {
            "id": 30,
            "text": "He signed a law legalizing same-sex civil unions in 2013 and opposed the death penalty."
        },
        {
            "id": 31,
            "text": "He also ordered Colorado to adopt California's low vehicle emission standards before leaving office."
        },
        {
            "id": 32,
            "text": "But some progressives felt that Hickenlooper was too supportive of the energy industry and were critical of his opposition to ballot measures that sought to limit drilling in suburban areas."
        },
        {
            "id": 33,
            "text": "In 2017, Hickenlooper and former Republican Ohio Gov. John Kasich joined to propose fixes for the Affordable Care Act."
        },
        {
            "id": 34,
            "text": "The bipartisan effort fueled speculation that the pair might consider a \"unity ticket\" in 2020, but Hickenlooper threw cold water on that idea in September."
        },
        {
            "id": 35,
            "text": "The Republican Nation Committee rejected the notion that Hickenlooper is a moderate, calling him a \"tax-and-spend liberal\" in a statement Monday."
        },
        {
            "id": 36,
            "text": "\"John Hickenlooper is the latest tax-and-spend liberal to join the race."
        },
        {
            "id": 37,
            "text": "But according to Hickenlooper, he’s actually ‘a lot more progressive’ than his far-left opponents."
        },
        {
            "id": 38,
            "text": "In a primary dominated by socialist policies like the $93 trillion ‘Green New Deal,’ that puts him way outside the mainstream,\" said RNC spokesman Michael Ahrens."
        },
        {
            "id": 39,
            "text": ""
        }
    ]
}