{
    "title": "'No choice but to act': House Speaker Pelosi asks chairmen to pursue articles of impeachment against President Trump",
    "text": [
        {
            "id": 0,
            "text": "House Speaker Nancy Pelosi announced Thursday that the House would draw up articles of impeachment against President Donald Trump, setting up a historic clash between the two branches of government that could lead to only the third presidential impeachment in history."
        },
        {
            "id": 1,
            "text": "\"Our democracy is what is at stake,\" said Pelosi, D-Calif., because the alleged misconduct involved interference with the 2020 election."
        },
        {
            "id": 2,
            "text": "\"The president leaves us no choice but to act, because he is trying to corrupt, once again, the election for his own benefit.\""
        },
        {
            "id": 3,
            "text": "The Democratic impeachment inquiry has focused on accusations that Trump withheld a White House meeting and military aid from Ukraine to pressure the country to investigate his political rival, former Vice President Joe Biden."
        },
        {
            "id": 4,
            "text": "Democrats have also argued that Trump obstructed Congress by directing his aides not to testify and federal agencies not to provide subpoenaed documents."
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "\"Today I am asking our chairmen to proceed with articles of impeachment,\" Pelosi announced from the Capitol."
        },
        {
            "id": 7,
            "text": "But Trump said he fought the subpoenas because the inquiry was partisan and biased, a \"witch hunt.\""
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "Congressional Republicans have rallied behind him, saying the president has the authority to set foreign policy."
        },
        {
            "id": 10,
            "text": "Trump eventually met with Ukraine President Volodymyr Zelensky and released $391 million in military aid without the requested investigations of Biden, his son Hunter and possible meddling in the 2016 election."
        },
        {
            "id": 11,
            "text": "Trump tweeted after Pelosi's statement that \"Radical Left Democrats\" were seeking \"to Impeach me over NOTHING.\""
        },
        {
            "id": 12,
            "text": "Republicans hold a 53 to 47 majority in the Senate, and it would take a two-thirds majority to vote to remove Trump."
        },
        {
            "id": 13,
            "text": "Stephanie Grisham, a White House spokeswoman, said in a tweet that Trump had done nothing but lead the country in a booming economy with more jobs and a stronger military."
        },
        {
            "id": 14,
            "text": "\"We look forward to a fair trial in the Senate,\" Grisham said."
        },
        {
            "id": 15,
            "text": "If the Judiciary Committee recommends and the full House approves articles of impeachment against Trump, it would be only the third time a president faced such a challenge."
        },
        {
            "id": 16,
            "text": "Former presidents Andrew Johnson and Bill Clinton were acquitted in the Senate."
        },
        {
            "id": 17,
            "text": "Richard Nixon resigned while under investigation, but before he was impeached."
        },
        {
            "id": 18,
            "text": "The clash between leaders of two of the three branches of government came after a daylong hearing Wednesday in the House Judiciary Committee."
        },
        {
            "id": 19,
            "text": "A trio of law professors said Trump had committed impeachable offenses by urging Ukraine to investigate his political rival while withholding a meeting and nearly $400 million in military aid."
        },
        {
            "id": 20,
            "text": "Pelosi recited the history of the reasoning behind impeachment, which the professors testified about during the hearing."
        },
        {
            "id": 21,
            "text": "A 300-page report Tuesday from three other panels that investigated Trump’s dealings with Ukraine found that the \"evidence of the President’s misconduct is overwhelming, and so too is the evidence of his obstruction of Congress.\""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": "The House Judiciary Committee schedule a hearing Monday for Intelligence Committee staffers to present the report's findings to the panel."
        },
        {
            "id": 24,
            "text": "\"President Trump placed his own personal and political interests above our national interest, above the security of our country, and most importantly above our most precious right: the ability of each and every one of us to participate in fair elections, free of corruption,\" House Judiciary Chairman Jerry Nadler, D-N.Y., said to close the hearing."
        },
        {
            "id": 25,
            "text": "\"The Constitution has a solution for a president who places his personal or political interests above those of the nation – the power of impeachment.\""
        },
        {
            "id": 26,
            "text": "Pelosi said the House wouldn't wait for federal court decisions in order to deal with Trump's misconduct, after the president said he would fight all subpoenas and directed top administration officials not to testify in the inquiry."
        },
        {
            "id": 27,
            "text": "One case pending in the D.C. Circuit Court of Appeals deals with the enforcement of a subpoena that former White House counsel Don McGahn defied."
        },
        {
            "id": 28,
            "text": "\"We’re not going to be accomplices to his obstruction of justice,\" Pelosi said."
        },
        {
            "id": 29,
            "text": "But she declined to comment about which issues the six committees that have investigated Trump since Democrats regained control of the House in January – Financial Services, Foreign Affairs, Intelligence, Judiciary, Oversight and Reform, and Ways and Means – might pursue for articles of impeachment."
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": "\"My chairmen will be making recommendations,\" Pelosi said."
        },
        {
            "id": 32,
            "text": "House Minority Leader Kevin McCarthy, R-Calif., suggested Thursday that a vote in the full House could reject articles of impeachment."
        },
        {
            "id": 33,
            "text": "The House vote that approved rules for the impeachment inquiry featured two Democrats joining all Republicans in opposition."
        },
        {
            "id": 34,
            "text": "“I am more confident that the bipartisan vote on impeachment that comes to the floor will be no,” McCarthy said."
        },
        {
            "id": 35,
            "text": "Trump called the hearing “a joke.”"
        },
        {
            "id": 36,
            "text": "Republicans on the three panels that investigated Trump – Foreign Affairs, Intelligence, and Oversight and Reform – released their own report Monday that argued the president has the authority to direct foreign policy."
        },
        {
            "id": 37,
            "text": "More:A diagram of events in the impeachment inquiry of President Trump"
        },
        {
            "id": 38,
            "text": "Grisham said the hearing was good for Trump but bad for Democrats because all it did was establish the liberal bias of the professors."
        },
        {
            "id": 39,
            "text": "“It did nothing to change the fact that, despite weeks of hearings in this sham process, the president did nothing wrong,” Grisham said."
        }
    ]
}