{
    "title": "'Both sides need to be heard': Senate Republicans reject plans to dismiss impeachment articles",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON (AP) — Senate Republicans signaled they would reject the idea of simply voting to dismiss the articles of impeachment against President Trump as the House prepares to send the charges to the chamber for the historic trial."
        },
        {
            "id": 1,
            "text": "“I think our members, generally are not interested in the motion to dismiss."
        },
        {
            "id": 2,
            "text": "They think both sides need to be heard,” Sen. Roy Blunt, R-Mo., who is part of GOP leadership, said Monday."
        },
        {
            "id": 3,
            "text": "It will be only the third presidential impeachment trial in American history, a serious and dramatic endeavor coming amid the backdrop of a politically divided nation and the start of an election year."
        },
        {
            "id": 4,
            "text": "Speaker Nancy Pelosi has not set the timing for the House vote that will launch the Senate action."
        },
        {
            "id": 5,
            "text": "Trump was impeached by the Democratic-led House last month on charges of abuse of power over pushing Ukraine to investigate Democratic rival Joe Biden and obstruction of Congress in the probe."
        },
        {
            "id": 6,
            "text": "Democrats said the vote could be Wednesday."
        },
        {
            "id": 7,
            "text": "With the impeachment trial starting in a matter of days, senators are still debating the rules of the proceedings."
        },
        {
            "id": 8,
            "text": "GOP senators are conferring privately about whether to allow a motion to dismiss the charges against the president or to call additional witnesses for testimony."
        },
        {
            "id": 9,
            "text": "Trump suggested over the weekend he might prefer simply dismissing the charges rather than giving legitimacy to charges from the House, which he considers a “hoax.”"
        },
        {
            "id": 10,
            "text": "It was an extraordinary suggestion, but one being proposed by Trump allies with support from some GOP senators, including Majority Leader Mitch McConnell."
        },
        {
            "id": 11,
            "text": "But it is clear McConnell does not have the votes needed from his GOP majority to do that."
        },
        {
            "id": 12,
            "text": "One key Republican, Sen. Susan Collins of Maine, said she, too, would oppose a motion to dismiss the charges."
        },
        {
            "id": 13,
            "text": "Collins is leading an effort among some Republicans, including Sens. Mitt Romney of Utah and Lisa Murkowski of Alaska, to ensure the ground rules include plans to eventually consider voting to call witnesses."
        },
        {
            "id": 14,
            "text": "“My position is that there should be a vote on whether or not witnesses should be called,” Collins said."
        },
        {
            "id": 15,
            "text": "Romney said he wants to hear from John Bolton, the former national security adviser at the White House, who others have said raised alarms about the alternative foreign policy toward Ukraine being run led by Trump’s personal lawyer Rudy Giuliani."
        },
        {
            "id": 16,
            "text": "“I’ve said I’d like to hear from John Bolton,” Romney told reporters Monday."
        },
        {
            "id": 17,
            "text": "“I expect that barring some kind of surprise, I’ll be voting in favor of hearing from witnesses after those opening arguments.”"
        },
        {
            "id": 18,
            "text": "Democrats have been pushing Republicans, who have the majority in the Senate, to consider new testimony, arguing that fresh information has emerged during Pelosi’s monthlong delay in transmitting the charges."
        },
        {
            "id": 19,
            "text": "McConnell is drafting an organizing resolution that will outline the steps ahead."
        },
        {
            "id": 20,
            "text": "Approving it will be among the first votes senators take after they are sworn as jurors by Supreme Court Chief Justice John Roberts for the Court of Impeachment."
        },
        {
            "id": 21,
            "text": "Republicans control the chamber, 53-47, and are all but certain to acquit Trump."
        },
        {
            "id": 22,
            "text": "McConnell is hesitant to call new witnesses who would prolong the trial."
        },
        {
            "id": 23,
            "text": "He prefers to model Trump’s trial partly on the process used for then-President Bill Clinton’s trial in 1999."
        },
        {
            "id": 24,
            "text": "It takes just 51 votes during the impeachment trial to approve rules or call witnesses."
        },
        {
            "id": 25,
            "text": "Just four GOP senators could form a majority with Democrats to insist on new testimony."
        },
        {
            "id": 26,
            "text": "It also would take only 51 senators to vote to dismiss the charges against Trump."
        },
        {
            "id": 27,
            "text": "Most Republicans appear willing to go along with McConnell’s plan to start the trial first then consider witnesses later, rather than upfront, as Democrats want."
        },
        {
            "id": 28,
            "text": "Collins is pushing to have at least the promise of witness votes included in the organizing resolution."
        },
        {
            "id": 29,
            "text": "She and the others appear to be gathering support."
        },
        {
            "id": 30,
            "text": "“I’ve been working to make sure that we will have a process that we can take a vote on whether or not we need additional information, and yes, that would include witnesses,” Murkowski told reporters."
        },
        {
            "id": 31,
            "text": "McConnell is expected to huddle privately with senators at their weekly lunch Tuesday."
        },
        {
            "id": 32,
            "text": "House Majority Leader Steny Hoyer told reporters the House vote might come Wednesday."
        },
        {
            "id": 33,
            "text": "“Could be,” he said."
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": ""
        },
        {
            "id": 36,
            "text": ""
        },
        {
            "id": 37,
            "text": ""
        }
    ]
}