{
    "title": "Elizabeth Warren Gets Senate Democratic Leadership Spot",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON --"
        },
        {
            "id": 1,
            "text": "Sen. Elizabeth Warren (D-Mass.) gained a leadership position in the Senate Democratic caucus Thursday, giving the prominent progressive senator a key role in shaping the party's policy priorities."
        },
        {
            "id": 2,
            "text": "Warren's new role, which was created specifically for her, will be strategic policy adviser to the Democratic Policy and Communications Committee, helping to craft the party's policy positions and priorities."
        },
        {
            "id": 3,
            "text": "She will also serve as a liaison to progressive groups to ensure they have a voice in leadership meetings and discussions, according to a source familiar with the role."
        },
        {
            "id": 4,
            "text": "A source close to Warren told The Huffington Post that the senator was interested in the position because she wanted to have a seat at the table in the leadership meetings in order to influence the agenda."
        },
        {
            "id": 5,
            "text": "Sources told HuffPost that Warren had the strong support of Senate Majority Leader Harry Reid (D-Nev.), who wanted her as part of his team."
        },
        {
            "id": 6,
            "text": "Warren's presence in the weekly leadership meetings and her role helping to shape the caucus' policies are significant achievements for progressives."
        },
        {
            "id": 7,
            "text": "\"Somebody asked me on the way in here, 'Elizabeth Warren's going to be part of your leadership."
        },
        {
            "id": 8,
            "text": "What do you expect her to do?'"
        },
        {
            "id": 9,
            "text": "I expect her to be Elizabeth Warren,\" Reid told reporters during a press conference introducing his new team."
        },
        {
            "id": 10,
            "text": "Reid's support for Warren also underscores his desire to push progressive policies in the next Congress, a priority his office has confirmed."
        },
        {
            "id": 11,
            "text": "\"If the ballot measure results are any indication, actual progressive policies remain popular with voters in red and blue states."
        },
        {
            "id": 12,
            "text": "I believe you’ll see a Senate Democratic caucus fight on behalf of those policies and provide the votes if and when Republicans are ready to act,\" Faiz Shakir, a senior adviser to Reid, told HuffPost earlier this month."
        },
        {
            "id": 13,
            "text": "Speaking to reporters after the leadership elections, Warren sounded familiar themes when detailing what her policy priorities would be."
        },
        {
            "id": 14,
            "text": "\"Wall Street … is doing very well, CEOs are bringing in millions more and families all across the country are struggling,\" she said."
        },
        {
            "id": 15,
            "text": "\"We have to make this government work for the American people."
        },
        {
            "id": 16,
            "text": "And that's what I will fight for.\""
        },
        {
            "id": 17,
            "text": "The Warren announcement took many senators by surprise, with some saying that the leadership simply informed them of the change with little debate."
        },
        {
            "id": 18,
            "text": "\"It's a fait accompli,\" said Sen. Dianne Feinstein (D-Calif.), adding that there wasn't much discussion about what exactly Warren would be doing."
        },
        {
            "id": 19,
            "text": "Throughout Senate history, individual members have often steered away from leadership positions, worried that the horse-trading and consensus-gathering that leadership involves would neuter their power."
        },
        {
            "id": 20,
            "text": "But the Senate has been evolving in recent years into a much more leadership-driven institution, in which individual senators and even chairmen have less power than they once did compared to caucus leadership."
        },
        {
            "id": 21,
            "text": "Today, decisions that would have been made in side negotiations, in committee or on the floor are instead made by leadership."
        },
        {
            "id": 22,
            "text": "It's those meetings that Warren will now be a part of."
        },
        {
            "id": 23,
            "text": "At the same time, she will diminish her ability to maintain that inside position if she criticizes the party from the outside."
        },
        {
            "id": 24,
            "text": "That dilemma, however, has been with her every step of her career, as she has moved closer to the center of power."
        },
        {
            "id": 25,
            "text": "\"I really rather doubt, knowing Elizabeth Warren as I have over the last couple of years, that she's going to give up her progressive views and her strong commitment to consumers, even if she is part of the leadership,\" Sen. Tom Harkin (D-Iowa) said Thursday."
        },
        {
            "id": 26,
            "text": "\"I can't imagine that happening.\""
        },
        {
            "id": 27,
            "text": "Erica Sagrans, campaign manager of Ready for Warren -- the campaign to convince Warren to run for president -- welcomed the senator's new role."
        },
        {
            "id": 28,
            "text": "\"Warren's new role shows how much of a leading voice she's become,\" said Sagrans."
        },
        {
            "id": 29,
            "text": "\"It's a great opportunity to put her vision for working families front and center in Washington.\""
        },
        {
            "id": 30,
            "text": "Advertisement\n\nJennifer Bendery, Michael McAuliff and Sabrina Siddiqui contributed reporting."
        },
        {
            "id": 31,
            "text": "Want more updates from Amanda?"
        },
        {
            "id": 32,
            "text": "Sign up for her newsletter, Piping Hot Truth."
        },
        {
            "id": 33,
            "text": "Enter your email address:\n\nEnter your email address:"
        }
    ]
}