{
    "title": "Chris Christie: Parents Should Have 'Some Measure Of Choice' On Vaccinating Their Children",
    "text": [
        {
            "id": 0,
            "text": "New Jersey Gov. Chris Christie (R) said parents should have \"some measure of choice\" when it comes to vaccinating their children."
        },
        {
            "id": 1,
            "text": "Christie, speaking to reporters during a three-day trip to the United Kingdom, said all four of his children have been vaccinated, but noted he thinks a parent's opinion about the issue is more important than what a public official thinks."
        },
        {
            "id": 2,
            "text": "“Mary Pat and I have had our children vaccinated and we think that it’s an important part of being sure we protect their health and the public health,” Christie said, according to The Washington Post."
        },
        {
            "id": 3,
            "text": "“I also understand that parents need to have some measure of choice in things as well, so that’s the balance that the government has to decide,\" Christie added."
        },
        {
            "id": 4,
            "text": "Christie spokesman Kevin Roberts clarified the governor's comments Monday in an email featuring a transcript of Christie's remarks."
        },
        {
            "id": 5,
            "text": "\"To be clear: The Governor believes vaccines are an important public health protection and with a disease like measles there is no question kids should be vaccinated,\" Roberts' email said."
        },
        {
            "id": 6,
            "text": "\"At the same time different states require different degrees of vaccination, which is why he was calling for balance in which ones government should mandate.\""
        },
        {
            "id": 7,
            "text": "In 2009, Christie met with those who oppose vaccinations and penned a letter that year expressing support for them, The Daily Beast pointed out Monday."
        },
        {
            "id": 8,
            "text": "“I have met with families affected by autism from across the state and have been struck by their incredible grace and courage,\" Christie wrote."
        },
        {
            "id": 9,
            "text": "\"Many of these families have expressed their concern over New Jersey’s highest-in-the-nation vaccine mandates."
        },
        {
            "id": 10,
            "text": "I stand with them now, and will stand with them as their governor in their fight for greater parental involvement in vaccination decisions that affect their children.”"
        },
        {
            "id": 11,
            "text": "Christie's comments on vaccinations seem to contradict his actions in 2014, when he quarantined a nurse who had been in West Africa treating Ebola victims even after she tested negative for the virus."
        },
        {
            "id": 12,
            "text": "“I'm glad she can be comfortable and back in her home now where she wants to be, but I hope, I think upon reflection she will understand that my job is to protect the health and safety of the people of New Jersey and the region,\" Christie said after nurse Kaci Hickox threatened to sue the governor for keeping her in isolation."
        },
        {
            "id": 13,
            "text": "His comments also break from President Barack Obama's recent remarks urging parents to get their children fully vaccinated amid what the Centers for Disease Control and Prevention said could become a \"large outbreak\" of measles."
        },
        {
            "id": 14,
            "text": "\"I understand that there are families that, in some cases, are concerned about the effect of vaccinations,\" Obama told NBC's Savannah Guthrie in an interview ahead of the Super Bowl on Sunday."
        },
        {
            "id": 15,
            "text": "\"The science is, you know, pretty indisputable."
        },
        {
            "id": 16,
            "text": "We’ve looked at this again and again."
        },
        {
            "id": 17,
            "text": "There is every reason to get vaccinated, but there aren’t reasons to not.\""
        },
        {
            "id": 18,
            "text": "\"You should get your kids vaccinated,\" he added."
        },
        {
            "id": 19,
            "text": "\"It's good for them and the challenge you have is if you have a certain group of kids who don't get vaccinated, and if it grows large enough that a percentage of the population doesn't get vaccinated and they're the folks who can't get vaccinated, small infants, for example ... they suddenly become much more vulnerable.\""
        },
        {
            "id": 20,
            "text": "The CDC has said there are at least 102 reported cases of measles in 14 states."
        },
        {
            "id": 21,
            "text": "In an interview on CBS's \"Face the Nation\" Sunday, CDC Director Tom Frieden said that the U.S. is \"likely to see more cases.\""
        },
        {
            "id": 22,
            "text": "This post has been updated with information about Christie's past remarks on vaccinations and illnesses."
        },
        {
            "id": 23,
            "text": "It's also been updated with clarification on Christie's remarks from his spokesman."
        }
    ]
}