{
    "title": "5 dead, at least 8 injured in shooting at Fort Lauderdale airport",
    "text": [
        {
            "id": 0,
            "text": "An airline passenger arriving at the Fort Lauderdale airport retrieved a firearm from his checked luggage and opened fire at a baggage claim Friday afternoon, killing five people and injuring eight others."
        },
        {
            "id": 1,
            "text": "The gunman was taken into custody and is being interrogated by law enforcement, but authorities said Friday it was too soon to say whether the shooting was terrorism-related."
        },
        {
            "id": 2,
            "text": "While authorities have declined to release the names of either the victims killed or the gunman, Sen. Bill Nelson identified the gunman as Esteban Santiago and said the man was carrying a military ID card that authorities were still working to authenticate."
        },
        {
            "id": 3,
            "text": "Relatives of the gunman confirmed his identity and told reporters that the 26-year-old had recently been treated for mental health issues."
        },
        {
            "id": 4,
            "text": "An aunt, Maria Luisa Ruiz, told NorthJersey.com that Mr. Santiago had appeared happy after recently becoming a father but that about a month ago he began experiencing a mental health crisis."
        },
        {
            "id": 5,
            "text": "“Like a month ago, it was like he lost his mind,” she said “He said he saw things.”"
        },
        {
            "id": 6,
            "text": "She said Mr. Santiago, who was born in Puerto Rico, had spent time in Iraq with the Army National Guard and was currently living in Anchorage, Alaska."
        },
        {
            "id": 7,
            "text": "The suspected gunman’s brother, Bryan Santiago, told the Associated Press that his family had recently gotten a call from his brother’s girlfriend saying that he was getting psychological treatment in Alaska where the couple lived."
        },
        {
            "id": 8,
            "text": "Broward County Sheriff Scott Israel declined to comment on whether the gunman had just arrived to the airport on a flight, but Broward County Commissioner Chip LaMarca wrote in a post to Facebook that the gunman was a passenger on a flight that landed at the Fort Lauderdale-Hollywood International Airport and had checked his gun in his baggage."
        },
        {
            "id": 9,
            "text": "After landing at the Florida airport, the gunman retrieved his luggage, went into a bathroom to load his firearm and subsequently began shooting people in the baggage claim area, Mr. LaMarca said."
        },
        {
            "id": 10,
            "text": "Sheriff Israel dispelled rumors that there was a second shooting at the airport, saying the baggage claim in Terminal 2 where the gunman opened fire was the only site of gunfire."
        },
        {
            "id": 11,
            "text": "“At this point, it looks like he acted alone,” Sheriff Israel said, adding it was too early to speculate on the gunman’s motive for carrying out the shooting."
        },
        {
            "id": 12,
            "text": "He said when deputies arrived on scene that the gunman was taken into custody “without incident” but declined to elaborate."
        },
        {
            "id": 13,
            "text": "No flights were arriving or leaving the airport Friday afternoon and airport Director Mark Gale said it was unclear how long the airport the would remain closed."
        },
        {
            "id": 14,
            "text": "Law enforcement officials said they first began receiving calls reporting gunfire in Terminal 2 of the airport at 12:55 p.m Friday."
        },
        {
            "id": 15,
            "text": "News footage from the scene showed people evacuating from the airport and standing on the tarmac as first responders rushed to the scene."
        },
        {
            "id": 16,
            "text": "Throughout the afternoon, people could be seen streaming out of airport exits and at various points crouching behind emergency vehicles to take cover."
        },
        {
            "id": 17,
            "text": "Former White House spokesman Ari Fleischer tweeted that he was at the airport when shots were fired and that “everyone is running.”"
        },
        {
            "id": 18,
            "text": "He later wrote that the scene seemed calm and that “the police aren’t letting anyone out of the airport.”"
        },
        {
            "id": 19,
            "text": "Florida Gov. Rick Scott called the shooting “a senseless act of evil” and late Friday said some of those injured and hospitalized were fighting for their lives."
        },
        {
            "id": 20,
            "text": "President-elect Donald Trump tweeted Friday, after emerging from an intelligence briefing on Russian hacking, that he was also monitoring the situation."
        },
        {
            "id": 21,
            "text": "“Monitoring the terrible situation in Florida."
        },
        {
            "id": 22,
            "text": "Just spoke to Governor Scott."
        },
        {
            "id": 23,
            "text": "Thoughts and prayers for all."
        },
        {
            "id": 24,
            "text": "Stay safe!”"
        },
        {
            "id": 25,
            "text": "Mr. Trump wrote."
        },
        {
            "id": 26,
            "text": "The Federal Aviation Administration issued a statement indicating that as of 2:15 p.m., any flights inbound and within 50 miles of the Fort Lauderdale-Hollywood International Airport would land at the airport but that other flights might be delayed or diverted."
        },
        {
            "id": 27,
            "text": "Airport officials later provided an update saying the airport would be closed for an extended period of time and that no flights are currently taking off from or landing at Fort Lauderdale."
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": ""
        }
    ]
}