{
    "title": "Reported Israeli airstrikes in Syria could accelerate U.S. decision process",
    "text": [
        {
            "id": 0,
            "text": "Israel’s reported airstrikes in Syria — and the threat of a retaliatory strike by the Syrian government — are likely to accelerate the decision-making of the Obama administration, which was already moving toward a sharp escalation of U.S. involvement in the two-year-old crisis."
        },
        {
            "id": 1,
            "text": "Senior officials said the deployment of U.S. troops to Syria remains unlikely, but they have indicated that a decision will come within weeks on options ranging from the supply of weapons to the Syrian rebels to the use of U.S. aircraft and missiles to ground President Bashar al-Assad’s air power by destroying planes, runways and missile sites inside Syria."
        },
        {
            "id": 2,
            "text": "Neither Israeli nor U.S. officials confirmed an attack Sunday morning that reportedly hit a weapons shipment in Syria — including sophisticated missiles and air defense equipment — about to be transferred to Lebanon-based Hezbollah."
        },
        {
            "id": 3,
            "text": "But President Obama, in an interview broadcast just hours later Sunday, said Israel is justified in preventing the provision of weapons to Hezbollah."
        },
        {
            "id": 4,
            "text": "“We coordinate very closely with the Israelis, recognizing that . . ."
        },
        {
            "id": 5,
            "text": "they are very close to Syria, they’re very close to Lebanon,” Obama said in the interview, recorded Saturday with the Spanish-language Telemundo, after an earlier Israeli attack reported late Friday."
        },
        {
            "id": 6,
            "text": "Throughout the Syrian crisis, the administration has repeatedly voiced the belief that Syria is already awash in weapons and that sending more will not tip the balance in favor of the rebels."
        },
        {
            "id": 7,
            "text": "Now, in part because of growing confidence in the rebel Free Syrian Army, “the national security team and the diplomatic team around the president” favor increased involvement, and their views are gaining momentum despite the caution expressed by Obama’s political advisers, according to a senior Western official whose government has closely coordinated its Syria policy with Washington and who spoke before the reported Israeli strikes."
        },
        {
            "id": 8,
            "text": "The official discussed sensitive diplomatic assessments on the condition of anonymity."
        },
        {
            "id": 9,
            "text": "Even U.S. lawmakers who have expressed reservations about stepped-up U.S. involvement appeared to now see it as inevitable."
        },
        {
            "id": 10,
            "text": "“If we are going to arm the rebels, we have to make sure those arms are not going to end up in the possession of al-Qaeda supporters,” Rep. Peter T King (R-N.Y.) said on CNN’s “State of the Union.”"
        },
        {
            "id": 11,
            "text": "Sen. Patrick J. Leahy (D-Vt.)"
        },
        {
            "id": 12,
            "text": "expressed similar concern but said he believes that Obama is moving toward action."
        },
        {
            "id": 13,
            "text": "“The idea of getting weapons in — if we know the right people to get them — my guess is we will give them to them,” Leahy said on NBC’s “Meet the Press.”"
        },
        {
            "id": 14,
            "text": "Rep. C.A. Dutch Ruppersberger (Md.), the senior Democrat on the House Intelligence Committee, urged that action be taken only with other partners."
        },
        {
            "id": 15,
            "text": "“We can’t be the sheriff to the whole world,” he said."
        },
        {
            "id": 16,
            "text": "“We have our own issues right now — Iraq, Afghanistan, we have sequestration, those type of issues."
        },
        {
            "id": 17,
            "text": "So when we make the move to get in, we have to do it with a coalition.”"
        },
        {
            "id": 18,
            "text": "The apparent Israeli strikes — following reports in recent weeks that Assad’s forces probably deployed chemical weapons in unknown quantities — appeared to bolster the case of those who have long favored direct U.S. support for the rebels."
        },
        {
            "id": 19,
            "text": "“We need to have a game-changing action,” said Sen. John McCain (R-Ariz.)."
        },
        {
            "id": 20,
            "text": "“And that is no American boots on the ground, establish a safe zone, and to protect it and to supply weapons to the right people in Syria who are fighting for, obviously, the things we believe in.”"
        },
        {
            "id": 21,
            "text": "The impunity with which the Israelis apparently struck targets in Damascus, McCain said on “Fox News Sunday,” undercut the argument of the U.S. military that Syrian air defenses would pose a formidable impediment to imposition of a no-fly zone over rebel-held areas of Syria."
        },
        {
            "id": 22,
            "text": "“The Israelis seem to be able to penetrate it rather easily,” Mc­Cain said."
        },
        {
            "id": 23,
            "text": "The “red line” Obama drew, promising consequences for Assad if he used chemical weapons, “was apparently written in disappearing ink,” he said."
        },
        {
            "id": 24,
            "text": "After Sunday’s strikes, U.N. Secretary General Ban Ki-moon expressed “grave concern” and called on “all sides to exercise maximum calm and restraint, and to act with a sense of responsibility to prevent an escalation of what is already a devastating and highly dangerous conflict,” according to Ban’s spokesman in New York."
        },
        {
            "id": 25,
            "text": "The administration has long exercised caution out of fears that U.S. involvement could worsen the situation."
        },
        {
            "id": 26,
            "text": "But Obama’s reservations have been challenged by U.S. allies and partners who have urged the United States to take more of a leadership role over their disparate efforts to help the Syrian opposition."
        },
        {
            "id": 27,
            "text": "At the same time, U.S. confidence has been growing in the cohesiveness of the Free Syrian Army led by Gen. Salim Idris."
        },
        {
            "id": 28,
            "text": "Idris, who met with Secretary of State John F. Kerry in Istanbul two weeks ago, pledged that no U.S.-supplied arms would go to Islamist extremist groups fighting for the same cause as the U.S.-backed rebels and said that all weapons would be carefully supervised and returned to donors at the end of the conflict."
        },
        {
            "id": 29,
            "text": "Kerry will travel this week to Moscow to appeal to President Vladimir Putin to drop his support of Assad and join an international effort to prevent the spread of chemical weapons and stop the Syrian bloodshed."
        },
        {
            "id": 30,
            "text": "But senior administration officials, speaking on the condition of anonymity about those upcoming talks, expressed little optimism that those efforts would succeed."
        }
    ]
}