{
    "title": "Conservative justices appear reluctant to immediately block Trump immigrant census plan",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "U.S. Supreme Court justices on Monday appeared reluctant to block a vaguely defined plan by President Donald Trump’s administration to exclude immigrants living in the United States illegally from the population totals used to allocate congressional districts to states."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "A general view of the U.S. Supreme Court building at sunset in Washington, U.S. November 10, 2020."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "The court’s conservatives, who hold a 6-3 majority, signaled such a ruling might be premature based on the administration’s admission that it does not yet know how or if it will be able to implement the proposal, a facet of Trump’s hardline policies on immigration being pursued in his final weeks in office."
        },
        {
            "id": 6,
            "text": "Challengers led by New York state and the American Civil Liberties Union have argued that Trump’s proposal would dilute the political clout of states with larger numbers of such immigrants, including heavily Democratic California, by undercounting state populations and depriving them of House seats to the benefit of his fellow Republicans."
        },
        {
            "id": 7,
            "text": "The administration has yet to disclose what method it would use to calculate the number of people it proposes to exclude or which subsets of immigrants may be targeted."
        },
        {
            "id": 8,
            "text": "Acting Solicitor General Jeffrey Wall told the justices the administration could miss a Dec. 31 statutory deadline to finalize a Census Bureau report to Trump containing the final population data including the number of immigrants excluded."
        },
        {
            "id": 9,
            "text": "The number of House districts in the 50 states is based on a state’s population count in the decennial national census, which was conducted this year."
        },
        {
            "id": 10,
            "text": "Democrat Joe Biden is set to become president on Jan. 20 and could reverse course if the apportionment numbers have not been finalized by then."
        },
        {
            "id": 11,
            "text": "“We don’t know what the president is going to do,” conservative Chief Justice John Roberts said."
        },
        {
            "id": 12,
            "text": "“We don’t know how many aliens will be excluded."
        },
        {
            "id": 13,
            "text": "We don’t know what the effect of that will be on apportionment."
        },
        {
            "id": 14,
            "text": "All these questions would be resolved if we wait until the apportionment takes place."
        },
        {
            "id": 15,
            "text": "Why aren’t we better advised to do that?”"
        },
        {
            "id": 16,
            "text": "The U.S. Constitution requires apportionment of House seats to be based upon the “whole number of persons in each state.”"
        },
        {
            "id": 17,
            "text": "Until now, the government’s practice was to count all people regardless of their citizenship or immigration status."
        },
        {
            "id": 18,
            "text": "The justices were expected to decide the case on a expedited basis, with a ruling before the end of the year."
        },
        {
            "id": 19,
            "text": "The court potentially could dismiss the current legal challenge, a move that would leave open the possibility of subsequent lawsuits after the administration actually takes action."
        },
        {
            "id": 20,
            "text": "Lawyers for the challengers urged the court not to toss out the lawsuit now, asking the justices to wait for a few weeks until more information is available on what data the Census Bureau intends to submit to the president."
        },
        {
            "id": 21,
            "text": "There are an estimated 11 million immigrants living in the United States illegally."
        },
        {
            "id": 22,
            "text": "The challengers have argued that Trump’s policy violates both the Constitution and the Census Act, a federal law that outlines how the census is conducted."
        },
        {
            "id": 23,
            "text": "The justices focused less on the underlying question of whether Trump’s plan was lawful but conservative Justice Amy Coney Barrett, a Trump appointee, noted that the government during the entire history of the United States has included illegal immigrants in the population count."
        },
        {
            "id": 24,
            "text": "“A lot of the historical evidence and longstanding practice really cuts against your position,” Barrett told Wall."
        },
        {
            "id": 25,
            "text": "Barrett also challenged Wall on the administration’s position that an immigrant in the country illegally cannot be considered an inhabitant for the purposes of House apportionment."
        },
        {
            "id": 26,
            "text": "CERTAIN GROUPS MAY BE TARGETED\n\nBy statute, the president is required to send Congress a report in early January with the population of each of the states and their entitled number of House districts."
        },
        {
            "id": 27,
            "text": "Wall told the justices that it is “very unlikely” the administration will amass data to exclude all immigrants in the country illegally."
        },
        {
            "id": 28,
            "text": "Instead, Wall said, it may propose excluding certain groups, such as the fewer than 100,000 in federal detention, and the total number may not be high enough to affect apportionment."
        },
        {
            "id": 29,
            "text": "The administration’s lack of detail on whether it could implement Trump’s plan prompted justices including Trump appointees Neil Gorsuch and Brett Kavanaugh to wonder if was premature to rule on the issue because the harm alleged by the challengers is speculative."
        },
        {
            "id": 30,
            "text": "Conservative Justice Samuel Alito said that for the administration to exclude all of the immigrants living illegally in the United States from the population count “seems to me a monumental task.”"
        },
        {
            "id": 31,
            "text": "“I would think you would be able to tell us whether that remains a realistic possibility at this point,” Alito told Wall."
        },
        {
            "id": 32,
            "text": "The challengers have argued that Trump’s plan could leave several million people uncounted and cause California, Texas and New Jersey to lose House seats."
        },
        {
            "id": 33,
            "text": "A three-judge panel in New York ruled against the administration in September."
        }
    ]
}