{
    "title": "US to impose new sanctions on Russia - and holds more in reserve",
    "text": [
        {
            "id": 0,
            "text": "President Obama said the US will unveil new sanctions today against Russia over its failure to help defuse the crisis in Ukraine, even as debate intensified over how best to shape such measures – and whether they can ultimately have the desired impact."
        },
        {
            "id": 1,
            "text": "Speaking at a press conference in Manila, Mr. Obama said “The goal here is not to go after Mr. Putin personally.”"
        },
        {
            "id": 2,
            "text": "Rather, the new sanctions will target unspecified individuals and companies close to Russian President Vladimir Putin, reports the Financial Times."
        },
        {
            "id": 3,
            "text": "“The goal is to change his calculus with respect to how the current actions that he’s engaging in could have an adverse impact on the Russian economy over the long haul and to encourage him to actually walk the walk and not just talk the talk when it comes to diplomatically resolving the crisis in Ukraine.”"
        },
        {
            "id": 4,
            "text": "The sanctions will also include some areas of high-tech defence exports to Russia that the US deems inappropriate to be trading at this time."
        },
        {
            "id": 5,
            "text": "The New York Times adds that according to US officials, the sanctioned individuals will include Igor Sechin, president of the state-owned Rosneft oil company, and Aleksei Miller, head of the state-owned energy giant Gazprom."
        },
        {
            "id": 6,
            "text": "But Obama added that additional \"broad-based\" sanctions – presumably meaning sanctions that target entire sectors of the Russian economy – are being held in reserve in the case of future \"Russian aggression,\" notes the Financial Times."
        },
        {
            "id": 7,
            "text": "The New York Times writes that the White House is divided into two camps over sanctions."
        },
        {
            "id": 8,
            "text": "The first holds that the US needs to coordinate its sanctions with those of Europe – as Obama currently is doing."
        },
        {
            "id": 9,
            "text": "According to this thinking, the US and the European Union could undermine the overall effectiveness of sanctions if they impose them at differing paces."
        },
        {
            "id": 10,
            "text": "“The notion that for us to go forward with sectoral sanctions on our own without the Europeans would be the most effective deterrent to Mr. Putin, I think, is factually wrong,” Mr. Obama told reporters in Asia, where he is traveling."
        },
        {
            "id": 11,
            "text": "“We’re going to be in a stronger position to deter Mr. Putin when he sees that the world is unified.”"
        },
        {
            "id": 12,
            "text": "He added: “For example, say we’re not going to allow certain arms sales to Russia — just to take an example — but every European defense contractor backfills what we do, then it’s not very effective.”"
        },
        {
            "id": 13,
            "text": "The other mode calls for the US to act aggressively to implement more punishing sanctions against Russia, regardless of European agreement."
        },
        {
            "id": 14,
            "text": "According to advocates of this position, Europe, being highly dependent on Russian trade, is too divided to come to a timely decision on sanctions."
        },
        {
            "id": 15,
            "text": "Instead, if the US acts, Europe will ultimately follow suit."
        },
        {
            "id": 16,
            "text": "But ultimately, argue some, sanctions are beside the point:"
        },
        {
            "id": 17,
            "text": "Rather, the goal needs to be to stabilize Ukraine as soon as possible, writes former US National Security Council staffer Thomas Graham in a commentary for the Financial Times."
        },
        {
            "id": 18,
            "text": "\"Sanctions may demonstrate America’s outrage,\" he writes, \"but they have done little to deter Russia and they will not solve Ukraine’s problems.\""
        },
        {
            "id": 19,
            "text": "The outlines of an accommodation [between the West and Russia] are already visible: non-bloc status for Ukraine; decentralisation of the country’s political institutions; some kind of official status for the Russian language; and an economic package drawing on US, European and Russian resources."
        },
        {
            "id": 20,
            "text": "Kiev is proposing constitutional reform that acknowledges those Russian concerns."
        },
        {
            "id": 21,
            "text": "Now is the time to begin negotiating the details."
        },
        {
            "id": 22,
            "text": "That is where the US should be focusing its energies, instead of trying to find new ways to contain Russia."
        },
        {
            "id": 23,
            "text": "Only active American participation, along with moral and material support for Kiev, can produce an equitable negotiated settlement."
        },
        {
            "id": 24,
            "text": "The new sanctions come as pro-Russia militants in eastern Ukraine show no signs of backing down."
        },
        {
            "id": 25,
            "text": "On Sunday, armed men in Slovyansk paraded eight observers from the Organization for Security and Co-operation in Europe that they had captured and claim are NATO operatives."
        },
        {
            "id": 26,
            "text": "One of the eight was later released for medical reasons."
        },
        {
            "id": 27,
            "text": "The BBC reports that the German foreign minister, Frank-Walter Steinmeier, slammed the move as \"revolting\" and demanded the remaining captives be freed."
        },
        {
            "id": 28,
            "text": "In addition, the BBC reports that Gennady Kernes, the mayor of Kharkiv in the east, is \"fighting for his life\" after being shot in the back while jogging."
        },
        {
            "id": 29,
            "text": "The mayor, a onetime supporter of former President Viktor Yanukovych, has publicly called for a united Ukraine."
        },
        {
            "id": 30,
            "text": "The gunmen who shot him have not been identified."
        }
    ]
}