{
    "title": "Broward County official Brenda Snipes submits resignation after criticism",
    "text": [
        {
            "id": 0,
            "text": "Broward County, Florida, election chief Brenda Snipes submitted her resignation on Sunday after weeks of criticism from Republican officials who accused her of illegal activity during the Florida recounts, according to multiple reports."
        },
        {
            "id": 1,
            "text": "A Snipes representative confirmed the initial report to NBC 6 on Sunday."
        },
        {
            "id": 2,
            "text": "The Sun Sentinel was first to report the development."
        },
        {
            "id": 3,
            "text": "ADVERTISEMENT\n\nSnipes fielded criticism from President Trump Donald TrumpJan."
        },
        {
            "id": 4,
            "text": "6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE as well as former Florida Gov. Jeb Bush (R), who appointed her as Broward County supervisor of elections in 2003."
        },
        {
            "id": 5,
            "text": "Bush called for Snipes to resign, to which she replied, \"That's his opinion.\""
        },
        {
            "id": 6,
            "text": "Snipes's resignation comes the same day that Florida Gov. Rick Scott (R) was officially elected senator after a nationally watched race that triggered two recounts and a series of bitter legal and public relations battles."
        },
        {
            "id": 7,
            "text": "Scott was one of Snipes's fiercest critics."
        },
        {
            "id": 8,
            "text": "He did not provide evidence for his allegations but threatened to sue Snipes."
        },
        {
            "id": 9,
            "text": "The Broward County elections office did not immediately respond to The Hill's request for comment."
        },
        {
            "id": 10,
            "text": "Voting in Broward County under Snipes took longer than other Florida counties and was marred by allegations of misconduct by election overseers."
        },
        {
            "id": 11,
            "text": "Snipes on Saturday said that her office was unable to locate 2,040 ballots that had been included in the first vote count but not in the machine recount, The Sun Sentinel reported."
        }
    ]
}