{
    "title": "President Trump blocked from posting to Facebook, Instagram 'indefinitely,' at least through end of term",
    "text": [
        {
            "id": 0,
            "text": "After originally planning to block President Donald Trump from posting to his Facebook and Instagram account for 24 hours, CEO Mark Zuckerberg said Thursday that the blocks have been extended \"indefinitely.\""
        },
        {
            "id": 1,
            "text": "\"We believe the risks of allowing the President to continue to use our service during this period are simply too great,\" Zuckerberg wrote in a Facebook post Thursday."
        },
        {
            "id": 2,
            "text": "\"Therefore, we are extending the block we have placed on his Facebook and Instagram accounts indefinitely and for at least the next two weeks until the peaceful transition of power is complete.\""
        },
        {
            "id": 3,
            "text": "Facebook's actions came too late, says the Real Oversight Board, a Facebook watchdog organization not affiliated with Facebook."
        },
        {
            "id": 4,
            "text": "\"It took a literal insurrection for Facebook to do the right thing,\" the group said in a statement sent to USA TODAY and posted on Twitter."
        },
        {
            "id": 5,
            "text": "\"It has now banned Donald Trump – as we called for yesterday – until the inauguration."
        },
        {
            "id": 6,
            "text": "But it is only because of its failure to take action previously that we are at this point.\""
        },
        {
            "id": 7,
            "text": "Trump's social media accounts:Michelle Obama calls for Trump to be 'permanently' banned as pressure mounts on Facebook, Twitter and YouTube\n\nRioting at U.S. Capitol:Angry mob's actions lead to widespread condemnation of Facebook, Twitter and YouTube"
        },
        {
            "id": 8,
            "text": "U.S. Sen. Mark R. Warner, D-Va., incoming chairman of the Senate Select Committee on Intelligence, also said the steps by social media platforms to address Trump’s “misuse” are too late and not enough."
        },
        {
            "id": 9,
            "text": "“Disinformation and extremism researchers have for years pointed to broader network-based exploitation of these platforms, Warner said in a statement."
        },
        {
            "id": 10,
            "text": "\"As I have continually said, these platforms have served as core organizing infrastructure for violent, far right groups and militia movements for several years now – helping them to recruit, organize, coordinate and in many cases (particularly with respect to YouTube) generate profits from their violent, extremist content.\""
        },
        {
            "id": 11,
            "text": "Former first lady Michelle Obama also called on social media companies to permanently ban Trump on Thursday."
        },
        {
            "id": 12,
            "text": "Trump returns to Twitter after freeze\n\nFacebook blocked Trump after Twitter froze three of his tweets about the riots at the U.S. Capitol and blocked his access."
        },
        {
            "id": 13,
            "text": "On Wednesday, Twitter said in a post on its on its Twitter Safety account that the @realDonaldTrump Twitter account would be locked, that those tweets must be removed and the account would remain frozen for at least 12 hours."
        },
        {
            "id": 14,
            "text": "Twitter also said Wednesday that future violations of the social network's rules – such as including inciting violence and interfering in elections – could \"result in permanent suspension of the @realDonaldTrump account.\""
        },
        {
            "id": 15,
            "text": "On Thursday, Twitter confirmed in an email to USA TODAY that the tweets leading to Trump's locked account have been deleted."
        },
        {
            "id": 16,
            "text": "Trump returned to Twitter Thursday night and tweeted a video saying his “focus now turns to ensuring a smooth, orderly and seamless transition of power.”"
        },
        {
            "id": 17,
            "text": "Facebook takes action against Trump accounts\n\nFacebook followed Twitter with its own more stringent response, after initially removing the president's video, saying the company assessed a couple of policy violations, \"which will result in a 24-hour feature block, meaning he will lose the ability to post on the platform during that time.”"
        },
        {
            "id": 18,
            "text": "Zuckerberg said Thursday that over the years, Facebook has at times removed Trump's content or labeled his posts when they violated policies."
        },
        {
            "id": 19,
            "text": "\"We did this because we believe that the public has a right to the broadest possible access to political speech, even controversial speech,\" Zuckerberg wrote."
        },
        {
            "id": 20,
            "text": "\"But the current context is now fundamentally different, involving use of our platform to incite violent insurrection against a democratically elected government.\""
        },
        {
            "id": 21,
            "text": "Online racial justice organization Color Of Change called Facebook complicit in the “violent insurrection” and said in a statement that the platform must permanently ban Trump."
        },
        {
            "id": 22,
            "text": "“The hatred, division and bigotry that Trump and his administration have inflamed will not immediately dissipate with the upcoming change of power,” the statement said."
        },
        {
            "id": 23,
            "text": "“Facebook must permanently ban Trump and take action against his enablers and allies who continue to use the platform to incite violence and spread dangerous misinformation.”"
        },
        {
            "id": 24,
            "text": "Trump's Twitch channel disabled\n\nVideo game streaming site Twitch on Thursday disabled Trump's channel \" in light of yesterday's shocking attack on the Capitol,\" the site told USA TODAY in a statement."
        },
        {
            "id": 25,
            "text": "\"Given the current extraordinary circumstances and the President's incendiary rhetoric, we believe this is a necessary step to protect our community and prevent Twitch from being used to incite further violence.\""
        },
        {
            "id": 26,
            "text": "The site had previously suspended the president's official channel for violating its rules against hate speech."
        },
        {
            "id": 27,
            "text": "That involved the removal of videos from a presidential campaign rally in 2015, when Trump described immigrants crossing the border from Mexico and a 2020 video from a Trump rally in Tulsa in which he described concerns about \"a very tough hombre\" breaking into homes."
        },
        {
            "id": 28,
            "text": "Snapchat locks"
        },
        {
            "id": 29,
            "text": "Trump’s account"
        },
        {
            "id": 30,
            "text": "Snapchat confirmed to USA TODAY that it locked Trump"
        },
        {
            "id": 31,
            "text": "’s account on Wednesday but stopped promoting it in June on its Discover platform, where it curates content."
        },
        {
            "id": 32,
            "text": "Since June, Trump’s account has only been visible to users who chose to subscribe or search for him."
        },
        {
            "id": 33,
            "text": "Snap CEO Evan Spiegel outlined the company’s earlier decision in a statement in June."
        },
        {
            "id": 34,
            "text": "“We will not amplify voices who incite racial violence and injustice by giving them free promotion on Discover,” Spiegel said."
        },
        {
            "id": 35,
            "text": "“Racial violence and injustice have no place in our society and we stand together with all who seek peace, love, equality, and justice in America.”"
        },
        {
            "id": 36,
            "text": ""
        }
    ]
}