{
    "title": "Trump appointees pushing to review, change CDC materials before publication: report",
    "text": [
        {
            "id": 0,
            "text": "The health department’s politically-appointed communications aides have demanded the right to review and seek changes to the Centers for Disease Control and Prevention’s (CDC) weekly scientific reports on the status of the coronavirus pandemic, Politico reported Saturday."
        },
        {
            "id": 1,
            "text": "Emails reviewed by Politico and three people reportedly familiar with the situation indicated that communications aides openly complained in emails to CDC Director Robert Redfield and other senior officials that the agency’s reports would undermine President Trump Donald 's optimistic messaging about COVID-19."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "Politico reported that its three sources said CDC officials have resisted most of the changes proposed by the Department of Health and Human Services (HHS) but that the CDC has increasingly agreed to allow politically-appointed officials to review reports and, in a few cases, alter the wording in the documents."
        },
        {
            "id": 4,
            "text": "When asked by Politico about why HHS was demanding the changes, top HHS spokesperson Michael Caputo said in a statement that the department was appropriately reviewing the CDC’s reports."
        },
        {
            "id": 5,
            "text": "“Our intention is to make sure that evidence, science-based data drives policy through this pandemic—not ulterior deep state motives in the bowels of CDC,\" he told Politico."
        },
        {
            "id": 6,
            "text": "Caputo, a former Trump campaign official with no previous medical or scientific experience, was named the department’s assistant public affairs secretary in April."
        },
        {
            "id": 7,
            "text": "The health department and CDC did not immediately respond to requests for comment from The Hill."
        },
        {
            "id": 8,
            "text": "Democratic presidential nominee Joe Biden ’s campaign responded to the Politico reporting with a press release on Saturday, saying in an official statement that the alleged demands from top HHS communications officials “is only the latest example of Trump’s refusal to be honest about this pandemic.”"
        },
        {
            "id": 9,
            "text": "“When Donald Trump told Bob Woodward that he wanted to downplay the virus, this is the exact kind of repugnant betrayal that he meant,” Deputy Campaign Manager and Communications Director Kate Bedingfield said in the statement, referring to a March interview the president had with veteran journalist Bob Woodward in which he said he downplayed virus to avoid 'panic.'"
        },
        {
            "id": 10,
            "text": "“Instead of telling us the truth about the deadly seriousness of COVID-19, this report is further proof that the Trump Administration has been systematically putting political optics ahead of the safety of the American people,\" she added."
        },
        {
            "id": 11,
            "text": "Bedingfield went on to say in the press release that, “Donald Trump has concealed the truth for his perceived political benefit, in historic acts of malpractice — while failing to come to grips with the severity of this pandemic or the economic carnage it is creating, and refusing to be honest about what needs to be done to win this battle."
        },
        {
            "id": 12,
            "text": "“Trump’s failure has left us with six million infected, millions more unemployed, and the worst outbreak in the developed world,” she added."
        },
        {
            "id": 13,
            "text": "“We deserve so much better.”"
        },
        {
            "id": 14,
            "text": "The CDC’s Morbidity and Mortality Weekly Reports are developed by scientists at the department to inform medical officials and the general public about the spread of COVID-19 and who is most at risk."
        },
        {
            "id": 15,
            "text": "Last month, Politico reported that HHS was looking to spend $250 million on a communications campaign with a goal to “defeat despair and inspire hope” about the coronavirus pandemic, share “best practices for businesses to operate in the new normal and instill confidence to return to work and restart the economy,” provide accurate health information and build a “coalition of spokespeople” around the U.S."
        }
    ]
}