{
    "title": "Nancy Pelosi: Trump 'leaves us no choice' but to proceed with impeachment",
    "text": [
        {
            "id": 0,
            "text": "House Speaker Nancy Pelosi on Thursday announced that Democrats would proceed with articles of impeachment against President Trump."
        },
        {
            "id": 1,
            "text": "“His wrongdoing strikes at the very heart of our Constitution,” said Mrs. Pelosi, California Democrat."
        },
        {
            "id": 2,
            "text": "She formally requested that the House Judiciary Committee move forward with articles of impeachment based on allegations that Mr. Trump abused the power of his office and invited foreign interference in the 2020 election."
        },
        {
            "id": 3,
            "text": "“The president leaves us no choice but to act because he’s trying once again to corrupt the election for his own benefit,” she said."
        },
        {
            "id": 4,
            "text": "Early Thursday morning, Mr. Trump called on the Democrats to move faster on impeachment so it can proceed to the Republican-controlled Senate."
        },
        {
            "id": 5,
            "text": "“Therefore I say, if you are going to impeach me, do it now, fast, so we can have a fair trial in the Senate, and so that our Country can get back to business,” he tweeted."
        },
        {
            "id": 6,
            "text": "“We will have Schiff, the Bidens, Pelosi and many more testify, and will reveal, for the first time, how corrupt our system really is."
        },
        {
            "id": 7,
            "text": "I was elected to ‘Clean the Swamp,’ and that’s what I am doing!”"
        },
        {
            "id": 8,
            "text": "Democrats have just entered phase two of the impeachment proceedings with Wednesday’s House Judiciary Committee hearing on high crimes and misdemeanors."
        },
        {
            "id": 9,
            "text": "Mrs. Pelosi did not offer a timeline for when the House will vote on articles, but many of her members are hoping to move through this step quickly and reach a decision before the end of the year."
        },
        {
            "id": 10,
            "text": "Despite the packed legislative schedule that Democrats have for the rest of December, Majority Leader Steny H. Hoyer told reporters Wednesday that if the Judiciary Committee brings forward articles of impeachment quickly, then there will be time to get a vote before Congress leaves for the holiday break."
        },
        {
            "id": 11,
            "text": "The next big question for Democrats is what exactly will be included in the articles of impeachment."
        },
        {
            "id": 12,
            "text": "The allegations that the president pressured the Ukrainian president to investigate former Vice President Joseph R. Biden, a 2020 Democratic presidential front-runner, and his son Hunter Biden will be at the forefront of the articles."
        },
        {
            "id": 13,
            "text": "But the question remains what, if anything, else will be added."
        },
        {
            "id": 14,
            "text": "When she formally launched the impeachment inquiry in September, Mrs. Pelosi described it would work in an “umbrella approach” with the Ukraine investigation at the center but involving the investigations from five other committees, including the probes into alleged violations of the emoluments clauses and the president’s tax returns."
        },
        {
            "id": 15,
            "text": "On Wednesday, Judiciary Committee Chairman Jarrold L. Nadler said that the issues Democrats raised during their Mueller report probe could be included."
        },
        {
            "id": 16,
            "text": "Democrats are debating how far they should go — knowing that it could split support on some charges."
        },
        {
            "id": 17,
            "text": "White House press secretary Stephanie Grisham said Mrs. Pelosi and the Democrats “should be ashamed.”"
        },
        {
            "id": 18,
            "text": "She tweeted that Mr. Trump “has done nothing but lead our country - resulting in a booming economy, more jobs & a stronger military, to name just a few of his major accomplishments.”"
        },
        {
            "id": 19,
            "text": "“We look forward to a fair trial in the Senate,” she said."
        },
        {
            "id": 20,
            "text": "Trump campaign manager Brad Parscale said Democrats are trying to interfere with next year’s election."
        },
        {
            "id": 21,
            "text": "“We are less than a year away from Election Day 2020 and Democrats can’t possibly explain to the American people why they want to take the decision of who should be president out of the hands of voters,” Mr. Parscale said."
        },
        {
            "id": 22,
            "text": "“But impeaching the president has always been their goal, so they should just get on with it so we can have a fair trial in the Senate and expose The Swamp for what it is.”"
        },
        {
            "id": 23,
            "text": "He said Mrs. Pelosi, House Permanent Select Committee on Intelligence Chairman Adam B. Schiff and Hunter Biden should testify, “and then we can get back to the business of our country.”"
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        }
    ]
}