{
    "title": "Senate reflects on Boston tragedy, followed by Newtown and Va. Tech, before gun debate",
    "text": [
        {
            "id": 0,
            "text": "The Senate opened its session on Tuesday with reflections on the tragedy at the Boston Marathon, moments before it began debate on gun-control legislation that evoked the tragedies at Newtown, Conn., in December and Virginia Tech in 2007."
        },
        {
            "id": 1,
            "text": "“Americans are still reeling from the senseless violence at the Boston Marathon yesterday,” Majority Leader Harry Reid, Nevada Democrat, said from the floor."
        },
        {
            "id": 2,
            "text": "“Our nation is united in its sympathy for the victims of the attack and their families."
        },
        {
            "id": 3,
            "text": "Adding to the horror of the tragedy are the questions about who did this and why.”"
        },
        {
            "id": 4,
            "text": "Minority Leader Mitch McConnell, Kentucky Republican, said the “thoughts of every American” are with the people of Boston, after a pair of explosions before 3 p.m. on Monday killed three and injured about 150 people near the finish line of the iconic marathon."
        },
        {
            "id": 5,
            "text": "“Many who were looking forward to celebrating the achievement of a loved one yesterday woke today to the grim reality of facing the rest of their lives with a disfiguring injury,” Mr. McConnell said."
        },
        {
            "id": 6,
            "text": "“For them, yesterday’s attacks were the beginning of a long, difficult journey."
        },
        {
            "id": 7,
            "text": "Three others who lined up to encourage others, including an 8-year-old boy who was there to cheer on his dad at the finish line, lost their lives in the blast.”"
        },
        {
            "id": 8,
            "text": "The senator was referring to young Martin Richard, of Dorchester, Mass., whose mother and sister were seriously injured from the shrapnel-loaded explosions."
        },
        {
            "id": 9,
            "text": "Senators from Virginia followed the remarks by remembering the sixth anniversary of a another tragedy — the mass shooting at Virginia Tech, in which a lone gunman killed 32 people."
        },
        {
            "id": 10,
            "text": "Sen. Mark Warner, a Democrat, referenced the incident and the more recent school shooting in Connecticut, in which 20 children and six adults were killed, in making his case for stricter gun laws."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        }
    ]
}