{
    "title": "Republican senators warn Iranian leaders about limits of White House-negotiated nuclear deal",
    "text": [
        {
            "id": 0,
            "text": "A letter from Senate Republicans to Iranian leaders sparked a furious response from the White House on Monday, with administration officials accusing the GOP of seeking war and undermining its diplomatic efforts to stop Iran’s pursuit of a nuclear weapon."
        },
        {
            "id": 1,
            "text": "In their letter, 47 Senate Republicans, led by freshman Sen. Tom Cotton of Arkansas, told Tehran that any nuclear deal that isn’t submitted to Congress — as now seems likely — would not last into the next administration and would not represent the kind of historic, lasting agreement President Obama envisions."
        },
        {
            "id": 2,
            "text": "The flap comes just a week after Israeli Prime Minister Benjamin Netanyahu addressed Congress at the invitation of House Republicans and warned against striking a deal with Iran."
        },
        {
            "id": 3,
            "text": "Mr. Obama refused a meeting with Mr. Netanyahu, and the White House condemned the speech, deepening already clear battle lines between the White House and congressional Republicans over foreign policy."
        },
        {
            "id": 4,
            "text": "But that battle reached new heights Monday."
        },
        {
            "id": 5,
            "text": "Congressional Democrats said their GOP counterparts issued a “hard slap” to the face of the administration by communicating directly with Tehran, while Iranian leaders accused Republicans of standing in the way of peace."
        },
        {
            "id": 6,
            "text": "Mr. Obama said the Republicans now effectively have aligned themselves with Iranian leaders in trying to pour cold water on a potentially fruitful diplomatic endeavor."
        },
        {
            "id": 7,
            "text": "“I think it’s somewhat ironic to see some members of Congress wanting to make common cause with the hard-liners in Iran."
        },
        {
            "id": 8,
            "text": "It’s an unusual coalition,” Mr. Obama said just before a closed-door meeting with European Council President Donald Tusk."
        },
        {
            "id": 9,
            "text": "“I think what we’re going to focus on right now is actually seeing whether we can get a deal or not."
        },
        {
            "id": 10,
            "text": "And once we do — if we do — then we’ll be able to make the case to the American people, and I’m confident we’ll be able to implement it.”"
        },
        {
            "id": 11,
            "text": "Negotiations between Iran and the so-called P5+1 — the U.S., Russia, China, France, Germany and Britain — are scheduled to resume next week in Switzerland, with just under four months until a June 30 deadline, although that deadline already had been pushed back multiple times."
        },
        {
            "id": 12,
            "text": "The coalition hopes to halt Iran’s uranium-enrichment program for at least the next decade."
        },
        {
            "id": 13,
            "text": "In exchange, the U.S. and its partners gradually would begin to lighten economic sanctions against Tehran, though Congress would have to sign off on lifting many of the stiffest sanctions."
        },
        {
            "id": 14,
            "text": "Senate Majority Leader Mitch McConnell emphasized that point Sunday on “Face the Nation” on CBS, saying that while it’s obvious “the president doesn’t want us involved in this … he’s going to need us if he’s going to lift any of the existing sanctions."
        },
        {
            "id": 15,
            "text": "… He cannot work around Congress forever.”"
        },
        {
            "id": 16,
            "text": "Nevertheless, the administration has repeatedly maintained it can strike a deal with Iran without congressional approval, and has given no indication it will seek a vote on Capitol Hill."
        },
        {
            "id": 17,
            "text": "Amid the uncertainty and admissions by the administration that Iran can’t fully be trusted, Mr. Obama has maintained that the chances of an agreement are 50-50 at best."
        },
        {
            "id": 18,
            "text": "They now say those chances could be reduced as a result of Monday’s letter, which was a showing of near-unity among the Senate GOP in opposition to the president’s approach to Tehran."
        },
        {
            "id": 19,
            "text": "“We will consider any agreement regarding your nuclear-weapons program that is not approved by the Congress as nothing more than an executive agreement between President Obama and Ayatollah Khamenei,” the senators wrote in the open letter."
        },
        {
            "id": 20,
            "text": "“The next president could revoke such an executive agreement with the stroke of a pen and future Congresses could modify the terms of the agreement at any time.”"
        },
        {
            "id": 21,
            "text": "Reaction to the letter, from the White House, Tehran and among Capitol Hill Democrats, was fierce."
        },
        {
            "id": 22,
            "text": "White House press secretary Josh Earnest said Republicans are undermining the president’s efforts for a diplomatic agreement and, in essence, trying to set the stage for yet another war in the Middle East."
        },
        {
            "id": 23,
            "text": "“The president is trying to explore this diplomatic option with Iran, alongside our international partners, because it is in the best interest of the United States,” he told reporters."
        },
        {
            "id": 24,
            "text": "“The rush to war — or, at least, the rush to the military option that many Republicans are advocating — is not at all in the best interest of the United States.”"
        },
        {
            "id": 25,
            "text": "Meanwhile, the Iranian regime lumped congressional Republicans in with Mr. Netanyahu, painting them all as war-hungry politicians set on derailing the “peace” process at any cost."
        },
        {
            "id": 26,
            "text": "“In our view, this letter has no legal value and is mostly a propaganda ploy,” Iranian Foreign Minister Javad Zarif said in a report from Iran’s state news service."
        },
        {
            "id": 27,
            "text": "“It is very interesting that while negotiations are still in progress, and while no agreement has been reached, some political pressure groups are so afraid even of the prospect of an agreement that they resort to unconventional methods, unprecedented in diplomatic history."
        },
        {
            "id": 28,
            "text": "This indicates that, like Netanyahu, who considers peace as an existential threat, some are opposed to any agreement, regardless of its content.”"
        },
        {
            "id": 29,
            "text": "Mr. Zarif went on to say that Iran believes the next U.S. administration would be bound by any potential agreement, a misunderstanding that Mr. Cotton said the letter was in part intended to address."
        },
        {
            "id": 30,
            "text": "“Many Iran experts say that Iran’s leaders don’t understand our Constitution, so they need to understand that under our Constitution, Congress plays a very important role of improving international agreements, and any deal that is not approved by the Congress won’t be accepted by the Congress — now or in the future,” Mr. Cotton said Monday on “Fox and Friends.”"
        },
        {
            "id": 31,
            "text": "White House officials argued Monday that major diplomatic agreements typically aren’t cast aside as soon as a new president comes to power, though they did not deny that the deal could be abandoned as soon as January 2017."
        },
        {
            "id": 32,
            "text": "On Capitol Hill — where there’s been bipartisan support for slapping new economic sanctions on Iran even as nuclear negotiations continue — top Democrats condemned the letter."
        },
        {
            "id": 33,
            "text": "“This letter is a hard slap not only in the face of the United States but in the face of our allies,” Senate Minority Leader Harry Reid said on the Senate floor."
        },
        {
            "id": 34,
            "text": "“Let’s be very clear: Republicans are undermining our commander in chief while empowering the Ayatollahs.”"
        },
        {
            "id": 35,
            "text": "Mr. Reid also said that while he had disagreed with President George W. Bush on the Iraq War, he never stooped to writing a letter to undermine the commander in chief’s policy."
        },
        {
            "id": 36,
            "text": "However, Mr. Reid was accused of potentially traitorous remarks and undermining troop morale when, in a 2007 speech, he declared “this war is lost.”"
        },
        {
            "id": 37,
            "text": "The Bush White House called those comments “disturbing.”"
        },
        {
            "id": 38,
            "text": ""
        },
        {
            "id": 39,
            "text": ""
        },
        {
            "id": 40,
            "text": ""
        },
        {
            "id": 41,
            "text": ""
        },
        {
            "id": 42,
            "text": ""
        }
    ]
}