{
    "title": "Mike Pence forced to defend his stay at Trump property in Ireland",
    "text": [
        {
            "id": 0,
            "text": "Vice President Mike Pence is meeting Tuesday with leaders in Dublin after staying overnight at a Trump property on the other side of Ireland, prompting Democrats to accuse him of “funneling” taxpayer money to his boss."
        },
        {
            "id": 1,
            "text": "Mr. Pence flew from an airport near Mr. Trump’s golf club in Doonbeg, on the west coast, to meet with Taoiseach Leo Varadkar and other dignitaries 180 miles away in the east-coast capital."
        },
        {
            "id": 2,
            "text": "The vice president and second lady are scheduled to fly back to Doonbeg later Tuesday, raising eyebrows from Democrats who are worried that President Trump is profiting from the presidency."
        },
        {
            "id": 3,
            "text": "“You took an oath to the Constitution, not to @realDonaldTrump,” Rep. Ted Lieu, California Democrat, tweeted."
        },
        {
            "id": 4,
            "text": "“Funneling taxpayer money to @POTUS by staying at this Trump resort is sooooooo corrupt.”"
        },
        {
            "id": 5,
            "text": "Mr. Pence’s chief of staff, Marc Short, dismissed the criticism, saying the odd logistics were a byproduct of Mr. Trump dispatching Mr. Pence to Poland at the last minute because of Hurricane Dorian."
        },
        {
            "id": 6,
            "text": "Mr. Pence initially planned to finish a European swing at Doonbeg to explore his family roots."
        },
        {
            "id": 7,
            "text": "His team had to rearrange the order of stops and find an overnight hotel for his entourage ahead of the Dublin meetings, according to Mr. Short."
        },
        {
            "id": 8,
            "text": "Mr. Trump and family members stayed at their Doonbeg residence on official business recently, so the property had been fully vetted."
        },
        {
            "id": 9,
            "text": "The president did not order Mr. Pence to stay at his property, according to Mr. Short."
        },
        {
            "id": 10,
            "text": "“I don’t think it was a request, like a command,” he told reporters."
        },
        {
            "id": 11,
            "text": "“I think that it was a suggestion."
        },
        {
            "id": 12,
            "text": "…"
        },
        {
            "id": 13,
            "text": "It’s like, ‘Well, you should stay at my place.’"
        },
        {
            "id": 14,
            "text": "“Yet Mr. Trump didn’t waive the bill."
        },
        {
            "id": 15,
            "text": "Taxpayers are still paying the tab, though Mr. Pence is personally paying for his mother and sister, who came along."
        },
        {
            "id": 16,
            "text": "Mr. Trump insists he is losing money as president, because he can’t explore blockbuster deals, though Democrats worry he hasn’t properly accounted for visits from foreign dignitaries to his hotels and clubs."
        },
        {
            "id": 17,
            "text": "Critics also find it unseemly that he spends so much time at his golf clubs while president."
        },
        {
            "id": 18,
            "text": "House Democrats last week said they will investigate Mr. Trump’s pitch to hold next year’s Group of Seven summit at his Florida club, Trump National Doral Miami."
        },
        {
            "id": 19,
            "text": "Mr. Pence, meanwhile, is scheduled to discuss Brexit negotiations with Irish leaders."
        },
        {
            "id": 20,
            "text": "Ireland’s foreign minister, Simon Coveney, on Monday said Ireland respects the U.K.’s decision to leave the European Union, but they fear “disruption” at the northern border."
        },
        {
            "id": 21,
            "text": "He said Ireland cannot return to a hard border full of inspections, calling it a “huge issue.”"
        },
        {
            "id": 22,
            "text": "Mr. Pence thanked Mr. Coveney for “his candor” and said the U.S. will work with the U.K. to ensure that any Brexit deal does not violate the Good Friday agreements between the British and Irish governments."
        },
        {
            "id": 23,
            "text": "House Speaker Nancy Pelosi last month called the agreement the “bedrock of peace in Northern Ireland and as a beacon of hope for the entire world.”"
        },
        {
            "id": 24,
            "text": "“Whatever form it takes, Brexit cannot be allowed to imperil the Good Friday Agreement, including the seamless border between the Irish Republic and Northern Ireland, especially now, as the first generation born into the hope of Good Friday 21 years ago comes into adulthood,” she said."
        },
        {
            "id": 25,
            "text": "“We cannot go back.”"
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": ""
        }
    ]
}