{
    "title": "Bernie wins again",
    "text": [
        {
            "id": 0,
            "text": "Sanders “believes in an inflexible, ideological revolution that leaves out most Democrats, not to mention most Americans,\" Buttigieg told supporters after the race was called."
        },
        {
            "id": 1,
            "text": "Buttigieg continued, “That is the choice in front of us."
        },
        {
            "id": 2,
            "text": "We can prioritize either ideological purity or inclusive victory."
        },
        {
            "id": 3,
            "text": "We can either call people names online or we can call them into our movement."
        },
        {
            "id": 4,
            "text": "We can either tighten a narrow and hardcore base or open the tent to a new and broad and big-hearted American coalition.\""
        },
        {
            "id": 5,
            "text": "Sanders' decisive victory overshadowed a long caucus-reporting process in Nevada, with less than half of precincts reporting as of 9:15 p.m. in the West, more than nine hours after the caucuses opened."
        },
        {
            "id": 6,
            "text": "At a minimum, the reporting process was expected to take hours, potentially lasting into late Saturday or spilling into Sunday."
        },
        {
            "id": 7,
            "text": "After caucusing concluded Saturday, a precinct chair in a rural area said it took two hours to report results because the initial hotline number he was given didn’t work and repeatedly gave a busy signal."
        },
        {
            "id": 8,
            "text": "The chair called a help number next and was told the party was having “problems” with the original number and gave him a new reporting number."
        },
        {
            "id": 9,
            "text": "After initially being told by an automated operator that the hold time would be 30 minutes, the chair got through in five minutes."
        },
        {
            "id": 10,
            "text": "But he said he heard that other precinct chairs in Las Vegas and at rural sites were having similar problems reporting their numbers."
        },
        {
            "id": 11,
            "text": "While Sanders victory was decisive, the race for second place appears much closer between Biden and Buttigieg."
        },
        {
            "id": 12,
            "text": "Elizabeth Warren was lagging behind them."
        },
        {
            "id": 13,
            "text": "Sanders was overwhelmingly the top choice for young voters, winning roughly six-in-10 of those under age 45."
        },
        {
            "id": 14,
            "text": "And he’s also winning about half of Hispanic and Latino caucus-goers, far more than any other candidate."
        },
        {
            "id": 15,
            "text": "For Biden, the one-time frontrunner both nationally and in Nevada, the importance of the contest was especially high."
        },
        {
            "id": 16,
            "text": "Embarrassing finishes in the first two states left his campaign reeling and eroded his once-overwhelming advantage in South Carolina, the next primary state."
        },
        {
            "id": 17,
            "text": "A third washout here could have been too much for his would-be supporters to endure, presaging a collapse in South Carolina and on Super Tuesday."
        },
        {
            "id": 18,
            "text": "Sanders has rapidly overtaken Biden in national polls, and he is now running far ahead of the rest of the field."
        },
        {
            "id": 19,
            "text": "In the race between Biden and Buttigieg, Nevada could point to an alternative moderate to oppose Sanders and Mike Bloomberg, the centrist billionaire who is not competing here but will factor significantly in the March primaries."
        },
        {
            "id": 20,
            "text": "Buttigieg, who finished alongside Sanders at the top in Iowa and ran second to him in New Hampshire, was being tested for the first time in a state with a significant number of people of color, with whom he's made little headway."
        },
        {
            "id": 21,
            "text": "The same was true of Amy Klobuchar, who has only recently begun developing a national campaign organization after a surprising, third-place finish in New Hampshire."
        },
        {
            "id": 22,
            "text": "Warren, who drew praise and raised millions of dollars after her evisceration of Bloomberg in Wednesday’s debate, could revive her candidacy with a strong result."
        },
        {
            "id": 23,
            "text": "It was unclear, however, how much that debate would factor in the outcome."
        },
        {
            "id": 24,
            "text": "Nearly 75,000 Nevadans cast early ballots ahead of the debate."
        },
        {
            "id": 25,
            "text": "In 2016, when Nevada had not yet instituted early caucusing, about 84,000 people participated."
        },
        {
            "id": 26,
            "text": "The caucuses mark a turn in the campaign toward a more nationalized primary, with South Carolina — the last of the four early voting states — coming Feb. 29, just three days before Super Tuesday."
        },
        {
            "id": 27,
            "text": "The candidates were already looking ahead in recent days, campaigning not only in Nevada, but in nearby Super Tuesday states such as California, Colorado and Utah."
        },
        {
            "id": 28,
            "text": "Meanwhile, candidates intensified their efforts to raise the money that they'll need to compete across multiple states."
        },
        {
            "id": 29,
            "text": "Biden, Buttigieg, Klobuchar and Warren are all strained financially."
        },
        {
            "id": 30,
            "text": "Klobuchar was planning to hold a fundraiser in Minneapolis on Saturday night."
        },
        {
            "id": 31,
            "text": "Buttigieg raised money last week in California."
        },
        {
            "id": 32,
            "text": "The high number of early votes in Nevada was viewed by Democrats as an encouraging development after turnout fell below expectations in Iowa."
        },
        {
            "id": 33,
            "text": "A majority of early voters were first-time caucus-goers, a positive sign for a party seeking evidence of enthusiasm to defeat President Donald Trump."
        },
        {
            "id": 34,
            "text": "The Nevada Democratic Party said Saturday that more than 10,000 Nevadans registered to vote as Democrats during the four-day early voting period, expanding the party’s registration advantage in the state."
        },
        {
            "id": 35,
            "text": "But the encouraging turnout was tempered by concerns about the process."
        },
        {
            "id": 36,
            "text": "POLITICO NEWSLETTERS 2020 Elections Unpacking the national conventions and the race for the White House."
        },
        {
            "id": 37,
            "text": ""
        },
        {
            "id": 38,
            "text": ""
        },
        {
            "id": 39,
            "text": ""
        },
        {
            "id": 40,
            "text": "At Cheyenne High School in Las Vegas, Biden was circumspect when asked about his confidence the caucuses running smoothly."
        },
        {
            "id": 41,
            "text": "“I’ll tell you that after we get it done."
        },
        {
            "id": 42,
            "text": "Look, this is a complicated process,” Biden said."
        },
        {
            "id": 43,
            "text": "“I hope it works out.”"
        },
        {
            "id": 44,
            "text": "To get more precinct captains in Nevada, the Steyer campaign offered all their staffers who were in Nevada free plane tickets and a hotel to bring a friend to the state to serve in that capacity, according to a Steyer campaign official and another person familiar with the matter."
        },
        {
            "id": 45,
            "text": "Some of the staffers, but not a majority, took the campaign up on the offer, according to the official."
        },
        {
            "id": 46,
            "text": "Sanders adviser Jeff Weaver said Saturday morning the campaign had “not been asked to provide people to run precincts, but our precinct captains are prepared to help out whenever party volunteers are not present.”"
        },
        {
            "id": 47,
            "text": "Keion Cherry, a precinct chair at Valley High School, said, “I’ve been definitely trying to get any volunteers."
        },
        {
            "id": 48,
            "text": "We had to get some of the precinct captains to be volunteers.”"
        },
        {
            "id": 49,
            "text": "Cherry added that he had “called my superiors … and they were not responding.”"
        },
        {
            "id": 50,
            "text": "Molly Forgey, communications director for the state Democratic party, said the party had “been recruiting and training volunteers all the way through this morning to ensure we have the capacity we need and we are confident in having the necessary volunteer numbers to cover caucus sites today.”"
        },
        {
            "id": 51,
            "text": "Forgey said the party has thousands of volunteers and that shortages were not occurring at a majority of sites."
        },
        {
            "id": 52,
            "text": "“It's common and not unusual for campaign volunteers to help with running precincts on caucus day — this happened in 2016 and in 2008,” Forgey said."
        },
        {
            "id": 53,
            "text": ""
        }
    ]
}