{
    "title": "White House makes formal veto threat against Keystone, ACA bills",
    "text": [
        {
            "id": 0,
            "text": "The White House made formal veto threats Wednesday against House bills that would allow the construction of the Keystone XL pipeline and change a key mandate under the Affordable Care Act, signaling a rocky start to the 114th Congress."
        },
        {
            "id": 1,
            "text": "The House version — which is identical to the one just introduced in the Senate on Tuesday by Sens. John Hoeven (N.D.) and Joe Manchin (D-W.Va.) — \"conflicts with longstanding Executive branch procedures regarding the authority of the President and prevents the thorough consideration of complex issues that could bear on U.S. national interests (including serious security, safety, environmental, and other ramifications),\" reads the statement, which was released by the Office of Management and Budget."
        },
        {
            "id": 2,
            "text": "\"If presented to the President, his senior advisors would recommend that he veto this bill,\" it adds."
        },
        {
            "id": 3,
            "text": "The president also laid down the gauntlet when it comes to House Republicans' latest effort to chip away at his signature health-care law."
        },
        {
            "id": 4,
            "text": "Currently the Affordable Care Act requires employers to provide health insurance if they have at least 50 full-time workers, which is defined by anyone working 30 hours a week or more."
        },
        {
            "id": 5,
            "text": "The Save American Workers Act would change the definition of a full-time employee to someone working at least 40 hours a week."
        },
        {
            "id": 6,
            "text": "Obama will reject the measure \"because it would significantly increase the deficit, reduce the number of Americans with employer-based health insurance coverage, and create incentives for employers to shift their employees to part-time work – causing the problem it intends to solve.\""
        },
        {
            "id": 7,
            "text": "\"Rather than attempting once again to repeal or undermine the Affordable Care Act, which the House has tried to do over 50 times, it is time for the Congress to stop fighting old political battles and join the President in forwarding an agenda focused on providing greater economic opportunity and security for middle class families and all those working to be a part of the middle class,\" the Statement of Administration Policy adds."
        },
        {
            "id": 8,
            "text": "During his regular press briefing Wednesday, House Speaker John Boehner (R-Ohio) questioned why the president was starting out the new session on such an adversarial note."
        },
        {
            "id": 9,
            "text": "\"Too many Americans are out of work, too many are working harder just to keep pace in the face of rising costs and frankly, we’ve got an awful lot of work to do,\" Boehner said."
        },
        {
            "id": 10,
            "text": "\"Unfortunately, by threatening two of these bipartisan jobs bills, the president essentially is telling the American people he really doesn’t care what they think."
        },
        {
            "id": 11,
            "text": "Well, our commitment is to stand up for the American people and their priorities, and it’s a commitment we will not break.”"
        },
        {
            "id": 12,
            "text": "Brendan Buck, a spokesman for House Ways and Means Committee Chairman Paul Ryan (R-Wisc.), noted in an e-mail that 18 House Democrats voted for a similar health care bill last Congress."
        },
        {
            "id": 13,
            "text": "A companion bill in the Senate is sponsored by Sens. Susan Collins (R-Maine) and Joe Donnelly (D-Ind.)."
        },
        {
            "id": 14,
            "text": "Polls show a clear majority of Americans support approving the Keystone pipeline, with 60 percent in a November USA Today survey saying Obama and Congress should authorize the project; 25 percent said it should not and the rest were unsure."
        },
        {
            "id": 15,
            "text": "Separate polling finds most Republicans, independents, and moderate or conservative Democrats support the pipeline, liberal Democrats and those with the most education more opposed."
        },
        {
            "id": 16,
            "text": "Along with overall public support, Americans are bullish about the pipeline’s job-creation prospects."
        },
        {
            "id": 17,
            "text": "More than eight in 10 respondents in a Washington Post-ABC News poll said the pipeline would create a significant number of jobs, while just under half thought it would pose a significant risk to the environment."
        },
        {
            "id": 18,
            "text": ""
        }
    ]
}