{
    "title": "Senator Klobuchar joins Democratic presidential field",
    "text": [
        {
            "id": 0,
            "text": "U.S. Senator Amy Klobuchar entered the 2020 presidential race on Sunday, becoming the first moderate in an increasingly crowded field of Democrats vying to challenge Republican President Donald Trump."
        },
        {
            "id": 1,
            "text": "Klobuchar becomes the fifth U.S. senator to announce her candidacy, and the fourth woman in the chamber."
        },
        {
            "id": 2,
            "text": "Klobuchar, 58, now in her third six-year term as a senator for Minnesota, will seek to position herself as a contrast to Trump, who is expected to be the Republican candidate in the November 2020 election, focusing on both policy differences but also style and tact."
        },
        {
            "id": 3,
            "text": "“I stand before you as the granddaughter of an iron ore miner, the daughter of a teacher and a newspaperman, the first woman elected to the United States Senate from the state of Minnesota, to announce my candidacy for president of the United States,” Klobuchar said."
        },
        {
            "id": 4,
            "text": "A large crowd assembled in Minnesota on an island in the middle of the Mississippi River, despite a heavy snowfall and 14 degree Fahrenheit (minus 10 Celsius) temperatures."
        },
        {
            "id": 5,
            "text": "Klobuchar’s announcement came amid several news reports of high staff turnover in her Senate office with workers complaining of having to do personal chores, making it difficult to hire high-level campaign strategists."
        },
        {
            "id": 6,
            "text": "A former prosecutor and corporate attorney, Klobuchar joins a list of Democratic hopefuls that includes fellow Senators Cory Booker of New Jersey, Kamala Harris of California, Kirsten Gillibrand of New York and Elizabeth Warren of Massachusetts."
        },
        {
            "id": 7,
            "text": "Warren went to Iowa to campaign on Sunday after formally launching her bid on Saturday."
        },
        {
            "id": 8,
            "text": "Booker also spent the weekend in the Midwestern farm state."
        },
        {
            "id": 9,
            "text": "“I’m tired of a government that works for a thin slice at the top and nobody else,” said Warren, appearing at the University of Iowa."
        },
        {
            "id": 10,
            "text": "“It’s pretty straightforward to me, not much fancier than that.”"
        },
        {
            "id": 11,
            "text": "Booker also spent the weekend in the Midwestern farm state."
        },
        {
            "id": 12,
            "text": "Klobuchar gained national attention in 2018 when she sparred with Brett Kavanaugh during Senate hearings on his Supreme Court nomination."
        },
        {
            "id": 13,
            "text": "Her questions earned her recognition in Democratic circles for working to advance the #MeToo movement against sexual harassment and assault."
        },
        {
            "id": 14,
            "text": "But the senator will have work to do to build a national profile."
        },
        {
            "id": 15,
            "text": "She barely registers in early opinion polls of potential Democratic candidates."
        },
        {
            "id": 16,
            "text": "Klobuchar won her most recent Senate race in November with more than 60 percent of the vote."
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "But she raised only about $7.4 million, a relatively small amount compared with Senate candidates in more competitive races."
        },
        {
            "id": 19,
            "text": "By comparison, Warren raised $35 million in the same period."
        },
        {
            "id": 20,
            "text": "Klobuchar hopes her moderate policies and strong electoral record in Minnesota will help her win back states Trump took from Democrats in the 2016 White House contest, including nearby Iowa, Wisconsin and Michigan, Wisconsin, as well as Pennsylvania."
        },
        {
            "id": 21,
            "text": "Klobuchar was the first 2020 Democratic presidential hopeful to use her launch speech to vow action on digital issues like privacy, saying “big tech companies” are misusing personal data."
        },
        {
            "id": 22,
            "text": "Slideshow ( 5 images )\n\n“Our laws need to be as sophisticated as the people who are breaking them,” she said."
        },
        {
            "id": 23,
            "text": "“We must revamp our nation’s cybersecurity and guarantee net neutrality.”"
        },
        {
            "id": 24,
            "text": "Klobuchar began her foray into Minnesota politics by advocating for better access to healthcare for babies and new mothers after her own daughter was born with health complications, a personal narrative she is likely to use in the debate about the future of the nation’s healthcare system."
        },
        {
            "id": 25,
            "text": "Klobuchar endorsed universal healthcare in her announcement speech, an issue that will be heavily debated during the Democratic nominating race."
        },
        {
            "id": 26,
            "text": "She said she supports increasing “shared prosperity,” adding, “We won’t get there if people can’t afford their health care and that means getting to universal health care and bringing down the costs of prescription drugs.”"
        },
        {
            "id": 27,
            "text": "Klobuchar's legislative efforts have focused on antitrust oversight, agriculture and voter security."
        },
        {
            "id": 28,
            "text": "She recently pushed for Senate investigations into whether Facebook Inc FB.O broke the law when it resisted oversight on how Russians used its platform to meddle in the 2016 presidential election."
        },
        {
            "id": 29,
            "text": "She has been measured in her criticism of Trump, attacking the effects of his trade tariffs on farmers but avoiding more explosive issues like immigration and gun control."
        },
        {
            "id": 30,
            "text": "Klobuchar is expected to focus her early presidential campaign on Iowa, which borders Minnesota and holds the nation’s first nominating contest in February 2020."
        },
        {
            "id": 31,
            "text": "An aggressive push in Iowa and a win there in 2008 helped catapult Barack Obama from underdog status to the Democratic nomination and eventual victory in that year’s presidential election."
        }
    ]
}