{
    "title": "George Floyd murder: Minneapolis police to face US federal probe",
    "text": [
        {
            "id": 0,
            "text": "A US federal investigation has been launched into policing practices in the city of Minneapolis, a day after one of its former officers was convicted of the murder of George Floyd."
        },
        {
            "id": 1,
            "text": "The justice department will look at whether there has been a pattern \"of unconstitutional or unlawful policing\", Attorney General Merrick Garland said."
        },
        {
            "id": 2,
            "text": "It follows national outrage over the killing of Mr Floyd by Derek Chauvin."
        },
        {
            "id": 3,
            "text": "The former officer was convicted of all charges against him on Tuesday."
        },
        {
            "id": 4,
            "text": "Chauvin was filmed kneeling on Mr Floyd's neck for more than nine minutes during an arrest in May 2020."
        },
        {
            "id": 5,
            "text": "Mr Floyd, an unarmed African American, was pronounced dead an hour later."
        },
        {
            "id": 6,
            "text": "His death sparked protests across the US and worldwide, and calls for police reform."
        },
        {
            "id": 7,
            "text": "Tuesday's verdict has been widely welcomed in a country where police are rarely convicted - if they are charged at all - over deaths in custody."
        },
        {
            "id": 8,
            "text": "But Mr Garland told reporters the verdict would not \"address potentially systemic policing issues in Minneapolis\"."
        },
        {
            "id": 9,
            "text": "The attorney general said the investigation would \"include a comprehensive review of the Minneapolis Police Department's policies, training, supervision and use-of-force investigations.\""
        },
        {
            "id": 10,
            "text": "It will also examine \"whether its treatment of those with behavioural health disabilities is unlawful\", while looking at the \"effectiveness of current systems of accountability and whether other mechanisms are needed to ensure constitutional and lawful policing\"."
        },
        {
            "id": 11,
            "text": "Mr Garland said both the community and law enforcement would have to take part if the investigation were to be a success, and he had already started reaching out to both."
        },
        {
            "id": 12,
            "text": "If unlawful patterns or practices were found, he promised to issue a public report and bring a civil lawsuit."
        },
        {
            "id": 13,
            "text": "By Jessica Lussenhop, BBC News, New York"
        },
        {
            "id": 14,
            "text": "This process happened after high-profile deaths of black men at the hands of police in Ferguson, Missouri, as well as in Chicago and Baltimore."
        },
        {
            "id": 15,
            "text": "At the end of its investigation, the Department of Justice (DoJ) issues a report that often contains details that the public would otherwise have no access to."
        },
        {
            "id": 16,
            "text": "They may look at arrest statistics for any evidence of racial bias, or for signs of racism in emails sent between officers."
        },
        {
            "id": 17,
            "text": "The report leads to an agreement - a consent decree - between the DoJ and the department to fix specific, troublesome practices."
        },
        {
            "id": 18,
            "text": "The city of Minneapolis could face real, legal consequences if benchmarks laid out in the agreement are not met."
        },
        {
            "id": 19,
            "text": "However, the process can be slow, bureaucratic and largely invisible to the community, and sometimes departments operate under federal monitoring for years."
        },
        {
            "id": 20,
            "text": "And past experiences show that these agreements do not lead to an end to controversial incidents."
        },
        {
            "id": 21,
            "text": "Chauvin will face sentencing in about eight weeks for his conviction."
        },
        {
            "id": 22,
            "text": "He was found guilty of three counts carrying a combined total of 75 years in prison but Minnesota guidelines recommend sentences be served concurrently, meaning Chauvin would face a maximum of 40 years in prison for the most serious charge, of second-degree murder."
        },
        {
            "id": 23,
            "text": "However, sentencing guidelines also recommend less time for offenders like Chauvin with no previous convictions."
        },
        {
            "id": 24,
            "text": "He is being held in solitary confinement at a maximum-security prison near St Paul, Minnesota."
        },
        {
            "id": 25,
            "text": "A spokeswoman for the facility told the BBC's US partner CBS News that Chauvin was being kept in isolation for his own safety."
        },
        {
            "id": 26,
            "text": "He is locked up 23 hours a day in a small cell that contains a bed, a combination toilet and sink, and a tiny shower, according to the New York Times."
        },
        {
            "id": 27,
            "text": "Guards are expected to look in on prisoners every 30 minutes in the cells, which are also monitored by cameras."
        },
        {
            "id": 28,
            "text": "Three other Minneapolis police officers who were involved in Floyd's arrest - Tou Thao, J Alexander Kueng and Thomas Lane - will face trial together in August on charges of aiding and abetting murder and manslaughter."
        },
        {
            "id": 29,
            "text": "The conviction has been hailed as a watershed moment, and welcomed by thousands who took to the streets."
        },
        {
            "id": 30,
            "text": "\"Being able to know there is justice for African American people, just people of colour, period, in this world,\" Philonise Floyd, Mr Floyd's brother, said."
        },
        {
            "id": 31,
            "text": "\"This is monumental."
        },
        {
            "id": 32,
            "text": "This is historic."
        },
        {
            "id": 33,
            "text": "This is a pivotal moment in history.\""
        },
        {
            "id": 34,
            "text": "But many point to the fact that this is just one case."
        },
        {
            "id": 35,
            "text": "The fatal shooting of Duante Wright - another unarmed African American man - during a traffic stop on 11 April has once again highlighted the fact that black people are more likely to be shot dead by police in the US than people of other races."
        },
        {
            "id": 36,
            "text": "The video of Mr Floyd's killing last May prompted outrage around the world, setting off days of demonstrations which spread across the entire US, with reformation of police departments at the heart of protesters' demands."
        },
        {
            "id": 37,
            "text": "Former President Donald Trump positioned himself as a defender of police, though he also signed an executive order asking law enforcement departments to improve officers' training and create a database to track misconduct."
        },
        {
            "id": 38,
            "text": "His successor Joe Biden has struck a different tone, welcoming the conviction of Chauvin on Tuesday, saying it \"can be a giant step forward in the march toward justice in America\"."
        }
    ]
}