{
    "title": "Emails in Anthony Weiner Inquiry Jolt Hillary Clinton’s Campaign",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — The presidential campaign was rocked on Friday after federal law enforcement officials said that emails pertinent to the closed investigation into Hillary Clinton’s private email server were discovered on a computer belonging to Anthony D. Weiner, the estranged husband of a top Clinton aide."
        },
        {
            "id": 1,
            "text": "In a letter to Congress, the F.B.I. director, James B. Comey, said the emails had surfaced in an unrelated case, which law enforcement officials said was an F.B.I. investigation into illicit text messages from Mr. Weiner to a 15-year-old girl in North Carolina."
        },
        {
            "id": 2,
            "text": "Mr. Weiner, a former Democratic congressman from New York, is married to Huma Abedin, the top aide."
        },
        {
            "id": 3,
            "text": "Mr. Comey's letter said that the F.B.I. would review the emails to determine if they improperly contained classified information, which is tightly controlled by the government."
        },
        {
            "id": 4,
            "text": "Senior law enforcement officials said that it was unclear if any of the emails were from Mrs. Clinton’s private server."
        },
        {
            "id": 5,
            "text": "And while Mr. Comey said in his letter that the emails “appear to be pertinent,” the F.B.I. had not yet examined them."
        },
        {
            "id": 6,
            "text": "By the end of a day that brought stinging criticism of Mr. Comey from both Democrats and Republicans, he appeared on the defensive, saying in an internal email to bureau employees that he had felt obligated to inform Congress, and “we don’t know the significance of this newly discovered collection of emails.’’"
        },
        {
            "id": 7,
            "text": "The new development in the saga over Mrs. Clinton’s handling of classified information came months after the F.B.I. closed the investigation without charging Mrs. Clinton."
        },
        {
            "id": 8,
            "text": "The announcement, less than two weeks before the election, left Mrs. Clinton’s team furious and scrambling for explanations while bolstering the spirits of Donald J. Trump after a wave of controversies and Republican defections had led many to write him off."
        },
        {
            "id": 9,
            "text": "“We are calling on the F.B.I. to release all the information that it has,” Mrs. Clinton said adamantly in an evening news conference that took issue with Mr. Comey for making the disclosure so close to the election."
        },
        {
            "id": 10,
            "text": "“Let’s get it out.”"
        },
        {
            "id": 11,
            "text": "Mr. Trump was ebullient."
        },
        {
            "id": 12,
            "text": "“Perhaps, finally, justice will be done,” he declared at a campaign rally in New Hampshire."
        },
        {
            "id": 13,
            "text": "A senior law enforcement official said that tens of thousands of emails belonging to Ms. Abedin were on Mr. Weiner’s laptop, which the F.B.I. had obtained as part of its investigation into Mr. Weiner."
        },
        {
            "id": 14,
            "text": "About a month ago, a person familiar with the investigation said, F.B.I. agents seized the laptop as well as Mr. Weiner’s iPad and cellphone."
        },
        {
            "id": 15,
            "text": "Mr. Comey said in his letter to Congress that he did not know how long it would take to review the emails."
        },
        {
            "id": 16,
            "text": "Law enforcement officials said they did not know whether any were duplicates of emails discovered in the earlier investigation."
        },
        {
            "id": 17,
            "text": "In the letter, the F.B.I. director, James B. Comey, said that new emails had surfaced in a case unrelated to the closed investigation into whether Hillary Clinton or her aides had mishandled classified information, and that the messages “appear to be pertinent to the investigation.”"
        },
        {
            "id": 18,
            "text": "Mr. Trump has fallen behind Mrs. Clinton in most national polls and in many key states."
        },
        {
            "id": 19,
            "text": "Polls have been tightening in recent days, however, as Republicans have started returning to their party roots during the final stretch of the race."
        },
        {
            "id": 20,
            "text": "An emboldened Mr. Trump seized on the F.B.I. action on Friday at his rally in New Hampshire."
        },
        {
            "id": 21,
            "text": "To cheers of “lock her up” from his supporters, Mr. Trump said: “Hillary Clinton’s corruption is on a scale we have never seen before."
        },
        {
            "id": 22,
            "text": "We must not let her take her criminal scheme into the Oval Office.”"
        },
        {
            "id": 23,
            "text": "After deriding the F.B.I. for weeks as inept and corrupt, Mr. Trump went on to praise the law enforcement agency."
        },
        {
            "id": 24,
            "text": "“I have great respect for the fact that the F.B.I. and the D.O.J. are now willing to have the courage to right the horrible mistake that they made,” Mr. Trump said, referring also to the Department of Justice."
        },
        {
            "id": 25,
            "text": "“This was a grave miscarriage of justice that the American people fully understand."
        },
        {
            "id": 26,
            "text": "It is everybody’s hope that it is about to be corrected.”"
        },
        {
            "id": 27,
            "text": "The Clinton campaign called on Mr. Comey to provide information beyond what was put forth in the letter."
        },
        {
            "id": 28,
            "text": "“Director Comey’s letter refers to emails that have come to light in an unrelated case, but we have no idea what those emails are and the director himself notes they may not even be significant,” said John D. Podesta, the chairman of Mrs. Clinton’s campaign."
        },
        {
            "id": 29,
            "text": "He added: “It is extraordinary that we would see something like this just 11 days out from a presidential election.”"
        },
        {
            "id": 30,
            "text": "Asked in an interview on CNN about Ms. Abedin’s involvement, Brian Fallon, a spokesman for Mrs. Clinton, demurred."
        },
        {
            "id": 31,
            "text": "“The facts of the matter is stuff that is unknown to us,” Mr. Fallon said."
        },
        {
            "id": 32,
            "text": "The “October surprise” confounded leading Democrats who suddenly found themselves on the defensive."
        },
        {
            "id": 33,
            "text": "“This is particularly troubling since so many questions are unanswered,” said Senator Dianne Feinstein, Democrat of California."
        },
        {
            "id": 34,
            "text": "“It’s unclear whether these emails have already been reviewed or if Secretary Clinton sent or received them."
        },
        {
            "id": 35,
            "text": "In fact, we don’t even know if the F.B.I. has these emails in its possession.”"
        },
        {
            "id": 36,
            "text": "Donna Brazile, the interim chairwoman of the Democratic National Committee, demanded more information from Mr. Comey about his next steps and expressed concern about the agency interfering with the election."
        },
        {
            "id": 37,
            "text": "“The F.B.I. has a solemn obligation to remain neutral in political matters — even the faintest appearance of using the agency’s power to influence our election is deeply troubling,” Ms. Brazile said."
        },
        {
            "id": 38,
            "text": "For Republicans who have struggled to defend Mr. Trump amid his comments about women and conspiracy theories about a rigged election, the opportunity to revisit a controversy that has dogged Mrs. Clinton was a welcome gift."
        },
        {
            "id": 39,
            "text": "The Republican National Committee cheered the new attention on Mrs. Clinton’s emails as a potential turning point in the race."
        },
        {
            "id": 40,
            "text": "“The F.B.I.’s decision to reopen their criminal investigation into Hillary Clinton’s secret email server just 11 days before the election shows how serious this discovery must be,” said Reince Priebus, the Republican committee chairman, arguing that the Democratic nominee should be disqualified from seeking the presidency."
        },
        {
            "id": 41,
            "text": "“This stunning development raises serious questions about what records may not have been turned over and why, and whether they show intent to violate the law.”"
        },
        {
            "id": 42,
            "text": "Speaker Paul D. Ryan, who has been critical of Mr. Trump, assailed Mrs. Clinton and said that she should no longer be allowed to receive classified briefings."
        },
        {
            "id": 43,
            "text": "“Hillary Clinton has nobody but herself to blame,” Mr. Ryan said in an emailed statement."
        },
        {
            "id": 44,
            "text": "“She was entrusted with some of our nation’s most important secrets, and she betrayed that trust by carelessly mishandling highly classified information.”"
        },
        {
            "id": 45,
            "text": "After defending her email practices for months, Mrs. Clinton sought to put the issue behind her this year, eventually apologizing and acknowledging that using a private server was a mistake."
        },
        {
            "id": 46,
            "text": "During the presidential debates with Mr. Trump, she tried to avoid the subject and accused Mr. Trump of putting national security at risk by inviting Russian hackers to meddle in the election."
        },
        {
            "id": 47,
            "text": "Mrs. Clinton and her staff expressed relief in July when Mr. Comey announced that the F.B.I. had closed the investigation after determining that no one should face criminal charges."
        },
        {
            "id": 48,
            "text": "But he did criticize Mrs. Clinton and her aides for what he termed the “extremely careless” handling of sensitive information, leaving an opportunity for Republicans to continue hammering her for bad judgment."
        },
        {
            "id": 49,
            "text": "The involvement of Ms. Abedin and Mr. Weiner in Mrs. Clinton’s case was an unforeseen twist."
        },
        {
            "id": 50,
            "text": "Several weeks ago, top Justice Department officials decided that prosecutors in Manhattan would handle Mr. Weiner’s case."
        },
        {
            "id": 51,
            "text": "After seizing the devices, investigators have been combing them for information."
        },
        {
            "id": 52,
            "text": "It remained unclear whether Mr. Comey would reveal more about the contents of the newly discovered emails."
        },
        {
            "id": 53,
            "text": "In his memo to the F.B.I. staff, it was evident that he is keenly aware of the fraught political backdrop that he faces."
        },
        {
            "id": 54,
            "text": "“We don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed,” Mr. Comey wrote."
        },
        {
            "id": 55,
            "text": "“I also think it would be misleading to the American people were we not to supplement the record.”"
        },
        {
            "id": 56,
            "text": "Ms. Abedin separated from Mr. Weiner in August after it emerged that he was exchanging lewd messages with a woman on social media."
        },
        {
            "id": 57,
            "text": "Such behavior had destroyed his congressional career and his 2013 mayoral campaign."
        },
        {
            "id": 58,
            "text": "Mr. Trump has pointed to Mrs. Clinton’s association with the couple as an example of her bad judgment."
        },
        {
            "id": 59,
            "text": "“I only worry for the country in that Hillary Clinton was careless and negligent in allowing Weiner to have such close proximity to highly classified information,” Mr. Trump said in August."
        },
        {
            "id": 60,
            "text": "“Who knows what he learned and who he told?”"
        }
    ]
}