{
    "title": "Biden hoping Senate can split impeachment with other priorities",
    "text": [
        {
            "id": 0,
            "text": "President-elect Joseph R. Biden on Monday said he is looking for ways that the Senate could hold an impeachment trial for President Trump while working on the new administration’s agenda."
        },
        {
            "id": 1,
            "text": "Mr. Biden has been in touch with “folks in the Senate” on potentially splitting the floor time that would be required for an impeachment trial with time for his early legislative and staffing priorities, he said."
        },
        {
            "id": 2,
            "text": "“Can you go a half day on dealing with impeachment and a half day getting my people nominated and confirmed in the Senate as well as moving on the [coronavirus] package?”"
        },
        {
            "id": 3,
            "text": "he said."
        },
        {
            "id": 4,
            "text": "“So that’s my hope and expectation.”"
        },
        {
            "id": 5,
            "text": "He said he wasn’t sure about the logistics behind such an arrangement."
        },
        {
            "id": 6,
            "text": "Mr. Biden waded into the impeachment fray talking to reporters in Delaware after receiving a second dose of the Pfizer-BioNTech coronavirus vaccine."
        },
        {
            "id": 7,
            "text": "He previously shied away from the question of whether Mr. Trump should be impeached over the U.S. Capitol attack, saying he was focused on the presidential transition."
        },
        {
            "id": 8,
            "text": "Mr. Biden has carefully ridden the political currents in Washington for nearly 50 years."
        },
        {
            "id": 9,
            "text": "Political strategists noted that Mr. Biden, as he prepared to take the top job in the White House, was again playing it safe."
        },
        {
            "id": 10,
            "text": "“He doesn’t really want to touch this because he doesn’t know how it’s going to go,” said Republican consultant Keith Naughton."
        },
        {
            "id": 11,
            "text": "“Impeachment and trial is Congress’ responsibility, so why stick your fingers into something that isn’t your responsibility?”"
        },
        {
            "id": 12,
            "text": "Democratic lawmakers likely will have hell to pay with their base if impeachment blows up in their faces."
        },
        {
            "id": 13,
            "text": "“They’ve always detested Trump, and"
        },
        {
            "id": 14,
            "text": "now that’s at a fever pitch,” Mr. Naughton said."
        },
        {
            "id": 15,
            "text": "“So if Biden gets involved in impeachment and Trump doesn’t get convicted, then he gets the blowback over it.”"
        },
        {
            "id": 16,
            "text": "House Democrats introduced an impeachment article on Monday accusing Mr. Trump of inciting insurrection by firing up supporters shortly before a pro-Trump mob invaded the U.S. Capitol."
        },
        {
            "id": 17,
            "text": "The House is expected to pass the article this week."
        },
        {
            "id": 18,
            "text": "Lawmakers suggested not sending it to the Senate until Mr. Biden is in office for a few months to avoid early disruptions to his term."
        },
        {
            "id": 19,
            "text": "Impeachment was not on the list of subjects he discussed in phone calls Friday with House Speaker Nancy Pelosi of California and Senate Democratic Leader Charles E. Schumer of New York, according to a readout of the calls."
        },
        {
            "id": 20,
            "text": "Last week, incoming White House press secretary Jen Psaki said Mr. Biden expects congressional leaders to do their jobs and declined to say whether the impeachment push would impede the early days of his administration."
        },
        {
            "id": 21,
            "text": "“He has a job to do — that is preparing to take the reins,” Ms. Psaki said."
        },
        {
            "id": 22,
            "text": "“I don’t think I’m going to weigh into the game of [whether it’s] helpful or hurtful.”"
        },
        {
            "id": 23,
            "text": "A precondition to bringing the country together is getting Mr. Trump out of office, she said, reiterating that the fastest way to make that happen is through Mr. Biden’s inauguration on Jan. 20."
        },
        {
            "id": 24,
            "text": "Sen. Chris Coons, a top Biden ally, said a Senate impeachment trial just as Mr. Biden is entering office could hamper efforts to get the coronavirus pandemic under control."
        },
        {
            "id": 25,
            "text": "“I understand the concerns that just as President Biden takes over responsibility for leading our nation through this tragic pandemic that we might be distracted by weeks in the Senate by a Senate trial,” the Delaware Democrat said on CBS’s “Face the Nation.”"
        },
        {
            "id": 26,
            "text": "It takes a simple majority in the House to impeach and a two-thirds majority in the Senate to convict."
        },
        {
            "id": 27,
            "text": "The upper chamber soon will be split 50-50 between Democrats and Republicans, with Vice President-elect Kamala D. Harris as the tie-breaking vote as president of the Senate."
        },
        {
            "id": 28,
            "text": "A conviction would require more than a dozen Republicans siding against the president."
        },
        {
            "id": 29,
            "text": "Democrats have talked about voting to bar Mr. Trump from ever holding federal office again, but such a vote would likely occur only if and when the Senate votes to convict the president of an offense."
        },
        {
            "id": 30,
            "text": "The Democrat-led House already voted to impeach Mr. Trump in December 2019, accusing the president of strong-arming Ukraine into digging up dirt on Mr. Biden."
        },
        {
            "id": 31,
            "text": "The Republican-led Senate acquitted Mr. Trump in February 2020."
        },
        {
            "id": 32,
            "text": ""
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}