{
    "title": "BREAKING: Jared Kushner's Security Clearance Has Been Downgraded, Along With Other White House Staffers",
    "text": [
        {
            "id": 0,
            "text": "Senior advisor to President Donald Trump, Jared Kusher -- who is also the president's son-in-law -- has officially lost the ability to review sensitive classified information after failing to obtain a permanent security clearance."
        },
        {
            "id": 1,
            "text": "Speculation surrounding whether Kushner's permanent security clearance, in addition to temporary clearances held by dozens of White House Staffers, would come through has been swirling for weeks."
        },
        {
            "id": 2,
            "text": "Last week President Trump said it was up to Chief of Staff John Kelly to determine whether his son-in-law would continue to review classified information."
        },
        {
            "id": 3,
            "text": "“That’ll be up to General Kelly."
        },
        {
            "id": 4,
            "text": "General Kelly respects Jared a lot and General Kelly will make that call."
        },
        {
            "id": 5,
            "text": "I won’t make that call,” Trump said last week during a press conference with the Australian Prime Minister at the White House."
        },
        {
            "id": 6,
            "text": "Previously, Kushner had access to President Trump's daily intelligence briefings and reports."
        },
        {
            "id": 7,
            "text": "Moving forward, he will not."
        },
        {
            "id": 8,
            "text": "Ivanka Trump, married to Kusher, has also been working at the White House on a temporary clearance."
        },
        {
            "id": 9,
            "text": "More on the background from POLITICO:\n\nThe White House’s handling of clearances came under scrutiny after reports that Kelly had been aware that former staff secretary Rob Porter, who was accused by his two ex-wives of verbal and physical abuse, did not have a full security clearance in part because of a previous protective order granted during one of his divorces."
        },
        {
            "id": 10,
            "text": "The scandal prompted Kelly to crack down on staffers working without full clearance, more than a year into the Trump administration."
        },
        {
            "id": 11,
            "text": "In a five-page document released last week, Kelly ordered a series of initiatives aimed at bolstering protocols."
        },
        {
            "id": 12,
            "text": "“The American people deserve a White House staff that meets the highest standards and that has been carefully vetted — especially those who work closely with the president or handle sensitive national security information,” Kelly said in the memo."
        },
        {
            "id": 13,
            "text": "“We should — and in the future, must — do better.”"
        },
        {
            "id": 14,
            "text": "The White House argues Kushner will continue to fulfill an important role at the White House, regardless of his access level to classified information."
        }
    ]
}