{
    "title": "Katie Hill: US congresswoman resigns amid affair allegations",
    "text": [
        {
            "id": 0,
            "text": "US lawmaker Katie Hill has announced her resignation from Congress, following allegations that she had an affair with a Capitol Hill aide."
        },
        {
            "id": 1,
            "text": "The California Democrat, who has denied the claim, said she was stepping down with a \"broken heart\"."
        },
        {
            "id": 2,
            "text": "\"I believe it is the best thing for my constituents, my community, and our country,\" she wrote on Twitter."
        },
        {
            "id": 3,
            "text": "The resignation came days after she was placed under investigation by the House of Representatives Ethics Committee."
        },
        {
            "id": 4,
            "text": "The ethics committee launched an inquiry after conservative blog RedState reported allegations that Ms Hill had an affair with one of her congressional aides, a man."
        },
        {
            "id": 5,
            "text": "The same blog separately reported claims that Ms Hill, who is bisexual, had also engaged in a three-way consensual romance with a female campaign staff member and her husband."
        },
        {
            "id": 6,
            "text": "It published naked images of the politician."
        },
        {
            "id": 7,
            "text": "She has asked police to investigate the nude photos being published online."
        },
        {
            "id": 8,
            "text": "Ms Hill, 32, has denied having an affair with her aide, which would be a possible violation of House rules."
        },
        {
            "id": 9,
            "text": "In a statement announcing the investigation, the ethics committee noted that the opening of an inquiry did not mean \"that any violation has occurred\"."
        },
        {
            "id": 10,
            "text": "Hours before the congressional inquiry was launched on Wednesday, Ms Hill sent a letter to supporters acknowledging a \"relationship\" with a female 2018 campaign staff member."
        },
        {
            "id": 11,
            "text": "She described that affair as \"inappropriate\"."
        },
        {
            "id": 12,
            "text": "The relationship that Ms Hill acknowledged took place before she was elected, so it fell outside congressional rules on personal relationships."
        },
        {
            "id": 13,
            "text": "In her resignation letter on Sunday, Ms Hill said stepping down from Congress was the \"hardest thing\" she had ever had to do."
        },
        {
            "id": 14,
            "text": "\"Having private photos of personal moments weaponised against me has been an appalling invasion of my privacy. It's also illegal, and we are currently pursuing all of our available legal options,\" she wrote. \""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "However, I know that as long as I am in Congress, we'll live fearful of what might come next and how much it will hurt.\""
        },
        {
            "id": 18,
            "text": "Ms Hill has accused her husband, whom she is in the process of divorcing, of trying to humiliate her."
        },
        {
            "id": 19,
            "text": "She says the campaign relationship began in the final \"tumultuous\" years of her marriage."
        },
        {
            "id": 20,
            "text": "\"I know that even a consensual relationship with a subordinate is inappropriate, but I still allowed it to happen despite my better judgment,\" she said in the letter to supporters."
        },
        {
            "id": 21,
            "text": "\"For that I apologise.\""
        },
        {
            "id": 22,
            "text": "Two years ago during her congressional campaign, she described Kenny Heslep, whom she wed in 2010, in a social media post as \"my best friend and the love of my life\"."
        },
        {
            "id": 23,
            "text": "In the statement on Sunday, she defined herself as a \"fighter\"."
        },
        {
            "id": 24,
            "text": "\"Now, my fight is going to be to defeat this type of exploitation that so many women are victims to and which will keep countless women and girls from running for office or entering public light.\""
        },
        {
            "id": 25,
            "text": "Ms Hill has represented the 25th district in southern California since 2018, when she was elected as part of a Democratic wave."
        },
        {
            "id": 26,
            "text": "She is also vice-chairwoman of the House Oversight and Reform Committee, which has been investigating President Donald Trump's financial dealings."
        },
        {
            "id": 27,
            "text": "She previously worked as executive director of non-profit organisation People Assisting the Homeless."
        }
    ]
}