{
    "title": "Potential jurors for trial of Greg Craig, former Obama W.H. counsel, asked about Mueller, Manafort",
    "text": [
        {
            "id": 0,
            "text": "Jury selection began Monday in the trial of Greg Craig, once the Obama White House’s top lawyer and a man who now stands charged with obscuring his efforts to assist a foreign government while in private practice."
        },
        {
            "id": 1,
            "text": "Upon exiting the courtroom Monday, defense attorneys said they expect the jury process to conclude early Tuesday with opening arguments starting sometime after that."
        },
        {
            "id": 2,
            "text": "Mr. Craig has pleaded not guilty to accusations that he failed to properly report his activities on behalf of officials in Ukraine, which included work with Paul Manafort, the one-time Trump campaign chairman who has been convicted on charges brought by special counsel Robert Mueller."
        },
        {
            "id": 3,
            "text": "Judge Amy Berman Jackson twice told the potential jurors Monday of the case’s links to Mr. Mueller, asking if they have “any knowledge or connection” to Mr. Mueller, Manafort or his longtime business associate Rick Gates."
        },
        {
            "id": 4,
            "text": "Gates also has pleaded guilty to charges brought by the special counsel team and is cooperating with the government."
        },
        {
            "id": 5,
            "text": "He is expected to be a key witness in the trial against Mr. Craig."
        },
        {
            "id": 6,
            "text": "Judge Jackson said the questions were to find connections that would prevent or hinder an impartial verdict."
        },
        {
            "id": 7,
            "text": "She told jurors her goal was to find people who “do not already know anything about the case.”"
        },
        {
            "id": 8,
            "text": "Reporters and the public were permitted to watch the initial part of jury selection, but Judge Jackson then cleared the courtroom so attorneys could ask more personal questions of the jurors."
        },
        {
            "id": 9,
            "text": "Mr. Craig was indicted in April on two counts of providing false statements to the Justice Department."
        },
        {
            "id": 10,
            "text": "Judge Jackson threw out one of those counts last week but allowed trial to commence this week on the remaining count."
        },
        {
            "id": 11,
            "text": "The case against Mr. Craig centers on work he and his law firm — Skadden Arps Slate Meager & Flom — performed for Ukraine’s pro-Russia government in 2012."
        },
        {
            "id": 12,
            "text": "Manafort tapped the firm to draw up a report whitewashing the Ukrainian prime minister’s prosecution of a former political rival."
        },
        {
            "id": 13,
            "text": "Prosecutors say when Mr. Craig pitched the report to The New York Times as an independent review of the case, he was lobbying on behalf of a foreign government."
        },
        {
            "id": 14,
            "text": "In doing so, Mr. Craig violated the Foreign Agent Registration Act, because he never registered as a foreign agent, the Justice Department said."
        },
        {
            "id": 15,
            "text": "Emails obtained by the government detail Mr. Craig’s lengthy discussions saying he wanted to avoid having to register, fearing it would shut him out of future government jobs if he did."
        },
        {
            "id": 16,
            "text": "The Craig defense team says his activities were on behalf of his law firm, not a foreign government, and thus didn’t require registration."
        },
        {
            "id": 17,
            "text": "The law firm reached a settlement this year on charged it violated the agent-registration law, agreeing to register and to pay a $4.6 million fine and thus avoiding prosecution."
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        }
    ]
}