{
    "title": "Administration Considers Giving Honduran Youth Refugee Status",
    "text": [
        {
            "id": 0,
            "text": "At this point in the border crisis, one would think the administration would be doing all it can to actually stem the flow of illegal immigrants from Central America."
        },
        {
            "id": 1,
            "text": "In reality, however, it seems some of their proposed solutions would do just the opposite."
        },
        {
            "id": 2,
            "text": "The New York Times reports:\n\nHoping to stem the recent surge of migrants at the Southwest border, the Obama administration is considering whether to allow hundreds of minors and young adults from Honduras into the United States without making the dangerous trek through Mexico, according to a draft of the proposal."
        },
        {
            "id": 3,
            "text": "If approved, the plan would direct the government to screen thousands of children and youths in Honduras to see if they can enter the United States as refugees or on emergency humanitarian grounds."
        },
        {
            "id": 4,
            "text": "It would be the first American refugee effort in a nation reachable by land to the United States, the White House said, putting the violence in Honduras on the level of humanitarian emergencies in Haiti and Vietnam, where such programs have been conducted in the past amid war and major crises."
        },
        {
            "id": 5,
            "text": "Yes, you read that correctly."
        },
        {
            "id": 6,
            "text": "The administration is considering a plan that would allow Hondurans under the age of 21 (and possibly El Salvadorans and Guatemalans) to apply to the program in their own country."
        },
        {
            "id": 7,
            "text": "And the reason they need refugee status?"
        },
        {
            "id": 8,
            "text": "Because they’re fleeing dangerous street gangs."
        },
        {
            "id": 9,
            "text": "Question: what can the children in Chicago’s South Side claim to get protection?"
        },
        {
            "id": 10,
            "text": "But seriously, how exactly will this decrease the number of Central Americans coming into the U.S.?"
        },
        {
            "id": 11,
            "text": "Sure, we would have more control over who may fit the program's criteria, but what's to say those who don't won't try for the amnesty route and make the trek up north anyway?"
        },
        {
            "id": 12,
            "text": "And if the definition of refugee is stretched to include people fleeing 'general crime and violence,' it's safe to say America's doors really are wide open--to untold numbers of people all around the world."
        },
        {
            "id": 13,
            "text": "Under American law, refugees are people fleeing their country of origin based on fears of persecution by reason of race, religion, nationality, political opinion or membership in a particular social group."
        },
        {
            "id": 14,
            "text": "The only category that would seem to apply is “social group,” experts said, but there is disagreement on what that means."
        },
        {
            "id": 15,
            "text": "Some contend that children could count as a group, but others say the refugee requirements are stricter, and would not apply to people fleeing general crime and violence."
        },
        {
            "id": 16,
            "text": "“What is a social group?” said Muzaffar Chishti, director of migration policies for the Migration Policy Institute’s New York office."
        },
        {
            "id": 17,
            "text": "“This is going to create a huge deal of debate."
        },
        {
            "id": 18,
            "text": "You will see a lot of law developing on it.”"
        },
        {
            "id": 19,
            "text": "Mark Krikorian, the executive director of the Center for Immigration Studies, told The New York Times that migrants would need “nothing more than a bus ride to the consulate” to claim to be refugees."
        },
        {
            "id": 20,
            "text": "“We’re talking about, down the road, an enormous additional flow of people from those countries.”"
        },
        {
            "id": 21,
            "text": "And guess what?"
        },
        {
            "id": 22,
            "text": "If it doesn't increase the total number of refugees coming into the country, President Obama's pen and phone can make this happen, no congressional approval needed."
        },
        {
            "id": 23,
            "text": "Update: Guy Benson weighed in on the issue on Fox News' \"America's Newsroom\" today."
        }
    ]
}