{
    "title": "McConnell and Boehner: Republicans united on sequesters",
    "text": [
        {
            "id": 0,
            "text": "They spent the weekend blaming each other for the $85 billion in sequestration cuts that began taking effect Friday — but top Democrats and Republicans were careful Sunday to keep the door open to a breakthrough deal on the federal budget."
        },
        {
            "id": 1,
            "text": "Both sides claimed to find the sequestration abhorrent, but leaders from both parties stressed Sunday that they now have an opportunity to find the “big deal” — one that tackles politically treacherous territory such as entitlement reform and an overhaul of the tax code — that has eluded Washington for the past two years."
        },
        {
            "id": 2,
            "text": "“We can do the big deal if we have some leadership,” said Sen. Lindsey Graham, South Carolina Republican, speaking on CBS’ “Face the Nation.”"
        },
        {
            "id": 3,
            "text": "“I’m not going to do any more small deals.”"
        },
        {
            "id": 4,
            "text": "Like virtually all other Republicans, Mr. Graham said he absolutely will not accept tax rate hikes to solve the sequestration mess, which both parties agree is not the ideal way to cut federal spending."
        },
        {
            "id": 5,
            "text": "But Mr. Graham said he is open to the type of major agreement that would raise about $600 billion in revenue by closing tax loopholes and eliminating deductions."
        },
        {
            "id": 6,
            "text": "That money, he said, then could be put toward reforming Medicare and other entitlement programs."
        },
        {
            "id": 7,
            "text": "The two sides have until the end of this month to achieve such a deal."
        },
        {
            "id": 8,
            "text": "The resolution funding federal government operations expires at the end of March, meaning yet another showdown, this time to avoid a Washington shutdown, is right around the corner."
        },
        {
            "id": 9,
            "text": "That standoff carries with it an opening for compromise, said Sen. Richard J. Durbin, Illinois Democrat and his party’s No. 2 man in the Senate."
        },
        {
            "id": 10,
            "text": "“We have to agree how to finish the [fiscal] year."
        },
        {
            "id": 11,
            "text": "It creates an opportunity for us to sit down, the president and congressional leaders, and come up with an answer that is sensible,” he said, also appearing on “Face the Nation.”"
        },
        {
            "id": 12,
            "text": "“I am certain the president would sit down and work in good faith to get us through this,” he added."
        },
        {
            "id": 13,
            "text": "Even Mitt Romney, the Republican Party’s vanquished 2012 presidential nominee, chimed in from the sidelines Sunday morning and urged Mr. Obama and congressional leaders to find a lasting solution."
        },
        {
            "id": 14,
            "text": "Congress has to approve another short-term spending plan by March 27 or face a government shutdown, and another debate over the debt ceiling looms in May."
        },
        {
            "id": 15,
            "text": "Bracing for these additional budget battles, top Republicans in the House and Senate reiterated their absolute opposition to further tax increases."
        },
        {
            "id": 16,
            "text": "House Speaker John A. Boehner, Ohio Republican, said the White House should not expect any more concessions on taxes after the New Year’s deal to avoid the so-called fiscal cliff."
        },
        {
            "id": 17,
            "text": "“I’m going to say it one more time: The president got his tax hikes on January the 1st."
        },
        {
            "id": 18,
            "text": "The issue here is spending."
        },
        {
            "id": 19,
            "text": "Spending is out of control,” Mr. Boehner said on NBC’s “Meet the Press,” an interview that was taped Friday."
        },
        {
            "id": 20,
            "text": "Senate Minority Leader Mitch McConnell, Kentucky Republican, echoed those sentiments on CNN’s “State of the Union.”"
        },
        {
            "id": 21,
            "text": "He said no Republican is “willing to raise a dime in taxes to turn off the sequester.”"
        },
        {
            "id": 22,
            "text": "“This modest reduction of 2.4 percent in spending over the next six months is a little more than the average American experienced two months ago, when their own pay went down when the payroll tax holiday expired,” Mr. McConnell said."
        },
        {
            "id": 23,
            "text": "The top Republican lawmakers made the comments after the White House indicated a willingness to go around the GOP leadership in the House and Senate."
        },
        {
            "id": 24,
            "text": "National Economic Council Director Gene Sperling, who appeared on multiple Sunday morning shows, said the president spent part of Saturday calling lawmakers directly in an attempt to break the sequester logjam and find a deal."
        },
        {
            "id": 25,
            "text": "Mr. Sperling also blasted Republicans for what the White House says is an unwillingness to compromise on the revenue question."
        },
        {
            "id": 26,
            "text": "“This is not a win for anyone,” Mr. Sperling said on ABC’s “This Week,” refuting the notion that congressional Republicans scored a political victory with sequestration and the administration’s inability to stop it."
        },
        {
            "id": 27,
            "text": "“The only win, if you can call it that, that this gives is [to] those on the Republican side who are willing to let all this harm be inflicted so they can stand by this principle that there should not be one dime of deficit reduction that should ever come from closing loopholes of deductions."
        },
        {
            "id": 28,
            "text": "That’s just an unreasonable position,” he said."
        }
    ]
}