{
    "title": "Prepping for 2016, a Gathering of Republicans in Iowa Leans Hard to the Right",
    "text": [
        {
            "id": 0,
            "text": "DES MOINES — A crowded field of potential Republican presidential candidates scrapped for the hearts of the party’s conservative base here Saturday, implicitly rejecting the more moderate wing favored by big donors and trying to fire up the kind of grass-roots supporters who will play a critical role in the nominating process."
        },
        {
            "id": 1,
            "text": "The daylong forum, billed as an informal kickoff to the 2016 campaign, was attended by about 1,200 people, many of whom ardently oppose the centrist views that tend to prevail in a general election."
        },
        {
            "id": 2,
            "text": "The speakers, some of them experienced presidential campaigners, came to test and tweak their messages, to seek second chances and to introduce themselves to voters whose passion for conservative causes makes them more likely to attend a caucus and launch a candidate out of a field of contenders."
        },
        {
            "id": 3,
            "text": "Two likely candidates who did not attend, Jeb Bush and Mitt Romney, were criticized by several who did — mostly in veiled swipes, rather than by name — over the Common Core educational standards and immigration reform, which Mr. Bush in particular supports."
        },
        {
            "id": 4,
            "text": "Senator Ted Cruz of Texas, a Tea Party hero, challenged attendees to demand that Republican leaders prove their conservative bona fides."
        },
        {
            "id": 5,
            "text": "“In a Republican primary, every candidate is going to say, ‘I’m the most conservative guy who ever lived,’ “ he said."
        },
        {
            "id": 6,
            "text": "“You know what?"
        },
        {
            "id": 7,
            "text": "Talk is cheap.”"
        },
        {
            "id": 8,
            "text": "Rising to his own challenge, Mr. Cruz called for “the locusts” of the Environmental Protection Agency to be stifled and for padlocking the Internal Revenue Service, then redeploying its agents to secure the Southern border."
        },
        {
            "id": 9,
            "text": "“If you said you opposed the president’s unconstitutional executive amnesty, show me where you stood up and fought,” he said of President Obama’s executive actions on immigration."
        },
        {
            "id": 10,
            "text": "“If you said you oppose Common Core, show me where you stood up and fought.”"
        },
        {
            "id": 11,
            "text": "But Gov. Chris Christie of New Jersey, the lone moderate to speak, cautioned against requiring a candidate to pass conservative litmus tests."
        },
        {
            "id": 12,
            "text": "“If that’s the standard we hold each other to, as a party we will never win another national election,” he said."
        },
        {
            "id": 13,
            "text": "Mr. Christie addressed head-on the criticism that he was, as he summarized, “too blunt, too direct, too loud and too New Jersey for Iowa.”"
        },
        {
            "id": 14,
            "text": "“I am here today because our conservative values work not only in Iowa,” he said, emphasizing that he had visited the state 11 times in the past five years."
        },
        {
            "id": 15,
            "text": "“I’m living proof that worked for me in New Jersey.”"
        },
        {
            "id": 16,
            "text": "Gov. Scott Walker of Wisconsin gave an energetic speech, strolling the stage with his sleeves rolled up and flattering the audience like a practiced caucus contender."
        },
        {
            "id": 17,
            "text": "He acknowledged a “woman in Waterloo” who had donated three times to his campaign, and thanked Iowans for their prayers during “the dark days” when he and his family received threats in his showdown with public employees’ unions."
        },
        {
            "id": 18,
            "text": "Mr. Walker offered a preview of a national campaign built on his record of defying teachers’ unions, as well as tens of thousands of protesters."
        },
        {
            "id": 19,
            "text": "“The Occupy movement started in Madison, Wisconsin, four years ago and then went to Wall Street,” he said."
        },
        {
            "id": 20,
            "text": "“So my apologies for that.”"
        },
        {
            "id": 21,
            "text": "A few candidates advanced a concern about income inequality that is percolating within the party, discussing wage stagnation, an issue that has largely belonged to Democrats."
        },
        {
            "id": 22,
            "text": "Mr. Christie spoke of the anxiety of the middle class."
        },
        {
            "id": 23,
            "text": "He said that any Republican coalition needed to include the “proud yet underserved and underrepresented working class in this country.”"
        },
        {
            "id": 24,
            "text": "“The rich are doing just fine,” Mr. Christie said."
        },
        {
            "id": 25,
            "text": "Rick Santorum, the winner in the 2012 Iowa caucus, noted that for years Republicans had extolled entrepreneurs and business owners, adding that it made more sense politically to “be the party of the worker.”"
        },
        {
            "id": 26,
            "text": "“What percentage of American workers own their own businesses?” he asked."
        },
        {
            "id": 27,
            "text": "“Less than 10.”"
        },
        {
            "id": 28,
            "text": "Former Gov. Mike Huckabee of Arkansas, who won the 2008 caucus here"
        },
        {
            "id": 29,
            "text": ", stressed that the falling unemployment rate did not represent an economic recovery for many people."
        },
        {
            "id": 30,
            "text": "“A lot of people who used to have one good-paying job with benefits now have to work two jobs,” he said."
        },
        {
            "id": 31,
            "text": "As speaker after speaker tossed juicy rhetorical tidbits to an appreciative crowd, the gathering emphasized the challenges that the party’s less conservative candidates could face in right-leaning states with early caucuses and primaries, like Iowa and South Carolina."
        },
        {
            "id": 32,
            "text": "Mr. Bush, speaking on Friday in San Francisco, stated a position that puts him at odds with a co-host of the forum, Representative Steve King of Iowa, an avid opponent of an immigration overhaul."
        },
        {
            "id": 33,
            "text": "“We need to find a path to legalized status for those who have come here and have languished in the shadows,” Mr. Bush said."
        },
        {
            "id": 34,
            "text": "In an interview last week, Senator Jeff Flake, Republican of Arizona, called the attention lavished on Iowa “an unfortunate part of our electoral calendar.”"
        },
        {
            "id": 35,
            "text": "Mr. Flake did not attend the forum."
        },
        {
            "id": 36,
            "text": "“Too many Republicans have for too many years, for too many cycles, tried to appeal to a small group that does not help us in general elections,” Mr. Flake said."
        },
        {
            "id": 37,
            "text": "With the exception of Mr. Christie, who is still trying to gain traction in Iowa, the more moderate wing was largely unrepresented in the audience and on stage."
        },
        {
            "id": 38,
            "text": "Mr. Bush, the former governor of Florida, and Mr. Romney, the party’s 2012 nominee, declined invitations to attend."
        },
        {
            "id": 39,
            "text": "Former Gov. Rick Perry of Texas, whose 2012 presidential campaign foundered in Iowa partly because opponents portrayed him as soft on illegal immigration, struck a more militant stance Saturday."
        },
        {
            "id": 40,
            "text": "He recalled Mr. Obama’s refusal to take a helicopter ride with him to the Rio Grande Valley last year to see unaccompanied minors crossing the border, a flow that Mr. Perry blamed on White House policies."
        },
        {
            "id": 41,
            "text": "“For the sake of the nation, we did not stand idle against this threat,” he said."
        },
        {
            "id": 42,
            "text": "“So here is what I say: If Washington refuses to secure the border, Texas will.”"
        },
        {
            "id": 43,
            "text": "Opening the forum, Mr. King spoke only briefly about immigration."
        },
        {
            "id": 44,
            "text": "But Democrats were quick to tie the Republicans here to Mr. King’s record of unvarnished comments about unauthorized immigrants, most recently his reference to a guest of the president’s at the State of the Union address as “deportable.”"
        },
        {
            "id": 45,
            "text": "“These wannabe Republican leaders should be standing up to Steve King, not standing with him,” said Representative Debbie Wasserman Schultz of Florida, the chairwoman of the Democratic National Committee."
        },
        {
            "id": 46,
            "text": "Ms. Schultz held a news conference near the site of the forum on Saturday morning."
        },
        {
            "id": 47,
            "text": "There were notably few direct swipes at Hillary Rodham Clinton, considered by many to be the leading contender for the Democratic nomination."
        },
        {
            "id": 48,
            "text": "But Carly Fiorina, a former Silicon Valley chief executive who ran unsuccessfully for the United States Senate in California in 2010, said: “Like Hillary Clinton, I too have traveled around the globe."
        },
        {
            "id": 49,
            "text": "But unlike her, I actually accomplished something.”"
        },
        {
            "id": 50,
            "text": "Donald Trump, who perennially floats himself as a presidential contender, took pointed digs at two absent Republicans — much to the crowd’s delight."
        },
        {
            "id": 51,
            "text": "“It can’t be Mitt because Mitt ran and failed,” Mr. Trump said."
        },
        {
            "id": 52,
            "text": "And to cheers, he said, “The last thing we need is another Bush.”"
        },
        {
            "id": 53,
            "text": "The gathering, called the Iowa Freedom Summit and held at the Hoyt Sherman Place theater, represented a return of the full political roadshow to the state."
        },
        {
            "id": 54,
            "text": "The forum drew more than 100 out-of-state journalists and a long list of Republican figures."
        },
        {
            "id": 55,
            "text": "On Friday, Sarah Palin ran into Newt Gingrich; his wife, Callista; and Mr. King in a hotel lobby, where onlookers quickly mobbed them."
        }
    ]
}