{
    "title": "Pelosi still resistant to scaled-down coronavirus relief deal, calls for negotiations to restart",
    "text": [
        {
            "id": 0,
            "text": "House Speaker Nancy Pelosi said Friday she wants to restart negotiations for a comprehensive coronavirus relief bill, but she still isn’t interested in adopting a scaled-down approach."
        },
        {
            "id": 1,
            "text": "“We want the Republicans to come back to the table,” Mrs. Pelosi told reporters at her weekly press conference."
        },
        {
            "id": 2,
            "text": "Despite her expectations that Democratic nominee Joseph R. Biden, who is leading in the presidential vote count, will win, Mrs. Pelosi said a relief bill can’t wait for a Democrat in the White House."
        },
        {
            "id": 3,
            "text": "And she has the agreement from Senate Republicans on at least the urgency for another bill, but neither side has signaled it’s ready to veer from its position."
        },
        {
            "id": 4,
            "text": "Senate Majority Leader Mitch McConnell said earlier this week that passing a stimulus deal to help get economic relief and testing resources to the public is at the top of the post-election to-do list."
        },
        {
            "id": 5,
            "text": "The last round of negotiations ended with the White House offering around $1.9 trillion, Democrats wanting $2.4 trillion, and Senate Republicans wary of anything more than $1 trillion."
        },
        {
            "id": 6,
            "text": "On Friday, Mrs. Pelosi said she still would not entertain a scaled-down approach to the coronavirus pandemic, like the $500 billion package Senate Republicans attempted to pass twice before the election."
        },
        {
            "id": 7,
            "text": "“They still have not agreed to crush the virus."
        },
        {
            "id": 8,
            "text": "If you don’t crush the virus, we’re still going to be dealing with the consequences of the virus,” she said."
        },
        {
            "id": 9,
            "text": "“There’s a difference between Democrats and Republicans."
        },
        {
            "id": 10,
            "text": "We have a responsibility to find common ground, stand your ground where we can’t, but make it clear to the American people what the choices [are].”"
        },
        {
            "id": 11,
            "text": "Meanwhile, in Kentucky, Mr. McConnell pointed to the improving unemployment rate, which fell to 6.9% in October, as a sign that Congress should tailor its response."
        },
        {
            "id": 12,
            "text": "“I think it reinforces the argument that I’ve been making for the last few months, that something smaller — rather than throwing another $3 trillion at this issue — is more appropriate,” he told reporters at a press conference."
        },
        {
            "id": 13,
            "text": "White House chief economic adviser Larry Kudlow told reporters the administration is talking with Mr. McConnell as they look at a “targeted” package, and they’re not interested in $2 trillion or $3 trillion."
        },
        {
            "id": 14,
            "text": "“I think everyone is going to want to get a stimulus package through,” Mr. Kudlow said."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": ""
        }
    ]
}