{
    "title": "'Lame duck' U.S. Congress to grapple with coronavirus aid, budget bills",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The push in the U.S. Congress for a major new coronavirus aid bill got a post-election boost on Wednesday when Senate Majority Leader Mitch McConnell put his weight behind passage by the end of this year and opened the door to considering a key Democratic priority."
        },
        {
            "id": 2,
            "text": "FILE PHOTO:"
        },
        {
            "id": 3,
            "text": "The U.S. Capitol is seen at sunrise during the election day, in Washington, U.S., November 3, 2020."
        },
        {
            "id": 4,
            "text": "While candidates elected to the Senate and U.S. House of Representatives will not be sworn in until Jan. 3, the Congress that has been in business since January 2019, will return to Washington next week for a “lame duck” session that is expected to extend well into December."
        },
        {
            "id": 5,
            "text": "McConnell, the top Republican in Congress who sailed to reelection on Tuesday, said on Wednesday that passage of a new coronavirus aid bill was a top priority of that session."
        },
        {
            "id": 6,
            "text": "“I think that’s job one when we get back, hopefully with a more cooperative situation than we had” before the elections, McConnell told reporters in his home state of Kentucky."
        },
        {
            "id": 7,
            "text": "Previously, McConnell had talked about doing a coronavirus stimulus bill at the beginning of 2021."
        },
        {
            "id": 8,
            "text": "But for months, he and many of his fellow Senate Republicans had balked at tackling a wide-ranging, high-dollar measure."
        },
        {
            "id": 9,
            "text": "Democrats had hoped to strengthen their position in Congress in Tuesday’s elections, with their eye on winning a majority in the Senate for the next two years and a bigger majority in the House of Representatives."
        },
        {
            "id": 10,
            "text": "While final results are still not in, they appeared to be falling short of both goals, having picked up only one Republican seat in the Senate so far and lost a number of competitive races while keeping their majority in the House."
        },
        {
            "id": 11,
            "text": "As a result, Democrats now enter upcoming negotiations over coronavirus aid with their hand weaker than expected."
        },
        {
            "id": 12,
            "text": "Nevertheless, McConnell on Wednesday signaled a willingness to discuss a top priority of House Speaker Nancy Pelosi, who has been pushing since May for an aid bill that funnels significant funding to state and local governments reeling from an economic slowdown that has diminished their revenues."
        },
        {
            "id": 13,
            "text": "McConnell spoke of the “possibility” of such aid."
        },
        {
            "id": 14,
            "text": "Early this year, Congress approved more than $3 trillion of emergency funding in response to the coronavirus pandemic."
        },
        {
            "id": 15,
            "text": "The money, included in a series of bills, provided economic stimulus and money for medical supplies and other health-related activities."
        },
        {
            "id": 16,
            "text": "In mid-May, amid deep opposition from Republicans who insisted on a “pause” in the spending, the House passed a comprehensive new package of over $3 trillion."
        },
        {
            "id": 17,
            "text": "Since then, Pelosi and White House negotiators have whittled that figure down to around $2 trillion but failed to reach a deal."
        },
        {
            "id": 18,
            "text": "The lame duck session of Congress will now pick up where they left off in negotiations that will be closely watched by Wall Street, as well as U.S. businesses and individuals seeking to pay their bills in an economy struggling to recover from the pandemic."
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": "A second high priority of the lame duck session will be passage of legislation to keep a range of government programs operating beyond Dec. 11, when existing funds expire."
        },
        {
            "id": 21,
            "text": "Those temporary funds have been in effect since Oct. 1, which marked the start of the current fiscal year."
        },
        {
            "id": 22,
            "text": "Such legislation was needed largely because the Republican-run Senate failed to pass any of the 12 regular spending bills needed to run government activities."
        },
        {
            "id": 23,
            "text": "McConnell said he and Pelosi have now agreed to work on a bill that would provide funding, which likely would be more than $1 trillion, through Sept. 30, 2021."
        },
        {
            "id": 24,
            "text": "Without action by Congress by Dec. 11, partial government shutdowns would occur."
        },
        {
            "id": 25,
            "text": "Even with McConnell’s somewhat conciliatory posture on Wednesday, negotiations could unravel."
        },
        {
            "id": 26,
            "text": "“I think the likelihood of divided government makes any agreement on COVID relief much more difficult to achieve, and substantial concessions to Republican preferences will be required,” said David Hopkins, a political science professor at Boston College."
        },
        {
            "id": 27,
            "text": "Nonetheless, history suggests that “lame duck” Congresses have a smoother time finding compromise in the weeks after an election."
        },
        {
            "id": 28,
            "text": "The Senate returns to Washington next week; the House, the week after that."
        },
        {
            "id": 29,
            "text": "“It is easier for members to vote for bills that might make some blocs of voters unhappy,” said American University Professor Jordan Tama."
        },
        {
            "id": 30,
            "text": "“Spending bills are a very good example,” he said."
        },
        {
            "id": 31,
            "text": "But Tama, an expert on Congress, said that if the outcome of the presidential election remains in doubt, it could be “impossible for Congress to be productive,” raising the prospect of a partial government shutdown after Dec. 11."
        },
        {
            "id": 32,
            "text": "Another unknown is whether President Donald Trump will sign whatever the lame duck Congress sends him for the rest of this year."
        }
    ]
}