{
    "title": "New Hampshire abolishes death penalty after state senate overrides governor",
    "text": [
        {
            "id": 0,
            "text": "New Hampshire, which hasn’t executed anyone in 80 years and has only one inmate on death row, has became the latest US state to abolish the death penalty when the state senate voted to override the governor’s veto."
        },
        {
            "id": 1,
            "text": "“Now it’s up to us to stop this practice that is archaic, costly, discriminatory and final,” said New Hampshire state senator Melanie Levesque."
        },
        {
            "id": 2,
            "text": "The senate vote came a week after the 400-member house voted by the narrowest possible margin to override Republican governor Chris Sununu’s veto of a bill to repeal capital punishment."
        },
        {
            "id": 3,
            "text": "New Hampshire’s death penalty applies in only seven scenarios: the killing of an on-duty law enforcement officer or judge, murder for hire, murder during a rape, certain drug offenses, or home invasion and murder by someone already serving a life sentence without parole."
        },
        {
            "id": 4,
            "text": "The state hasn’t executed anyone since 1939, and the repeal bill would not apply retroactively to Michael Addison, who killed Manchester officer Michael Briggs and is the state’s only inmate on death row."
        },
        {
            "id": 5,
            "text": "But death penalty supporters argued that courts will interpret it differently, giving Addison a chance at life in prison."
        },
        {
            "id": 6,
            "text": "“If you think you’re passing this today and Mr Addison is still going to remain on death row, you are confused,” said the state senator Sharon Carson."
        },
        {
            "id": 7,
            "text": "“Mr Addison’s sentence will be converted to life in prison.”"
        },
        {
            "id": 8,
            "text": "Carson argued that New Hampshire has a narrowly drawn law and a careful, deliberative process to ensure innocent people are not executed."
        },
        {
            "id": 9,
            "text": "“This is not Louisiana of the 1920s where Old Sparky was put on a flatbed truck and driven from prison to prison and people were executed."
        },
        {
            "id": 10,
            "text": "We are not those people,” she said."
        },
        {
            "id": 11,
            "text": "“That doesn’t happen here in New Hampshire.”"
        },
        {
            "id": 12,
            "text": "The senate vote, 16-8, was exactly the two-thirds majority necessary to override the veto."
        },
        {
            "id": 13,
            "text": "Twelve Democrats and four Republicans supported ending the death penalty, while six Republicans and two Democrats voted to keep it."
        },
        {
            "id": 14,
            "text": "The latter included Lou D’Allesandro, who represents the district in which Briggs was killed."
        },
        {
            "id": 15,
            "text": "He urged his colleagues to remember law enforcement officers who put their lives on the line every day."
        },
        {
            "id": 16,
            "text": "“I can’t abandon these people,” he said."
        },
        {
            "id": 17,
            "text": "“These people are there for us."
        },
        {
            "id": 18,
            "text": "They’re there for us, and I believe strongly we have to support them.”"
        },
        {
            "id": 19,
            "text": "Sununu, who vetoed the repeal bill surrounded by officers at a community center named for Briggs, said Thursday he was incredibly disappointed in the vote."
        },
        {
            "id": 20,
            "text": "“I have consistently stood with law enforcement, families of crime victims, and advocates for justice in opposing a repeal of the death penalty because it is the right thing to do,” he said in a statement."
        },
        {
            "id": 21,
            "text": "But state senator Bob Giuda, a former FBI agent, said while he greatly respects law enforcement, the death penalty is at odds with his pro-life principles."
        },
        {
            "id": 22,
            "text": "He called execution a “ghastly” process and urged his colleagues to “move our civilization” past it."
        },
        {
            "id": 23,
            "text": "“I think we’re better than that,” he said."
        },
        {
            "id": 24,
            "text": "“I choose to move our state forward to remove the death penalty.”"
        },
        {
            "id": 25,
            "text": "Thirty states allow capital punishment, but in four of them, governors have issued moratoriums on the death penalty, according to the Death Penalty Information Center."
        },
        {
            "id": 26,
            "text": "Twenty states have abolished or overturned it."
        },
        {
            "id": 27,
            "text": "New Hampshire lawmakers have been considering and rejecting repeal efforts for the last two decades."
        },
        {
            "id": 28,
            "text": "Former governor Joeanne Shaheen, a Democrat, vetoed a similar bill in 2000."
        },
        {
            "id": 29,
            "text": "Another Democrat, former governor John Lynch, signed a bill in 2011 expanding the death penalty to cover home invasions in response to a machete and knife attack that killed a woman and maimed her daughter in Mont Vernon."
        }
    ]
}