{
    "title": "Elizabeth Warren gets leadership post by Senate Democrats",
    "text": [
        {
            "id": 0,
            "text": "The Senate Democratic Caucus will have fewer members as the minority party in the next Congress, but they will have a larger leadership team."
        },
        {
            "id": 1,
            "text": "Senate Majority Leader Harry Reid, Nevada Democrat, announced Thursday that he was expanding the leadership team with the appointments Massachusetts Sen. Elizabeth Warren and Minnesota Sen. Amy Klobuchar, who will act as special liaisons to the party’s liberal base and to the Republicans, respectively."
        },
        {
            "id": 2,
            "text": "He made the announcement after a four-hour caucus meeting in which he and the rest of the current leadership team were re-elected to the same posts in the new minority."
        },
        {
            "id": 3,
            "text": "“We’re going to do things a little differently, just different approach,” said Mr. Reid, who suffered some criticism from members in light of Senate Democrats’ humiliating loses in the elections but nevertheless survived as their leader in the minority."
        },
        {
            "id": 4,
            "text": "The rank within leadership and the parameters of the jobs for Mrs. Warren and Mrs. Klobuchar remained unclear."
        },
        {
            "id": 5,
            "text": "“Somebody asked me on the way in here: ‘Liz Warren is going to be part of your leadership; what do you expect her to do?’"
        },
        {
            "id": 6,
            "text": "I expect her to be Elizabeth Warren,” Mr. Reid said."
        },
        {
            "id": 7,
            "text": "Mrs. Warren has become a darling of the party’s liberal base and was in high demand on the campaign trail this year."
        },
        {
            "id": 8,
            "text": "Adding her to the leadership team will both tap her star power and placate liberals who want see Democratic leaders tilt in a more liberal direction."
        },
        {
            "id": 9,
            "text": "Mrs. Klobuchar is a popular lawmaker who is credited with effectively working across the aisle."
        },
        {
            "id": 10,
            "text": "The expanded leadership team was designed to help Senate Democrats better address the needs of middle-class Americans, said Mr. Reid."
        },
        {
            "id": 11,
            "text": "“They’re not getting a fair shot, and we’re going to do everything we can in the 114th Congress to make sure the middle class of this great country of ours has a fair shot at succeeding,” he said."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        }
    ]
}