{
    "title": "Trump picks debt-warrior Mulvaney to lead White House budget office",
    "text": [
        {
            "id": 0,
            "text": "President-elect Donald Trump said Saturday that he’ll tap Rep. Mick Mulvaney to be his budget director, putting an ardent conservative in the job that has the most control over the size of the federal government."
        },
        {
            "id": 1,
            "text": "Mr. Mulvaney, a South Carolina Republican, was elected to Congress as part of the 2010 tea party wave, and carved out a role as one of House conservatives’ fiercest fighters for cutting spending."
        },
        {
            "id": 2,
            "text": "He voted against the 2011 debt deal and against most of the omnibus spending bills that have come to the floor during his six years in office."
        },
        {
            "id": 3,
            "text": "“We are going to do great things for the American people with Mick Mulvaney leading the Office of Management and Budget,” Mr. Trump said in a statement."
        },
        {
            "id": 4,
            "text": "The OMB is the nerve center for the federal government, serving as the White House’s chief oversight over the departments and agencies that dole out money and write regulations."
        },
        {
            "id": 5,
            "text": "While not as high-profile as other administration jobs, the OMB director has extensive influence over nearly every midlevel and major decision."
        },
        {
            "id": 6,
            "text": "Mr. Mulvaney takes cutting seriously, regularly coming in under the budget for his House office and returning unused money to the Treasury Department."
        },
        {
            "id": 7,
            "text": "He’s also sponsored a constitutional amendment to impose term limits, and has tried to end the abuse of war-funding bills to break budget caps."
        },
        {
            "id": 8,
            "text": "“Mick Mulvaney is the absolute right choice,” said House Speaker Paul D. Ryan."
        },
        {
            "id": 9,
            "text": "“In Congress, he has been a conservative reformer from day one, proposing solutions to fix the budget process and our regulatory system.”"
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}