{
    "title": "Workers Fearful of the Coronavirus Are Getting Fired and Losing Their Benefits",
    "text": [
        {
            "id": 0,
            "text": "DENVER — After scraping by for weeks on unemployment checks and peanut butter sandwiches, Jake Lyon recently received the call that many who temporarily lost their jobs because of the coronavirus pandemic have anticipated: The college-town tea shop where he worked was reopening, and it was time to go back."
        },
        {
            "id": 1,
            "text": "But Mr. Lyon, 23, and his co-workers in Fort Collins, Colo., who were temporarily laid off, worried about contracting the virus, so they asked the shop’s owners to delay reopening and meet with them to discuss safety measures."
        },
        {
            "id": 2,
            "text": "The reluctance cost them."
        },
        {
            "id": 3,
            "text": "Six of them permanently lost their jobs in May, and their former employer reported them to the state’s unemployment office to have their benefits potentially revoked."
        },
        {
            "id": 4,
            "text": "“You have all refused to go back to work,” their former boss wrote in an email."
        },
        {
            "id": 5,
            "text": "As people across the United States are told to return to work, employees who balk at the health risks say they are being confronted with painful reprisals: Some are losing their jobs if they try to stay home, and thousands more are being reported to the state to have their unemployment benefits cut off."
        },
        {
            "id": 6,
            "text": "The coronavirus pandemic continues to strain the economy."
        },
        {
            "id": 7,
            "text": "On Thursday, the Labor Department reported that 1.9 million Americans filed new claims for state unemployment insurance last week."
        },
        {
            "id": 8,
            "text": "Businesses want to bring back customers and profits."
        },
        {
            "id": 9,
            "text": "But workers now worry about contracting the coronavirus once they return to cramped restaurant kitchens, dental offices or conference rooms where few colleagues are wearing masks."
        },
        {
            "id": 10,
            "text": "Some states with a history of weaker labor protections are encouraging employers to report workers who do not return to their jobs, citing state laws that disqualify people from receiving unemployment checks if they refuse a reasonable offer of work."
        },
        {
            "id": 11,
            "text": "Oklahoma set up a “Return To Work” email address for businesses to report employees who turn down jobs."
        },
        {
            "id": 12,
            "text": "Ohio offered a similar way for employers to report coronavirus-related work refusals."
        },
        {
            "id": 13,
            "text": "Labor advocates and unions say the push to recall workers and kick reluctant employees off unemployment benefits carries grave risks in an age of coronavirus, when infections have rampaged through meatpacking plants, call centers, factories and other confined spaces where co-workers spend hours touching the same surfaces and breathing the same air."
        },
        {
            "id": 14,
            "text": "“Their choices are: ‘Do I go back and risk my life, or say no and risk being kicked off unemployment and not be able to pay my bills?’” said Rachel Bussett, an employment lawyer in Oklahoma, where 179 businesses have reported workers to the unemployment agency."
        },
        {
            "id": 15,
            "text": "Alabama, Oklahoma and South Carolina are among several states that have told workers they cannot continue to collect unemployment if they turn down a suitable job offer."
        },
        {
            "id": 16,
            "text": "Missouri has received 982 reports of workers refusing to return to their jobs."
        },
        {
            "id": 17,
            "text": "In Tennessee, where 735 workers have been reported for refusing to return to work, the state labor commissioner announced that the fear of contracting the coronavirus was not a good enough excuse to not go back."
        },
        {
            "id": 18,
            "text": "To continue to qualify for unemployment, workers need to be directly affected by the virus: They must have a diagnosed case of Covid-19, be caring for a patient or be confined by a quarantine, among other reasons outlined by Congress in the coronavirus stimulus law that was passed in March."
        },
        {
            "id": 19,
            "text": "The question has split along partisan lines, with some Republican politicians and business owners complaining that furloughed workers have little incentive to go back to work if they are earning more from the emergency aid passed by Congress."
        },
        {
            "id": 20,
            "text": "Steven Mnuchin, the Treasury secretary, recently told a Senate panel that workers who turned down their old jobs could be ineligible for unemployment payments."
        },
        {
            "id": 21,
            "text": "But Pennsylvania’s Democratic governor took a different view, saying that workers should refuse to go back to jobs they consider unsafe."
        },
        {
            "id": 22,
            "text": "“This is uncharted waters,” said Kersha Cartwright, a spokeswoman for the Georgia Department of Labor, which has encouraged businesses to work with employees on reopening plans after the state became one of the first in the country to forge ahead with reopening."
        },
        {
            "id": 23,
            "text": "In interviews across the country, workers said they were anxious to keep their jobs at a time when the economic devastation of the coronavirus has left more than 40 million in the country out of work."
        },
        {
            "id": 24,
            "text": "With the job market bleak and many family members unemployed, many people said they felt powerless to refuse an order to return to work or question the safety practices at their jobs."
        },
        {
            "id": 25,
            "text": "In the tea shop case, Mr. Lyon lost his unemployment benefits after his former bosses reported him to the Colorado Department of Labor and Employment."
        },
        {
            "id": 26,
            "text": "The state agency ruled that Mr. Lyon’s work “did not present an unacceptable risk” to his health, and disqualified him from unemployment for 20 weeks."
        },
        {
            "id": 27,
            "text": "“What we’re asking for is so basic during an unprecedented global pandemic,” Mr. Lyon said."
        },
        {
            "id": 28,
            "text": "But Qin Liu, who owns the tea shop, the Ku Cha House of Tea, with his wife, said they had tried to accommodate their employees’ safety concerns by limiting customers in the store, installing a sneeze guard at the cash register, requiring masks and halting tea services and free samples of their teas."
        },
        {
            "id": 29,
            "text": "But he said his business would founder if it stayed closed until there was a vaccine or cure."
        },
        {
            "id": 30,
            "text": "“They wanted to wait a little bit longer till the danger has passed,” Mr. Liu said."
        },
        {
            "id": 31,
            "text": "“But for us, a small business, the danger is imminent.”"
        },
        {
            "id": 32,
            "text": "Mr. Liu said the business was also obligated under Colorado labor laws to notify the state when they dismissed the six workers, inciting the unemployment investigation."
        },
        {
            "id": 33,
            "text": "In Toledo, Ohio, Stephanie VanSlambrouck, 45, said she urged her husband to quit when he was called back to his job as a steel fabricator after weeks of working from home."
        },
        {
            "id": 34,
            "text": "He reads blueprints and pores over figures all day, and has little need to go into the office, Ms. VanSlambrouck said."
        },
        {
            "id": 35,
            "text": "But the couple have three children, and had already lost their home to foreclosure once, after the 2008 housing crash."
        },
        {
            "id": 36,
            "text": "So now, her husband eats lunch at his desk, sanitizes his hands and wears a mask to the Monday morning planning meetings in the small conference room."
        },
        {
            "id": 37,
            "text": "“We’re caught,” Ms. VanSlambrouck said."
        },
        {
            "id": 38,
            "text": "“We have to do what our bosses are telling us."
        },
        {
            "id": 39,
            "text": "And to quit a job in this uncertain time would be ridiculous."
        },
        {
            "id": 40,
            "text": "You can’t walk away from something that’s providing food for the family because who knows what’s going to happen in a week?”"
        },
        {
            "id": 41,
            "text": "Mark Adani, a car salesman in suburban Detroit,"
        },
        {
            "id": 42,
            "text": "spent weeks working from home to avoid the coronavirus."
        },
        {
            "id": 43,
            "text": "He is 71 and has high blood pressure and a wife with heart trouble."
        },
        {
            "id": 44,
            "text": "But he recently got an ultimatum from his dealership: Come back to the office or consider a new job."
        },
        {
            "id": 45,
            "text": "“I’m damned if I come to work, damned if I don’t come to work,” he said."
        },
        {
            "id": 46,
            "text": "Mr. Adani said one worker had already died of Covid-19, and he flirted with letting his bosses dismiss him when he was called back to the office."
        },
        {
            "id": 47,
            "text": "Ultimately, he decided to go back."
        },
        {
            "id": 48,
            "text": "He was unable to reach anyone from Michigan’s overwhelmed unemployment system to answer whether he could refuse to go back and still retain his benefits."
        },
        {
            "id": 49,
            "text": "With customers scarce, Mr. Adani said he spent much of the day at his desk, chasing online leads and worrying about bringing home the virus to his wife."
        },
        {
            "id": 50,
            "text": "Most of his co-workers slip on masks when they head to the break room for coffee."
        },
        {
            "id": 51,
            "text": "“I really don’t feel this place is safe,” Mr. Adani said."
        },
        {
            "id": 52,
            "text": "Nurses, grocery store workers, fast-food cashiers, slaughterhouse workers and others deemed “essential” have been navigating these fears throughout the pandemic because they never stopped working."
        },
        {
            "id": 53,
            "text": "Now, the concern is spreading to wider areas of the economy."
        },
        {
            "id": 54,
            "text": "In Boise, Idaho, Robin Slater, a 65-year-old line cook with chronic shortness of breath from 40 years of smoking, said he was reluctant to answer the call back to work at the sports bar where he constantly bumps up against other cooks in the tiny kitchen."
        },
        {
            "id": 55,
            "text": "He said he was the only one who wore a mask."
        },
        {
            "id": 56,
            "text": "The plan, he said, was to limit tables to six people or fewer, though a party of 14 came in to eat last Sunday."
        },
        {
            "id": 57,
            "text": "Mr. Slater said he had little choice other than returning to work because he was almost certain to lose his $220 in weekly unemployment, supplemented by the $600 passed as part of the coronavirus relief bill."
        },
        {
            "id": 58,
            "text": "So far, 147 workers in Idaho have been reported as refusing to work, though the state did not say how many had lost benefits."
        },
        {
            "id": 59,
            "text": "Mr. Slater’s uneasiness has not gone away after his first few shifts, though few others at work seem bothered."
        },
        {
            "id": 60,
            "text": "“Most of our servers and cooks are in their 20s and 30s,” Mr. Slater said."
        },
        {
            "id": 61,
            "text": "“They’re all like, ‘It doesn’t really matter.’"
        },
        {
            "id": 62,
            "text": "But I don’t want to go back to work and die.”"
        }
    ]
}