{
    "title": "Kellyanne Conway says El Paso, Dayton are 'safe and ready' for Trump visit on Wednesday",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON – Despite objections from some residents, President Donald Trump will travel Wednesday to El Paso, Texas, and Dayton, Ohio, to review recovery efforts from mass shootings over the weekend, officials said Tuesday."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "\"The president has wanted to go there since he learned of these tragedies,\" presidential counselor Kellyanne Conway said."
        },
        {
            "id": 3,
            "text": "\"The Secret Service says that it's safe and ready.\""
        },
        {
            "id": 4,
            "text": "Trump plans to visit with victims' families, survivors and law enforcement personnel involved in El Paso and Dayton, Conway said, just as he has on previous trips to the sites of mass shootings and natural disasters."
        },
        {
            "id": 5,
            "text": "The Federal Aviation Administration has issued a notification of \"VIP movement\" in El Paso and Dayton on Wednesday."
        },
        {
            "id": 6,
            "text": "In remarks at the White House on Monday, the president and first lady Melania Trump said they are praying for the victims, their families and the survivors."
        },
        {
            "id": 7,
            "text": "\"We will stand by their side forever,\" Trump said."
        },
        {
            "id": 8,
            "text": "\"We will never forget."
        },
        {
            "id": 9,
            "text": "These barbaric slaughters are an assault upon our communities, an attack upon our nation, and a crime against all of humanity.\""
        },
        {
            "id": 10,
            "text": "Trump responds:Trump slams white nationalism, vows to respond to shootings"
        },
        {
            "id": 11,
            "text": "Some residents and lawmakers in El Paso have asked Trump to stay away, given his past attacks on some migrants and claims that they are \"invading\" the United States."
        },
        {
            "id": 12,
            "text": "The killer in El Paso authored an anti-immigration \"manifesto\" that echoed some of Trump's language."
        },
        {
            "id": 13,
            "text": "\"Words have consequences: The president has made my community and my people the enemy,\" said Rep. Veronica Escobar, D-Texas, an El Paso lawmaker speaking on MSNBC."
        },
        {
            "id": 14,
            "text": "\"He has told the country that we are people to be feared, people to be hated.\""
        },
        {
            "id": 15,
            "text": "Democratic presidential candidate Beto O'Rourke, who once represented the El Paso area as a member of the U.S. House, said Trump \"helped create the hatred that made Saturday's tragedy possible,\" and therefore \"should not come to El Paso."
        },
        {
            "id": 16,
            "text": "We do not need more division."
        },
        {
            "id": 17,
            "text": "We need to heal."
        },
        {
            "id": 18,
            "text": "He has no place here.\""
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "El Paso Mayor Dee Margo told reporters he is aware of the protests surrounding Trump's visit, but he believes it is his \"formal duty\" as mayor to welcome the president to the city."
        },
        {
            "id": 22,
            "text": "Margo said he plans to ask the president \"to support our efforts with any and all federal resources that are available.\""
        },
        {
            "id": 23,
            "text": "Dayton Mayor Nan Whaley, who has also said that Trump would be visiting, made a wisecrack about how Trump, in his speech, mistakenly said \"Toledo\" rather than \"Dayton.\""
        },
        {
            "id": 24,
            "text": "\"You know,\" she said, \"he might be going to Toledo, I don't know.\""
        },
        {
            "id": 25,
            "text": ""
        }
    ]
}