{
    "title": "Divisions remain on infrastructure as clock ticks on bipartisan deal",
    "text": [
        {
            "id": 0,
            "text": "Negotiations for an infrastructure package took center stage on Sunday as the clock ticks for the White House and Senate Republicans to strike a bipartisan deal on a trillion-dollar package."
        },
        {
            "id": 1,
            "text": "The administration and Senate Republicans, led by Sen. Shelley Moore Capito Shelley Wellons Moore CapitoOvernight Energy & Environment — Presented by Climate Power — Senate Democrats ding Biden energy proposal"
        },
        {
            "id": 2,
            "text": "Capito grills EPA nominee on '#ResistCapitalism' tweet GOP senators unveil bill designating Taliban as terrorist organization MORE (W.Va.), have traded infrastructure proposals in recent weeks as debate swirls about what should be included in the package, the total price tag and how the investments should be paid for."
        },
        {
            "id": 3,
            "text": "A main sticking point is what Democrats have dubbed “human infrastructure,” which includes investments in long-term care for seniors and people with disabilities."
        },
        {
            "id": 4,
            "text": "Republicans, however, are arguing that the package should remain focused on “core physical infrastructure,” including funding for roads and bridges."
        },
        {
            "id": 5,
            "text": "The two sides are also at odds over how to pay for an infrastructure bill."
        },
        {
            "id": 6,
            "text": "The White House has proposed increasing the corporate tax rate, which Republicans are firmly opposed to."
        },
        {
            "id": 7,
            "text": "Instead, the GOP has called for repurposing some leftover COVID-19 funding to finance the investments."
        },
        {
            "id": 8,
            "text": "Transportation Secretary Pete Buttigieg Pete ButtigiegDo progressives prefer Trump to compromise?"
        },
        {
            "id": 9,
            "text": "DOJ sues to block JetBlue-American Airlines partnership On The Money — Presented by Wells Fargo — Pelosi plows full speed ahead on jam-packed agenda MORE on Sunday said there is “still lots of daylight” between the two sides."
        },
        {
            "id": 10,
            "text": "“There are a lot of conversations going on among a lot of members of the Senate and over on the House side."
        },
        {
            "id": 11,
            "text": "On Wednesday, there's going to be a markup for a key element of infrastructure policy."
        },
        {
            "id": 12,
            "text": "So lots going on right now but still lots of daylight, honestly, between us and our Republican friends,” Buttigieg told host John Dickerson on CBS’s “Face the Nation.”"
        },
        {
            "id": 13,
            "text": "Capito last week raised the GOP’s proposal by $50 billion."
        },
        {
            "id": 14,
            "text": "White House press secretary Jen Psaki Jen PsakiGen."
        },
        {
            "id": 15,
            "text": "Milley faces his toughest day yet on Capitol Hill White House says 'no link' between release of Huawei exec and 'Two Michaels' The Hill's 12:30 Report - Presented by Facebook - Lawmakers fret over wild week of deadlines MORE said that while Biden expressed “gratitude for her effort and goodwill,” the offer “did not meet his objectives to grow the economy, tackle the climate crisis, and create new jobs.”"
        },
        {
            "id": 16,
            "text": "This comes after Senate Republicans unveiled a $928 billion infrastructure proposal last month."
        },
        {
            "id": 17,
            "text": "The offer, while substantially more than the caucus’s initial $568 billion proposal introduced in April, fell far short of the $1.7 trillion counteroffer White House officials made last week."
        },
        {
            "id": 18,
            "text": "Buttigieg echoed that sentiment on Sunday, telling CBS that the offer “really did not meet the president's objectives in terms of what we need to do for a generational investment.”"
        },
        {
            "id": 19,
            "text": "While the two sides are still divided on a number of key infrastructure issues, one prominent Senate Democrat, Sen. Joe Manchin Joe ManchinProtesters demonstrate outside Manchin's houseboat over opposition to reconciliation package Security policy expert: Defense industry donations let lawmakers 'ignore public opinion' Manchin cast doubt on deal this week for .5"
        },
        {
            "id": 20,
            "text": "T spending bill MORE (W.Va.), expressed optimism at the prospect of striking a bipartisan deal at this stage of negotiations."
        },
        {
            "id": 21,
            "text": "He told host Chris Wallace Christopher (Chris)"
        },
        {
            "id": 22,
            "text": "WallaceAbbott promises to hire Border Patrol agents punished by Biden administration DHS secretary says Haitian migrant crisis is 'nothing new' Yarmuth and Clyburn suggest .5"
        },
        {
            "id": 23,
            "text": "T package may be slimmed MORE on “Fox News Sunday” that he is “very, very confident” that the two sides can reach a deal."
        },
        {
            "id": 24,
            "text": "“There's a lot that's been done with the COVID bills that we put out that basically overlap in some areas of infrastructure, but there's a lot more that needs to be done."
        },
        {
            "id": 25,
            "text": "And I think we can come to that compromise to where we'll find a bipartisan deal."
        },
        {
            "id": 26,
            "text": "I'm very, very confident of that,” Manchin said."
        },
        {
            "id": 27,
            "text": "He added that the two parties are “not that far apart,” adding that “we think we can find a pathway for it.”"
        },
        {
            "id": 28,
            "text": "Energy Secretary Jennifer Granholm Jennifer GranholmFederal watchdog calls on Congress, Energy Dept. to overhaul nuclear waste storage process Energy Department's loan program helped Tesla; now it needs to help low-income communities Biden administration launches new effort to help communities with energy transition MORE also said that a compromise is still on the table but stressed that action on infrastructure “has got to be done soon.”"
        },
        {
            "id": 29,
            "text": "She noted that the House is set to mark up its version of the bill on Wednesday, upping the pressure to reach a deal."
        },
        {
            "id": 30,
            "text": "“It's just curious why there isn't more coming together. ..."
        },
        {
            "id": 31,
            "text": "The president still has hope."
        },
        {
            "id": 32,
            "text": "Joe Manchin still has hope."
        },
        {
            "id": 33,
            "text": "We all have hope that it can happen."
        },
        {
            "id": 34,
            "text": "They will be talking on Monday, but I can tell you the House will start their markup on Wednesday.”"
        },
        {
            "id": 35,
            "text": "Granholm placed the blame on Republicans for the drawn-out negotiations, telling CNN that it is “perplexing” that Republicans “haven’t moved further on critical pieces.”"
        }
    ]
}