{
    "title": "Federal prosecutors recommend that Andrew McCabe, former FBI second-in-command, face criminal charge",
    "text": [
        {
            "id": 0,
            "text": "Federal prosecutors recommended seeking criminal charges against Andrew McCabe, the former deputy director of the FBI and a frequent target of criticism by President Donald Trump, according to people familiar with the decision Thursday."
        },
        {
            "id": 1,
            "text": "McCabe was fired from the FBI just before his retirement in March 2018 after the Justice Department's internal watchdog concluded that he improperly authorized a leak about a federal investigation into the Clinton Foundation in the final weeks of the 2016 presidential campaign."
        },
        {
            "id": 2,
            "text": "Investigators concluded that he displayed a lack of candor when asked about the leak."
        },
        {
            "id": 3,
            "text": "The U.S. attorney in Washington, Jessie Liu, recommended moving forward with unspecified charges against McCabe, according to people familiar with the situation who were not authorized to comment publicly."
        },
        {
            "id": 4,
            "text": "McCabe's lawyers appealed that decision to Deputy Attorney General Jeffrey Rosen, who rejected their request, one of the people said."
        },
        {
            "id": 5,
            "text": "McCabe's lawyers were informed of that decision Thursday."
        },
        {
            "id": 6,
            "text": "The decision clears the way for prosecutors to ask a grand jury to indict McCabe, though it was unclear Thursday whether that would happen."
        },
        {
            "id": 7,
            "text": "Whether McCabe is indicted will be up to a federal grand jury in Washington."
        },
        {
            "id": 8,
            "text": "The U.S. Attorney's Office in Washington declined to comment."
        },
        {
            "id": 9,
            "text": "The recommendation that McCabe be charged is the latest fallout from the FBI's handling of investigations around the 2016 presidential election, when agents investigated both of the major-party candidates."
        },
        {
            "id": 10,
            "text": "Those investigations – into Russian meddling to help Trump win the presidency and Democrat Hillary Clinton's use of a private email server – inserted the FBI into the center of fraught political controversies."
        },
        {
            "id": 11,
            "text": "Then-Attorney General Jeff Sessions fired McCabe after a Justice Department Inspector General’s report found he misstated his involvement in a leak to The Wall Street Journal days before the election about an FBI investigation into the Clinton Foundation."
        },
        {
            "id": 12,
            "text": "He was ousted days before he could begin collecting retirement benefits."
        },
        {
            "id": 13,
            "text": "McCabe, who became acting FBI director after Trump fired James Comey in May 2017, has been the target of the president's attacks."
        },
        {
            "id": 14,
            "text": "Trump accused law enforcement officials of partisan investigations of him, his campaign and his administration."
        },
        {
            "id": 15,
            "text": "Inquiries led to charges against a half-dozen of Trump's aides and advisers."
        },
        {
            "id": 16,
            "text": "Trump applauded the decision to fire McCabe in March 2018, calling it \"a great day for democracy.”"
        },
        {
            "id": 17,
            "text": "Trump called McCabe a \"major sleazebag\" and argued that his conduct was akin to treason for favoring Clinton, Trump's Democratic rival in 2016."
        },
        {
            "id": 18,
            "text": "The election-year investigations roiled the top ranks of the FBI."
        },
        {
            "id": 19,
            "text": "Internal investigators faulted McCabe and Comey for violating Justice Department rules in the final months of the campaign."
        },
        {
            "id": 20,
            "text": "Lower-level staffers were fired or reassigned."
        },
        {
            "id": 21,
            "text": "The Justice Department announced Aug. 29 that Comey violated bureau policies for keeping private memos about his conversations with Trump, then having a friend describe the contents of one memo to The New York Times for a story."
        },
        {
            "id": 22,
            "text": "The department didn't charge Comey criminally."
        },
        {
            "id": 23,
            "text": "McCabe's firing came after the inspector general investigated the information behind a Wall Street Journal story about the Clinton Foundation to determine whether it was an unauthorized leak and if so, who was the source."
        },
        {
            "id": 24,
            "text": "The story appeared online Oct. 30, 2016, and in print Oct. 31, which was a week after another story reported that McCabe terminated the foundation probe under pressure from the Justice Department."
        },
        {
            "id": 25,
            "text": "Investigators determined that McCabe, to promote his impartiality, authorized associates to disclose a call Aug. 12 between McCabe and the principal associate deputy attorney general to The Wall Street Journal."
        },
        {
            "id": 26,
            "text": "The call effectively confirmed the existence of the Clinton Foundation investigation, which Comey refused to do."
        },
        {
            "id": 27,
            "text": "The inspector general found McCabe “lacked candor” when he said he hadn't authorized the disclosure and didn't know who did while talking to Comey, when questioned under oath by FBI agents, then when questioned under oath by investigators for special counsel Robert Mueller."
        },
        {
            "id": 28,
            "text": "McCabe filed a lawsuit in August challenging his dismissal, alleging that Justice Department officials demoted him in January 2018 and fired him two months later to cater to Trump’s “unlawful whims.”"
        },
        {
            "id": 29,
            "text": "McCabe's termination came after he had announced his intention to resign and days before his full retirement benefits would have set in."
        },
        {
            "id": 30,
            "text": "Trump's political accusations against McCabe stemmed from his wife running unsuccessfully for state Senate as a Democrat in Virginia."
        },
        {
            "id": 31,
            "text": "Trump seized on contributions Jill McCabe received from a political action committee tied with Virginia Gov. Terry McAuliffe, a Clinton ally."
        },
        {
            "id": 32,
            "text": "Trump said McCabe took “massive amounts of money” for his wife’s campaign."
        },
        {
            "id": 33,
            "text": "Internal FBI documents stated that McCabe didn't oversee the Clinton investigation while his wife was running for office and that he didn't have a conflict of interest."
        },
        {
            "id": 34,
            "text": "McCabe argued in television interviews that top congressional leaders were notified about the counterintelligence inquiry into Russian influence on Trump's campaign and nobody objected."
        },
        {
            "id": 35,
            "text": "The decision about McCabe comes amid several investigations of how the Justice Department and the FBI began inquiries into Russian interference in the 2016 election."
        },
        {
            "id": 36,
            "text": "Attorney General William Barr assigned one internal probe in May."
        },
        {
            "id": 37,
            "text": "Inspector General Michael Horowitz’s review launched in March 2018 focuses on an FBI wiretap of Carter Page, a former policy adviser to Trump's campaign."
        },
        {
            "id": 38,
            "text": "The inspector general looked into whether the FBI violated the Foreign Intelligence Surveillance Act, or FISA, when it sought court-ordered surveillance of Page in late 2016."
        },
        {
            "id": 39,
            "text": "Horowitz examined the FBI's relationship and communication with Christopher Steele, a former British intelligence officer who was hired by a research firm working for Clinton's campaign and compiled a \"dossier\" alleging links between Russia and the Trump campaign."
        },
        {
            "id": 40,
            "text": "Republicans complained that the FBI concealed its reliance on Steele's findings in the surveillance applications for Page."
        },
        {
            "id": 41,
            "text": "Copies of those applications released after USA TODAY and others sued showed investigators disclosed to judges that Steele sought information to \"discredit\" Trump and that investigators had broader suspicions about Page's ties to the Russian government."
        },
        {
            "id": 42,
            "text": "Mueller took over the Russia investigation in May 2017 after Trump fired Comey."
        },
        {
            "id": 43,
            "text": "Mueller's report, released in April, detailed a \"sweeping and systematic\" effort by the Russian government to intercede in the election to help Trump win but \"did not establish that members of the Trump Campaign conspired or coordinated with the Russian government in its election interference activities.”"
        },
        {
            "id": 44,
            "text": ""
        }
    ]
}