{
    "title": "Obama To Unveil Plan To Bring Overtime Pay To 5 Million More Workers",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- President Barack Obama this week will propose a plan to extend overtime pay to 5 million American workers who are currently excluded under federal law, according to sources."
        },
        {
            "id": 1,
            "text": "The president will recommend updating overtime rules so that salaried workers who earn less than roughly $50,400 per year would be guaranteed time-and-a-half pay when they work more than 40 hours in a week."
        },
        {
            "id": 2,
            "text": "Under the current rules implemented by former President George W. Bush, salaried workers must earn less than $23,660 per year in order to be automatically eligible for overtime pay."
        },
        {
            "id": 3,
            "text": "The president announced his intention to make overtime reforms last year, but the details of the plan have been kept secret until this week."
        },
        {
            "id": 4,
            "text": "The president is expected to discuss the proposal later this week during a visit to Wisconsin."
        },
        {
            "id": 5,
            "text": "Details of the proposal were first reported by Bloomberg."
        },
        {
            "id": 6,
            "text": "In a blog post on The Huffington Post Monday night, Obama said that \"too many Americans are working long days for less pay than they deserve,\" and that his proposal would help assure that \"hard work is rewarded.\""
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "\"That’s how America should do business,\" the president wrote."
        },
        {
            "id": 9,
            "text": "\"In this country, a hard day’s work deserves a fair day’s pay."
        },
        {
            "id": 10,
            "text": "That’s at the heart of what it means to be middle class in America.\""
        },
        {
            "id": 11,
            "text": "With heavy lobbying by business groups, many progressives feared the White House would recommend only modest changes, thereby impacting relatively few workers and employers."
        },
        {
            "id": 12,
            "text": "Instead, the White House has proposed a substantial reform that has the potential to change pay and scheduling for millions of people."
        },
        {
            "id": 13,
            "text": "Employers whose workers become newly eligible for overtime will now face a choice: Either pay a premium for those extra hours worked, or get the employee's hours below 40 per week, likely by shifting the labor to other workers."
        },
        {
            "id": 14,
            "text": "The proposal would be robust enough to cut across industries, bringing many workers either more pay or more time off, and forcing many employers to grapple with overtime costs that they never had to before."
        },
        {
            "id": 15,
            "text": "The proposal must still undergo a public-comment period before it can be finalized and go into effect, but the release of a concrete proposal will mark a major step in what's likely to be one of the president's most far-reaching reforms undertaken without congressional approval."
        },
        {
            "id": 16,
            "text": "The changes are expected to go into effect in 2016."
        },
        {
            "id": 17,
            "text": "Last year, Obama signed an executive order directing the Labor Department to overhaul the overtime rules, setting off a lobbying campaign in Washington."
        },
        {
            "id": 18,
            "text": "On one side were labor groups, progressive economists and Democratic lawmakers who pressed for an ambitious reform that would reach a large share of the U.S. workforce."
        },
        {
            "id": 19,
            "text": "On the other side were employers and business lobbies that wanted to limit the rule's effects as much as possible, given the new labor costs they would face."
        },
        {
            "id": 20,
            "text": "Under wage laws established during the Great Depression, employers must pay overtime to hourly wage earners and salaried workers who aren't considered white-collar."
        },
        {
            "id": 21,
            "text": "But the current rules give employers a lot of leeway to classify workers as managerial and therefore ineligible for time-and-a-half pay."
        },
        {
            "id": 22,
            "text": "As HuffPost reported in 2013, this phenomenon is especially prevalent in the retail industry, where store managers can work 80-hour weeks without any pay beyond their base salary, even though they may be doing mostly manual labor."
        },
        {
            "id": 23,
            "text": "Obama pointed expressly to these workers in an interview with HuffPost in March."
        },
        {
            "id": 24,
            "text": "\"What we’ve seen is, increasingly, companies skirting basic overtime laws, calling somebody a manager when they’re stocking groceries and getting paid $30,000 a year,\" Obama said."
        },
        {
            "id": 25,
            "text": "\"Those folks are being cheated.\""
        },
        {
            "id": 26,
            "text": "Workers whose salaries fall beneath the threshold are guaranteed overtime pay regardless of what their bosses call them."
        },
        {
            "id": 27,
            "text": "Although the reforms are expected to hit industries like retail the most, the impact will be felt in any field where the hours are relatively long and the pay relatively low."
        },
        {
            "id": 28,
            "text": "Since the threshold hasn't risen alongside American salaries, overtime pay has become something of a foreign concept for most Americans -- something that could now change."
        },
        {
            "id": 29,
            "text": "According to estimates from the Economic Policy Institute, just 11 percent of salaried workers in the U.S. are covered by overtime law under the current rules."
        },
        {
            "id": 30,
            "text": "That share would be closer to half of salaried workers under the new proposal, by EPI's estimates."
        }
    ]
}