{
    "title": "After Brown autopsy, mom wants officer arrested",
    "text": [
        {
            "id": 0,
            "text": "Yamiche Alcindor and Kevin Johnson\n\nUSA TODAY\n\nFERGUSON, Mo. —"
        },
        {
            "id": 1,
            "text": "A preliminary autopsy report has convinced the family of Michael Brown that the police officer who shot him should be arrested, a lawyer for the family said Monday."
        },
        {
            "id": 2,
            "text": "\""
        },
        {
            "id": 3,
            "text": "His mother asked the questions that ... lawyers could not answer. '"
        },
        {
            "id": 4,
            "text": "What else do we need to get them to arrest the killer of my child?'"
        },
        {
            "id": 5,
            "text": "\" lawyer Benjamin Crump said at a news conference here."
        },
        {
            "id": 6,
            "text": "Crump said Brown's mother, Lesley McSpadden, asked if her son suffered pain before he died."
        },
        {
            "id": 7,
            "text": "Pathologist Michael Baden, who conducted the autopsy at the family's request, \"shared his opinion that he did not suffer,\" Crump said."
        },
        {
            "id": 8,
            "text": "Baden, who also spoke at the news conference, said Brown, 18, was shot at least six times, including twice in the head."
        },
        {
            "id": 9,
            "text": "None of the bullets entered from the back, and three were recovered from Brown's body, he said."
        },
        {
            "id": 10,
            "text": "Brown could have survived all of his wounds except for the shot to the top of his head, Baden said."
        },
        {
            "id": 11,
            "text": "That shot was probably sustained last, hitting Brown as he was bending over, and exited through his right eye, he said."
        },
        {
            "id": 12,
            "text": "Baden said Brown was shot from at least one foot away but the distance could have been as far as 30 feet."
        },
        {
            "id": 13,
            "text": "He said six bullets entered Brown's body and at least two bullets ricocheted and traveled back through his body."
        },
        {
            "id": 14,
            "text": "Bullet wounds to Brown's arms could have been sustained by putting his hands up or crossing his arms, he said."
        },
        {
            "id": 15,
            "text": "Baden said his results could be consistent with police or witness accounts of how Brown died."
        },
        {
            "id": 16,
            "text": "Crump's position was clear."
        },
        {
            "id": 17,
            "text": "\""
        },
        {
            "id": 18,
            "text": "It verifies the worst that the family thinks happened — that he was executed,\" Crump told USA TODAY."
        },
        {
            "id": 19,
            "text": "\"It confirms what the witnesses said, that this was an execution."
        },
        {
            "id": 20,
            "text": "That's what the witnesses said from Day One.\""
        },
        {
            "id": 21,
            "text": "\"It's so hard for his mother and father to even deal with the notion that this is what happened,\" Crump said."
        },
        {
            "id": 22,
            "text": "\"It's obvious his hands were up at some point because you can tell how the bullet goes from in and out.\""
        },
        {
            "id": 23,
            "text": "Brown was unarmed when Ferguson police officer Darren Wilson, 28, shot him on a street Aug. 9."
        },
        {
            "id": 24,
            "text": "Witnesses said Brown had raised his hands to surrender when he was shot."
        },
        {
            "id": 25,
            "text": "The shooting and police response drew racially charged protests that have sometimes turned violent."
        },
        {
            "id": 26,
            "text": "U.S. Attorney General Eric Holder, who ordered a separate federal autopsy of Brown, said it was being performed Monday by a U.S. military medical examiner he described as \"one of the most experienced'' in the armed forces."
        },
        {
            "id": 27,
            "text": "\"I am confident this additional autopsy will be thorough and aid in our investigation,'' he said in a written statement issued following his meeting with President Obama."
        },
        {
            "id": 28,
            "text": "\"As I informed the President this afternoon, the full resources of the Department of Justice are being committed to our federal civil rights investigation into the death of Michael Brown."
        },
        {
            "id": 29,
            "text": "During the day today, more than 40 FBI agents continued their canvassing of the neighborhood where Michael Brown was shot."
        },
        {
            "id": 30,
            "text": "As a result of this investigative work, several new interviews have already been conducted.''"
        },
        {
            "id": 31,
            "text": "Holder will also travel to Ferguson on Wednesday where he will meet with local officials, and FBI investigators who are assisting in a federal, civil rights inquiry into Brown's shooting."
        },
        {
            "id": 32,
            "text": "]"
        },
        {
            "id": 33,
            "text": "He asked for the public to be patient as the facts are gathered."
        },
        {
            "id": 34,
            "text": "\""
        },
        {
            "id": 35,
            "text": "The selective release of sensitive information that we have seen in this case so far is troubling to me,'' Holder said."
        },
        {
            "id": 36,
            "text": "\"No matter how others pursue their own separate inquiries, the Justice Department is resolved to preserve the integrity of its investigation."
        },
        {
            "id": 37,
            "text": "This is a critical step in restoring trust between law enforcement and the community, not just in Ferguson, but beyond.''"
        },
        {
            "id": 38,
            "text": "Baden said a final autopsy report would require study of the clothes Brown was wearing to see if they contained gunshot residue, which would indicate whether at least one shot was fired at close range."
        },
        {
            "id": 39,
            "text": "No residue was found on Brown's body, Baden said."
        },
        {
            "id": 40,
            "text": "Baden said he also needs eyewitness and toxicology reports."
        },
        {
            "id": 41,
            "text": "The St. Louis County Medical Examiner's autopsy concluded that Brown died of gunshot wounds, but other details have not been released."
        },
        {
            "id": 42,
            "text": "The Washington Post, citing a person familiar with that autopsy, said the county autopsy indicates Brown was shot six to eight times and that he had marijuana in his system."
        },
        {
            "id": 43,
            "text": "Suzanne McCune, administrator of the medical examiner's office, said the only information the office is providing is that Brown died of gunshot wounds to the head and chest."
        },
        {
            "id": 44,
            "text": "She said she could not confirm the marijuana report."
        },
        {
            "id": 45,
            "text": "Shawn Parcells, a forensic pathologist assistant who helped conduct the autopsy requested by Brown's family, told CNN Monday afternoon that while certain aspects of the investigation take time, \"what i am surprised about, that at least the preliminary results of the autopsy itself didn't come out sooner than they did.''"
        },
        {
            "id": 46,
            "text": "U.S. Attorney General Eric Holder on Sunday ordered a separate, third autopsy."
        },
        {
            "id": 47,
            "text": "Citing the \"extraordinary'' nature of the case, Justice Department spokesman Brian Fallon said Holder directed the action at the request of Brown's family."
        },
        {
            "id": 48,
            "text": "The Justice Department is conducting a separate inquiry into possible civil rights violations related to the shooting."
        },
        {
            "id": 49,
            "text": "About 40 FBI agents have been deployed to the investigation to assist in canvassing neighborhoods for witnesses."
        }
    ]
}