{
    "title": "Pence stays at Trump's Doonbeg resort hours away from official meetings",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "When Vice President Mike Pence woke up Tuesday in the west of Ireland, he had a long commute ahead of him: the span of the entire island to Dublin, where he was meeting with government officials."
        },
        {
            "id": 2,
            "text": "The reason for the journey: Pence was staying at the golf property owned by his boss, President Donald Trump, in Doonbeg."
        },
        {
            "id": 3,
            "text": "That’s 181 miles — or an hour’s drive plus a 40-minute flight — away from the government buildings where Pence will conduct his official visit on Tuesday."
        },
        {
            "id": 4,
            "text": "Pence also happens to have family connections to the tiny Irish village, surrounded by windswept Atlantic coastline and bogland."
        },
        {
            "id": 5,
            "text": "His great-grandmother was from there, and a distant cousin still owns Morrissey’s Pub in town."
        },
        {
            "id": 6,
            "text": "Pence defended the choice."
        },
        {
            "id": 7,
            "text": "Citing his family connections to the town, Pence told reporters in Dublin it was “important for me to at least spend one night in Doonbeg.”"
        },
        {
            "id": 8,
            "text": "“I understand political attacks by Democrats,” he said."
        },
        {
            "id": 9,
            "text": "“If you have a chance to get to Doonbeg you’ll find it’s a fairly small place.”"
        },
        {
            "id": 10,
            "text": "In order to “accommodate the unique footprint” of the vice president’s entourage, the Trump resort made “logical” sense, Pence said."
        },
        {
            "id": 11,
            "text": "But the decision to spend two nights at the President’s own hotel is nevertheless drawing outcry from ethics groups and Democrats, who have already questioned government expenditures at Trump’s various properties during his presidency."
        },
        {
            "id": 12,
            "text": "“While the president is making appearances at his Virginia golf club, the vice president is making appearances at his Ireland golf club."
        },
        {
            "id": 13,
            "text": "Because the priority is always making Trump money,” tweeted Citizens for Responsibility and Ethics in Washington, a watchdog group."
        },
        {
            "id": 14,
            "text": "Trump visited his Virginia golf course on Monday, as the southeast United States was preparing for Hurricane Dorian."
        },
        {
            "id": 15,
            "text": "Democratic Rep. Ted Lieu of California, a frequent Trump critic, wrote on Twitter that Pence’s decision to stay at the President’s hotel was “sooooooo corrupt.”"
        },
        {
            "id": 16,
            "text": "Pence’s aides defended the decision to overnight at the Trump International Golf Links & Hotel, saying the plan was approved by the State Department and lower-cost options are always explored."
        },
        {
            "id": 17,
            "text": "The facility — with a 218-room lodge, a spa and several restaurants — was the only place large enough in remote Doonbeg to house the vice president’s traveling entourage, according to Marc Short, his chief of staff."
        },
        {
            "id": 18,
            "text": "The President himself suggested staying at his property upon learning Pence would be visiting the town."
        },
        {
            "id": 19,
            "text": "“When we went through the trip, it’s like, well, he’s going to Doonbeg because that’s where the Pence family is from."
        },
        {
            "id": 20,
            "text": "It’s like, ‘Well, you should stay at my place,’ ”"
        },
        {
            "id": 21,
            "text": "Short told reporters on Tuesday."
        },
        {
            "id": 22,
            "text": "But asked whether the President had offered to comp the cost of the stay, Short said he hadn’t."
        },
        {
            "id": 23,
            "text": "“No, this is following the normal procedures that we usually have,” he said."
        },
        {
            "id": 24,
            "text": "“Because it has, again, the size that can we think can accommodate us and Secret Service can protect us.”"
        },
        {
            "id": 25,
            "text": "A spokesperson for the vice president later said in a statement that the decision to stay at the property was “solely” a decision by the vice president’s office and “at no time did the President direct our office to stay at his Doonbeg resort.”"
        },
        {
            "id": 26,
            "text": "Later, Short said that Pence would personally foot the bill for his mother and sister, who are traveling with him to Ireland."
        },
        {
            "id": 27,
            "text": "Short also explained that last-minute changes to Pence’s itinerary — prompted by Trump’s cancellation of a trip to Poland, which the vice president visited instead — meant the awkward back-and-forth between County Clare and Dublin, on the opposite side of the country."
        },
        {
            "id": 28,
            "text": "Originally, Pence was planning to fly into Dublin, conduct his meetings, and travel onward to Doonbeg to connect with his family roots."
        },
        {
            "id": 29,
            "text": "Instead, Pence arrived at Shannon Airport on Monday afternoon and met with Ireland’s Minister for Foreign Affairs Simon Coveney at the airport’s lounge."
        },
        {
            "id": 30,
            "text": "Afterward he traveled to the Trump property, located an hour from the Shannon airport on Ireland’s west coast."
        },
        {
            "id": 31,
            "text": "On Tuesday, Pence traveled back to Shannon Airport and flew aboard Air Force Two to Dublin for meetings with Irish government officials, including Taoiseach Leo Varadkar."
        },
        {
            "id": 32,
            "text": "The talks were expected to focus on Brexit and its effect on the Irish border."
        },
        {
            "id": 33,
            "text": "But one White House official sought to highlight the meeting’s personal aspect."
        },
        {
            "id": 34,
            "text": "“For all of you who still think our @VP is anti-gay, I point you to his and the @SecondLady’s schedule tomorrow where they will join Taoiseach @LeoVaradkar and his partner Dr. Matthew Barrett for lunch in Ireland,” White House deputy press secretary Judd Deere tweeted."
        },
        {
            "id": 35,
            "text": "Pence has been accused of supporting anti-LGBT policies, including as governor of Indiana."
        },
        {
            "id": 36,
            "text": "His wife Karen, who is traveling with him this week, took a job earlier this year at a Christian school that bans gay students and parents."
        },
        {
            "id": 37,
            "text": "Once a bastion of conservative Catholic social values, Ireland has transformed in the past decade as the church has lost influence."
        },
        {
            "id": 38,
            "text": "In 2015, the country became the first in the world to legalize same-sex marriage through a popular vote."
        },
        {
            "id": 39,
            "text": "And last year, Ireland voted to end a ban on abortion."
        },
        {
            "id": 40,
            "text": "That makes it a different country from the one Pence’s ancestors left decades ago to come to America."
        },
        {
            "id": 41,
            "text": "His grandfather, Richard Michael Cawley, came to Chicago in 1923, escaping poverty and the Irish civil war."
        },
        {
            "id": 42,
            "text": "He married Mary Elizabeth Maloney, whose family came from Doonbeg."
        },
        {
            "id": 43,
            "text": "The vice president has spoken fondly of visiting Ireland in the past, including Doonbeg, where he helped pull pints at his family’s pub."
        },
        {
            "id": 44,
            "text": "During a visit there as a young man, Pence once recalled a “little old lady” who told him “you’ve got a face like the map of Ireland.”"
        },
        {
            "id": 45,
            "text": "He’ll return to the white-walled pub on Tuesday evening, officials said, before retiring to the decidedly more modern establishment blaring the name of his boss."
        }
    ]
}