{
    "title": "Conservatives blast Boehner tax increases; other Republicans withhold criticism",
    "text": [
        {
            "id": 0,
            "text": "Leading conservatives blasted a controversial new House Republican proposal that breaks with years of GOP orthodoxy by calling for more taxes to be paid by wealthier Americans as part of a broader deal to avoid the so-called fiscal cliff."
        },
        {
            "id": 1,
            "text": "But in a sign of how politically treacherous and awkward the offer has become, top Senate Republicans - many of them conservatives - withheld harsh criticism of the plan even as they refused to embrace it."
        },
        {
            "id": 2,
            "text": "In fact, despite their general misgivings about approving tax increases, they gently nudged negotiations forward, in apparent recognition that any final agreement would include higher taxes – at least in some form - as President Barack Obama demands."
        },
        {
            "id": 3,
            "text": "The proposal, part of a $2.2 trillion deficit reduction package, would raise new revenue by eliminating unspecified deductions and other loopholes from the tax code."
        },
        {
            "id": 4,
            "text": "While it does not call for an increase in tax rates - as Democrats want – it still drew fire from conservatives like Sen. Jim DeMint, R-South Carolina, who said the \"offer of an $800 billion tax hike will destroy jobs and allow politicians in Washington to spend even more.\""
        },
        {
            "id": 5,
            "text": "Sen. Rand Paul, R-Kentucky, said it would be \"a huge mistake to raise taxes."
        },
        {
            "id": 6,
            "text": "It will cripple the economy.\""
        },
        {
            "id": 7,
            "text": "Senate Republican Leader Mitch McConnell sidestepped the question when at a press conference he was asked directly if he backed the plan, which was presented Monday by House Speaker John Boehner and other House leaders."
        },
        {
            "id": 8,
            "text": "\"I commend the House Republican leadership for trying to move the process along and getting to a point where, hopefully, we can have a real discussion,\" he said."
        },
        {
            "id": 9,
            "text": "Sen. John Thune of South Dakota, the third-ranking Senate Republican, echoed the sentiment."
        },
        {
            "id": 10,
            "text": "\"I'm not prepared to come out and embrace it or support it other than to say it's a good faith effort."
        },
        {
            "id": 11,
            "text": "It's serious and it ought to be taken seriously by the White House.\""
        },
        {
            "id": 12,
            "text": "Another Senate GOP leader, Roy Blunt of Missouri, said it would be counter productive for Republican senators to become \"outside commentators\" while negotiations are taking place between Obama and Boehner."
        },
        {
            "id": 13,
            "text": "\"I don't have position on the Boehner proposal,\" Blunt said."
        },
        {
            "id": 14,
            "text": "Charles Grassley of Iowa, a senior Republicans on the Finance Committee, was one of a only a few GOP senators who said he would support Boehner's plan to raise revenue but only if there is a \"willingness on the part of Democrats to accept spending cuts that are three to one or four to one.\""
        },
        {
            "id": 15,
            "text": "Americans for Prosperity, a conservative grassroots group, released a statement late Monday that said, \"Sadly this plan leaves conservatives wanting.\""
        },
        {
            "id": 16,
            "text": "Heritage Action for America, an advocacy group affiliated with the conservative think tank, sent an e-mail to supporters urging them to contact their members of Congress and oppose the compromise."
        },
        {
            "id": 17,
            "text": "\"Not only are Republican leaders asking their members to go back on their promise not to raise taxes on the American people, but they appear unwilling to fight for the bold entitlement reforms that won them the House in 2010,\" the e-mail stated."
        },
        {
            "id": 18,
            "text": "But two senior House GOP aides cited criticism from the right as evidence that House Republican leaders are being more responsible in the negotiations than the president."
        },
        {
            "id": 19,
            "text": "They argued they are giving ground taxes - on an issue that they knew full well would inflame their base."
        },
        {
            "id": 20,
            "text": "\"It points to the fact that this is serious credible proposal,\" one of these aides told CNN, referring to the critical statements from some outside groups and conservative lawmakers."
        },
        {
            "id": 21,
            "text": "\"The reason the president isn't meeting the same kind of criticism is because he's proposing a Christmas list for the left, and we can't do this if he's not willing to break with his comfort zone.\""
        },
        {
            "id": 22,
            "text": "This aide added, \"if we don't see some movement from the White House then it proves that the president agrees with liberals that going off the cliff isn't' all that bad.\""
        },
        {
            "id": 23,
            "text": "It was notable that in addition to Boehner, the entire House GOP leadership team signed onto the Republican counter offer on Monday, including House Budget Committee Chairman Paul Ryan."
        },
        {
            "id": 24,
            "text": "Ryan gained national prominence as GOP presidential nominee Mitt Romney's running mate, and has earned a reputation as a leading conservative voice on tax and budget issues."
        },
        {
            "id": 25,
            "text": "The show of unity was designed to help stem defections among the rank and file and head off potential questions about differences in strategy among top leaders."
        },
        {
            "id": 26,
            "text": "South Carolina Republican Rep Trey Gowdy said he was still reviewing the proposal and needs more details, but said that \"Paul Ryan's opinion carries great weight with many of us.\""
        },
        {
            "id": 27,
            "text": "Freshman Georgia Republican Rep Austin Scott said he wants to see a deal that reduces the debt more, but said he still needs to see the final cost of the House Republican plan."
        },
        {
            "id": 28,
            "text": "But Scott praised House GOP leaders for putting more ideas on the table, and told reporters he doesn't believe Obama is sincere about finding compromise with Republicans."
        },
        {
            "id": 29,
            "text": "\"We'd like to see him coming with his proposals instead of sending subordinates like (Treasury) Secretary (Timothy) Geithner, who quite honestly has low credibility with most of us including myself,\" Scott said."
        },
        {
            "id": 30,
            "text": "House GOP aides recognize that they are likely to lose votes from conservatives if they are able to get to a final deal with the White House, but they are working closely now to keep their message consistent."
        },
        {
            "id": 31,
            "text": "Now that they have responded to the White House demand to see a Republican plan they will continue to press for the administration to engage and show what kind of cuts to entitlement programs Obama could accept."
        },
        {
            "id": 32,
            "text": "Blunt, who served as top vote counter in the House under Boehner, told CNN that he believes that the speaker needs to get \"a majority of the majority\" of Republicans to vote for a final deal so that Boehner has a strong hand to deal with other big issues in the future."
        }
    ]
}