{
    "title": "Trump will ask for $8.6B for wall in budget",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "President Trump intends to request $8.6 billion for his long-promised wall along the border with Mexico when he submits his 2020 congressional budget on Monday, likely igniting another funding standoff with Congress."
        },
        {
            "id": 2,
            "text": "A senior administration official confirmed the figure, which is expected to be used to build or replace roughly 700 miles of barriers along the U.S.-Mexico border."
        },
        {
            "id": 3,
            "text": "Reuters reported early Sunday that funding for the wall would pull $5 billion from the Department of Homeland Security budget and $3.6 billion from the military construction budget at the Pentagon."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "The budget proposal also would reportedly include $3.6 million in military construction funding to help fund projects affected by the wall."
        },
        {
            "id": 6,
            "text": "In addition to wall funding, Trump's proposal calls for the hiring of an additional 2,800 law enforcement and other personnel to reinforce the border and 100 immigration judge teams, Reuters reported."
        },
        {
            "id": 7,
            "text": "Trump's proposal will face stiff opposition in the Democrat-held House."
        },
        {
            "id": 8,
            "text": "Speaker Nancy Pelosi cast doubt on deal this week for .5"
        },
        {
            "id": 9,
            "text": "Speaker Nancy Pelosi (D-Calif.) and Senate Minority Leader Charles Schumer (D-N.Y.) indicated in a statement that the president’s $8.6 billion ask is a non-starter."
        },
        {
            "id": 10,
            "text": "\"President Trump hurt millions of Americans and caused widespread chaos when he recklessly shut down the government to try to get his expensive and ineffective wall, which he promised would be paid for by Mexico,\" the Democratic leaders said."
        },
        {
            "id": 11,
            "text": "\"Congress refused to fund his wall and he was forced to admit defeat and reopen the government."
        },
        {
            "id": 12,
            "text": "The same thing will repeat itself if he tries this again,\" they added."
        },
        {
            "id": 13,
            "text": "\"We hope he learned his lesson.\""
        },
        {
            "id": 14,
            "text": "Congress must approve funding for fiscal 2020 by Oct. 1, or funding could lapse and the government could shut down."
        },
        {
            "id": 15,
            "text": "Trump's requests for border funding have shifted during his time in office as he seeks to fulfill a signature campaign promise."
        },
        {
            "id": 16,
            "text": "The administration's proposal for fiscal year 2019 sought $18 billion for the wall, including $1.6 billion to construct 65 miles in south Texas."
        },
        {
            "id": 17,
            "text": "The president in December triggered a partial government shutdown when he demanded $5.7 billion in wall funding."
        },
        {
            "id": 18,
            "text": "Trump agreed after 35 days to reopen the government without wall funding, but continued to press lawmakers for $5.7 billion for the structure."
        },
        {
            "id": 19,
            "text": "Congress ultimately approved $1.375 billion for border barriers, and the president issued a national emergency to bypass Congress and spend roughly $8 billion to construct his long-desired border wall."
        },
        {
            "id": 20,
            "text": "In making the emergency declaration, the president said he planned to redirect $3.6 billion in military construction funding toward the border project."
        },
        {
            "id": 21,
            "text": "He also said he would take separate executive action to repurpose about $2.5 billion from the Defense Department’s drug-interdiction program and $600 million from the Treasury Department’s asset-forfeiture fund."
        },
        {
            "id": 22,
            "text": "The national emergency has drawn pushback from Congress, with the House voting to approve a resolution that would terminate the emergency and the Senate expected to do the same this week."
        },
        {
            "id": 23,
            "text": "The Senate vote would set Trump up for the first veto of his presidency, with neither chamber likely to override it."
        },
        {
            "id": 24,
            "text": "Trump has made construction of a wall along the southern border a key agenda item since he launched his campaign in 2015."
        },
        {
            "id": 25,
            "text": "His inability to complete the task has prompted criticism from immigration hard-liners, though Trump has insisted the wall is being built and transitioned his mantra from \"Build the wall\" to \"Finish the wall.\""
        },
        {
            "id": 26,
            "text": "Larry Kudlow, Trump's top economic adviser, acknowledged on \"Fox News Sunday\" that the request for wall funding is likely to spur yet another fight with Congress, but he depicted it as a necessary one."
        },
        {
            "id": 27,
            "text": "\"I would just say that the whole issue of the wall and border security is of paramount importance,\" Kudlow said Sunday."
        },
        {
            "id": 28,
            "text": "\"We have to be much together and have more constructive immigration policy, which we will be developing,\" he added. \""
        },
        {
            "id": 29,
            "text": "(Trump) is going to stay with his wall."
        },
        {
            "id": 30,
            "text": "He’s going to stay with the border security theme."
        },
        {
            "id": 31,
            "text": "I think it’s essential.\""
        }
    ]
}