{
    "title": "Congratulations, You Are Now a U.S. Citizen. Unless Someone Decides Later You’re Not.",
    "text": [
        {
            "id": 0,
            "text": "MIAMI — Norma Borgoño immigrated to the United States from Peru in 1989."
        },
        {
            "id": 1,
            "text": "A single mother with two children, she set roots in the Miami suburbs, finding work as a secretary, dedicating herself to her church and, earlier this year, welcoming her first grandchild, a girl named Isabel, after Ms. Borgoño’s middle name."
        },
        {
            "id": 2,
            "text": "She took the oath of citizenship in 2007, a step she felt would secure her status in her adopted homeland."
        },
        {
            "id": 3,
            "text": "But hers, it turns out, is not a feel-good immigrant story: The Justice Department has moved to revoke Ms. Borgoño’s citizenship, an action that could eventually force her to return to Peru."
        },
        {
            "id": 4,
            "text": "Federal prosecutors in May filed a rare denaturalization case against Ms. Borgoño, 64, accusing her of committing fraud when she applied for citizenship and failed to disclose that she had taken part in a crime several years before she applied for citizenship — though she had not at the time been charged with it."
        },
        {
            "id": 5,
            "text": "It wasn’t until four years later, in 2011, that Ms. Borgoño pleaded guilty to helping her boss, to no benefit of her own, defraud the Export-Import Bank of the United States of $24 million."
        },
        {
            "id": 6,
            "text": "Since President Trump took office, the number of denaturalization cases has been growing, part of a campaign of aggressive immigration enforcement that now promises to include even the most protected class of legal immigrants: naturalized citizens."
        },
        {
            "id": 7,
            "text": "The government says it is doing what it has always done: Prosecuting cases of fraud among 21.2 million naturalized citizens, from people suspected of war crimes or terrorism to those in phony marriages or with false identities."
        },
        {
            "id": 8,
            "text": "But Ms. Borgoño’s case comes as the United States Citizenship and Immigration Services, the agency that handles residency and citizenship, is separately opening a new office to investigate thousands of potential denaturalization cases involving identity fraud, even as it approves more new citizenship applications than before."
        },
        {
            "id": 9,
            "text": "U.S.C.I.S. also intends to refer more cases for possible deportation, and to give citizenship adjudicating officers more discretion to deny applications they consider ineligible or incomplete."
        },
        {
            "id": 10,
            "text": "Another agency, Immigration and Customs Enforcement, has requested $207.6 million to hire an additional 300 agents to investigate more cases, including marriage, visa, residency and citizenship fraud."
        },
        {
            "id": 11,
            "text": "Taken together, “it’s new terrain for the government,” said Victor X. Cerda, one of Ms. Borgoño’s defense attorneys."
        },
        {
            "id": 12,
            "text": "“They’re being more aggressive.”"
        },
        {
            "id": 13,
            "text": "The renewed focus on denaturalization, and a recent uptick in the number of cases filed by the Justice Department, have deeply unsettled many immigrants who had long believed that a United States passport warded off a lifetime of anxiety over possible deportation."
        },
        {
            "id": 14,
            "text": "Citizenship also opens the door to voting, a fact that Democratic Party activists and others used to their advantage in naturalization drives before the 2016 election."
        },
        {
            "id": 15,
            "text": "The new push for denaturalization investigations, though, threatens what were once certainties."
        },
        {
            "id": 16,
            "text": "“You put a question mark next to every naturalized citizen’s name,” said David W. Leopold, a former president of the American Immigration Lawyers Association."
        },
        {
            "id": 17,
            "text": "“And then you instill fear.”"
        },
        {
            "id": 18,
            "text": "Denaturalization remains a rare, lengthy and difficult process, and immigration authorities say that only people who have deliberately lied to the government have any reason to be concerned."
        },
        {
            "id": 19,
            "text": "U.S.C.I.S. naturalizes 700,000 to 750,000 people a year; in 2017, that number was 715,000, despite a 35 percent surge in applications that began in the run-up to the last presidential election."
        },
        {
            "id": 20,
            "text": "The increase required U.S.C.I.S. to hire more staff, open two new offices and expand 10 existing offices to keep up, though processing times have slowed."
        },
        {
            "id": 21,
            "text": "Still, the agency says it naturalized more people in the first six months of this year than in the same period for each of the previous five years."
        },
        {
            "id": 22,
            "text": "The number of denaturalization cases, however, has also gone up: They averaged 11 a year from 1990 to 2017 and rose to approximately 15 in 2016 and about 25 in 2017, according to the Justice Department."
        },
        {
            "id": 23,
            "text": "About 20 cases have been filed so far this year, the department said."
        },
        {
            "id": 24,
            "text": "More cases are expected from the new U.S.C.I.S. office investigating suspected citizenship fraud."
        },
        {
            "id": 25,
            "text": "Expected to open in Los Angeles next year, the office will review naturalizations that were flagged after old fingerprint records on paper were scanned into a government database a decade ago."
        },
        {
            "id": 26,
            "text": "The scans allowed immigration authorities to find people who had been granted citizenship despite having prior criminal convictions or deportation orders."
        },
        {
            "id": 27,
            "text": "The Obama administration appeared to pursue few cases involving duplicate identities, unless they involved egregious wrongdoing or naturalized citizens who had received government security clearances."
        },
        {
            "id": 28,
            "text": "But a 2016 report by the inspector general for the Department of Homeland Security found that more than 315,000 fingerprint records for people who had been deported or had criminal convictions had still not been uploaded."
        },
        {
            "id": 29,
            "text": "The report prompted U.S.C.I.S. to dedicate funds and workers to the job, starting in January 2017."
        },
        {
            "id": 30,
            "text": "So far, about 2,500 cases have required an in-depth review, and about 100 cases have been referred to the Justice Department."
        },
        {
            "id": 31,
            "text": "Prosecutors have not pursued all of them."
        },
        {
            "id": 32,
            "text": "“We are not out there looking for people to denaturalize,” said Daniel M. Renaud, associate director for field operations at U.S.C.I.S."
        },
        {
            "id": 33,
            "text": "“We’re not going out and saying, ‘Who did we naturalize last year?"
        },
        {
            "id": 34,
            "text": "Let’s open up that file and take a look!’”"
        },
        {
            "id": 35,
            "text": "As with any other immigration approval, he said, “If there is fraud, then we think it’s in the interest of everyone for us to deal with it.”"
        },
        {
            "id": 36,
            "text": "Last year, the Supreme Court ruled unanimously that citizenship could not be revoked over minor falsehoods in an application."
        },
        {
            "id": 37,
            "text": "Among the pending denaturalizations are cases against two men in Michigan and Florida."
        },
        {
            "id": 38,
            "text": "The Justice Department says it found evidence that the men did not disclose in their applications that they had outstanding deportation orders under other identities."
        },
        {
            "id": 39,
            "text": "Six people have been denaturalized since the fingerprint reviews began, including a New Jersey man who had immigrated from India and failed to respond to the denaturalization lawsuit filed against him."
        },
        {
            "id": 40,
            "text": "Ms. Borgoño’s case in Miami, however, is different, because it did not originate with the fingerprint database but with her criminal conviction."
        },
        {
            "id": 41,
            "text": "Ms. Borgoño cooperated with investigators to build the case against her boss and never profited from his fraudulent scheme involving bank loan applications."
        },
        {
            "id": 42,
            "text": "She was sentenced to house arrest and probation, which she completed early after paying a small amount of restitution."
        },
        {
            "id": 43,
            "text": "But prosecutors say that because the scheme began before Ms. Borgoño became naturalized, she should have divulged her involvement to immigration authorities, who might have then denied her citizenship."
        },
        {
            "id": 44,
            "text": "Her attorneys say it is unclear whether Ms. Borgoño knew of her boss’s unlawful scheme at the time."
        },
        {
            "id": 45,
            "text": "When Ms. Borgoño pleaded guilty, prosecutors did not suggest her citizenship was at risk, said Mr. Cerda, her attorney, who has asked the court to dismiss the denaturalization case."
        },
        {
            "id": 46,
            "text": "“There was no indication, no discussion, that this could be used against her,” he said, saying Ms. Borgoño’s defense might have taken a different tack if it had known her immigration status was at stake."
        },
        {
            "id": 47,
            "text": "“There has to be a modicum of understanding, frankly, in terms of the government’s perspective of which cases to pursue and which ones not to pursue."
        },
        {
            "id": 48,
            "text": "I just don’t think that’s being applied right now.”"
        },
        {
            "id": 49,
            "text": "The Justice Department’s other recent denaturalization targets include child sex abusers, repeat sex offenders and people accused of supporting or conspiring with terrorists."
        },
        {
            "id": 50,
            "text": "In 2016, a Pennsylvania man who 18 years earlier had been convicted of a white-collar crime, like Ms. Borgoño, agreed to give up his citizenship but remain a legal permanent resident."
        },
        {
            "id": 51,
            "text": "“There’s no statute of limitations,” noted Matthew Hoppock, an immigration lawyer in Kansas who tracks denaturalization cases."
        },
        {
            "id": 52,
            "text": "“It makes negotiating these cases with the government really difficult."
        },
        {
            "id": 53,
            "text": "My client can agree to give up her citizenship if you promise not to deport her."
        },
        {
            "id": 54,
            "text": "You can make that promise now, but you could always deport her later — 10 years from now, 20 years from now.”"
        },
        {
            "id": 55,
            "text": "Mr. Cerda declined to make Ms. Borgoño available for an interview, citing the pending case."
        },
        {
            "id": 56,
            "text": "Her daughter, Urpi Ríos, said the lawsuit had shattered the family."
        },
        {
            "id": 57,
            "text": "“She did everything that was asked of her,” Ms. Ríos said, speaking through tears."
        },
        {
            "id": 58,
            "text": "“I’m trying to do the best I can to make her smile every day.”"
        },
        {
            "id": 59,
            "text": "Ms. Borgoño has no close family remaining in Peru, according to her daughter, who worries her mother could be deported and wind up alone and sick."
        },
        {
            "id": 60,
            "text": "Ms. Borgoño has Alport syndrome, a genetic condition, and has been on a kidney transplant list for two years."
        },
        {
            "id": 61,
            "text": "She was overjoyed by the birth of her granddaughter, who spent two weeks in the neonatal intensive care unit before coming home."
        },
        {
            "id": 62,
            "text": "“And then, not even a week goes by, and this bombshell comes,” said Ms. Ríos, recalling the moment her mother was served with the denaturalization complaint."
        },
        {
            "id": 63,
            "text": "“It’s without mercy.”"
        }
    ]
}