{
    "title": "Critics pounce after Obama talks Crusades, slavery at prayer breakfast",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "The annual event brings together U.S. and international leaders from different parties and religions for an hour devoted to faith."
        },
        {
            "id": 5,
            "text": "President Obama has never been one to go easy on America."
        },
        {
            "id": 6,
            "text": "As a new president, he dismissed the idea of American exceptionalism, noting that Greeks think their country is special, too."
        },
        {
            "id": 7,
            "text": "He labeled the Bush-era interrogation practices, euphemistically called “harsh” for years, as torture."
        },
        {
            "id": 8,
            "text": "America, he has suggested, has much to answer given its history in Latin America and the Middle East."
        },
        {
            "id": 9,
            "text": "His latest challenge came Thursday at the National Prayer Breakfast."
        },
        {
            "id": 10,
            "text": "At a time of global anxiety over Islamist terrorism, Obama noted pointedly that his fellow Christians, who make up a vast majority of Americans, should perhaps not be the ones who cast the first stone."
        },
        {
            "id": 11,
            "text": "“Humanity has been grappling with these questions throughout human history,” he told the group, speaking of the tension between the compassionate and murderous acts religion can inspire."
        },
        {
            "id": 12,
            "text": "“And lest we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ."
        },
        {
            "id": 13,
            "text": "In our home country, slavery and Jim Crow all too often was justified in the name of Christ.”"
        },
        {
            "id": 14,
            "text": "President Obama spoke about the common theme of treating others with love during his speech at the National Prayer Breakfast on Feb. 5, 2015, in Washington, D.C."
        },
        {
            "id": 15,
            "text": "Here are highlights from that event."
        },
        {
            "id": 16,
            "text": "Some Republicans were outraged."
        },
        {
            "id": 17,
            "text": "“The president’s comments this morning at the prayer breakfast are the most offensive I’ve ever heard a president make in my lifetime,” said former Virginia governor Jim Gilmore (R)."
        },
        {
            "id": 18,
            "text": "“He has offended every believing Christian in the United States."
        },
        {
            "id": 19,
            "text": "This goes further to the point that Mr. Obama does not believe in America or the values we all share.”"
        },
        {
            "id": 20,
            "text": "Obama’s remarks spoke to his unsparing, sometimes controversial, view of the United States — where triumphalism is often overshadowed by a harsh assessment of where Americans must try harder to live up to their own self-image."
        },
        {
            "id": 21,
            "text": "Only by admitting these shortcomings, he has argued, can we fix problems and move beyond them."
        },
        {
            "id": 22,
            "text": "“There is a tendency in us, a sinful tendency, that can pervert and distort our faith,” he said at the breakfast."
        },
        {
            "id": 23,
            "text": "[Obama’s comments on religious intolerance provoke outrage in India]"
        },
        {
            "id": 24,
            "text": "But many critics believe that the president needs to focus more on enemies of the United States."
        },
        {
            "id": 25,
            "text": "Russell Moore, president of the Southern Baptist Ethics and Religious Liberty Commission, called Obama’s comments about Christianity “an unfortunate attempt at a wrongheaded moral comparison.”"
        },
        {
            "id": 26,
            "text": "What we need more is a “moral framework from the administration and a clear strategy for defeating ISIS,” he said, using an acronym for the Islamic State."
        },
        {
            "id": 27,
            "text": "When the Dalai Lama was recognized at the 63rd annual National Prayer Breakfast, President Obama could be seen bowing and placing his palms together in a gesture of greeting."
        },
        {
            "id": 28,
            "text": "Obama spoke a day after meeting with Muslim leaders, in what participants said was his first roundtable with a Muslim-only group since taking office."
        },
        {
            "id": 29,
            "text": "The Muslim leaders argued that their community has faced unfair scrutiny in the wake of terrorist attacks overseas."
        },
        {
            "id": 30,
            "text": "Although the White House released only a broad description of the meeting — which touched on issues including racial profiling — participants said it gave them a chance to express their concerns directly to the president."
        },
        {
            "id": 31,
            "text": "Farhana Khera, executive director of the civil rights group Muslim Advocates, one of 13 participants, said the session gave Obama a chance to focus on Muslim Americans the way he has done with other constituencies, such as African American and Jewish groups."
        },
        {
            "id": 32,
            "text": "“I started off by saying the biggest concern I hear from Muslim parents is their fear that their children will be ashamed to be Muslim” because of discrimination, Khera said."
        },
        {
            "id": 33,
            "text": "“We are asking him to use his bully pulpit to have a White House summit on hate crimes against religious minorities, much like the summit on bullying reset the conversation around LGBT youth.”"
        },
        {
            "id": 34,
            "text": "Obama emphasized the need to respect minorities in his speech Thursday, saying it was part of the obligation Americans face as members of a diverse and open society, “And if, in fact, we defend the legal right of a person to insult another’s religion, we’re equally obligated to use our free speech to condemn such insults — and stand shoulder to shoulder with religious communities, particularly religious minorities who are the targets of such attacks.”"
        },
        {
            "id": 35,
            "text": "For the president, the prayer breakfast represented a role he has played before: explaining to Americans why others might see things differently."
        },
        {
            "id": 36,
            "text": "Joshua DuBois, who headed the White House Office of Faith Based and Neighborhood Partnerships under Obama and has served as an informal spiritual adviser, said the president is conscious of the fact that Islam is an abstraction for much of the general public."
        },
        {
            "id": 37,
            "text": "“The president, as a Christian, knows many American Muslims,” DuBois said."
        },
        {
            "id": 38,
            "text": "“Unfortunately, a lot of folks in our country don’t have close relationships with Muslims."
        },
        {
            "id": 39,
            "text": "The only time they’re hearing about Islam is in the context of the foreign policy crisis or what’s happening with ISIS.”"
        },
        {
            "id": 40,
            "text": "As a result, many Americans have an increasingly hostile view of Islam."
        },
        {
            "id": 41,
            "text": "A Pew Research Center survey last fall found that half of Americans think the Islamic religion is more likely than others to encourage violence, while 39 percent said it does not."
        },
        {
            "id": 42,
            "text": "The view that Islam is more apt to encourage violent acts rose 12 percentage points from the beginning of 2014 and was double the number who said so in March 2002 — less than a year after the Sept. 11 attacks."
        },
        {
            "id": 43,
            "text": "In the past, Obama has used stark, personal terms to describe ongoing tensions between African Americans and America’s white majority."
        },
        {
            "id": 44,
            "text": "When discussing the acquittal of George Zimmerman in the February 2012 shooting of Trayvon Martin, a black teenager, he spoke of being trailed while shopping in a department store and hearing the locks on cars click as he walked down the street."
        },
        {
            "id": 45,
            "text": "But he has also framed the most incendiary aspects of race relations — whether it’s the moment when his former pastor, the Rev. Jeremiah A. Wright, thundered “God damn America” from the pulpit or the shooting of another unarmed young black man, Michael Brown — as an opportunity to test the concept of American exceptionalism."
        },
        {
            "id": 46,
            "text": "He titled the 2008 speech he delivered in Philadelphia about Wright “A More Perfect Union,” a phrase he echoed 6 1 / 2 years later when he addressed the United Nations General Assembly."
        },
        {
            "id": 47,
            "text": "“We welcome the scrutiny of the world — because what you see in America is a country that has steadily worked to address our problems and make our union more perfect,” he said."
        },
        {
            "id": 48,
            "text": "“America is not the same as it was 100 years ago, 50 years ago or even a decade ago."
        },
        {
            "id": 49,
            "text": "Because we fight for our ideals and are willing to criticize ourselves when we fall short.”"
        },
        {
            "id": 50,
            "text": "But each of these admissions of fault — whether it is Obama’s acknowledgment during his 2009 Cairo speech that the United States was involved in the 1953 coup overthrowing the government of Iranian Prime Minister Mohammad Mossadegh or the suggestion that America has “a moral responsibility to act” on arms control because only the United States had “used a nuclear weapon” — has drawn sharp criticism from opponents."
        },
        {
            "id": 51,
            "text": "Obama has argued that United States is exceptional because it responds to its citizens’ frank assessments of whether it lives up to its core values."
        },
        {
            "id": 52,
            "text": "And he has defended the exceptional role it plays in the world given its military power and political traditions, like when Obama decided to intervene in Libya on the grounds that it is not in America’s nature to stand by while a civilian population is threatened."
        },
        {
            "id": 53,
            "text": "But he has always argued that straying from those values, as he believes happened during the George W. Bush administration, weakens the United States."
        },
        {
            "id": 54,
            "text": "“We went off course,” he said early in his presidency of the detention and interrogation practices of his predecessor, and he pledged to end torture, close the military prison at Guantanamo Bay, Cuba, and correct what he defined as mistakes America made during the country’s “season of fear.”"
        },
        {
            "id": 55,
            "text": "Critics say that Obama is chastising the wrong people."
        },
        {
            "id": 56,
            "text": "“The evil actions that he mentioned were clearly outside the moral parameters of Christianity itself and were met with overwhelming moral opposition from Christians,” Moore said."
        },
        {
            "id": 57,
            "text": "He added that while he understood Obama’s attempt to make sure “he is not heard as saying that all Muslims are terrorists, I think most people know that at this point.”"
        },
        {
            "id": 58,
            "text": ""
        }
    ]
}