{
    "title": "Trump to demand $8.6 billion in new wall funding, setting up fresh battle with Congress",
    "text": [
        {
            "id": 0,
            "text": "President Trump on Monday will request at least $8.6 billion more in funding to build additional sections of a wall along the U.S.-Mexico border, setting up a fresh battle with Congress less than one month after he declared a national emergency."
        },
        {
            "id": 1,
            "text": "The people describing the request spoke on the condition of anonymity because the budget proposal had not been made public, but a top White House official acknowledged the ­request ­in an interview on “Fox News Sunday.”"
        },
        {
            "id": 2,
            "text": "Reuters first reported the $8.6 billion figure."
        },
        {
            "id": 3,
            "text": "Asked whether Trump’s request signals that a new budget fight is coming, Larry Kudlow, the White House’s top economic adviser, said, “I suppose there will be."
        },
        {
            "id": 4,
            "text": "I would just say that the whole issue of the wall, of border security, is of paramount importance."
        },
        {
            "id": 5,
            "text": "We have a crisis down there."
        },
        {
            "id": 6,
            "text": "I think the president has made that case very effectively.”"
        },
        {
            "id": 7,
            "text": "Top Democrats reacted swiftly to reports that Trump was seeking more money for the wall, reflecting how they are girding for the fight and betting that public sentiment is on their side."
        },
        {
            "id": 8,
            "text": "Rep. Nita M. Lowey (D-N.Y.), who chairs the House Appropriations Committee, said the request was “not even worth the paper it’s written on.”"
        },
        {
            "id": 9,
            "text": "House Speaker Nancy Pelosi (D-Calif.) and Senate Minority Leader Charles E. Schumer (D-N.Y.) added that Trump caused a government shutdown in December because he defied Congress and demanded a wall."
        },
        {
            "id": 10,
            "text": "They said lawmakers were prepared to block his demand this time as well."
        },
        {
            "id": 11,
            "text": "“The same thing will repeat itself if he tries this again,” they said in a joint statement."
        },
        {
            "id": 12,
            "text": "“We hope he learned his lesson.”"
        },
        {
            "id": 13,
            "text": "The request will come as part of a broader proposal to cut $2.7 trillion in spending over 10 years for programs including welfare assistance, environmental protection and foreign aid."
        },
        {
            "id": 14,
            "text": "At the same time, Trump will seek to boost the military’s budget from $716 billion to $750 billion next year."
        },
        {
            "id": 15,
            "text": "The contrast is meant to bring into sharper focus the White House’s priorities heading into budget negotiations this summer, even if many lawmakers have declared the proposals dead on arrival."
        },
        {
            "id": 16,
            "text": "The wall demands will attract a particular focus because of Trump’s willingness to amplify the immigration debate into a political brawl."
        },
        {
            "id": 17,
            "text": "He led a government shutdown in December that lasted for 35 days because Congress would not appropriate $5.7 billion to build sections of his long-promised wall."
        },
        {
            "id": 18,
            "text": "Eventually, Trump relented and reopened the government."
        },
        {
            "id": 19,
            "text": "A few weeks later, Congress agreed to provide $1.375 billion to finance 55 miles of barrier on the border in Texas."
        },
        {
            "id": 20,
            "text": "To extract more funds, Trump last month declared a national emergency and said he would redirect more than $6.7 billion from other programs to build more sections of the wall."
        },
        {
            "id": 21,
            "text": "The emergency declaration unsettled many lawmakers, including some of his key allies in the Senate."
        },
        {
            "id": 22,
            "text": "A number of Republican Senators have said they oppose Trump’s attempt to move money without congressional approval, and the chamber is set to pass a measure to overturn the declaration in the coming days, which the president is expected to veto."
        },
        {
            "id": 23,
            "text": "Even with the stiff congressional opposition, Trump’s new budget request shows he plans to continue fighting on the issue in the coming months."
        },
        {
            "id": 24,
            "text": "Congress and the White House must agree on a new budget deal by the end of September."
        },
        {
            "id": 25,
            "text": "They also must pass a measure to raise the debt ceiling in September or October, or they will risk having the government fall behind on its obligations, which could rattle the economy and financial markets."
        },
        {
            "id": 26,
            "text": "House Budget Chairman John Yarmuth (D-Ky.) said the request is “a shot across the bow.”"
        },
        {
            "id": 27,
            "text": "By signaling Monday that he wants billions in additional border wall funding to be part of any deal, Trump is sending a message to lawmakers about his budget priorities."
        },
        {
            "id": 28,
            "text": "The number of people crossing illegally into the United States from Mexico had fallen in recent years, but there has been a sharp increase in recent months."
        },
        {
            "id": 29,
            "text": "The number taken into custody along the border rose 31 percent last month in large part because of a wave of families trying to enter the United States from Central America."
        },
        {
            "id": 30,
            "text": "One senior administration official said the $8.6 billion in additional funding, combined with the money Trump is attempting to redirect with his national emergency declaration, would allow the White House to complete at least 722 miles of barriers — a figure that has long been a White House goal."
        },
        {
            "id": 31,
            "text": "White House officials say there are already 122 miles of barriers that have been completed or are under construction."
        },
        {
            "id": 32,
            "text": "Some of those barriers replace fences that had previously existed, and Democrats have routinely said Trump is claiming credit for building walls that don’t exist or that are far from being completed."
        },
        {
            "id": 33,
            "text": "During the 2016 campaign, Trump promised repeatedly to build a wall along the Mexican border."
        },
        {
            "id": 34,
            "text": "He also said Mexico would pay for it, though the Mexican government has repeatedly refused to finance the project."
        },
        {
            "id": 35,
            "text": "Since becoming president, Trump has changed his description of how the wall would be financed, at first saying Mexico would eventually pay the U.S. government back and later scrapping any mention of Mexico sending money to the United States."
        },
        {
            "id": 36,
            "text": "Instead, he has insisted that the money come from U.S. taxpayers, arguing that criminals, terrorists and drugs are flooding into the United States from across the southern border."
        },
        {
            "id": 37,
            "text": "His top advisers have not provided information to back up many of those assertions, but Kudlow said Sunday that Trump planned to keep fighting."
        },
        {
            "id": 38,
            "text": "“He’s going to stay with his wall, and he’s going to stay with the border security theme,” Kudlow said on “Fox News Sunday.”"
        },
        {
            "id": 39,
            "text": "“I think it’s essential.”"
        },
        {
            "id": 40,
            "text": "Pelosi and Schumer said Sunday the money would be better spent on projects like education and workforce development, among other things."
        },
        {
            "id": 41,
            "text": "The $8.6 billion request would represent less than 0.5 percent of the White House budget plan, which will eclipse $4 trillion."
        },
        {
            "id": 42,
            "text": "The proposal would, among other things, cut more than $1.1 trillion from Medicaid and other health-care programs over the next decade by turning over more control to states, according to a summary reviewed by The Washington Post."
        },
        {
            "id": 43,
            "text": "Medicaid is a health-care program for low-income and disabled Americans, run jointly by states and the federal government."
        },
        {
            "id": 44,
            "text": "Some Republicans and the White House have repeatedly proposed slashing its benefits, alleging it is wasteful, while many Democrats and a number of Republicans have sought to expand the program as a way to provide more benefits for the poor."
        },
        {
            "id": 45,
            "text": "The White House’s new budget plan would also cut $327 billion from other welfare programs, including those that provide food and housing assistance, in part by imposing mandatory work requirements for certain recipients."
        },
        {
            "id": 46,
            "text": "It would cut an additional $207 billion by making changes to student loan programs over 10 years and $200 billion more by changing federal retirement programs and making major changes to the U.S. Postal Service."
        },
        {
            "id": 47,
            "text": "The budget would call for severe reductions at a number of federal agencies."
        },
        {
            "id": 48,
            "text": "It will propose a 12 percent cut at the Education Department, a 12 percent cut at the Department of Health and Human Services, an 11 percent cut at the Interior Department, a 23 percent cut at the State Department, a 32 percent cut at the Environmental Protection Agency and a 22 percent cut at the Transportation Department, according to the summary."
        },
        {
            "id": 49,
            "text": "Almost all of the proposals would require congressional approval, and lawmakers have dismissed cuts of a similar size in Trump’s past budgets."
        },
        {
            "id": 50,
            "text": "Many Democratic leaders have said they will oppose the sweep of the White House’s proposed cuts, though administration officials have signaled they plan to fight over the budget much harder this year, saying it provides a sharp contrast between Democrats and Republicans heading into the final year of Trump’s first term."
        },
        {
            "id": 51,
            "text": "Even with the proposed cuts, the White House plan does not project eliminating the budget deficit until the mid-2030s."
        },
        {
            "id": 52,
            "text": "This is in part because Trump has instructed aides not to pursue any structural changes to Medicare, the health-care program for millions of older Americans."
        },
        {
            "id": 53,
            "text": ""
        }
    ]
}