{
    "title": "All Talk, No Action: Trump Furious Over Border Wall Funding And Yes–He Threatened A Shutdown",
    "text": [
        {
            "id": 0,
            "text": "President Trump is reportedly furious that his border wall is not being fully funded."
        },
        {
            "id": 1,
            "text": "In a private meeting with members of the U.S. Senate, Trump was frustrated that the funds for his $25 billion project are not being served upfront."
        },
        {
            "id": 2,
            "text": "The president also threatened to shutdown the government in order to get the funds he needs for this critical campaign promise (via Politico):"
        },
        {
            "id": 3,
            "text": "In a private meeting regarding the wall Monday, Trump fumed to senators and his own staff about the $1.6 billion the Senate is planning to send him this fall, according to two people familiar with the meeting."
        },
        {
            "id": 4,
            "text": "Trump wants the full $25 billion upfront and doesn’t understand why Congress is going to supply him funds in a piecemeal fashion — even though that’s how the spending process typically works."
        },
        {
            "id": 5,
            "text": "“He’s focused on border security."
        },
        {
            "id": 6,
            "text": "And like all presidents, he wants it done now."
        },
        {
            "id": 7,
            "text": "But we’re part of the legislative process, it’s slower and deliberate,\" said Senate Appropriations Chairman Richard Shelby (R-Ala.), who met with Trump."
        },
        {
            "id": 8,
            "text": "The president said at the meeting that if Congress doesn’t give him the resources he needs for border security, he will shut down the government in September, according to one of the people familiar with the meeting."
        },
        {
            "id": 9,
            "text": "He did not give a specific number, but has been fixated on getting the $25 billion in a lump sum."
        },
        {
            "id": 10,
            "text": "GOP lawmakers are loath to see a government shutdown on their watch just weeks before the midterm elections."
        },
        {
            "id": 11,
            "text": "Is that bad for the GOP?"
        },
        {
            "id": 12,
            "text": "Oh yeah"
        },
        {
            "id": 13,
            "text": "—but let’s not forget that the Trump agenda benefits the GOP, but also his core group of voters who aren’t all Republicans."
        },
        {
            "id": 14,
            "text": "Trump was able to navigate a checkered path with his base, building off of GOP"
        },
        {
            "id": 15,
            "text": "voters—90 percent of whom voted for him in 2016—and millions of Democrats and Independents who liked his attitude."
        },
        {
            "id": 16,
            "text": "He was change."
        },
        {
            "id": 17,
            "text": "He was different."
        },
        {
            "id": 18,
            "text": "And Hillary looked like the same old movie, only that it would yield more economic pain."
        },
        {
            "id": 19,
            "text": "A lot of Obama voters flipped for Trump; you don’t bury Clinton the way Trump did in Ohio without help from the other side of the aisle."
        },
        {
            "id": 20,
            "text": "If Trump is seen as bashing both parties to check off another action item from his agenda, he will be rewarded."
        },
        {
            "id": 21,
            "text": "This is an easy item to understand."
        },
        {
            "id": 22,
            "text": "It’s funding for a wall, a wall that has been unable to be scaled by U.S. Special Forces."
        },
        {
            "id": 23,
            "text": "Obamacare was a tricky task."
        },
        {
            "id": 24,
            "text": "There are market factors to contend with, the IRS code due to the new taxes, the regulations, etc."
        },
        {
            "id": 25,
            "text": "it was a mess."
        },
        {
            "id": 26,
            "text": "And after nearly a decade of campaigning for its repeal, the GOP failed."
        },
        {
            "id": 27,
            "text": "There are no such strings attached with a wall."
        },
        {
            "id": 28,
            "text": "In politics, if you promise a simple thing like building a wall and fail, then you need to do something else."
        },
        {
            "id": 29,
            "text": "Trump is not like that."
        },
        {
            "id": 30,
            "text": "He’ll find a way to win."
        },
        {
            "id": 31,
            "text": "Trump’s go-to shouldn’t be to put his party, most of which agree with most of his agenda items, in a terrible position so close to the midterms."
        },
        {
            "id": 32,
            "text": "Trump wants more GOP members elected, but that doesn’t mean Trump won’t do this."
        },
        {
            "id": 33,
            "text": "He will."
        },
        {
            "id": 34,
            "text": "The immigration issue is one the splits the GOP, Democrats know this, which leads us to this discharge petition nonsense."
        },
        {
            "id": 35,
            "text": "It would have allowed the Left to hold immigration votes without the blessing of the House GOP leadership if they found 218 signatories."
        },
        {
            "id": 36,
            "text": "This effort was three votes shy, so we’re going to have a vote on two bills that probably won’t pass this week."
        },
        {
            "id": 37,
            "text": "Who got Democrats so close to success on this push?"
        },
        {
            "id": 38,
            "text": "Well, that would be moderate Republicans."
        }
    ]
}