{
    "title": "Trump tells Ingraham some officers 'choke' during shootings, saying 'They miss a 3-foot putt'",
    "text": [
        {
            "id": 0,
            "text": "While discussing the shooting of Jacob Blake with Fox News ahead of his visit to Kenosha, Wisconsin, President Donald Trump said some police officers who shoot unarmed suspects \"choke,\" as if missing a 3-foot putt in golf, a comment that drew social media criticism and mockery."
        },
        {
            "id": 1,
            "text": "Blake, a Black man, was shot seven times in the back by an officer as he tried to enter a vehicle in an incident caught on video."
        },
        {
            "id": 2,
            "text": "The shooting sparked a new wave of protests around the country against police brutality and racial discrimination."
        },
        {
            "id": 3,
            "text": "While discussing the situation in Kenosha during a White House news briefing on Monday, Trump said sometimes an officer \"makes a mistake\" or \"chokes\" under pressure."
        },
        {
            "id": 4,
            "text": "Trump elaborated on that point later Monday during an interview on \"The Ingraham Angle\" on Fox News, during which he said police are \"under siege.\""
        },
        {
            "id": 5,
            "text": "\"They can do 10,000 great acts, which is what they do, and one bad apple – or a choker, you know, a choker, they choke – shooting the guy in the back many times,\" Trump told host Laura Ingraham."
        },
        {
            "id": 6,
            "text": "\"I mean, couldn't you have done something different?"
        },
        {
            "id": 7,
            "text": "Couldn't you have wrestled him?\""
        },
        {
            "id": 8,
            "text": "Trump asked, wondering how the tragedy could have been avoided."
        },
        {
            "id": 9,
            "text": "\"You know, I mean, in the meantime he might have been going for a weapon and, you know, there's a whole big thing there.\""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "\"But they choke, just like in a golf tournament, they miss a 3-foot putt,\" Trump said as Ingraham, one his staunchest supporters in the news media, cut him off."
        },
        {
            "id": 12,
            "text": "\"You're not comparing it to golf, because that's what the media would say,\" Ingraham said."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "No, I'm saying people choke."
        },
        {
            "id": 15,
            "text": "People choke."
        },
        {
            "id": 16,
            "text": "And people are bad people."
        },
        {
            "id": 17,
            "text": "You have both,\" he said."
        },
        {
            "id": 18,
            "text": "\"You have some bad people and you have – they choke."
        },
        {
            "id": 19,
            "text": "You could be a police officer for 15 years and, all of a sudden, you're confronted."
        },
        {
            "id": 20,
            "text": "You've got a quarter of a second to make a decision."
        },
        {
            "id": 21,
            "text": "If you don't make the decision and you're wrong, you're dead.\""
        },
        {
            "id": 22,
            "text": "Trump is scheduled to travel to Kenosha on Tuesday to meet with law enforcement officials and survey damage from the demonstrations."
        },
        {
            "id": 23,
            "text": "White House Press Secretary Kayleigh McEnany said Trump is looking forward to going to Kenosha to speak directly to its residents and \"unifying the state.\""
        },
        {
            "id": 24,
            "text": "Wisconsin Gov. Tony Evers and Kenosha Mayor John Antaramian, both Democrats, have asked Trump not to come, saying it could hurt the community's effort to heal and would require them to redirect resources toward securing his visit."
        },
        {
            "id": 25,
            "text": "As Ingraham predicted, many expressed shock and outrage at the comparison between the shooting that left Blake paralyzed and a golfer missing a short putt."
        },
        {
            "id": 26,
            "text": "\"Disgusting."
        },
        {
            "id": 27,
            "text": "Trump compares police shooting a Black man in the back 7 times to a golfer who misses a 3-foot putt,\" tweeted Jim Murphy who is a deputy director for the Human Rights Campaign's digital team."
        },
        {
            "id": 28,
            "text": "Many on social media used dark humor to mock the president for his comment."
        },
        {
            "id": 29,
            "text": "\"I'll never forget my worst round of golf."
        },
        {
            "id": 30,
            "text": "I was under a lot of pressure, and on the 15th hole, on what should have been an easy putt for birdie, I choked and shot someone seven times in the back,\" tweeted Robert Maguire, research director for the government watchdog Citizens for Responsibility and Ethics in Washington."
        },
        {
            "id": 31,
            "text": "\"You know things are bad when Laura Ingraham has to save President Trump from saying stupid things,\" said Senate Minority Leader Charles Schumer, D-N.Y."
        }
    ]
}