{
    "title": "Republicans brush off Trump's call for impeachment dismissal",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "President Trump is sending mixed signals to Senate Republicans about what he wants from a soon-to-begin impeachment trial."
        },
        {
            "id": 2,
            "text": "Trump’s weekend tweets backing an “outright dismissal” of the articles of impeachment put him at odds with the strategy Senate Majority Leader Mitch McConnell (R-Ky.) has publicly advocated for weeks."
        },
        {
            "id": 3,
            "text": "Most Senate Republicans have embraced the call for no witnesses and say they are sticking with their plan for a trial — albeit a quick one."
        },
        {
            "id": 4,
            "text": "Sen. John Cornyn (R-Texas), an adviser to McConnell, shrugged off Trump’s criticism, arguing that senators should ignore “chatter.”"
        },
        {
            "id": 5,
            "text": "“We’ve a constitutional duty to perform, and we’re going to try to do our best and try not to get too distracted by all the chatter,” he told The Hill in response to a question about Trump’s tweets."
        },
        {
            "id": 6,
            "text": "Cornyn also told reporters he expected opening arguments in the trial to begin a week from Tuesday, giving the Senate two weeks if it’s going to conclude its consideration of impeachment before the president is set to deliver the State of the Union address on Feb. 4."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "Speaker Nancy Pelosi is expected to hold a House vote this week on sending the articles of impeachment to the Senate and naming managers for the impeachment trial."
        },
        {
            "id": 9,
            "text": "She is scheduled to meet with her caucus on Tuesday morning."
        },
        {
            "id": 10,
            "text": "Sen. Roy Blunt (Mo.), the No. 4 Senate Republican, said the caucus believes both Trump and the House managers deserve to make their case in a trial."
        },
        {
            "id": 11,
            "text": "“I think he indicated consistently from the previous weeks that he thought he deserved an opportunity in a fair hearing to make his case, and I think that is ultimately what will happen,” Blunt said, asked about Trump’s tweet from over the weekend."
        },
        {
            "id": 12,
            "text": "Sen. Rob Portman (R-Ohio) also indicated he opposed an outright dismissal, telling reporters that “we ought to have the opportunity to hear from both sides.”"
        },
        {
            "id": 13,
            "text": "The public division between Trump and Senate Republicans comes as McConnell has worked hard to publicly stress that there is no daylight with the White House on impeachment strategy."
        },
        {
            "id": 14,
            "text": "He said last month that he would be in “total coordination” with Trump’s team and that he would “take my cues” from White House counsel Pat Cipollone, who is expected to lead the president’s defense team."
        },
        {
            "id": 15,
            "text": "A GOP aide downplayed talk of division between the two ends of Pennsylvania Avenue, noting that senators and the White House have been in touch."
        },
        {
            "id": 16,
            "text": "McConnell didn’t directly respond to the president during his floor speech on Monday but signaled that he is ready to move forward with a trial, saying the “Senate is ready to fulfill our duty.”"
        },
        {
            "id": 17,
            "text": "“We will fulfill our constitutional duty."
        },
        {
            "id": 18,
            "text": "We will honor the reason for which the Founders created this body, to ensure our institutions and our Republic can rise above short-term factional fever,” McConnell said."
        },
        {
            "id": 19,
            "text": "McConnell has also worked behind the scenes to try to downplay public differences, urging Trump late last year to lay off public criticism of Republican senators who would be crucial during the upcoming impeachment saga."
        },
        {
            "id": 20,
            "text": "McConnell’s strategy, in some instances, appeared to be paying dividends, with Trump and White House officials appearing to embrace the GOP leader’s strategy of a quick trial with potentially no witnesses for either the president’s team or House impeachment managers."
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": "White House director of legislative affairs Eric Ueland told CBS News late last year that, similar to former special counsel Robert Mueller ’s investigation into the 2016 election, “the facts belie the allegation and the facts speak very strongly for themselves.”"
        },
        {
            "id": 23,
            "text": "“The president is working closely and collaboratively with leader McConnell,” Ueland added, asked if the president wants witnesses or not."
        },
        {
            "id": 24,
            "text": "Though McConnell has worked for months to maneuver both his caucus and the White House, Trump is a perennial wild card on strategy — underscoring one of the biggest differences between the two men."
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": "Trump also floated over the weekend that Pelosi and House Intelligence Committee Chairman Adam Schiff (D-Calif.) should be called as witnesses as part of a Senate trial — a controversial request that could struggle to win over the 51 votes needed to successfully call a witness and one that contradicts his backing of an outright dismissal of the articles."
        },
        {
            "id": 27,
            "text": "Republicans are formally punting a decision on who, if anyone, should testify until mid-trial."
        },
        {
            "id": 28,
            "text": "But most of the caucus, including McConnell, has backed having no witnesses, arguing that they want a speedy trial that lets them acquit the president and move on."
        },
        {
            "id": 29,
            "text": "“I think both sides are going to present their case."
        },
        {
            "id": 30,
            "text": "We’ll get to ask questions in writing, then we’ll take the vote."
        },
        {
            "id": 31,
            "text": "I don’t think we’re going to have any witnesses."
        },
        {
            "id": 32,
            "text": "I think it’ll be over right then."
        },
        {
            "id": 33,
            "text": "I think it’s going to be pretty fast,” Sen. Rick Scott (R-Fla.) told conservative radio show host Hugh Hewitt on Monday."
        },
        {
            "id": 34,
            "text": "Senate Republicans have also repeatedly shot down suggestions, including from within their own caucus, that they dismiss the two articles instead of going through a trial."
        },
        {
            "id": 35,
            "text": "“I don’t think there’s any question that we have to take up the matter."
        },
        {
            "id": 36,
            "text": "The rules of impeachment are very clear, we’ll have to have a trial."
        },
        {
            "id": 37,
            "text": "My own view is that we should give people the opportunity to put the case on,” McConnell told reporters late last year."
        },
        {
            "id": 38,
            "text": "Republicans say they want to acquit Trump of wrongdoing — an all but guaranteed outcome of a trial because of the 67 votes required to convict and remove the president from office."
        },
        {
            "id": 39,
            "text": "The Senate rules resolution passed during the 1999 Clinton trial included a motion to dismiss the articles built into the resolution, laying the groundwork for an ultimately failed vote that took place during the proceeding."
        },
        {
            "id": 40,
            "text": "But GOP senators predicted that a motion to dismiss would likely not be built into the rules resolution for the Trump trial, though they noted that wouldn’t stop a senator from offering a motion during the trial."
        },
        {
            "id": 41,
            "text": "Republicans are still drafting the rules resolution."
        },
        {
            "id": 42,
            "text": "“If 51 senators wanted to have that vote we could have it at some point."
        },
        {
            "id": 43,
            "text": "I don’t believe it’s going to be baked into the underlying resolution,” Cornyn said."
        },
        {
            "id": 44,
            "text": "A GOP aide said late last week that the caucus was discussing moving the motion to dismiss to a different point in Trump’s trial or removing it from the rules resolution altogether."
        },
        {
            "id": 45,
            "text": "Blunt noted that the caucus had agreed to have rules “based on” the Clinton model but that they didn’t have to be “exact.”"
        },
        {
            "id": 46,
            "text": "“I’m confident that there’s not much interest on our side on dismissing as opposed to hearing,” Blunt said."
        },
        {
            "id": 47,
            "text": "“I don’t think in our conference there would be a sense that it had to be exact.”"
        }
    ]
}