{
    "title": "McConnell to lift blockade on Dems' Senate control after filibuster assurances",
    "text": [
        {
            "id": 0,
            "text": "Minority Leader Mitch McConnell said Monday that he’s now satisfied the filibuster, a defining feature of the Senate, won’t be erased, so he will lift his blockade and allow Democrats to finish organizing as the majority party."
        },
        {
            "id": 1,
            "text": "The Kentucky Republican has been holding up Democrats’ ability to take control of committees, using that as leverage to try to win an ironclad agreement from Democrats that they would not trigger the nuclear option and nix the filibuster."
        },
        {
            "id": 2,
            "text": "He didn’t win that concession, but he said two Democrats have come out forcefully in rejecting any changes, and in a 50-50 Senate their opposition makes him confident the critical but controversial tool remain."
        },
        {
            "id": 3,
            "text": "“Today two Democratic Senators publicly confirmed they will not vote to end the legislative filibuster."
        },
        {
            "id": 4,
            "text": "They agree with President Biden’s"
        },
        {
            "id": 5,
            "text": "and my view that no Senate majority should destroy the right of future minorities of both parties to help shape legislation,” Mr. McConnell said in a statement."
        },
        {
            "id": 6,
            "text": "The two Democrats who reaffirmed the value of the filibuster are Sens. Kyrsten Sinema of Arizona and Joe Manchin of West Virginia."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "Democrats took control of the Senate on Jan. 20 when three new senators were sworn in, along with Vice President Kamala Harris, whose tie-breaking vote gives the edge to Democrats in the 50-50 Senate."
        },
        {
            "id": 10,
            "text": "But since the chamber is a “continuing body,” Republicans still have control of the committees based on their majority before Jan. 20."
        },
        {
            "id": 11,
            "text": "The Senate must pass a new organizing resolution to officially transfer control to Democrats."
        },
        {
            "id": 12,
            "text": "Mr. McConnell had been blocking any new resolution as he sought assurances on the filibuster, a tool both parties have used to derail each other’s priorities."
        },
        {
            "id": 13,
            "text": "Newly minted Majority Leader Charles Schumer had balked at giving those assurances, saying to do so would embolden Mr. McConnell to flex the filibuster more than ever."
        },
        {
            "id": 14,
            "text": "There is a roadmap for a 50-50 Senate from 20 years ago, when the GOP held the majority by dint of Vice President Dick Cheney’s tie-breaking vote."
        },
        {
            "id": 15,
            "text": "Mr. McConnell said Monday that the Senate will use that arrangement as a template for a power-sharing deal this year."
        },
        {
            "id": 16,
            "text": "It takes a three-fifths vote of senators — usually 60 votes, when all 100 seats are filled — to overcome a filibuster."
        },
        {
            "id": 17,
            "text": "That high bar has doomed everything from abortion legislation to gun bills to immigration changes, on both sides of the ideological divide."
        },
        {
            "id": 18,
            "text": "Democrats weren’t shy about using the filibuster to derail President Trump’s priorities."
        },
        {
            "id": 19,
            "text": "Now, though, with a Democratic president and control of the House, the filibuster stands in the way of the liberal wish list laid out by the party’s more left-leaning members."
        },
        {
            "id": 20,
            "text": "That’s sparked a rethink among even some former supporters of the filibuster."
        },
        {
            "id": 21,
            "text": "Sen. Chris Coons, who while Mr. Trump was in office led a bipartisan statement defending the primacy of the filibuster, changed his mind last year and said he could vote to end the practice if it meant getting Mr. Biden’s agenda through a deeply divided Senate."
        },
        {
            "id": 22,
            "text": "Sign up for Daily Newsletters Manage Newsletters"
        },
        {
            "id": 23,
            "text": "Copyright © 2021"
        },
        {
            "id": 24,
            "text": "The Washington Times, LLC."
        },
        {
            "id": 25,
            "text": "Click here for reprint permission."
        }
    ]
}