{
    "title": "How the world is responding",
    "text": [
        {
            "id": 0,
            "text": "The world was already watching Boston on Monday afternoon, when two bombs exploded near the finish line of the city’s annual marathon, touching off an outpouring of solidarity from around the world."
        },
        {
            "id": 1,
            "text": "As Boston processed the attack that left three dead and more than 100 wounded, a steady flow of replies poured in from global leaders and observers, many of them no stranger to the horror of anonymous acts of terror on their own soil."
        },
        {
            "id": 2,
            "text": "\"Having suffered from terrorist attacks and civilian casualties for years, our people feel better the pain and suffering arising from such incidents,\" Afghan President Hamid Karzai said in a statement Tuesday, according to Agence France-Presse."
        },
        {
            "id": 3,
            "text": "His government, he said, denounced the attacks in the “strongest possible terms.”"
        },
        {
            "id": 4,
            "text": "Meanwhile, Ramin Mehmanparast, a spokesman for Iran’s foreign ministry, called the bombings a “source of sorrow” for his country."
        },
        {
            "id": 5,
            "text": "“No one should under any circumstances support terrorism and extremism, whether it be in the Middle East or the United States,\" he said, according to AFP."
        },
        {
            "id": 6,
            "text": "And writing of the attack in the Israeli daily Haaretz, Boston-based Israeli journalist Dina Kraft said yesterday felt eerily familiar because of her days reporting back home: sifting through facts and testimonies as smoke clears from a gruesome public bombing."
        },
        {
            "id": 7,
            "text": "Boston “streets, usually crammed with rush-hour traffic, now emptied out as people heeded the state’s call to go home and out of the way of other possible bombs,” she wrote."
        },
        {
            "id": 8,
            "text": "“I thought back to covering attacks in Israel where the streets often fill after an attack, a blend of curiosity seekers and those who find it a good opportunity to gather for another hearty round of 'Death to the Arabs' chants.”"
        },
        {
            "id": 9,
            "text": "There were no such chants in Boston, and the lack of hysteria surrounding the tragedy impressed her, she said."
        },
        {
            "id": 10,
            "text": "But as her evening of interviewing survivors and eyewitnesses wore on, “a familiar dread and weariness began to settle in, one that I felt with every attack I covered while I lived in Israel.”"
        },
        {
            "id": 11,
            "text": "Meanwhile, newspapers around the world led their Tuesday front pages and homepages with the Boston bombing."
        },
        {
            "id": 12,
            "text": "Many described the experiences of locals who had been on the scene, underscoring the global scope of the marathon, which is the world's oldest."
        },
        {
            "id": 13,
            "text": "“They won’t win,” blared the headline of an editorial in the British tabloid The Sun."
        },
        {
            "id": 14,
            "text": "“Truly, we cannot relax."
        },
        {
            "id": 15,
            "text": "We can never assume that because we have had a period of calm, the bombers have gone away,” the paper wrote."
        },
        {
            "id": 16,
            "text": "“As ever, Britain will stand by America in her dark hour and offer all assistance to catch those responsible.”"
        },
        {
            "id": 17,
            "text": "As authorities searched for clues and culprits and social media lit up with support for Boston from all over the world, a small number of extremist groups expressed support for the bombings."
        },
        {
            "id": 18,
            "text": "\"We believe in attacking US and its allies but we are not involved in this attack,\" Ihsanullah Ihsan, the top spokesman for the Taliban in Pakistan told AFP."
        },
        {
            "id": 19,
            "text": "\"We have no connection to this bombing but we will continue to target them wherever possible.\""
        },
        {
            "id": 20,
            "text": "Somalia’s Al Shabaab mocked the victims on its official Twitter feed and used the attack as an opportunity to criticize US policy."
        },
        {
            "id": 21,
            "text": "“The ‪#BostonBombings are just a tiny fraction of what US soldiers inflict upon millions of innocent Muslims across the globe on a daily basis,” read one tweet."
        },
        {
            "id": 22,
            "text": "Political as that sentiment was, it was joined by more levelheaded reminders that while the Boston attack was vicious and tragic, on a global scale it was hardly a unique experience."
        },
        {
            "id": 23,
            "text": "American academic and pundit Juan Cole noted that bombings and other mass violence also killed dozens of civilians Monday in Syria and Iraq."
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": "The world is stitched together, he wrote, by the common human experiences of sorrow and grief that follow such tragedies."
        },
        {
            "id": 28,
            "text": "“Having experienced the shock and grief of the Boston bombings, cannot we in the US empathize more with Iraqi victims and Syrian victims?"
        },
        {
            "id": 29,
            "text": "Compassion for all is the only way to turn such tragedies toward positive energy,” he wrote."
        },
        {
            "id": 30,
            "text": "“Terrorism has no nation or religion."
        },
        {
            "id": 31,
            "text": "But likewise its victims are human beings, precious human beings, who must be the objects of compassion for us all.”"
        }
    ]
}