{
    "title": "Mike Pence's decision to stay at Trump hotel in Ireland came after president's 'suggestion', top aide says",
    "text": [
        {
            "id": 0,
            "text": "A top aide to Mike Pence defended the vice president's decision to stay at a Trump hotel during his trip to Ireland."
        },
        {
            "id": 1,
            "text": "Speaking to reporters aboard Air Force Two, chief of staff Marc Short said the idea to stay at the Trump International Golf Links and Hotel in Doonbeg, Ireland, was a suggestion from President Donald Trump."
        },
        {
            "id": 2,
            "text": "\"It's like when we went through the trip, it's like, well, he's going to Doonbeg because that's where the Pence family is from,\" Short explained."
        },
        {
            "id": 3,
            "text": "\"It's like, 'Well, you should stay at my place.'\""
        },
        {
            "id": 4,
            "text": "According to Short, the Trump hotel in Doonbeg was \"the one facility that can accommodate\" a group with Pence's size and needs."
        },
        {
            "id": 5,
            "text": "Short explained that the trip followed \"normal protocol\" and was approved by the State Department."
        },
        {
            "id": 6,
            "text": "The vice president plans to pay all family expenses for his mother and sister, Short later added."
        },
        {
            "id": 7,
            "text": "Later Tuesday, Pence addressed criticism of the trip, and told reporters it was important for him to spend time in Doonbeg because of his family roots there."
        },
        {
            "id": 8,
            "text": "\"I understand political attacks by Democrats, but if you have a chance to get to Doonbeg, you’ll find it’s a fairly small place and the opportunity to stay at the Trump National in Doonbeg, to accommodate the unique footprint that comes with our security detail and other personnel, made it logical,\" Pence said."
        },
        {
            "id": 9,
            "text": "Later on Tuesday, Pence's office put out another statement in an attempt to clarify the vice president's position on the Trump property."
        },
        {
            "id": 10,
            "text": "According to Pence's office, the decision to stay at the Doonbeg Trump property was \"solely a decision by the Office of the Vice President\" and was \"based on the requirement to find accommodations near the Vice President’s ancestral hometown that could satisfy official meetings on both coasts of the Emerald Isle.\""
        },
        {
            "id": 11,
            "text": "\"At no time did the President direct our office to stay at his Doonbeg resort and any reporting to the contrary is false,\" Pence's office added."
        },
        {
            "id": 12,
            "text": "Trump's business entanglements:Did Trump keep his 19 promises to insulate himself from his business?"
        },
        {
            "id": 13,
            "text": "Only he knows."
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": "Pence is traveling through Ireland as part of a trip to meet with the Irish prime minister and business leaders, reconnect with family heritage, and discuss the potential implications of Brexit."
        },
        {
            "id": 16,
            "text": "The vice president had originally intended to visit Doonbeg, an ancestral home of his family through his mother's side, during his trip."
        },
        {
            "id": 17,
            "text": "His great-grandmother was born there, and he has visited the small town on previous trips to Ireland."
        },
        {
            "id": 18,
            "text": "The Trump International Golf Links and Hotel is owned by the Trump Organization, which is held in a trust managed by his sons Eric Trump and Donald Trump Jr. and Trump Organization trustee Allen Weisselberg."
        },
        {
            "id": 19,
            "text": "It is unknown what degree of involvement Trump still has with the organization."
        },
        {
            "id": 20,
            "text": "Pence has faced some criticism from Democrats for staying at the property and flying to meetings in Dublin, on the other side of Ireland."
        },
        {
            "id": 21,
            "text": "Rep. Ted Lieu, D-Calif., called out Pence on Twitter, saying Pence's stay was \"funneling taxpayer money to @POTUS\" and \"sooooooo corrupt.\""
        },
        {
            "id": 22,
            "text": "Short responded to Lieu's comments: \"I think Ted Lieu's often looking to try to get into you all's news stories."
        },
        {
            "id": 23,
            "text": "So I'm not too worried about Ted Lieu's comments.\""
        }
    ]
}