{
    "title": "Trump Demands Two Liberal Justices Recuse Themselves From His Cases",
    "text": [
        {
            "id": 0,
            "text": "NEW DELHI — President Trump lashed out at two liberal Supreme Court justices on Tuesday, escalating his battle with the judicial system to new heights despite entreaties by his attorney general to refrain from attacks that complicate the administration’s legal fights."
        },
        {
            "id": 1,
            "text": "Weighing in on a domestic matter as he began a day of ceremony, meetings and a joint appearance with Prime Minister Narendra Modi of India, Mr. Trump seized on a dissenting opinion last week by Justice Sonia Sotomayor and a years-old comment by Justice Ruth Bader Ginsburg to demand that the two Democratic-appointed jurists recuse themselves from any cases involving him."
        },
        {
            "id": 2,
            "text": "“I just thought it was so inappropriate, such a terrible statement for a Supreme Court justice,” the president said."
        },
        {
            "id": 3,
            "text": "Besides ignoring the entreaties of Attorney General William P. Barr, the president’s attack on the two justices also risked provoking a reaction from Chief Justice John G. Roberts Jr."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "In 2018, Chief Justice Roberts admonished Mr. Trump for calling a federal judge who ruled against one of his administration’s policies, “an Obama judge.”"
        },
        {
            "id": 6,
            "text": "“We do not have Obama judges or Trump judges, Bush judges or Clinton judges,” he said at the time."
        },
        {
            "id": 7,
            "text": "“What we have is an extraordinary group of dedicated judges doing their level best to do equal right to those appearing before them."
        },
        {
            "id": 8,
            "text": "That independent judiciary is something we should all be thankful for.”"
        },
        {
            "id": 9,
            "text": "Kathleen Arberg, a Supreme Court spokeswoman,"
        },
        {
            "id": 10,
            "text": "said Chief Justice Roberts, Justice Ginsburg and Justice Sotomayor declined to comment."
        },
        {
            "id": 11,
            "text": "Mr. Trump did not confine his criticism to the two justices."
        },
        {
            "id": 12,
            "text": "At his news conference, he also renewed his calls for an investigation into his longtime foil, chairman of the House Intelligence Committee, Adam B. Schiff, for what he said without evidence was Mr. Schiff’s improper disclosure of information provided to the committee at a briefing from intelligence officials."
        },
        {
            "id": 13,
            "text": "It is unusual for presidents to fixate on domestic issues while overseas on a state visit, but Mr. Trump has veered from that tradition so much that it has come to be expected."
        },
        {
            "id": 14,
            "text": "Before he took the first question from a reporter during the Tuesday appearance, Mr. Trump said that he did not plan on saying anything controversial."
        },
        {
            "id": 15,
            "text": "And then he attacked two liberal Supreme Court justices and called for an investigation into a political rival."
        },
        {
            "id": 16,
            "text": "“Schiff leaked it, in my opinion — and he shouldn’t be leaking things like that,” Mr. Trump said referring to the California Democrat."
        },
        {
            "id": 17,
            "text": "The president was responding to a question about recent intelligence briefings about Russia’s meddling in the upcoming election."
        },
        {
            "id": 18,
            "text": "“And if they don’t stop it, I can’t imagine that people are not going to go after them and find out what’s happening,” Mr. Trump said, reviving his accusation that the committee had been a source of improper leaks."
        },
        {
            "id": 19,
            "text": "Last week the president also called for an investigation into Mr. Schiff, to which Mr. Schiff responded: “Your false claims fool no one.”"
        },
        {
            "id": 20,
            "text": "Justice Sotomayor issued her dissent issued last week against an order by the court allowing the Trump administration to proceed with a plan to deny green cards to immigrants who are deemed likely to become “public charges” reliant on government aid programs."
        },
        {
            "id": 21,
            "text": "In her seven-page opinion, Justice Sotomayor wrote that the Trump administration had become too quick to run to the Supreme Court after interim losses in the lower courts."
        },
        {
            "id": 22,
            "text": "“Claiming one emergency after another, the government has recently sought stays in an unprecedented number of cases, demanding immediate attention and consuming limited court resources in each,” she wrote."
        },
        {
            "id": 23,
            "text": "“And with each successive application, of course, its cries of urgency ring increasingly hollow.”"
        },
        {
            "id": 24,
            "text": "Writing on Twitter Tuesday morning, Mr. Trump cited Laura Ingraham’s show on Fox News: “‘Sotomayor accuses GOP appointed Justices of being biased in favor of Trump.’”"
        },
        {
            "id": 25,
            "text": "“This is a terrible thing to say."
        },
        {
            "id": 26,
            "text": "Trying to ‘shame’ some into voting her way?"
        },
        {
            "id": 27,
            "text": "She never criticized Justice Ginsberg when she called me a ‘faker’."
        },
        {
            "id": 28,
            "text": "Both should recuse themselves on all Trump, or Trump related, matters!”"
        },
        {
            "id": 29,
            "text": "“While ‘elections have consequences,’” he added, “I only ask for fairness, especially when it comes to decisions made by the United States Supreme Court!”"
        },
        {
            "id": 30,
            "text": "Later, during the news conference at his hotel, he added of Justice Sotomayor, “Her statement was so inappropriate.”"
        },
        {
            "id": 31,
            "text": "“When you’re a justice of the Supreme Court — it’s almost what she’s trying to do is take the people that do feel a different way and get them to vote the way that she would like them to vote,” he said."
        },
        {
            "id": 32,
            "text": "But Justice Sotomayor did not overtly accuse Republican-appointed justices of being biased in favor of Mr. Trump, as the president asserted."
        },
        {
            "id": 33,
            "text": "She complained in her dissent that the court “is partly to blame for the breakdown in the appellate process,” because it “has been all too quick to grant the government’s” reflexive requests."
        },
        {
            "id": 34,
            "text": "She added: “Perhaps most troublingly, the court’s recent behavior on stay applications has benefited one litigant over all others,” a reference to the Trump administration."
        },
        {
            "id": 35,
            "text": "The five justices who voted in the majority in the case were all appointed by Republicans, but Justice Sotomayor did not frame her disagreement in partisan terms, and her dissent was written in much the same way as others by justices who lose divided rulings."
        },
        {
            "id": 36,
            "text": "Mr. Trump did not seem familiar with what Justice Sotomayor actually wrote but instead seemed to be reacting to a television chryon that characterized her statement in a far balder, more political way than she had."
        },
        {
            "id": 37,
            "text": "Asked by a reporter what exactly he found inappropriate, Mr. Trump demurred, saying “you know what the statement was.”"
        },
        {
            "id": 38,
            "text": "When the reporter accurately summarized part of the justice’s dissent, the president said, “No, I don’t think that was it.”"
        },
        {
            "id": 39,
            "text": "In adding Justice Ginsburg to his attacks on Twitter and at the news conference, Mr. Trump resumed a four-year-old feud with the longest-serving liberal on the court."
        },
        {
            "id": 40,
            "text": "During the 2016 presidential campaign, Justice Ginsburg called Mr. Trump a “faker” and said she could not imagine him as president."
        },
        {
            "id": 41,
            "text": "He responded at the time that she should resign."
        },
        {
            "id": 42,
            "text": "She did not, but expressed regret, saying her remarks were “ill advised” for a Supreme Court justice and promised that “in the future I will be more circumspect.”"
        },
        {
            "id": 43,
            "text": "The head of the Lawyers’ Committee for Civil Rights Under Law, Kristen Clarke, said the president’s call for Justices Ginsburg and Sotomayor to recuse themselves was “deeply disturbing and unprecedented.”"
        },
        {
            "id": 44,
            "text": "“No president in modern times,” she said “has shown greater disrespect for or worked to actively undermine the independence of the judiciary than President Trump.”"
        },
        {
            "id": 45,
            "text": "The justices are highly unlikely to comply with Mr. Trump’s latest demand that they recuse themselves from the many cases involving him that come before their court."
        },
        {
            "id": 46,
            "text": "But the president’s attack raised the temperature of his continuing assault on the law enforcement and justice systems, which he has tried to bend to his will in increasingly bold ways."
        },
        {
            "id": 47,
            "text": "In recent days, he has repeatedly attacked Judge Amy Berman Jackson, who is overseeing the case of his friend Roger J. Stone Jr., who was sentenced to more than three years in prison for lying to Congress and intimidating a witness."
        },
        {
            "id": 48,
            "text": "He targeted her again on Tuesday, reposting a Twitter message from a Fox News host that said, “Roger Stone judge’s bias may have jeopardized entire trial,” and later posting another message of his own calling the judge and the jury forewoman “totally biased.”"
        },
        {
            "id": 49,
            "text": "Mr. Barr has gone on television to ask Mr. Trump to stop weighing in on legal cases involving his friends, because it was making it “impossible” for him to do his work."
        },
        {
            "id": 50,
            "text": "A group of federal judges convened an emergency conference call because of the attacks on Judge Jackson."
        },
        {
            "id": 51,
            "text": ""
        }
    ]
}