{
    "title": "Former Republican Lawmakers Urge Congress to Block Trump’s National Emergency Declaration",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "A group of former Republican lawmakers urged Congressional Republicans to block President Trump’s emergency declaration in an open letter released Monday."
        },
        {
            "id": 3,
            "text": "Five former Senators and 19 House members signed the letter, which was first published by Politico, calling on Congress to support a joint resolution ending the national emergency Trump declared earlier this month."
        },
        {
            "id": 4,
            "text": "“We who have signed this letter are no longer Members of Congress but that oath still burns within us,” the former lawmakers write."
        },
        {
            "id": 5,
            "text": "“That is why we are coming together to urge those of you who are now charged with upholding the authority of the first branch of government to resist efforts to surrender those powers to a president.”"
        },
        {
            "id": 6,
            "text": "Trump resorted to a national emergency declaration after Republicans on a specially-designated conference committee failed to secure the $5.7 billion he had long demanded for the construction of a border wall as part of a broader spending package."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "The former lawmakers, all of whom served between 1967 and 2013, embraced a common critique of the national emergency declaration, pointing out that the expansion of executive authority would eventually be wielded against Republicans by a Democratic administration."
        },
        {
            "id": 9,
            "text": "“What will you do when a president of another party uses the precedent you are establishing to impose policies to which you are unalterably opposed?” they ask."
        },
        {
            "id": 10,
            "text": "“There is no way around this difficulty: what powers are ceded to a president whose policies you support may also be used by presidents whose policies you abhor.”"
        },
        {
            "id": 11,
            "text": "The House will vote this week on a resolution to end the national emergency, which has thus far received the support of only one Republican, Representative Justin Amash of Michigan."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        }
    ]
}