{
    "title": "Police Identify Woman Who Wounded 3 at YouTube and Killed Herself; Motive Is Unclear",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "A woman opened fire with a handgun at YouTube’s headquarters in California on Tuesday afternoon, shooting three people — one of whom was critically injured — before killing herself, the authorities said."
        },
        {
            "id": 2,
            "text": "The San Bruno Police Department identified the attacker late Tuesday as Nasim Najafi Aghdam, who was in her late 30s."
        },
        {
            "id": 3,
            "text": "The motivation for the shootings was under investigation, the police said, although her social media postings included criticisms of YouTube."
        },
        {
            "id": 4,
            "text": "Zuckerberg San Francisco General Hospital received three patients: a man, 36, in critical condition; a woman, 32, in serious condition; and a woman, 27, in fair condition, a hospital spokesman, Brent Andrew, said at a news conference."
        },
        {
            "id": 5,
            "text": "A fourth person had injuries that weren’t from a gunshot, the police said."
        },
        {
            "id": 6,
            "text": "“At this time there is no evidence that the shooter knew the victims of this shooting or that individuals were specifically targeted,” the San Bruno Police Department said in a written statement."
        },
        {
            "id": 7,
            "text": "Word of the attack in San Bruno at YouTube, which is owned by Google and is one of the world’s largest social media companies, quickly spread online through employees’ social media feeds."
        },
        {
            "id": 8,
            "text": "Vadim Lavrusik, a YouTube employee who formerly worked for The New York Times, tweeted just before 1 p.m. that there was an “active shooter at YouTube HQ” and that he had “heard shots and saw people running while at my desk.”"
        },
        {
            "id": 9,
            "text": "He was barricaded in a room with co-workers, he said, but moments later tweeted that he had been safely evacuated."
        },
        {
            "id": 10,
            "text": "The last known address for Ms. Aghdam was in Menifee, a city in Southern California about halfway between Los Angeles and San Diego."
        },
        {
            "id": 11,
            "text": "Ms. Aghdam was active on various social media outlets, including YouTube, where she had a number of channels in Persian, Turkish and English."
        },
        {
            "id": 12,
            "text": "On YouTube, she published an eclectic set of videos, including music parodies and workouts, on topics like animal cruelty and vegan cooking."
        },
        {
            "id": 13,
            "text": "In February 2017, she recorded a video on Facebook criticizing YouTube for taking measures that decreased the number of views on her videos."
        },
        {
            "id": 14,
            "text": "She said that she had contacted YouTube, but that the site’s support staff told her that her workout videos contained inappropriate scenes and needed to be restricted from younger audiences."
        },
        {
            "id": 15,
            "text": "“This is what they are doing to vegan activists and many other people who try to promote healthy, humane and smart living — people like me are not good for big business, like for animal business, medicine business and for many other businesses."
        },
        {
            "id": 16,
            "text": "That’s why they are discriminating and censoring us,” she said in the video on Facebook."
        },
        {
            "id": 17,
            "text": "YouTube had pulled down all of her channels as of Tuesday night."
        },
        {
            "id": 18,
            "text": "A 2009 story by The San Diego Union-Tribune quoted a woman with the same name as Ms. Aghdam at an animal rights protest outside Camp Pendleton, the Marine Corps base in Southern California."
        },
        {
            "id": 19,
            "text": "Two dozen attended the protest organized by People for the Ethical Treatment of Animals against the use of pigs in military trauma training."
        },
        {
            "id": 20,
            "text": "“For me, animal rights equal human rights,” said Ms. Aghdam, then 29, who attended the protest carrying a plastic sword and wearing a wig and jeans painted with drops of blood."
        },
        {
            "id": 21,
            "text": "The shootings on Tuesday took place in a courtyard at YouTube’s offices, the police said."
        },
        {
            "id": 22,
            "text": "Those offices, like other Google facilities, maintain light security, with employees using badges to go through security gates or doors."
        },
        {
            "id": 23,
            "text": "Usually, the main lobby is attended by a receptionist."
        },
        {
            "id": 24,
            "text": "There are no visible metal detectors or armed guards."
        },
        {
            "id": 25,
            "text": "San Bruno is about nine miles south of San Francisco, with a population around 43,000."
        },
        {
            "id": 26,
            "text": "YouTube is the city’s biggest employer, and many workers commute here from San Francisco."
        },
        {
            "id": 27,
            "text": "Though YouTube is owned by Google, it operates in a separate office, about 20 miles from Google’s main campus in Mountain View, Calif."
        },
        {
            "id": 28,
            "text": "Outside the YouTube headquarters, armed police officers waded into a crowd of 200 or so employees who had evacuated to a nearby parking lot Tuesday afternoon."
        },
        {
            "id": 29,
            "text": "The police asked for employees who had witnessed something firsthand to come forward, and about two dozen, some visibly distraught, walked over to the officers."
        },
        {
            "id": 30,
            "text": "Many employees said they had initially thought the episode was a fire drill."
        },
        {
            "id": 31,
            "text": "Others said they had run when people started shouting that there was a shooter."
        },
        {
            "id": 32,
            "text": "Two hours after the attack, YouTube employees, including Susan Wojcicki, the chief executive, continued to stream slowly down the hill, away from the office."
        },
        {
            "id": 33,
            "text": "Footage broadcast by CNN showed people leaving the building in single file with their hands raised above their heads."
        },
        {
            "id": 34,
            "text": "Separate footage showed a large crowd lining up to be frisked, one by one, by the police."
        },
        {
            "id": 35,
            "text": "Zach Vorhies, 37, a senior software engineer at YouTube, said in an interview that he had been sitting at his desk when the fire alarm went off."
        },
        {
            "id": 36,
            "text": "He grabbed his electric skateboard and headed for a back exit, he said."
        },
        {
            "id": 37,
            "text": "As he rode down a gravel hill, he heard someone shouting and saw a man lying motionless in one of the office’s outdoor dining areas."
        },
        {
            "id": 38,
            "text": "“He had a red spot on his stomach, and he was lying on his back, not moving,” Mr. Vorhies said."
        },
        {
            "id": 39,
            "text": "“I saw the blood soak through the shirt.”"
        },
        {
            "id": 40,
            "text": "About 25 feet away from the victim, he said, a man was shouting, “Come at me!”"
        },
        {
            "id": 41,
            "text": "Mr. Vorhies thought the man was the attacker, but he did not see a gun and said it was possible that the man had actually “been taunting the shooter.”"
        },
        {
            "id": 42,
            "text": "A moment later, an armed police officer entered the patio area, and Mr. Vorhies quickly left, he said."
        },
        {
            "id": 43,
            "text": "The dining area can be reached from an adjacent parking structure without an employee badge, Mr. Vorhies said."
        },
        {
            "id": 44,
            "text": "By 2:15 p.m., President Trump had been briefed on the attack."
        },
        {
            "id": 45,
            "text": "He tweeted a short time later: “Was just briefed on the shooting at YouTube’s HQ in San Bruno, California."
        },
        {
            "id": 46,
            "text": "Our thoughts and prayers are with everybody involved."
        },
        {
            "id": 47,
            "text": "Thank you to our phenomenal Law Enforcement Officers and First Responders that are currently on the scene.”"
        },
        {
            "id": 48,
            "text": "Cameron Rogers Polan, a spokeswoman for the San Francisco Division of the F.B.I., said in an email that the agency was in contact with the San Bruno police."
        },
        {
            "id": 49,
            "text": "The San Francisco division of the federal Bureau of Alcohol, Tobacco, Firearms and Explosives tweeted that it, too, was responding to the shooting."
        },
        {
            "id": 50,
            "text": "Google said on Twitter that it was “coordinating with authorities.”"
        },
        {
            "id": 51,
            "text": "“I know a lot of you are in shock right now,” Google’s chief executive, Sundar Pichai, said in a statement posted to Twitter."
        },
        {
            "id": 52,
            "text": "“Over the coming days, we will continue to provide support to help everyone in our Google family heal from this unimaginable tragedy.”"
        },
        {
            "id": 53,
            "text": "Executives at other Silicon Valley companies took to Twitter to send their condolences to YouTube employees."
        },
        {
            "id": 54,
            "text": "“From everyone at Apple, we send our sympathy and support to the team at YouTube and Google, especially the victims and their families,” Apple’s chief executive, Timothy D. Cook, wrote."
        },
        {
            "id": 55,
            "text": "Jack Dorsey, Twitter’s chief executive, wrote on Twitter: “I can’t imagine what our friends at YouTube are feeling and dealing with right now."
        },
        {
            "id": 56,
            "text": "We‘re here for you and your families and friends.”"
        },
        {
            "id": 57,
            "text": "Others, including a trauma surgeon at the hospital where shooting victims were taken, expressed anger at continued gun violence."
        },
        {
            "id": 58,
            "text": "“You’d think that after we’ve seen Las Vegas, Parkland, the Pulse nightclub shooting, that we would see an end to this, but we have not,” the surgeon, Dr. Andre Campbell, told reporters Tuesday afternoon."
        }
    ]
}