{
    "title": "Sessions vows to eliminate political bias at DOJ",
    "text": [
        {
            "id": 0,
            "text": "Attorney General Jeff Sessions said Friday he’s determined to eliminate “political bias” from the Justice Department, and said the department must be more open to the kind of criticism it’s facing from Congress right now."
        },
        {
            "id": 1,
            "text": "Mr. Sessions said “the vast majority” of employees at Justice, which includes the FBI, are dedicated and patriotic Americans who do quality work."
        },
        {
            "id": 2,
            "text": "But he signaled the department has strayed from its core mission of fairly enforcing the laws as written by Congress, and said his “purpose every day” is to get it back on track."
        },
        {
            "id": 3,
            "text": "“It means absolutely eliminating political bias or favoritism — in either direction — from our investigations and prosecutions."
        },
        {
            "id": 4,
            "text": "That sort of thinking is the antithesis of what the department stands for, and I won’t tolerate it,” he said in a speech in Norfolk."
        },
        {
            "id": 5,
            "text": "The FBI has been rocked by revelations that an agent and a lawyer both involved at one point in the Russia investigation exchanged thousands of text messages suggesting a deep antipathy toward President Trump."
        },
        {
            "id": 6,
            "text": "The agent was also part of the investigation into former Secretary of State Hillary Clinton’s emails, and his texts have raised more questions about bias in that probe as well."
        },
        {
            "id": 7,
            "text": "Republicans have also questioned the behavior of the deputy director at the FBI, who has family ties to Democratic causes."
        },
        {
            "id": 8,
            "text": "Mr. Sessions didn’t mention any specific instances in his speech, and said bias from all sides must be weeded out of the department."
        },
        {
            "id": 9,
            "text": "Democrats have said those raising questions about the FBI are trying to undermine the investigation into Russian meddling in the 2016 election."
        },
        {
            "id": 10,
            "text": "But Mr. Sessions said the department should be open to the complaints."
        },
        {
            "id": 11,
            "text": "“We don’t see criticism from Congress as a bad thing."
        },
        {
            "id": 12,
            "text": "We welcome Congress as a partner in this effort,” he said."
        },
        {
            "id": 13,
            "text": "“When they learn of a problem and start asking questions, that is a good thing.”"
        },
        {
            "id": 14,
            "text": "“A culture of defensiveness is not acceptable,” he said."
        },
        {
            "id": 15,
            "text": "“The Department of Justice does not always know what’s best, and it is not perfect."
        },
        {
            "id": 16,
            "text": "And, it can never be that this Department conceals errors when they occur.”"
        },
        {
            "id": 17,
            "text": "He did say the department should defend itself against “criticism that is unfair.”"
        },
        {
            "id": 18,
            "text": "Sign up for Daily Newsletters Manage Newsletters"
        },
        {
            "id": 19,
            "text": "Copyright © 2021"
        },
        {
            "id": 20,
            "text": "The Washington Times, LLC."
        },
        {
            "id": 21,
            "text": "Click here for reprint permission."
        }
    ]
}