{
    "title": "Trump-Russia probe: Barr 'assigns prosecutor to review inquiry'",
    "text": [
        {
            "id": 0,
            "text": "US Attorney General William Barr has assigned a senior federal prosecutor to examine the origins of the Russia investigation."
        },
        {
            "id": 1,
            "text": "John Durham, the US attorney in Connecticut, has reportedly been asked to determine whether the collection of intelligence on the Trump campaign was lawful."
        },
        {
            "id": 2,
            "text": "President Donald Trump has long called for such an investigation."
        },
        {
            "id": 3,
            "text": "He has branded the Russia inquiry a \"witch hunt\" by his opponents."
        },
        {
            "id": 4,
            "text": "Critics of Mr Barr, however, have accused him of acting on behalf of the president rather than in the interests of US justice."
        },
        {
            "id": 5,
            "text": "Speaking to reporters outside the White House on Tuesday, Mr Trump said he had not directed Mr Barr to investigate the origins of the Russia probe."
        },
        {
            "id": 6,
            "text": "\"I didn't ask him to do that..."
        },
        {
            "id": 7,
            "text": "But I think it's a great thing that he did,\" Mr Trump said."
        },
        {
            "id": 8,
            "text": "\"I am so proud of our attorney general.\""
        },
        {
            "id": 9,
            "text": "Last month, Mr Barr told members of Congress that he believed \"spying did occur\" on the Trump campaign in 2016, adding: \"The question is whether it was adequately predicated."
        },
        {
            "id": 10,
            "text": "And I'm not suggesting that it wasn't adequately predicated."
        },
        {
            "id": 11,
            "text": "But I need to explore that.\""
        },
        {
            "id": 12,
            "text": "He gave no details but said he was gathering a team to look into the origins of the investigation, which was led by special counsel Robert Mueller."
        },
        {
            "id": 13,
            "text": "Mr Durham, who has a background in investigating wrongdoing and corruption among public officials, will not be acting as a special counsel in the same way Mr Mueller did, reports say."
        },
        {
            "id": 14,
            "text": "But he will be tasked with exploring whether the government acted lawfully and appropriately when collecting intelligence ahead of the 2016 election."
        },
        {
            "id": 15,
            "text": "Mr Trump and his supporters have often accused the FBI and the Department of Justice of illegally monitoring his campaign."
        },
        {
            "id": 16,
            "text": "This is the third known inquiry into the early days of the Russia investigation."
        },
        {
            "id": 17,
            "text": "A Department of Justice inspector general is also examining the origins of the investigation, and the US attorney in Utah has also been asked to look into aspects of it."
        },
        {
            "id": 18,
            "text": "Further details of the latest review are limited and the Justice Department has yet to comment."
        },
        {
            "id": 19,
            "text": "Mr Durham is also exploring whether former FBI general counsel James Baker disclosed confidential information to the media, the New York Times reports."
        },
        {
            "id": 20,
            "text": "Mr Baker denies wrongdoing, and it is unclear if this line of inquiry relates directly to the Russia investigation."
        },
        {
            "id": 21,
            "text": "Mr Mueller's 448-page report did not conclude that there was a criminal conspiracy between Moscow and the Trump campaign to influence the 2016 US presidential election."
        },
        {
            "id": 22,
            "text": "However, it did detail 10 instances where Mr Trump possibly attempted to impede the investigation."
        },
        {
            "id": 23,
            "text": "The report concluded that Russia had interfered in the election \"in sweeping and systematic fashion\"."
        },
        {
            "id": 24,
            "text": "That interference took the form of an extensive social media campaign and hacking into Democratic Party servers by Russian military intelligence, the report said."
        },
        {
            "id": 25,
            "text": "Mr Trump and his supporters immediately jumped on the fact that no collusion was found."
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": "\"After three years of lies and smears and slander, the Russia hoax is finally dead,\" the president said at the time."
        },
        {
            "id": 28,
            "text": "He called for an investigation into the report."
        },
        {
            "id": 29,
            "text": "On Tuesday, the president's lawyers welcomed news of Mr Barr's review. \""
        },
        {
            "id": 30,
            "text": "He made a sensible choice,\" Rudy Giuliani said."
        },
        {
            "id": 31,
            "text": "\"I believe Barr has selected an excellent person.\""
        },
        {
            "id": 32,
            "text": "\"The origins of this investigation have to be examined thoroughly, and the appointment of a US attorney would be the appropriate course of action,\" another of Mr Trump's lawyers, Jay Sekulow, said."
        },
        {
            "id": 33,
            "text": "Meanwhile, leading Democrats have demanded that the Mueller report be published in full."
        },
        {
            "id": 34,
            "text": "They have pledged to make use of the party's majority control of committees in the House of Representatives to continue investigating the president."
        },
        {
            "id": 35,
            "text": "Earlier this month, a US House of Representatives panel voted to hold Mr Barr in contempt of Congress for not releasing an unredacted copy of the report."
        },
        {
            "id": 36,
            "text": "The judiciary committee took the rare step as tensions rose over its findings."
        },
        {
            "id": 37,
            "text": "US Speaker Nancy Pelosi accused Mr Barr of lying to Congress but a justice department spokeswoman called it a \"baseless attack\"."
        }
    ]
}