{
    "title": "House lawmakers grapple with Ebola both at home and abroad",
    "text": [
        {
            "id": 0,
            "text": "A House oversight hearing Friday laid bare the sheer complexity of dealing with the global Ebola epidemic, as lawmakers toggled between the desperate plight in West Africa and concern that flawed policies have put Americans’ at risk on their own shores."
        },
        {
            "id": 1,
            "text": "Rep. Darrell Issa, California Republican and the chamber’s top investigator, repeatedly questioned the Obama administration’s ability to track the virus and guide local officials through the fight."
        },
        {
            "id": 2,
            "text": "A Dallas hospital turned away the Liberian man who first brought Ebola to the U.S. when he presented symptoms, only to admit him days later."
        },
        {
            "id": 3,
            "text": "He died Oct. 8, and two nurses contracted the virus from him."
        },
        {
            "id": 4,
            "text": "The second nurse was allowed to fly on a commercial airline."
        },
        {
            "id": 5,
            "text": "“We need to know why there have been breakdowns and if our system for responding to such serious crisis is working properly,” Mr. Issa said."
        },
        {
            "id": 6,
            "text": "Even as Nina Pham, the first Dallas nurse to contract the virus, was set to be released from special care in Bethesda, Md., reports from New York City spurred new alarm about the ease with which Ebola could crop up in pockets of the country."
        },
        {
            "id": 7,
            "text": "Late Thursday, New York City officials confirmed that a 33-year-old doctor, Craig Spencer, had tested positive for Ebola after treating patients in West Africa."
        },
        {
            "id": 8,
            "text": "Although he was not symptomatic and likely not contagious, the doctor had been out bowling and used public transportation before he was hospitalized."
        },
        {
            "id": 9,
            "text": "Dr. Spencer left Guinea on Oct. 14 and traveled through Brussels, Belgium, before arriving at JFK Airport last Friday, New York City officials said."
        },
        {
            "id": 10,
            "text": "The oversight committee’s top Democrat, Rep. Elijah Cummings of Maryland, tried to shift the focus of Friday’s hearing to the plight abroad."
        },
        {
            "id": 11,
            "text": "At one point, he played a short video of a West African gravedigger who said he has no specialized skill, but he is a laborer who wants to do his part in the fight against Ebola"
        },
        {
            "id": 12,
            "text": "“We need to deal with the Ebola virus as its source, in West Africa,” said Rabih Torbay, asking for more health care personnel and financial resources."
        },
        {
            "id": 13,
            "text": "“This is a global issue, not just a West Africa issue.”"
        },
        {
            "id": 14,
            "text": "President Obama has dedicated upwards of 3,000 troops to the fight in West Africa."
        },
        {
            "id": 15,
            "text": "On Friday, Michael D. Lumpkin, an assistant secretary at the Defense Department, highlighted the disarray in those countries for the committee."
        },
        {
            "id": 16,
            "text": "“I traveled to the region thinking we faced a health care crisis with a logistics challenge,” Mr. Lumpkin testified."
        },
        {
            "id": 17,
            "text": "“In reality, what I found was that we face a logistics crisis focused on a health care challenge.”"
        },
        {
            "id": 18,
            "text": "Lawmakers worried about the challenge abroad, but repeatedly questioned whether the administration is implementing an on-the-fly approach to the disease at home."
        },
        {
            "id": 19,
            "text": "The scramble to retrace Dr. Spencer’s steps in New York presented a moral dilemma for lawmakers scrutinizing U.S. efforts."
        },
        {
            "id": 20,
            "text": "The young doctor volunteered his time in West Africa, but members wondered whether he should have spent Ebola’s 21-day incubation period in his apartment upon his return."
        },
        {
            "id": 21,
            "text": "“I give the doctor tremendous credit for going over there."
        },
        {
            "id": 22,
            "text": "But I think there should be more restrictions when they come back, because, as we saw in the first few weeks of the CDC, they were wrong in certain areas,” Rep. Peter King, New York Republican, told MSNBC early Friday."
        },
        {
            "id": 23,
            "text": "“I don’t think we know yet enough about Ebola and how it may be transmitted, for instance, in a region like Africa, as opposed to a confined urban center such as New York, with the subways, with the crowded population.”"
        },
        {
            "id": 24,
            "text": "The Department of Homeland Security is screening all passengers from Liberia, Sierra Leone or Guinea at major international airports, yet some say the process is useless if travelers do not show symptoms until they are deeply within the U.S."
        },
        {
            "id": 25,
            "text": "“I can tell you it’s not working,” Rep. John Mica, Florida Republican, said at the oversight hearing."
        },
        {
            "id": 26,
            "text": "“All you have to do is look at Craig Spencer.”"
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        }
    ]
}