{
    "title": "DACA Participants Can Again Apply for Renewal, Immigration Agency Says",
    "text": [
        {
            "id": 0,
            "text": "The federal government said on Saturday that it would resume accepting renewal requests for a program that shields from deportation young immigrants who were brought illegally to the United States as children."
        },
        {
            "id": 1,
            "text": "In a statement, United States Citizenship and Immigration Services said that “until further notice,” the Obama-era program, Deferred Action for Childhood Arrivals, known as DACA, “will be operated on the terms in place before it was rescinded” in September, when President Trump moved to end it."
        },
        {
            "id": 2,
            "text": "The decision came after a federal judge in California issued a nationwide injunction on Tuesday ordering the Trump administration to resume the DACA program."
        },
        {
            "id": 3,
            "text": "The agency said on Saturday that people who were previously granted deferred action under the program could request a renewal if it had expired on or after Sept. 5, 2016."
        },
        {
            "id": 4,
            "text": "People who had previously received DACA, but whose deferred action had expired before Sept. 5, 2016, cannot renew, but can instead file a new request, the agency said."
        },
        {
            "id": 5,
            "text": "It noted that the same instructions apply to anyone whose deferred action had been terminated."
        },
        {
            "id": 6,
            "text": "But officials also said they were not accepting requests from individuals who have never been granted deferred action under DACA."
        },
        {
            "id": 7,
            "text": "President Barack Obama created the DACA program in 2012 to give young immigrants the ability to work legally in the United States."
        },
        {
            "id": 8,
            "text": "In attempting to end it in September, President Trump argued that Mr. Obama’s actions were unconstitutional and an overreach of executive power."
        },
        {
            "id": 9,
            "text": "Critics of the president’s decision to end the policy later sued the administration, saying that shutting down the program was arbitrary and done without following the proper legal procedures."
        },
        {
            "id": 10,
            "text": "The legal battle is one piece of a fierce debate in Washington."
        },
        {
            "id": 11,
            "text": "Democrats and Republicans have sparred for months about how to provide relief for about 800,000 immigrants who could face deportation."
        },
        {
            "id": 12,
            "text": "Mr. Trump met with lawmakers on Tuesday afternoon in an hourlong televised meeting to begin negotiations."
        },
        {
            "id": 13,
            "text": "Later that day, Judge William Alsup of Federal District Court in San Francisco handed down his ruling, writing that the administration must “maintain the DACA program on a nationwide basis” as the legal challenge to the president"
        },
        {
            "id": 14,
            "text": "’s decision goes forward."
        },
        {
            "id": 15,
            "text": "In his ruling, Judge Alsup laid out a road map for the government that officials appeared to follow."
        },
        {
            "id": 16,
            "text": "He said that previous beneficiaries of DACA, known as Dreamers, must be allowed to renew their status in the program, though the government would not be required to accept new applications from immigrants who had not previously submitted one."
        },
        {
            "id": 17,
            "text": "On Sunday morning, Mr. Trump blamed Democrats for preventing progress on a legislative deal that would permanently legalize the young immigrants and give them an eventual path to citizenship in exchange for tougher border security and enforcement measures."
        },
        {
            "id": 18,
            "text": "The president criticized Democratic lawmakers, some of whom have suggested that they will not support efforts to fund the government by a deadline later this week unless Congress passes the DACA legislation."
        },
        {
            "id": 19,
            "text": "“DACA is probably dead because the Democrats don’t really want it, they just want to talk and take desperately needed money away from our Military,” Mr. Trump said on Twitter from his Mar-a-Lago estate in Palm Beach, Fla."
        },
        {
            "id": 20,
            "text": "In a second tweet, Mr. Trump said that immigration legislation should include an end to the diversity visa lottery system, in which the State Department encourages diversity in immigration by holding a lottery for those wanting to come to the United States."
        },
        {
            "id": 21,
            "text": "The president has criticized the program as a threat to the country’s security even though people selected are screened in the same ways that other immigrants are."
        },
        {
            "id": 22,
            "text": "Mr. Trump has also said that the program undermines efforts by the administration to allow immigrants who have skills that will be beneficial to the United States."
        },
        {
            "id": 23,
            "text": "“I, as President, want people coming into our Country who are going to help us become strong and great again, people coming in through a system based on MERIT,” he said."
        },
        {
            "id": 24,
            "text": "“No more Lotteries!"
        },
        {
            "id": 25,
            "text": "#AMERICA FIRST.”"
        }
    ]
}