{
    "title": "Trump questions 3-D printable guns — which his own administration just helped make available to public",
    "text": [
        {
            "id": 0,
            "text": "A federal judge has blocked the public availability of blueprints that provide instructions for making guns using 3-D printers, just hours before the documents were expected to be published online."
        },
        {
            "id": 1,
            "text": "Eight attorneys general and the District of Columbia argued that the instructions posed a national security threat."
        },
        {
            "id": 2,
            "text": "New York Gov. Andrew Cuomo (D) on Tuesday also issued a cease-and-desist order against the man who was scheduled to post them online."
        },
        {
            "id": 3,
            "text": "“In a major victory for common sense and public safety, a federal judge just granted our request for a nationwide temporary restraining order — blocking the Trump administration from allowing the distribution of materials to easily 3-D print guns,” New York Attorney General Barbara Underwood said in a statement."
        },
        {
            "id": 4,
            "text": "“As we argued in the suit we filed yesterday, it is — simply — crazy to give criminals the tools to build untraceable, undetectable 3-D printed guns at the touch of a button."
        },
        {
            "id": 5,
            "text": "Yet that’s exactly what the Trump administration decided to allow.”"
        },
        {
            "id": 6,
            "text": "Josh Blackman, a lawyer who represents Cody Wilson, the founder of the nonprofit that planned to post the instructions, said the restraining order violates protected First Amendment rights."
        },
        {
            "id": 7,
            "text": "“We were disappointed in the ruling and view it as a massive prior restraint of free speech,” Blackman said."
        },
        {
            "id": 8,
            "text": "Lasnik will hold a hearing on Aug. 10 to determine whether the order should be made permanent."
        },
        {
            "id": 9,
            "text": "Lawmakers are trying to prevent the spread of 3-D-printed guns."
        },
        {
            "id": 10,
            "text": "They may be too late."
        },
        {
            "id": 11,
            "text": "The legislative and legal maneuvers aimed to prevent Defense Distributed, a Texas nonprofit organization, from posting the schematics for 3-D-printed guns on the Internet."
        },
        {
            "id": 12,
            "text": "The firearms, which are mostly made of plastic, are untraceable because they do not have serial numbers, would not require a background check to print and are easily destroyed after use."
        },
        {
            "id": 13,
            "text": "The available blueprints include guides for making guns akin to assault-style rifles such as AR-15s and AR-10s, a pistol called the Liberator, and a Ruger 10/22."
        },
        {
            "id": 14,
            "text": "The technology could herald an era of DIY guns that can be produced — and amassed — in secret."
        },
        {
            "id": 15,
            "text": "The Pennsylvania attorney general also sued Defense Distributed on Sunday, and the company agreed to temporarily block Pennsylvania users from its website."
        },
        {
            "id": 16,
            "text": "Democrats in the House and Senate also filed legislation that would in effect ban guns constructed from 3-D-printed material."
        },
        {
            "id": 17,
            "text": "But despite the efforts, some of the plans went online Friday, according to Pennsylvania Attorney General Josh Shapiro."
        },
        {
            "id": 18,
            "text": "He said about 1,000 people had, within days, already downloaded 3-D plans for AR-15 semiautomatic rifles."
        },
        {
            "id": 19,
            "text": "Defense Distributed agreed not to upload new files."
        },
        {
            "id": 20,
            "text": "In a tweet, President Trump said the guns do not “seem to make much sense.”"
        },
        {
            "id": 21,
            "text": "Trump said he is “looking into” the guns’ availability and said he spoke with the National Rifle Association."
        },
        {
            "id": 22,
            "text": "Deputy White House press secretary Hogan Gidley told reporters Tuesday that it is illegal to own or make a “wholly plastic gun of any kind,” including on a 3-D printer."
        },
        {
            "id": 23,
            "text": "Gidley said that the administration supports the law and that it “will continue to look at all options available to us to do what is necessary to protect Americans while also supporting the First and Second Amendments. ..."
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": "The President is committed to the safety and security of all Americans and considers this his highest responsibility.”"
        },
        {
            "id": 27,
            "text": "Chris Cox, executive director of the NRA’s Institute for Legislative Action, said in a statement that many have “wrongly claimed” that 3-D printing will lead to the production and “widespread proliferation” of undetectable plastic guns."
        },
        {
            "id": 28,
            "text": "“Regardless of what a person may be able to publish on the Internet, undetectable plastic guns have been illegal for 30 years,” Cox said, noting that federal law makes it “unlawful to manufacture, import, sell, ship, deliver, possess, transfer or receive an undetectable firearm.”"
        },
        {
            "id": 29,
            "text": "It is legal to make a firearm for personal use without a license, though some  — such as those that have short barrels, for example — require a tax payment and advance approval from the Bureau of Alcohol, Tobacco, Firearms and Explosives."
        },
        {
            "id": 30,
            "text": "It is illegal to make a gun from 10 or more imported parts, and it is illegal to make guns that can’t be detected by metal detectors or X-ray machines."
        },
        {
            "id": 31,
            "text": "The battle over the blueprints started in 2013, when Cody Wilson, the founder of Defense Distributed, made the first fully 3-D-printed pistol and posted the design files online."
        },
        {
            "id": 32,
            "text": "The federal government alleged that violated federal law."
        },
        {
            "id": 33,
            "text": "Uploading the files, it argued, was tantamount to an illegal export of firearms."
        },
        {
            "id": 34,
            "text": "Meet the man who might have brought on the age of ‘downloadable guns’\n\nWilson sued, and the federal government shocked all involved by reversing its position."
        },
        {
            "id": 35,
            "text": "It settled with Wilson on June 29, agreeing to pay $40,000 in legal fees and exempting the company from the regulations, allowing it to post the blueprints online."
        },
        {
            "id": 36,
            "text": "His lawyer did not immediately respond to a request for comment on Tuesday night’s ruling."
        },
        {
            "id": 37,
            "text": "Twenty-one attorneys general signed a letter asking Secretary of State Mike Pompeo and Attorney General Jeff Sessions to withdraw from the settlement and block the plans from going online."
        },
        {
            "id": 38,
            "text": "State Department spokeswoman Heather Nauert said U.S. citizens have been legally able to download the files for years and that the State Department was involved because it controls access to U.S. defense technology."
        },
        {
            "id": 39,
            "text": "Wilson has maintained that this is a First Amendment case, claiming that the government’s attempts to block the publication of the information on the Web amounts to prior restraint barred by Supreme Court precedent."
        },
        {
            "id": 40,
            "text": "Blackman, Wilson’s attorney, compared the state government’s attempts to block his client’s website to the Pentagon Papers case, in which the Nixon administration unsuccessfully tried to stop the New York Times and The Washington Post from publishing the contents of a leaked Vietnam War report."
        },
        {
            "id": 41,
            "text": "Nauert said the Justice Department recommended that the case settle because it would probably be lost on First Amendment grounds."
        },
        {
            "id": 42,
            "text": "Wilson filed suit against the New Jersey attorney general and the Los Angeles city attorney in recent days, arguing that his case is about “access to information,” not gun regulations."
        },
        {
            "id": 43,
            "text": "A group of gun-control groups filed suit trying to block publication of the schematics; their case was thrown out by a federal judge."
        },
        {
            "id": 44,
            "text": "Opponents blamed the Trump administration for allowing them to go online."
        },
        {
            "id": 45,
            "text": "“.@POTUS has imperiled the lives of untold numbers of innocent children, teachers, religious worshippers, movie-goers, and music lovers, not to mention bystanders."
        },
        {
            "id": 46,
            "text": "Plastic guns are untraceable, undetectable, and uncontrollable."
        },
        {
            "id": 47,
            "text": "These inevitable deaths will be on his hands,” said Rep. Jackie Speier (D-Calif.), who was shot five times in the Jonestown massacre in 1978."
        },
        {
            "id": 48,
            "text": "Sen. Susan Collins (R-Maine) said she believes that Congress needs to take action on the guns."
        },
        {
            "id": 49,
            "text": "“This is a dangerous development, and the idea of allowing terrorists and criminals to be able to manufacture their own firearms using 3-D printers is very serious,” she said."
        },
        {
            "id": 50,
            "text": "Correction: An earlier version of this article reported that it is legal to make a firearm for personal use without a license if one makes a tax payment and gets advance approval from the Bureau of Alcohol, Tobacco, Firearms and Explosives."
        },
        {
            "id": 51,
            "text": "Only some homemade guns require a tax payment and advance approval."
        },
        {
            "id": 52,
            "text": ""
        }
    ]
}