{
    "title": "Justice Dept. to Replace Lawyers in Census Citizenship Question Case",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — The Justice Department announced on Sunday that it was replacing the legal team defending the Trump administration’s effort to place a citizenship question on the next census, a change that is all but unprecedented in legal battles as consequential as the one over the 2020 head count."
        },
        {
            "id": 1,
            "text": "The department said in a statement that it was “shifting these matters to a new team of Civil Division lawyers going forward.”"
        },
        {
            "id": 2,
            "text": "It offered no explanation for the en masse change, which came on the heels of an extraordinary week in a yearlong clash over the issue that has raised concerns about whether the department’s arguments for adding the question could be believed."
        },
        {
            "id": 3,
            "text": "And it strongly suggested that the department’s career lawyers had decided to quit a case that at the least seemed to lack a legal basis, and at most left them defending statements that could well turn out to be untrue."
        },
        {
            "id": 4,
            "text": "“There is no reason they would be taken off that case unless they saw what was coming down the road and said, ‘I won’t sign my name to that,’”"
        },
        {
            "id": 5,
            "text": "Justin Levitt, a former senior official in the Justice Department under President Barack Obama, said on Sunday."
        },
        {
            "id": 6,
            "text": "Kerri Kupec, a department spokeswoman, cast the change in a positive light, saying in a statement that the lawyers had “given countless hours to defending the Commerce Department and have consistently demonstrated the highest professionalism, integrity and skill inside and outside the courtroom.”"
        },
        {
            "id": 7,
            "text": "Attorney General William P. Barr “appreciates that service,” she added, “and is confident that the new team will carry on in the same exemplary fashion.”"
        },
        {
            "id": 8,
            "text": "But according to a Justice Department lawyer who spoke on the condition of anonymity for fear of retaliation, no lawyers from the department’s federal programs branch — which customarily defends the administration’s policies in court — would be working on the census issue."
        },
        {
            "id": 9,
            "text": "A senior official confirmed that federal programs was being taken off the case."
        },
        {
            "id": 10,
            "text": "Lawyers who had been working on the case apparently concluded that they faced three problems."
        },
        {
            "id": 11,
            "text": "They had told the Supreme Court that they were up against a strict deadline of June 30 for printing the census forms, and there were difficulties in finding a new justification for the question that would not seem invented out of whole cloth."
        },
        {
            "id": 12,
            "text": "They may have also concluded that there was no way to move speedily enough to restore the question in any event, given that constitutional and statutory frameworks seem to require a lengthy administrative process before new questions may be added to the census."
        },
        {
            "id": 13,
            "text": "The change in the legal team appeared to signal even deeper problems for the administration’s effort to put the question on the next census, a proposal that critics have assailed as an ill-disguised plot to manipulate the final head count in ways that would benefit the Republican Party."
        },
        {
            "id": 14,
            "text": "The department’s lawyers had for months defended assertions by Commerce Secretary Wilbur Ross that the Justice Department sought the citizenship question so that it could acquire better data to enforce the 1965 Voting Rights Act."
        },
        {
            "id": 15,
            "text": "Three federal courts ruled that that explanation was clearly an excuse for some other goal, and last month the Supreme Court agreed, saying the question could be asked only if the department came up with a believable rationale."
        },
        {
            "id": 16,
            "text": "The Justice Department abandoned the fight after that ruling, telling a federal judge that the battle was over “for once and for all,” only to be blindsided last week by President Trump, who said on Twitter that the statements were “fake.”"
        },
        {
            "id": 17,
            "text": "Mr. Trump suggested that the head count could be delayed until he found a way to add the citizenship question, perhaps by printing an addendum that could be tacked onto the questionnaire."
        },
        {
            "id": 18,
            "text": "That prompted a cascade of troubles."
        },
        {
            "id": 19,
            "text": "On Wednesday, Justice Department lawyers returned to a Maryland court that was hearing a case against the question to recant their admission of defeat."
        },
        {
            "id": 20,
            "text": "“The tweet this morning was the first I had heard of the president’s position on this issue, just like the plaintiffs and Your Honor,” Joshua Gardner, a lawyer working on the census issue, told Judge George J. Hazel of United States District Court."
        },
        {
            "id": 21,
            "text": "Mr. Gardner and other department officials told Judge Hazel and a second judge in Manhattan overseeing another census lawsuit that the search for a way to place the question on the census would continue."
        },
        {
            "id": 22,
            "text": "But lawyers for opponents of the question pounced on that declaration on Friday, arguing that the Justice Department had insisted repeatedly — including to the Supreme Court — that it was essential to wrap up the dispute by the end of June, lest the census be delayed for lack of time to print questionnaires and other forms."
        },
        {
            "id": 23,
            "text": "The Supreme Court relied on that deadline, the plaintiffs noted, in leapfrogging the legal appeals process to take the case directly from a lower federal court to a hearing before the justices."
        },
        {
            "id": 24,
            "text": "But having lost the legal battle, they argued, the Justice Department says there is ample time to hunt for some other way to achieve its goal."
        },
        {
            "id": 25,
            "text": "The government’s “‘heads I win, tails we’ll see’ approach undermines confidence in both their ability to conduct the 2020 census and public confidence in the rule of law,” the plaintiffs argued."
        },
        {
            "id": 26,
            "text": "“If any ordinary litigant engaged in such conduct, sanctions would be the minimum relief provided."
        },
        {
            "id": 27,
            "text": "And defendants are no ordinary litigants.”"
        },
        {
            "id": 28,
            "text": "The Justice Department has been under fire from the moment Mr. Trump took office."
        },
        {
            "id": 29,
            "text": "In district and appellate court, the department has defended the Trump administration against litigation spurred by the president’s travel ban, his immigration policies and his stance on the Affordable Care Act."
        },
        {
            "id": 30,
            "text": "Much of that work has fallen to lawyers in the federal programs branch."
        },
        {
            "id": 31,
            "text": "Known for being particularly apolitical, lawyers in that division pride themselves on their ability to argue vociferously for any policy that the White House supports, no matter who is in office."
        },
        {
            "id": 32,
            "text": "But career lawyers have pushed back against pressure from the Trump White House for nearly two years, particularly when asked to reverse legal positions that they had already argued in court."
        },
        {
            "id": 33,
            "text": "They have refused to sign a wide array of legal briefs, and some have even resigned."
        },
        {
            "id": 34,
            "text": "The defiance culminated in a showdown last summer after the department, under Attorney General Jeff Sessions, declined to defend parts of the Affordable Care Act."
        },
        {
            "id": 35,
            "text": "A longtime career lawyer, Joel McElvain, resigned over that decision, and the department scrambled to find another career lawyer willing to sign the brief that outlined the decision to reverse course."
        },
        {
            "id": 36,
            "text": "After that incident, lawyers in federal programs held a standing-room-only meeting to address rancor over the health care reversal."
        },
        {
            "id": 37,
            "text": "Attendees told The New York Times that lawyers asked whether political considerations had edged out a sound legal opinion, and whether they were considered the president’s enemies."
        },
        {
            "id": 38,
            "text": "Rank-and-file employees had hoped that Mr. Barr, a veteran of the department, would act as a buffer against White House demands that they feel are not legally defensible."
        },
        {
            "id": 39,
            "text": "Nearly a half-dozen current and former employees say morale has not risen considerably under Mr. Barr, citing the fact that he allowed the Justice Department to stop defending all of the health care law at the behest of Mr. Trump."
        },
        {
            "id": 40,
            "text": "And now he has replaced the entire team working on the census question."
        }
    ]
}