{
    "title": "Obama calls for end to nuclear weapons, but U.S. disarmament is slowest since 1980",
    "text": [
        {
            "id": 0,
            "text": "Speaking from Hiroshima, the site of the first war-time atomic weapon detonation, President Obama on Friday called for the pursuit of \"a world without nuclear weapons.\""
        },
        {
            "id": 1,
            "text": "Every year, the Department of Defense declassifies data on the size of the country's nuclear stockpile and the number of warheads dismantled."
        },
        {
            "id": 2,
            "text": "Its most recent data, released this week, shows that the U.S. stockpile numbered 4,571 at the end of 2015, about 15 percent of its size at its peak during the Cold War in 1967."
        },
        {
            "id": 3,
            "text": "The number of weapons dismantled was 109, the lowest figure since at least 1980."
        },
        {
            "id": 4,
            "text": "In 1945, the size of the stockpile matched the number of weapons deployed -- two."
        },
        {
            "id": 5,
            "text": "The biggest reductions came in the early 1990s during the administration of George H.W. Bush and, a decade later, during his son's."
        },
        {
            "id": 6,
            "text": "At the end of 2008, the stockpile numbered 5,273; over the course of Obama's two terms, it has dropped to 4,571."
        },
        {
            "id": 7,
            "text": "It is, of course, easier to reduce the size of a stockpile when it is much larger."
        },
        {
            "id": 8,
            "text": "As a fraction of the total weapon count, Obama has sliced the total by a bit more than one-tenth -- 13 percent."
        },
        {
            "id": 9,
            "text": "But the Federation of American Scientists is still critical of Obama's progress in this regard."
        },
        {
            "id": 10,
            "text": "That 13 percent is \"the smallest reduction of the stockpile achieved by any previous post-Cold War administration;\" the 109 dismantlings last year continues \"a trendline of fewer and fewer warheads dismantled\" under Obama."
        },
        {
            "id": 11,
            "text": "The FAS notes that there are reasons outside of the administration's control for the lower number last year -- but also that political pressure discourages a push for reduction."
        },
        {
            "id": 12,
            "text": "Why does the size of our stockpile matter?"
        },
        {
            "id": 13,
            "text": "As data from the Stockholm International Peace Research Institute shows, the United States still controls about half of the weapons controlled by recognized nuclear states."
        },
        {
            "id": 14,
            "text": "Eliminating nuclear weapons, in other words, begins at home."
        }
    ]
}