{
    "title": "House approves VA reform bill",
    "text": [
        {
            "id": 0,
            "text": "Sen. Bernie Sanders and Rep. Jeff Miller unveiled the comprise bill earlier this week."
        },
        {
            "id": 1,
            "text": "House approves VA reform bill\n\nThe House on Wednesday approved legislation 420-5 to drastically reform the Department of Veterans Affairs."
        },
        {
            "id": 2,
            "text": "In a strong bipartisan vote, lawmakers backed the $17 billion compromise bill crafted by Sen. Bernie Sanders (I-Vt.) and Rep. Jeff Miller (R-Fla.)."
        },
        {
            "id": 3,
            "text": "The Senate is expected to sign off on the legislation later this week."
        },
        {
            "id": 4,
            "text": "The bill gives the VA secretary new authority to fire senior employees accused of mismanagement and gives veterans the ability to leave the VA to seek medical care if they have waited longer than 14 days for treatment."
        },
        {
            "id": 5,
            "text": "( Also on POLITICO: Will better technology save the VA?)"
        },
        {
            "id": 6,
            "text": "The agency has been widely criticized in the wake of reports that it manipulated data on its wait times, hiding delays that in some cases contributed to the deaths of veterans."
        },
        {
            "id": 7,
            "text": "There has been overwhelming support in Congress to overhaul the agency after the White House found a “corrosive culture” of corruption within the department - a report that prompted former VA Secretary Eric Shinseki to resign."
        },
        {
            "id": 8,
            "text": "Shinseki was replaced by Robert McDonald, a former executive with Proctor & Gamble who was confirmed by the Senate on Tuesday."
        },
        {
            "id": 9,
            "text": "Sanders and Miller unveiled the compromise bill earlier this week after spending more than a month debating the cost of reforms and how to pay for them."
        },
        {
            "id": 10,
            "text": "“The Department of Veterans Affairs is in the midst of an unprecedented crisis caused by corruption, mismanagement and a lack of accountability across the board,” Miller said."
        },
        {
            "id": 11,
            "text": "“This is an honest solution to an urgent problem."
        },
        {
            "id": 12,
            "text": "One that is focused on making government more accountable and providing veterans with real choice in their health care decisions.”"
        },
        {
            "id": 13,
            "text": "A Senate vote could come as early as Thursday, Sanders said."
        },
        {
            "id": 14,
            "text": "“My expectation is that the Senate will do the same thing as soon as tomorrow."
        },
        {
            "id": 15,
            "text": "The veterans of this country are entitled to quality and timely health care."
        },
        {
            "id": 16,
            "text": "This legislation will take us a long way toward making good on that promise,” he said."
        }
    ]
}