{
    "title": "Wayne LaPierre Delivers Fiery Speech At CPAC",
    "text": [
        {
            "id": 0,
            "text": "NATIONAL HARBOR, Md. -- National Rifle Association CEO Wayne LaPierre attempted to turn the tables Friday on those in the media and government who have recently characterized the gun lobbyist's talking points as \"crazy.\""
        },
        {
            "id": 1,
            "text": "In a speech at the Conservative Political Action Conference, LaPierre accused the federal government, the Department of Homeland Security, so-called \"Washington elites\" and Vice President Joe Biden of offering illogical solutions to the challenges of gun violence."
        },
        {
            "id": 2,
            "text": "Entering the stage to a standing ovation and showing a video montage of his opponents' attacks, LaPierre delivered a fiery rebuttal that garnered a half-dozen standing ovations from the staunchly conservative, and generally young, crowd at CPAC."
        },
        {
            "id": 3,
            "text": "Gun control advocates \"insult [us], they denigrate, and they call us 'crazy' for holding fast to [our opposition to gun control]."
        },
        {
            "id": 4,
            "text": "In their distorted view of the world, they're smarter than we are; they're special; they're more worthy than we are; they know better than we do,\" he said."
        },
        {
            "id": 5,
            "text": "\"The liberal media can keep hating on me, but I'm still standing.\""
        },
        {
            "id": 6,
            "text": "Much of LaPierre's speech covered familiar territory in the ongoing debate over gun violence, such as the argument that universal background checks on gun purchases will not work because criminals will evade them."
        },
        {
            "id": 7,
            "text": "But LaPierre also launched attacks working off more recent news, such as Chinese Internet hackers and the across-the-board budget cuts known as sequestration."
        },
        {
            "id": 8,
            "text": "\"What's the point of registering lawful gun owners?\""
        },
        {
            "id": 9,
            "text": "LaPierre asked the crowd, jumping to the false conclusion that universal background checks will be used to create a federal registry of gun owners. \""
        },
        {
            "id": 10,
            "text": "So newspapers can print those names … so the list can be hacked by foreign entities like the Chinese?\""
        },
        {
            "id": 11,
            "text": "He also seized on the effects of sequestration. \""
        },
        {
            "id": 12,
            "text": "Instead of rational belt-tightening ..."
        },
        {
            "id": 13,
            "text": "the first thing the government does is let criminal illegals out of jail,\" said LaPierre, referring to the February release of undocumented immigrants facing deportation by the Department of Homeland Security."
        },
        {
            "id": 14,
            "text": "\"It's as if insanity itself has been sequestered in Washington.\""
        },
        {
            "id": 15,
            "text": "In addition to DHS Secretary Janet Napolitano, LaPierre directly addressed Vice President Biden, and in particular, Biden's recent suggestion that a shotgun would make a more effective weapon for personal defense than a military-style rifle like the one used in the Newtown, Conn., massacre."
        },
        {
            "id": 16,
            "text": "Democrats support an assault weapons ban that would cover the latter guns."
        },
        {
            "id": 17,
            "text": "\"Have they lost their minds over at the White House?\""
        },
        {
            "id": 18,
            "text": "LaPierre asked mockingly."
        },
        {
            "id": 19,
            "text": "\"You keep your advice, we'll keep our guns.\""
        }
    ]
}