{
    "title": "From 'broken child' to mass killer",
    "text": [
        {
            "id": 0,
            "text": "This image made available by the Broward County Sheriff's Office on Sunday, Feb. 18, 2018, shows Sheriff Scott Israel, holding the hand of Anthony Borges, 15, a student at Marjory Stoneman Douglas High School."
        },
        {
            "id": 1,
            "text": "The teenager was shot five times during the massacre on Valentine's Day that killed 17 students."
        },
        {
            "id": 2,
            "text": "Borges is being credited with saving the lives of at least 20 other students."
        },
        {
            "id": 3,
            "text": "(Broward County Sheriff's Office via AP)\n\nTOPSHOT - Marjory Stoneman Douglas High School staff, teachers and students return to school greeted by police and well wishers in Parkland, Florida on February 28, 2018."
        },
        {
            "id": 4,
            "text": "Students grieving for slain classmates prepared for an emotional return Wednesday to their Florida high school, where a mass shooting shocked the nation and led teen survivors to spur a growing movement to tighten America's gun laws."
        },
        {
            "id": 5,
            "text": "The community of Parkland, Florida, where residents were plunged into tragedy two weeks ago, steeled itself for the resumption of classes at Marjory Stoneman Douglas High School, where nearby flower-draped memorials and 17 white crosses pay tribute to the 14 students and three staff members who were murdered by a former student."
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": " —\n\nLong before he slaughtered 17 people at the South Florida high school he once attended, Nikolas Cruz had a disturbing way of introducing himself."
        },
        {
            "id": 9,
            "text": "“Hi, I’m Nick,” he used to say, according to an acquaintance interviewed by CNN."
        },
        {
            "id": 10,
            "text": "“I’m a school shooter.”"
        },
        {
            "id": 11,
            "text": "Cruz posed with guns and knives in photos posted on Instagram and made a chilling online comment about a mass shooting carried out in New York this summer."
        },
        {
            "id": 12,
            "text": "“Man I can do so much better,” he wrote."
        },
        {
            "id": 13,
            "text": "His hints of future violence are part of an emerging portrait of the 19-year-old Broward County man who carried out the nation’s most recent mass killing on Valentine’s Day with an AR-15-style rifle he legally purchased last year."
        },
        {
            "id": 14,
            "text": "Also part of that portrait are what Cruz’s attorneys referred to as a chronic battle with mental illness and depression exacerbated by the recent death of his adoptive mother, which left him without parents."
        },
        {
            "id": 15,
            "text": "A defense attorney referred to him on Thursday as “a broken child.”"
        },
        {
            "id": 16,
            "text": "CNN pieced together this profile of Cruz based on interviews with people who knew him, court documents, and an analysis of Cruz’s online writings and videos."
        },
        {
            "id": 17,
            "text": "Cruz was adopted at a young age by Roger and Lynda Cruz."
        },
        {
            "id": 18,
            "text": "Roger died years ago."
        },
        {
            "id": 19,
            "text": "Lynda died last fall, following an illness."
        },
        {
            "id": 20,
            "text": "He was taken in by the parents of a schoolmate, according to that family’s attorney."
        },
        {
            "id": 21,
            "text": "Broward County Sheriff's Office Police say Nikolas Cruz has confessed to the shootings."
        },
        {
            "id": 22,
            "text": "His mother’s death capped troubled high school years that ended with his expulsion from Marjory Stoneman Douglas High School."
        },
        {
            "id": 23,
            "text": "A former classmate, who grew up with Cruz and attended school with him since the sixth grade, said Cruz would sometimes introduce himself as a “school shooter.”"
        },
        {
            "id": 24,
            "text": "“He was very, very strange,” the student, who asked not to be named, told CNN."
        },
        {
            "id": 25,
            "text": "“Like if there was someone to shoot up a school, it would be him.”"
        },
        {
            "id": 26,
            "text": "Another schoolmate, Brody Speno, also recalled peculiar behavior."
        },
        {
            "id": 27,
            "text": "“Something wasn’t right about him,” Speno recalled."
        },
        {
            "id": 28,
            "text": "“He was off.”"
        },
        {
            "id": 29,
            "text": "Speno said he knew Cruz from elementary school until his family moved away a couple of years ago."
        },
        {
            "id": 30,
            "text": "He described him as “an evil kid” who was “always getting in trouble.”"
        },
        {
            "id": 31,
            "text": "He recalled Cruz stealing peoples’ mail, throwing rocks at cars and tormenting animals."
        },
        {
            "id": 32,
            "text": "He described one incident in which he said Cruz “cornered a squirrel and was trying to throw rocks at it and kill it.”"
        },
        {
            "id": 33,
            "text": "He said police were called to the house “almost every other week.”"
        },
        {
            "id": 34,
            "text": "Documents obtained by CNN show that law enforcement officers responded to Cruz’s house on 39 occasions over a seven-year period."
        },
        {
            "id": 35,
            "text": "No police reports were immediately available for those calls so it was not possible to determine whether Cruz was involved."
        },
        {
            "id": 36,
            "text": "Another neighbor, concerned about Cruz “acting weird” in the backyard took video of him dressed in boxer shorts shooting what appeared to be a BB gun."
        },
        {
            "id": 37,
            "text": "The man, who asked not to be identified, said his wife watched Cruz shooting bottles, cans and buckets over and over again for two days in October 2017."
        },
        {
            "id": 38,
            "text": "He sometimes pointed the gun toward their window, the man said."
        },
        {
            "id": 39,
            "text": "“She got scared."
        },
        {
            "id": 40,
            "text": "I got scared,” he said."
        },
        {
            "id": 41,
            "text": "Some of Cruz’s most alarming behavior was exhibited online."
        },
        {
            "id": 42,
            "text": "He had two Instagram accounts featuring weapons and photos."
        },
        {
            "id": 43,
            "text": "In one picture he is wearing a kerchief over his face and a Make America Great Again hat."
        },
        {
            "id": 44,
            "text": ""
        },
        {
            "id": 45,
            "text": "Another photo is taken from behind a gun sight looking out the window."
        },
        {
            "id": 46,
            "text": "There are online posts in which he writes:\n\n“I wanna shoot people with my AR-15” and “Im going to be a professional school shooter”"
        },
        {
            "id": 47,
            "text": "The latter post, made with Cruz’s name attached to it, was reported to the FBI."
        },
        {
            "id": 48,
            "text": "But FBI officials said they were unable to determine who was responsible."
        },
        {
            "id": 49,
            "text": "This summer a Nikolas Cruz made an online comment in response to a story about a disgruntled doctor in New York who used an AR-15 to shoot seven people, killing one and wounding six others."
        },
        {
            "id": 50,
            "text": "“Man, I can do so much better,” he wrote."
        },
        {
            "id": 51,
            "text": "The comment was linked to one of Cruz’s YouTube accounts, which have since been removed in the wake of Wednesday’s shooting."
        },
        {
            "id": 52,
            "text": "Not everyone who crossed paths with Cruz saw reason for concern."
        },
        {
            "id": 53,
            "text": "The attorney for the family who took him in after his mother’s death said they were aware of trouble he’d earlier had at school and saw signs of depression."
        },
        {
            "id": 54,
            "text": "But, “they didn’t see any danger,” Jim Lewis said of the unidentified family."
        },
        {
            "id": 55,
            "text": "“They are horrified just like everybody else.”"
        },
        {
            "id": 56,
            "text": "Lewis described Cruz as “a smaller kid” and said there was an indication “there may have been some bullying going on.”"
        },
        {
            "id": 57,
            "text": "Hunter Vukelich, a former manager at a Dollar Tree store where Cruz worked while he pursued a GED, said he saw nothing alarming about the young man who would ride his bike back and forth to the job."
        },
        {
            "id": 58,
            "text": "“You could tell he was a little off,” Vukelich said, but not dangerous."
        },
        {
            "id": 59,
            "text": "“He was always very nice, shy, head usually down,” he recalled."
        },
        {
            "id": 60,
            "text": "According to authorities, Cruz was initially able to leave the crime scene at the school by blending in with students fleeing campus in the wake of the massacre."
        },
        {
            "id": 61,
            "text": "He went to a Walmart and a McDonald’s before being found by police and taken into custody."
        },
        {
            "id": 62,
            "text": "He has since confessed to the killings, according to court documents."
        },
        {
            "id": 63,
            "text": "Gordon Weekes, one of Cruz’s public defenders, said he believed Cruz has been placed on suicide watch."
        },
        {
            "id": 64,
            "text": "He said the defense team would be exploring mental health issues and “the possibility of autism.”"
        },
        {
            "id": 65,
            "text": "“We are trying to save this young man’s life,” he said."
        }
    ]
}