{
    "title": "Scott Brown, Cory Gardner Shift Stance On Climate Change In First Senate Debates",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- Republican Senate candidates Scott Brown and Cory Gardner on Monday embraced the notion that climate change is caused in part by human activity, despite previously expressing skepticism that man-made climate change is real."
        },
        {
            "id": 1,
            "text": "Brown, a former Massachusetts senator, is seeking to unseat Sen. Jeanne Shaheen in New Hampshire, while Gardner, a congressman from Colorado, is looking to defeat Sen. Mark Udall in that state."
        },
        {
            "id": 2,
            "text": "Both Senate races, regarded as unexpectedly competitive for Democrats, had debates on Monday -- the first for New Hampshire candidates, the second for Colorado."
        },
        {
            "id": 3,
            "text": "In both, candidates were asked if they believed that humans were causing climate change."
        },
        {
            "id": 4,
            "text": "Gardner briefly weighed in on the human contributions to climate change, then used his response to criticize the so-called Waxman-Markey cap-and-trade bill passed by House Democrats in 2010:"
        },
        {
            "id": 5,
            "text": "There is no doubt that pollution contributes to the climate changing around us, but what I refuse to do is support a climate tax bill like Waxman/Markey put in place, that would have cost farmers and ranchers in the state, that would cost small business the opportunity to grow, that would increase that bills that families pay, $1,700 a year."
        },
        {
            "id": 6,
            "text": "We hear people talk about putting a price on carbon, but they won't talk about how much that price of carbon is."
        },
        {
            "id": 7,
            "text": "Let's just have an answer: What is the price?"
        },
        {
            "id": 8,
            "text": "Is it $5 a month, is $10 a month, is it $20 a month?"
        },
        {
            "id": 9,
            "text": "Senator Udall, am I not going high enough?"
        },
        {
            "id": 10,
            "text": "Democrats were quick to point out that in January of this year, Gardner voted against an amendment that would have explicitly stated that climate change is real."
        },
        {
            "id": 11,
            "text": "The measure, which failed to clear the House Energy and Commerce Committee, stated that \"Congress accepts the scientific finding of the Environmental Protection Agency (contained in the proposed rule referred to in section 4(2))"
        },
        {
            "id": 12,
            "text": "that '[g]reenhouse gas (GHG) pollution threatens the American public’s health and welfare by contributing to long-lasting changes in our climate that can have a range of negative effects on human health and the environment.\""
        },
        {
            "id": 13,
            "text": "Gardner also rejected the theory of man-made climate change as a Colorado state representative in 2010."
        },
        {
            "id": 14,
            "text": "\"I think the climate is changing, but I don't believe humans are causing that change to the extent that's been in the news,\" he said at the time."
        },
        {
            "id": 15,
            "text": "In the New Hampshire debate, Brown said he believes climate change is \"a combination of manmade and natural.\""
        },
        {
            "id": 16,
            "text": "\"That's what I've said, and I continue to believe that,\" he said, before listing ways he has appreciated the environment and encouraging the United States to reduce its dependence on foreign oil:"
        },
        {
            "id": 17,
            "text": "The question is how do we deal with not only respecting our environment -- as someone who's hiked Mount Washington with [New Hampshire state Sen.] Jeb Bradley and appreciated the environment as a triathlete, swimming, biking, camping."
        },
        {
            "id": 18,
            "text": "We want to respect that environment but we also want to find a way to balance the ability to live within the environment and use its natural resources to become energy independent and to step back from our dependence on foreign oil."
        },
        {
            "id": 19,
            "text": "I think that's very critical and you can find that balance and there are opportunities to do just that."
        },
        {
            "id": 20,
            "text": "Brown's comments marked a departure from a GOP primary debate in late August, when he was asked if he believed that the theory of man-made climate change had been scientifically proven."
        },
        {
            "id": 21,
            "text": "At that debate, Brown responded, \"Uh, no.\""
        },
        {
            "id": 22,
            "text": "That answer, too, was dubbed a flip-flop from Brown's position in the 2012 Massachusetts Senate race, when he lost his seat to Sen. Elizabeth Warren (D)."
        },
        {
            "id": 23,
            "text": "During that race, Brown said he \"absolutely\" believed that climate change was real and deemed its causes to be \"a combination of man-made and natural.\""
        },
        {
            "id": 24,
            "text": "Brown's campaign has insisted that his stance on the issue is what he stated both on Monday and in 2012 -- that climate change is real and caused by factors that are both man-made and natural."
        },
        {
            "id": 25,
            "text": "But Democrats in New Hampshire accused Brown on Monday of trying to have it both ways by refusing to endorse climate change during the primary, when he took on a more conservative tone, only to revert back to his more centrist position now that the general election is underway."
        },
        {
            "id": 26,
            "text": "Despite the reversal by both Gardner and Brown, environmental groups remain unconvinced."
        },
        {
            "id": 27,
            "text": "NextGen Climate, the progressive group founded by billionaire investor Tom Steyer, recently launched a truck tour targeting Brown's environmental record, citing his support for the Koch brothers and \"Big Oil tycoons."
        },
        {
            "id": 28,
            "text": "\" The group has also gone after Gardner through attack ads on television and billboards in Colorado."
        },
        {
            "id": 29,
            "text": "NextGen Climate spokesman Bobby Whithorne said Brown and Gardner only seemed willing to move to the middle when it was politically convenient."
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": "\"First he denied the basic science behind climate change, now he’s changing his tune,\" Whithorne said in an email to HuffPost. \""
        },
        {
            "id": 32,
            "text": "Scott Brown can’t make up his mind about what he believes."
        },
        {
            "id": 33,
            "text": "One thing is clear, he’ll say anything that’s politically convenient to try to get himself elected.\""
        },
        {
            "id": 34,
            "text": "Gardner, according to Whithorne, \"couldn't even answer the question without attempting to deny and deceive.\""
        },
        {
            "id": 35,
            "text": "\"First he ducked it entirely, then deceived Coloradans with an incomplete answer to deliberately mislead voters on his record,\" Whithorne said."
        },
        {
            "id": 36,
            "text": "\"Maybe he thinks all of the pollution is caused by cow farts?"
        },
        {
            "id": 37,
            "text": "The facts are clear; Gardner has taken votes to deny the reality of climate change and to let power plants dump unlimited carbon pollution into the air.\""
        },
        {
            "id": 38,
            "text": "Advertisement\n\nHuffPost's Pollster average, which combines all publicly available polling, shows Gardner and Udall tied."
        },
        {
            "id": 39,
            "text": "The model shows Brown closing the gap with Shaheen, who remains ahead by about 4 percentage points, but was up by more than 6 points just last month."
        },
        {
            "id": 40,
            "text": "Samantha Lachman contributed reporting."
        },
        {
            "id": 41,
            "text": "CORRECTION:"
        },
        {
            "id": 42,
            "text": "This article has been edited to note that Monday's Senate debate in Colorado was the second, not the first."
        }
    ]
}