{
    "title": "Trey Gowdy: Hillary Clinton wiped her server clean  ",
    "text": [
        {
            "id": 0,
            "text": "Hillary Clinton wiped “clean” the private server housing emails from her tenure as secretary of state, the chairman of the House committee investigating the 2012 terrorist attacks in Benghazi said Friday."
        },
        {
            "id": 1,
            "text": "“While it is not clear precisely when Secretary Clinton decided to permanently delete all emails from her server, it appears she made the decision after October 28, 2014, when the Department of State for the first time asked the Secretary to return her public record to the Department,” Rep. Trey Gowdy (R-S.C.), chairman of the Select Committee on Benghazi, said in a statement."
        },
        {
            "id": 2,
            "text": "Clinton was under a subpoena order from the panel for all documents related to the 2012 attacks on the American compound there."
        },
        {
            "id": 3,
            "text": "But David Kendall, an attorney for Clinton, said the 900 pages of emails previously provided to the panel cover its request."
        },
        {
            "id": 4,
            "text": "Kendall also informed the committee that Clinton’s emails from her time at the State Department have been permanently erased."
        },
        {
            "id": 5,
            "text": "Gowdy said that Clinton’s response to the subpoena means he and Speaker John Boehner (R-Ohio) will now contemplate new legal actions against Clinton."
        },
        {
            "id": 6,
            "text": "“After seeking and receiving a two week extension from the Committee, Secretary Clinton failed to provide a single new document to the subpoena issued by the Committee and refused to provide her private server to the Inspector General for the State Department or any other independent arbiter for analysis,” Gowdy said."
        },
        {
            "id": 7,
            "text": "Clinton previously said she decided to delete the emails after her lawyers reviewed the server for work-related correspondence."
        },
        {
            "id": 8,
            "text": "She said the deletion of private emails occurred “at the end” of that review."
        },
        {
            "id": 9,
            "text": "In a letter provided to the committee, Kendall said Clinton would not be turning over the server to a third-party for review and that the emails no longer exist on the private server located in her New York home."
        },
        {
            "id": 10,
            "text": "“There is no basis to support the proposed third-party review of the server that hosted the [email protected] account,” Kendall wrote."
        },
        {
            "id": 11,
            "text": "“To avoid prolonging a discussion that would be academic, I have confirmed with the secretary’s IT support that no emails…..for the time period January 21, 2009 through February 1, 2013 reside on the server or on any back-up systems associated with the server.”"
        },
        {
            "id": 12,
            "text": "The broad subpoena from Gowdy included any emails relating to Libya, weapons located in the country, the Benghazi attacks and administration statements following the attacks on the compound."
        },
        {
            "id": 13,
            "text": "Shortly after the New York Times reported on Clinton’s private email use, she requested that the State Department make public all documents from her time at the agency."
        },
        {
            "id": 14,
            "text": "The State Department has said it’s working though these documents – which include 55,000 pages – for review."
        },
        {
            "id": 15,
            "text": "The agency has also said it will focus on vetting the 300 pages the Benghazi Committee has already received."
        },
        {
            "id": 16,
            "text": "Kendall said the State Department is “uniquely positioned” to respond to requests for additional documents, a sign from Clinton’s camp that they believe she has fully responded to any standing legal requests."
        },
        {
            "id": 17,
            "text": "Kendall added, “Thus, there are no [email protected] e-mails from Secretary Clinton’s tenure as Secretary of State on the server for any review, even if such review were appropriate or legally authorized.”"
        },
        {
            "id": 18,
            "text": "The letter added that requests from a second email, [email protected], are not germane as that address was “not an address that existed during Secretary Clinton’s tenure.”"
        },
        {
            "id": 19,
            "text": "Rep. Elijah Cummings, the top Democrat on the Benghazi panel, said Clinton’s response “confirms” that the former secretary of state has provided all documents related to the Benghazi attacks to the committee."
        },
        {
            "id": 20,
            "text": "“This confirms what we all knew—that Secretary Clinton already produced her official records to the State Department, that she did not keep her personal emails, and that the Select Committee has already obtained her emails relating to the attacks in Benghazi,” said Cummings (D-Md.)."
        },
        {
            "id": 21,
            "text": "“It is time for the Committee to stop this political charade and instead make these documents public and schedule Secretary Clinton’s public testimony now.”"
        },
        {
            "id": 22,
            "text": "The move all but ensures congressional Republicans’ focus on Clinton will intensify."
        },
        {
            "id": 23,
            "text": "The Benghazi panel has already said it will bring Clinton in to testify at least twice — once privately about her email use while at State and at another public hearing on the Obama administration’s reaction to Benghazi."
        },
        {
            "id": 24,
            "text": "The House Oversight and Government Reform Committee has also signaled plans to investigate Clinton’s use of private email."
        },
        {
            "id": 25,
            "text": "Gowdy’s subpoenas came after it was reported that Clinton stored her emails on a private server and used a personal email address while at the State Department."
        },
        {
            "id": 26,
            "text": "Clinton has already made more than 900 pages of emails available to the committee but the panel has requested the entire swath of documents – a request Gowdy has repeatedly said is necessary to conduct a thorough investigation into the 2012 terrorist attacks."
        },
        {
            "id": 27,
            "text": ""
        }
    ]
}