{
    "title": "BREAKING: Schiff's Impeachment Witness Has Been Fired and Escorted Out of the White House",
    "text": [
        {
            "id": 0,
            "text": "Lt. Col. Alexander Vindman has been fired from the National Security Council and escorted out of the White House."
        },
        {
            "id": 1,
            "text": "“Today, Lieutenant Colonel Alexander Vindman was escorted out of the White House where he has dutifully served his country and his President."
        },
        {
            "id": 2,
            "text": "He does so having spoken publicly once, and only pursuant to a subpoena from the United States Congress,\" Vindman's attorney released in a statement."
        },
        {
            "id": 3,
            "text": "Vindman's ousting comes as part of a restructuring of the NSC, which has been in the works for months."
        },
        {
            "id": 4,
            "text": "Last year Vindman testified on behalf of Democrats during the impeachment inquiry in the House."
        },
        {
            "id": 5,
            "text": "He complained that President Trump did not use his prepared talking points for his now famous July 25th phone call with Ukrainian President Volodymyr Zelensky."
        },
        {
            "id": 6,
            "text": "Further, under questioning from Republican Congressman Devin Nunes, Vindman appeared to admit he leaked information and violated the chain of command."
        },
        {
            "id": 7,
            "text": "He refused to answer questions about contact with the intelligence community and the whistleblower who prompted an impeachment inquiry against President Trump."
        },
        {
            "id": 8,
            "text": "Rumbling of Vindman's firing started Thursday night and into Friday morning when President Trump retweeted the following:\n\nI’d fire him."
        },
        {
            "id": 9,
            "text": "I listened to his testimony in the SCIF."
        },
        {
            "id": 10,
            "text": "He’s a leaker, not a whistleblower."
        },
        {
            "id": 11,
            "text": "Vindman was upset that @realDonaldTrump didn’t follow the script Vindman prepared for the phone call."
        },
        {
            "id": 12,
            "text": "Current Commander in Chief doesn’t take orders from a Lt. Col."
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}