{
    "title": "DACA Renewal Applications Resume After Judge's Ruling",
    "text": [
        {
            "id": 0,
            "text": "Yesterday, the Department of Homeland Security announced that it would resume the application renewal process for illegal aliens seeking protection from deportation after being brought into the United States as children."
        },
        {
            "id": 1,
            "text": "These “Dreamers”, as they are known in some circles, had previously been shielded from deportation under President Barack Obama’s executive order known as the Deferred Action for Childhood Arrivals program (DACA)."
        },
        {
            "id": 2,
            "text": "On Tuesday January 9th, U.S. District Judge William Allsup ruled that President Donald J. Trump did not have the legal authority to rescind some parts of the program."
        },
        {
            "id": 3,
            "text": "In September 2017, Trump pledged to end DACA altogether unless Democrats and Republicans in Congress could craft a bill addressing serious legal and immigration issues that he could sign."
        },
        {
            "id": 4,
            "text": "Allsup ruled that the DHS must accept applications from individuals seeking to renew their \"Dreamer\" status, but did not have to accept new applications from individuals applying for the first time."
        },
        {
            "id": 5,
            "text": "\"These individuals had submitted substantial personal identifying information to the government, paid hefty fees and planned their lives according to the dictates of DACA,\" the Judge wrote."
        },
        {
            "id": 6,
            "text": "\"The administrative record includes no consideration to the disruption a rescission would have on the lives of DACA recipients, let alone their families, employers and employees, schools and communities.\""
        },
        {
            "id": 7,
            "text": "He added that the government's arguments were \"arbitrary, capricious and an abuse of discretion.\""
        },
        {
            "id": 8,
            "text": "After hearing Allsup’s decision, the White House strongly condemned what some may say is judicial overreach. \""
        },
        {
            "id": 9,
            "text": "An issue of this magnitude must go through the normal legislative process,\" White House Press Secretary Sarah Huckabee Sanders said."
        },
        {
            "id": 10,
            "text": "\"President Trump is committed to the rule of law, and will work with members of both parties to reach a permanent solution that corrects the unconstitutional actions taken by the last administration.\""
        },
        {
            "id": 11,
            "text": "And President Trump tweeted on Wednesday, \"It just shows everyone how broken and unfair our Court System is when the opposing side in a case (such as DACA) always runs to the 9th Circuit and almost always wins before being reversed by higher courts.”"
        },
        {
            "id": 12,
            "text": "On Sunday morning, President Trump once again took to Twitter to slam America’s immigration policy."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "\"DACA is probably dead because the Democrats don’t really want it, they just want to talk and take desperately needed money away from our Military,” he proclaimed."
        },
        {
            "id": 15,
            "text": "Moments the president later called for a merit based immigration system."
        },
        {
            "id": 16,
            "text": "“I, as President, want people coming into our Country who are going to help us become strong and great again, people coming in through a system based on MERIT."
        },
        {
            "id": 17,
            "text": "No more Lotteries!"
        },
        {
            "id": 18,
            "text": "#AMERICA FIRST,” he added."
        },
        {
            "id": 19,
            "text": "So far, Republicans and Democrats have not been able to compromise on an immigration reform bill that would also address the problem of illegal aliens and \"Dreamers\" currently in the United States."
        }
    ]
}