{
    "title": "Obama Confronts Hecklers At Immigration Speech",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- Hecklers interrupted President Barack Obama during a speech on Monday to demand he halt deportations, which have risen to record levels during his time in the White House."
        },
        {
            "id": 1,
            "text": "\"Our families are separated,\" a young man yelled during remarks in San Francisco at the Betty Ann Ong Chinese Recreation Center. \""
        },
        {
            "id": 2,
            "text": "Mr. President, please use your executive authority to halt [deportations]."
        },
        {
            "id": 3,
            "text": "We agree that we need to pass comprehensive immigration reform, but at the same time, you have the power to stop deportations.\""
        },
        {
            "id": 4,
            "text": "\"Actually, I don't,\" the president replied, \"and that's why we're here.\""
        },
        {
            "id": 5,
            "text": "Other people in the crowd began to yell as well: \"Stop deportations."
        },
        {
            "id": 6,
            "text": "Yes, we can.\""
        },
        {
            "id": 7,
            "text": "As Obama delivered a speech calling on House Republicans to press forward with immigration reform, the interruption served as a reminder that many advocates are frustrated and ready for the president to take immediate action."
        },
        {
            "id": 8,
            "text": "Most have been calling for Obama to slow or halt deportations for months or years, but as progress on legislative reform has slowed, they say there's no more time to wait."
        },
        {
            "id": 9,
            "text": "This year 1,100 people will be forced out of the country each day if removals continue at the same rate as the previous year."
        },
        {
            "id": 10,
            "text": "Obama has said that he can't simply halt deportations by executive action, although he did so more narrowly for undocumented young people who entered the U.S. as children."
        },
        {
            "id": 11,
            "text": "He asked for the hecklers to remain in their seats, and said again that such an action would be illegal."
        },
        {
            "id": 12,
            "text": "\"What you need to know, when I'm speaking as president of the United States and I come to this community, is that if in fact I could solve all of these problems without passing laws in Congress, then I would do so,\" he said."
        },
        {
            "id": 13,
            "text": "\"But we're also a nation of laws."
        },
        {
            "id": 14,
            "text": "That's part of our tradition.\""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "\"So the easy way out is to try to yell and pretend like I can do something by violating our laws,\" he continued."
        },
        {
            "id": 17,
            "text": "\"What I'm proposing is the harder path, which is to use our democratic process to achieve the same goal that you want to achieve."
        },
        {
            "id": 18,
            "text": "But it won't be as easy as just shouting."
        },
        {
            "id": 19,
            "text": "It requires us lobbying and getting it done.\""
        },
        {
            "id": 20,
            "text": "Before the interruption, the president made his pitch to the House GOP to take up immigration reform to deal with a number of different issues, even if they do it through a more piecemeal approach."
        },
        {
            "id": 21,
            "text": "\"It's Thanksgiving,\" he joked."
        },
        {
            "id": 22,
            "text": "\"We can carve that bird into multiple pieces.\""
        },
        {
            "id": 23,
            "text": "House Speaker John Boehner (R-Ohio) said last week that immigration reform is \"absolutely not\" dead, although without answering questions about the timetable."
        },
        {
            "id": 24,
            "text": "Majority Whip Kevin McCarthy (R-Calif.), who previously said immigration bills won't go for votes until next year, said Sunday on CBS' \"Face the Nation\" that reform \"is going to happen in a step-by-step method.\""
        },
        {
            "id": 25,
            "text": "But so far, it's not clear what pieces House Republicans plan to include."
        },
        {
            "id": 26,
            "text": "While there are already proposals on border security, high-skilled worker visas and interior enforcement, the GOP has not put any bills on the table to give legal status to undocumented immigrants."
        },
        {
            "id": 27,
            "text": "House Democrats, joined by three Republicans, introduced a comprehensive immigration reform bill in October and are urging a vote, but House leadership has indicated they won't get one."
        },
        {
            "id": 28,
            "text": "A poll released Monday from the Public Religion Research Institute found that 63 percent of Americans support allowing undocumented immigrants to eventually become citizens if they meet certain criteria, while 14 percent said they should be given legal residency without a path to citizenship."
        },
        {
            "id": 29,
            "text": "Only 18 percent said all undocumented immigrants should be deported."
        },
        {
            "id": 30,
            "text": "Obama said he hopes that Boehner will not let a small minority of immigration reform opponents block the process, and called it \"good news\" that the speaker had repeated his commitment to reform last week."
        },
        {
            "id": 31,
            "text": "\"I believe the speaker is sincere,\" he said."
        },
        {
            "id": 32,
            "text": "\"I think he genuinely wants to get it done, and that's something we should be thankful for this week.\""
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}