{
    "title": "Trump threatens to shut down government over full border wall funding: report",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "President Trump Donald Trump Jan.6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE threatened during a meeting with GOP senators and White House officials to shut down the government over full funding for his border wall, according to multiple reports."
        },
        {
            "id": 2,
            "text": "Politico reported Tuesday that Trump is uninterested in the Senate’s plan to provide $1.6 billion on Trump’s wall along the U.S.-Mexico border."
        },
        {
            "id": 3,
            "text": "Instead, according to the news outlet, he wants the full $25 billion for the project funded all at once."
        },
        {
            "id": 4,
            "text": "Trump told meeting attendees on Monday that he will shut down the government in September if he does not receive the full funding, Politico reported."
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "Sen. Richard Shelby Richard Craig ShelbyBiden sidesteps GOP on judicial vacancies, for now The Hill's Morning Report - Presented by Alibaba - House Democrats plagued by Biden agenda troubles GOP warns McConnell won't blink on debt cliff MORE (R-Ala.), who attended Monday’s meeting, said he considers the $1.6 billion in funding a minimum that could increase during negotiations."
        },
        {
            "id": 7,
            "text": "“He’s focused on border security."
        },
        {
            "id": 8,
            "text": "And like all presidents, he wants it done now."
        },
        {
            "id": 9,
            "text": "But we’re part of the legislative process, it’s slower and deliberate,” Shelby told Politico."
        },
        {
            "id": 10,
            "text": "The government last shut down for three days in January as a temporary spending bill stalled in Congress."
        },
        {
            "id": 11,
            "text": "Trump's hard-line stance over his border wall comes as his administration faces overwhelming opposition from Republicans and Democrats to its \"zero tolerance\" immigration policy, which has led to the separation of thousands of migrant children from their parents."
        },
        {
            "id": 12,
            "text": "Trump has refused to cave on the policy, blaming Democrats for it."
        },
        {
            "id": 13,
            "text": "Other administration officials have said it falls on Congress to address the issue, despite the Trump administration implementing the zero tolerance policy."
        },
        {
            "id": 14,
            "text": "The House is expected to vote soon on a pair of GOP immigration bills that include broader reforms."
        },
        {
            "id": 15,
            "text": "Meanwhile, some members of Congress have crafted legislation that would specifically end the practice of family separation."
        }
    ]
}