{
    "title": "Wayne County GOP Board Members Want to Rescind Votes",
    "text": [
        {
            "id": 0,
            "text": "Two Michigan Republicans who reversed course and voted to certify the election results in the state's most populous county Tuesday now say they were pressured to certify the election and want to rescind their votes."
        },
        {
            "id": 1,
            "text": "Wayne County Board of Canvassers Chairwoman Monica Palmer and William Hartmann, the two Republicans on the four-member board, filed affidavits Wednesday night saying they had been improperly pressured and claiming Democrats on the board reneged on their promise to seek an audit of votes from Detroit, reports The Washington Post."
        },
        {
            "id": 2,
            "text": "The vote to certify the results from the Nov. 3 election is seen as a key step toward finalizing Joe Biden's victory in Michigan."
        },
        {
            "id": 3,
            "text": "Palmer and Hartmann said in their affidavits, published with a report on the website JustTheNews, that they thought they had a firm commitment to the audit."
        },
        {
            "id": 4,
            "text": "However, Palmer said in her document that Michigan Secretary of State Jocelyn Benson, a Democrat, said later she did not view their resolution that asked for an audit as binding."
        },
        {
            "id": 5,
            "text": "\"I felt misled,\" Palmer told the Post Wednesday before signing the affidavit."
        },
        {
            "id": 6,
            "text": "\"I stand firm in not certifying Wayne County without the audit.\""
        },
        {
            "id": 7,
            "text": "Hartmann, who made similar claims in his affidavit, did not respond to a message from the Post seeking comment."
        },
        {
            "id": 8,
            "text": "Jonathan Kinloch, the board's vice chairman and a Democrat, told the Post that it is too late for Palmer and Hartmann to rescind their votes because the certified results have already been sent to Benson, in compliance with state election rules."
        },
        {
            "id": 9,
            "text": "He also slammed the two Republicans for their requests."
        },
        {
            "id": 10,
            "text": "\"Do they understand how they are making us look as a body?\""
        },
        {
            "id": 11,
            "text": "he said."
        },
        {
            "id": 12,
            "text": "\"We have such an amazing and important role in the democratic process, and they're turning it on its head.\""
        },
        {
            "id": 13,
            "text": "Kinloch and the two Republicans had reached a compromise to seek an audit of the results in the Detroit area after Palmer and Hartmann said the official list of who voted did not match the number of ballots that had been received."
        },
        {
            "id": 14,
            "text": "However, Kinloch said the Republicans knew what they'd agreed to on Tuesday and the board has not asked Benson formally for the audit."
        },
        {
            "id": 15,
            "text": "He also accused them of bowing to pressure from the GOP and the White House."
        }
    ]
}