{
    "title": "Federal appeals court upholds New York subpoena for Trump's taxes",
    "text": [
        {
            "id": 0,
            "text": "A federal appeals court on Wednesday dealt another blow to President Trump’s bid to keep New York’s mitts off his tax returns, rejecting his second try at blocking the enforcement of a grand jury subpoena demanding the documents."
        },
        {
            "id": 1,
            "text": "The 2nd U.S. Circuit Court of Appeals ruled that the president’s accounting firm must turn over his personal financial records including eight years of tax returns to the Manhattan District Attorney’s Office."
        },
        {
            "id": 2,
            "text": "Jay Sekulow, counsel to the president, said they will be petitioning the Supreme Court to halt the subpoena."
        },
        {
            "id": 3,
            "text": "It will be the president’s second attempt at getting the high court to wave off Manhattan District Attorney Cyrus Vance’s pursuit of documents in a criminal probe against Mr. Trump and his family business."
        },
        {
            "id": 4,
            "text": "The dispute arose in 2018 after Mr. Vance began an investigation into the Trump Organization and its dealings in New York."
        },
        {
            "id": 5,
            "text": "He subpoenaed Mazars USA, the president’s accounting firm, for financial information, including the tax returns."
        },
        {
            "id": 6,
            "text": "Mr. Trump broke with tradition by not releasing his tax returns when running for president in 2016 and has continued to keep them under wraps, citing an ongoing Internal Revenue Service audit."
        },
        {
            "id": 7,
            "text": "In June, the Supreme Court ruled the subpoena could go forward."
        },
        {
            "id": 8,
            "text": "The justices, however, sided with the president in a similar case brought by House Democrats seeking the same documents through a congressional subpoena, suggesting in the justices’ opinion that the politicians needed to show a policy-making reason for reviewing the tax returns."
        },
        {
            "id": 9,
            "text": "Once the New York case was remanded back to the lower courts, the president argued the state’s subpoena was issued in bad faith — for political harassment — and was over broad."
        },
        {
            "id": 10,
            "text": "A three-judge panel rejected those claims Wednesday in a unanimous ruling."
        },
        {
            "id": 11,
            "text": "“Grand juries routinely issue multiple subpoenas seeking different information from different recipients during the course of their investigations, because, after all, they have a duty to follow ‘every available clue’ wherever it may lead,” the court wrote in its 35-page opinion."
        },
        {
            "id": 12,
            "text": "Wednesday’s decision was handed down by Judge Pierre N. Leval, a Clinton appointee, Judge Robert Katzmann, a Clinton appointee, and Judge Raymond Lohier, an Obama appointee."
        },
        {
            "id": 13,
            "text": "The matter likely won’t be resolved before the Nov. 3 presidential election."
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        }
    ]
}