{
    "title": "Senate Hopeful Joe Miller Calls For Obama's Impeachment, Blasts Mark Begich Over Border",
    "text": [
        {
            "id": 0,
            "text": "Joe Miller, who is running in the Republican primary for the opportunity to challenge Sen. Mark Begich (D-Alaska), has called for President Barack Obama's impeachment, his campaign said this week."
        },
        {
            "id": 1,
            "text": "\"Sarah Palin is right; it’s time to impeach this President for dereliction of duty, selectively enforcing the law, and usurping powers that the Constitution does not authorize,\" he said in a press release. \""
        },
        {
            "id": 2,
            "text": "He is willfully undermining the rule of law and creating chaos.\""
        },
        {
            "id": 3,
            "text": "Palin, the former Alaska governor who shot to prominence as Sen. John McCain's presidential running mate in 2008, has repeatedly called for Obama's impeachment this summer."
        },
        {
            "id": 4,
            "text": "Earlier this month, Palin penned an op-ed for Breitbart.com, saying that the crisis on the U.S.-Mexico border was \"the last straw\" and should be cause for Congress to bring articles of impeachment against the president."
        },
        {
            "id": 5,
            "text": "But the rhetoric around impeachment has also incorporated many of the issues conservatives have used to attack Obama throughout his two terms, including questions about the Sept. 11, 2012, attacks on the diplomatic mission in Benghazi, Libya."
        },
        {
            "id": 6,
            "text": "House Speaker John Boehner (R-Ohio), who has said he intends to file a lawsuit against Obama over the president's use of executive powers, has largely resisted the impeachment buzz."
        },
        {
            "id": 7,
            "text": "But on Friday, a top aide to Obama said that the White House expects Congress to eventually seek articles of impeachment against the president."
        },
        {
            "id": 8,
            "text": "Miller also attacked Obama and Begich over the crisis at the border."
        },
        {
            "id": 9,
            "text": "\"Mark Begich has not even deemed the crisis on our southern border worthy of a press release,\" he said."
        },
        {
            "id": 10,
            "text": "\"There is no doubt that he is complicit with the President in encouraging and empowering this illegal invasion, both from a policy perspective by voting for amnesty, and by virtue of his refusal to hold Barack Obama accountable for dereliction of duty and usurpation of Congressional authority.\""
        },
        {
            "id": 11,
            "text": "This year has seen a crisis-level influx of unaccompanied minors arriving at the southern border, largely coming from Central American countries such as Guatemala and Honduras."
        },
        {
            "id": 12,
            "text": "Obama has requested $3.7 billion to address the surge -- a request that has been met with skepticism by most in the Republican conference."
        },
        {
            "id": 13,
            "text": "This is not Miller's first Senate run."
        },
        {
            "id": 14,
            "text": "In 2010, he bested incumbent Sen. Lisa Murkowski (R-Alaska) in the primary, only to see her win anyway as a write-in candidate in the general election."
        },
        {
            "id": 15,
            "text": "According to HuffPost Pollster, which combines all publicly available polling data, Miller is running third in the GOP primary, which is scheduled for Aug. 19."
        }
    ]
}