{
    "title": "Presidential Candidates Set Their Sights On Colorado's Latinos",
    "text": [
        {
            "id": 0,
            "text": "The presidential race has become much tighter in recent days, and in Colorado, a recent poll puts Republican presidential nominee Mitt Romney in the lead."
        },
        {
            "id": 1,
            "text": "Colorado is one of several swing states where campaign efforts will be concentrated in these past few weeks before the election."
        },
        {
            "id": 2,
            "text": "Of those efforts, actually getting people to the polls will be one of the most important."
        },
        {
            "id": 3,
            "text": "In Colorado, both the Romney and Obama campaigns have an eye on Latino voters in particular."
        },
        {
            "id": 4,
            "text": "The state has seen a tremendous amount of growth in the Latino population."
        },
        {
            "id": 5,
            "text": "According to census data, that particular demographic grew by 41 percent between 2000 and 2010."
        },
        {
            "id": 6,
            "text": "Latinos make up about 21 percent of Colorado's overall population."
        },
        {
            "id": 7,
            "text": "They're a smaller percentage of the population in Larimer County — only about 11 percent — but in a hotly contested swing county, it's a voting bloc that neither candidate can afford to ignore."
        },
        {
            "id": 8,
            "text": "On a rainy evening in downtown Fort Collins, we met with three Latino women — Betty Aragon, Guadalupe Salazar and Jan Barela-Smith — at their favorite Mexican restaurant."
        },
        {
            "id": 9,
            "text": "They'd been caught in a downpour on their way to meet us, and by the time we arrived, they were drying off and warming up with bowls of hot chili verde."
        },
        {
            "id": 10,
            "text": "All three women are Democrats, which puts them in sync with most Latino voters."
        },
        {
            "id": 11,
            "text": "Polls show Latinos support President Obama at a rate of more than 2 to 1."
        },
        {
            "id": 12,
            "text": "Aragon, a self-employed resident of Fort Collins, explains to us why she thinks that is: \"We're talking about the DREAM Act,\" she says."
        },
        {
            "id": 13,
            "text": "\"We're talking about the immigration issue."
        },
        {
            "id": 14,
            "text": "These are issues that really impact the Hispanic community.\""
        },
        {
            "id": 15,
            "text": "But Salazar and Barela-Smith — both of whom work in higher education — think that it's more than just traditional issues that keep Latinos in the Democratic camp."
        },
        {
            "id": 16,
            "text": "Salazar points out that the Romney campaign has raised the idea of cutting back on Pell Grants for higher education."
        },
        {
            "id": 17,
            "text": "That, she says, disproportionately affects Latinos — either preventing them from pursuing education or forcing them to take out more loans."
        },
        {
            "id": 18,
            "text": "\"Since Obama has been in office, the Pell Grant went up from $4,300 to $5,550,\" she explains."
        },
        {
            "id": 19,
            "text": "\"That's a lot of money."
        },
        {
            "id": 20,
            "text": "That pays a full tuition, books and fees at Front Range [Community College] for a student to go."
        },
        {
            "id": 21,
            "text": "Without that money, they're not going to be able to go to college, and then they will take loans.\""
        },
        {
            "id": 22,
            "text": "While the Democrats are counting on Latino support, Republicans are trying to prove that their party is the natural home for Latino voters."
        },
        {
            "id": 23,
            "text": "One man who agrees with that is Joe Andujo, an information analyst for a health care group and a member of the Northern Colorado Hispanic Republicans."
        },
        {
            "id": 24,
            "text": "\"Faith, family, freedom\" — those are the values that he says he believes are held by both Latinos and by the Republican Party."
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": "\"None of us,\" he says, \"want handouts."
        },
        {
            "id": 27,
            "text": "We want a hand up."
        },
        {
            "id": 28,
            "text": "We want to be able to work hard and keep what we earned."
        },
        {
            "id": 29,
            "text": "And I think the Republican Party best demonstrates, or best helps us to achieve those goals of retaining what we have and living the American dream, which is why most immigrants come to this country to begin with.\""
        },
        {
            "id": 30,
            "text": "Andujo says he thinks the Republican Party could do much more to educate Latinos about who Republicans are and what the party stands for."
        },
        {
            "id": 31,
            "text": "That strategy could one day pay off for Republicans in attracting larger numbers of Latino voters."
        },
        {
            "id": 32,
            "text": "In the meantime, there's no guarantee that Latinos will turn out in great numbers."
        },
        {
            "id": 33,
            "text": "Both campaigns will be using these remaining few weeks to get out the vote."
        }
    ]
}