{
    "title": "Trump Spouts New Conspiracy Theories In Bizarre Fox News Interview",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump spouted numerous baseless conspiracy theories and attacked Black Lives Matter protesters while claiming his own supporters were peacefully demonstrating during a lengthy interview with Fox News host Laura Ingraham on Monday."
        },
        {
            "id": 1,
            "text": "When asked if his supporters should confront Black Lives Matter protesters ― as they have been doing in various cities ― Trump said that should be left to law enforcement."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "Then, he proceeded to call his base “wonderful, hardworking, tremendous” people who were shocked by the violence and were simply engaging in “peaceful protest.”"
        },
        {
            "id": 4,
            "text": "In Portland, Oregon, which has been rocked by demonstrations since the police killing of George Floyd in Minneapolis in May, Trump supporters drove a convoy of more than 600 vehicles through the city over the weekend."
        },
        {
            "id": 5,
            "text": "Some were filmed shooting paintball guns and pepper spray at Black Lives Matter protesters."
        },
        {
            "id": 6,
            "text": "An apparent member of Patriot Prayer, a right-wing group whose supporters have frequently clashed with demonstrators in Portland, died in a shooting during the violence on Saturday."
        },
        {
            "id": 7,
            "text": "“You know it’s amazing, they want to protest, and they get criticized,” Trump said."
        },
        {
            "id": 8,
            "text": "“The other people run through the streets, burn down storefronts, hurt people, beat people and kill people.”"
        },
        {
            "id": 9,
            "text": "In Kenosha, Wisconsin, protests erupted after the Aug. 23 shooting of Jacob Blake, a Black man who was shot seven times in the back by police."
        },
        {
            "id": 10,
            "text": "Blake was left paralyzed in the incident, which was caught on video and shared widely on social media."
        },
        {
            "id": 11,
            "text": "To date, the cop has not been charged."
        },
        {
            "id": 12,
            "text": "Three days later, two people died and another was wounded when Kyle Rittenhouse, a white 17-year-old vigilante and apparent supporter of the president, allegedly fired on people protesting the Blake attack."
        },
        {
            "id": 13,
            "text": "He was charged as an adult with two counts of first-degree homicide and one count of attempted homicide."
        },
        {
            "id": 14,
            "text": "At a press conference on Monday, Trump defended Rittenhouse and repeatedly refused to condemn his other supporters in Portland, claiming the paintball guns were for “defense.”"
        },
        {
            "id": 15,
            "text": "Asked if he wants his supporters to confront protesters, Trump says, \"I want to leave it to law enforcement, but my supporters are wonderful, hardworking, tremendous people and they turn on their televisions and they look at a Portland or a Kenosha ..."
        },
        {
            "id": 16,
            "text": "they can't believe it.\""
        },
        {
            "id": 17,
            "text": "Later in the Fox News interview, Trump claimed unnamed people in “dark shadows” were pulling the strings behind his Democratic opponent, former Vice President Joe Biden, a claim which even Ingraham said, “sounds like a conspiracy theory.”"
        },
        {
            "id": 18,
            "text": "“There are people that are on the streets,” Trump continued."
        },
        {
            "id": 19,
            "text": "“There are people that are controlling the streets.”"
        },
        {
            "id": 20,
            "text": "He claimed there was an apparent secret plot to damage the Republican National Convention, but refused to provide any clarifying details."
        },
        {
            "id": 21,
            "text": "“We had somebody get on a plane from a certain city this weekend."
        },
        {
            "id": 22,
            "text": "And in the plane, it was almost completely loaded with thugs, wearing these dark uniforms, black uniforms, with gear and this and that,” he said."
        },
        {
            "id": 23,
            "text": "Trump compared the Wisconsin police officer who shot Blake to a golfer who chokes by missing an easy putt, and said the police were “under siege.”"
        },
        {
            "id": 24,
            "text": "He baselessly declared that Portland had been burning for decades and asserted that protesters there wanted to kill Mayor Ted Wheeler (D)."
        },
        {
            "id": 25,
            "text": "Trump also repeatedly blamed the civil unrest in Portland, Kenosha and other cities across the country on Biden and Democratic leaders."
        },
        {
            "id": 26,
            "text": ""
        }
    ]
}