{
    "title": "McConnell rejects Schumer's call for witnesses at impeachment trial",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON, DC - SEPTEMBER 25: The U.S. Capitol on September 25, 2021 in Washington, DC."
        },
        {
            "id": 1,
            "text": "The House Budget Committee is expected to advance Democrats $3.5 trillion social spending plan during a rare Saturday session, setting it up for a full floor vote next week."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "“We don’t create impeachments,” McConnell said on the Senate floor."
        },
        {
            "id": 4,
            "text": "“We judge them.”"
        },
        {
            "id": 5,
            "text": "“The House chose this road."
        },
        {
            "id": 6,
            "text": "It is their duty to investigate."
        },
        {
            "id": 7,
            "text": "It is their duty to meet the very high bar for undoing a national election,” the Kentucky Republican said."
        },
        {
            "id": 8,
            "text": "“If they fail, they fail."
        },
        {
            "id": 9,
            "text": "It is not the Senate’s job to leap into the breach and search desperately for ways to get to ‘guilty.’"
        },
        {
            "id": 10,
            "text": "That would hardly be impartial justice.”"
        },
        {
            "id": 11,
            "text": "In a letter to McConnell on Sunday, Schumer said he wanted to have four Trump officials testify, including former national security adviser John Bolton and acting White House chief of staff Mick Mulvaney, two people close to Trump’s actions on Ukraine who refused to testify in the House investigation."
        },
        {
            "id": 12,
            "text": "McConnell also said that Senate Democrats wanting fact witnesses is a sign House Democrats did “sloppy work” in their impeachment inquiry."
        },
        {
            "id": 13,
            "text": "“If House Democrats’ case is this deficient, this thin, the answer is not for the judge and jury to cure it here in the Senate."
        },
        {
            "id": 14,
            "text": "The answer is that the House should not impeach on this basis in the first place,” McConnell said."
        },
        {
            "id": 15,
            "text": "McConnell’s rejection of Schumer’s request does not mean the question of witnesses is settled."
        },
        {
            "id": 16,
            "text": "McConnell said the Senate should revisit the issue at some point in the middle of the trial, similarly to how it was handled in the Clinton impeachment trial."
        },
        {
            "id": 17,
            "text": "“In President Clinton’s trial, we handled procedural issues in two separate Senate resolutions that passed at different times."
        },
        {
            "id": 18,
            "text": "The first resolution passed unanimously before the trial."
        },
        {
            "id": 19,
            "text": "It sketched out basic things like scheduling, opening arguments and the timing of a motion to dismiss,” he said."
        },
        {
            "id": 20,
            "text": "“Other, more detailed questions about the middle and the end of the trial, including whether any witnesses would be called, were reserved for a second resolution that was passed in the middle of the trial itself.”"
        },
        {
            "id": 21,
            "text": "That means in the end, which witnesses they want or don’t want will be decided by a majority of senators."
        },
        {
            "id": 22,
            "text": "Schumer spoke shortly after McConnell and blasted him for not wanting to hear from witnesses who could fill in the holes that were left in the House investigation because Trump prevented his staff from appearing or providing documents."
        },
        {
            "id": 23,
            "text": "He pointed to a new Washington Post/ABC poll that showed 71% of Americans, including 64% of Republicans want witnesses at a trial and he had a blunt warning for GOP senators who reject witnesses."
        },
        {
            "id": 24,
            "text": "“Senators who oppose this plan will have to explain why less evidence is better than more evidence."
        },
        {
            "id": 25,
            "text": "Again, let me say that to every senator in this room, Democrat and Republican, senators who oppose this plan will have to explain why less evidence is better than more evidence,” the New York Democrat said."
        },
        {
            "id": 26,
            "text": "“And they’re going to have to explain that position to a public that is understandably skeptical when they see an administration suppressing evidence and blocking senior officials from telling the truth about what they know.”"
        },
        {
            "id": 27,
            "text": "Schumer hopes to persuade a handful of Republicans to break with McConnell and Trump and provide the votes to force witnesses in a trial."
        },
        {
            "id": 28,
            "text": "While he needs only four Republicans to do it, there’s no evidence yet there are four ready to break."
        },
        {
            "id": 29,
            "text": "One of the GOP senators Schumer wants in his corner is Mitt Romney of Utah, a frequent critic of Trump’s."
        },
        {
            "id": 30,
            "text": "Romney said he had no issues with McConnell pushing back on Schumer’s request."
        },
        {
            "id": 31,
            "text": "“My read of his comments were that he’s looking for the same process that was employed during the Clinton impeachment trial, that it would be a two-stage process of setting rules,” Romney told CNN."
        },
        {
            "id": 32,
            "text": "On the floor, McConnell accused Schumer of releasing his letter as public relations ploy not designed to start real negotiations on the contours of a trial."
        },
        {
            "id": 33,
            "text": "In return, Schumer slammed McConnell for appearing on Fox’s Sean Hannity program Friday, where he discussed to his vision of a trial before consulting with Democrats."
        },
        {
            "id": 34,
            "text": "The two men at the center of the Senate trial process, who must devise a common approach, seem far apart."
        },
        {
            "id": 35,
            "text": "Nevertheless, they said they intend to meet soon, even as time is running short."
        },
        {
            "id": 36,
            "text": "The House is set to vote out the impeachment articles Wednesday and a Senate trial is expected in early January."
        },
        {
            "id": 37,
            "text": "This story has been updated with additional developments Tuesday."
        }
    ]
}