{
    "title": "Obama to continue modified NSA meta-data gathering program",
    "text": [
        {
            "id": 0,
            "text": "President Obama on Friday will announce some changes to how data gathered by the National Security Agency is stored but will allow the collection of that information to continue, according to multiple media reports."
        },
        {
            "id": 1,
            "text": "In a widely anticipated speech to be delivered from the Justice Department, the president is expected to recommend that a third party retain the “meta-data” now housed by the federal government, and that the government only be allowed access to that data after a judicial finding in its favor."
        },
        {
            "id": 2,
            "text": "The changes come after Mr. Obama’s own hand-picked review panel in December delivered 46 specific recommendations on how U.S. surveillance and data-collection programs could be overhauled to increase transparency and better protect the privacy of Americans."
        },
        {
            "id": 3,
            "text": "But privacy advocates don’t believe the changes Mr. Obama is expected to unveil on Friday will make much of a difference and cast them as cosmetic fixes primarily designed to appease critics."
        },
        {
            "id": 4,
            "text": "Allowing third parties to store data on millions of Americans “won’t solve the problem."
        },
        {
            "id": 5,
            "text": "It would just outsource it,” said Elizabeth Goitein, co-director of the Liberty and National Security Program at the Brennan Center for Justice."
        },
        {
            "id": 6,
            "text": "If phone companies ultimately are the ones to hold the data, that presents a whole new set of problems, Ms. Goitein said, adding it would set a “dangerous precedent” for the government to “launder its surveillance activities through private parties."
        },
        {
            "id": 7,
            "text": "“It would turn these service providers into agents of the intelligence community,” she said."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        }
    ]
}