{
    "title": "Trump Accuses FDA Of Playing Politics With COVID-19 Vaccine Guidelines",
    "text": [
        {
            "id": 0,
            "text": "Trump Accuses FDA Of Playing Politics With COVID-19 Vaccine Guidelines"
        },
        {
            "id": 1,
            "text": "President Trump on Wednesday decried reported health agency efforts to issue stricter guidelines for evaluating a vaccine against COVID-19, accusing the Food and Drug Administration of playing politics."
        },
        {
            "id": 2,
            "text": "Trump was apparently reacting to a Tuesday report in the New York Times that said the agency will soon move to tighten requirements for emergency authorization of any coronavirus vaccine to better ensure its safety and effectiveness."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "\"That has to be approved by the White House."
        },
        {
            "id": 5,
            "text": "We may or may not approve it."
        },
        {
            "id": 6,
            "text": "That sounds like a political move,\" Trump said during a press briefing at the White House."
        },
        {
            "id": 7,
            "text": "\"I think that was a political move more than anything else,\" he said."
        },
        {
            "id": 8,
            "text": "PBS NewsHour via YouTube"
        },
        {
            "id": 9,
            "text": "The timing of a vaccine has been an issue of contention between the president and health experts."
        },
        {
            "id": 10,
            "text": "Trump has directly contradicted Centers for Disease Control and Prevention Director Robert Redfield on an estimate for widespread release of a vaccine, saying that such distribution of a vaccine would happen before the end of the year."
        },
        {
            "id": 11,
            "text": "Trump has also said that \"every American\" will have access to a vaccine by April."
        },
        {
            "id": 12,
            "text": "Redfield has testified to Congress that a vaccine would likely not be widely available until next spring or summer."
        },
        {
            "id": 13,
            "text": "Multiple potential vaccines are undergoing testing."
        },
        {
            "id": 14,
            "text": "Top health officials vowed in a hearing on Capitol Hill Wednesday that a COVID-19 vaccine would not be approved until it met \"vigorous expectations\" for safety and effectiveness."
        }
    ]
}