{
    "title": "\"Extraordinary Circumstances:\" Holder Orders Second Autopsy in Ferguson Shooting",
    "text": [
        {
            "id": 0,
            "text": "With the unrest in Ferguson, Missouri not ending anytime soon, U.S. Attorney General Eric Holder has ordered another autopsy to try and find some answers as to how teenager Michael Brown died at the hands of police in the small city."
        },
        {
            "id": 1,
            "text": "Some, however, are questioning his seemingly racial motives."
        },
        {
            "id": 2,
            "text": "Following the death of unarmed black teenager Michael Brown last week, residents looted and burned local businesses decrying what they deemed as police brutality."
        },
        {
            "id": 3,
            "text": "The chaos only ensued from there, leading to a second shooting and Governor Jay Nixon eventually declaring a state of emergency and enforcing a citywide curfew."
        },
        {
            "id": 4,
            "text": "The St. Louis County Medical Examiner's office performed an initial autopsy which concluded Brown was killed by gun shots."
        },
        {
            "id": 5,
            "text": "Insisting this is an \"extraordinary circumstance,\" however, Holder announced he is launching another investigation:\n\nAG Eric Holder has ordered an additional autopsy of #MikeBrown to be done by the Feds."
        },
        {
            "id": 6,
            "text": "Here is their statement pic.twitter.com/wnWJYu8XYI — Michael Skolnik (@MichaelSkolnik) August 17, 2014"
        },
        {
            "id": 7,
            "text": "In addition to authorizing this second probe, Holder has suggested the Ferguson police department should become more \"racially diverse\" to help ease some tension in the community."
        },
        {
            "id": 8,
            "text": "Because of comments like these, some have criticized Holder for his involvement."
        },
        {
            "id": 9,
            "text": "Fox News contributor Deneen Borelli, for example, insisted Holder needs to do his job as our chief law enforcement officer instead of playing the role of \"chief activist."
        },
        {
            "id": 10,
            "text": "\" You can watch her whole comments on Hannityhere:\n\nWe'll soon find out if the examiner's findings will help to quell or exacerbate the city's current struggle."
        }
    ]
}