{
    "title": "Trump: Putin ‘very smart’ for not retaliating against U.S. over latest round of sanctions",
    "text": [
        {
            "id": 0,
            "text": "President-elect Donald Trump on Friday hailed Russian President Vladimir Putin as “very smart” for not retaliating against a new round of U.S. sanctions against the former Cold War foe."
        },
        {
            "id": 1,
            "text": "“Great move on delay (by V. Putin) - I always knew he was very smart!” tweeted Mr. Trump, "
        },
        {
            "id": 2,
            "text": "who weathered unrelenting criticism during the campaign for heaping praise on Mr. Putin."
        },
        {
            "id": 3,
            "text": "The tweet suggested that Mr. Trump, who made his deal-making skills a chief argument for his presidential run, will be open to negotiating with Russia over the status of the sanctions once he takes office Jan. 20."
        },
        {
            "id": 4,
            "text": "Mr. Putin condemned the new round of sanctions President Obama imposed against Russia for allegedly using computer hacking to interfere with the U.S. presidential election."
        },
        {
            "id": 5,
            "text": "But the Russian president said he would not retaliate."
        },
        {
            "id": 6,
            "text": "Mr. Obama hit Russia with sanctions that included expelling 35 Russian intelligence agents and closing two Russian compounds in the U.S."
        },
        {
            "id": 7,
            "text": "The parting shot at Russia was the latest rift between Mr. Obama and Mr. Trump, who urged the administration to move on from the hacking allegations."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        }
    ]
}