{
    "title": "Biden hopes Senate can split time on impeachment, his agenda",
    "text": [
        {
            "id": 0,
            "text": "President-elect Joe Biden Joe Biden said Monday that he hoped the Senate would “bifurcate” its work so that an impeachment trial of President Trump does not interfere with confirming his Cabinet nominees or passing a stimulus package."
        },
        {
            "id": 1,
            "text": "Biden said that he had spoken with the Senate parliamentarian about whether the upper chamber can “go a half day with the impeachment and a half day getting my people nominated and confirmed in the Senate as well as moving on the [coronavirus stimulus] package.”"
        },
        {
            "id": 2,
            "text": "He said he had yet to receive an answer on the issue."
        },
        {
            "id": 3,
            "text": "“My priority is to get, first and foremost, a stimulus bill passed and secondly, again to rebuild the economy,” Biden said."
        },
        {
            "id": 4,
            "text": "Biden’s remarks to reporters represented tacit approval of the Senate moving forward with an impeachment trial swiftly, assuming that the House votes to impeach Trump."
        },
        {
            "id": 5,
            "text": "House Democrats on Monday introduced an article of impeachment charging Trump with inciting a mob of his supporters to conduct a violent attack on the U.S. Capitol last Wednesday."
        },
        {
            "id": 6,
            "text": "The assault left five people dead, including a Capitol police officer, and has prompted mounting calls for Trump to resign or be removed from office in his waning days as president."
        },
        {
            "id": 7,
            "text": "Biden last week declined to take a position on whether Trump should be impeached, saying that was up to Congress to decide."
        },
        {
            "id": 8,
            "text": "\"What the Congress decides to do is for them to decide, but I'm going to have to — and they're going to have to be ready to hit the ground running,\" Biden told reporters on Friday."
        },
        {
            "id": 9,
            "text": "The House is expected to vote on impeaching Trump on Wednesday, one week before Biden’s inauguration."
        },
        {
            "id": 10,
            "text": "The Senate is out of session until Jan. 19, meaning that an impeachment trial would likely start sometime after Biden is inaugurated."
        },
        {
            "id": 11,
            "text": "The transition process was initially delayed as Trump unsuccessfully contested the election results."
        },
        {
            "id": 12,
            "text": "Biden is not expected to have a single Cabinet official confirmed by the Senate by the time he takes office."
        },
        {
            "id": 13,
            "text": "The president-elect also plans to lay out an economic relief package to assist those impacted by the novel coronavirus and related business closures, which would need to be put to a vote in both the House and the Senate."
        }
    ]
}