{
    "title": "Hope and hype of Hiroshima can’t conceal Obama’s dismal record on nuclear disarmament",
    "text": [
        {
            "id": 0,
            "text": "Seven years ago, in the Czech capital of Prague, Barack Obama delivered his first major foreign policy speech as president."
        },
        {
            "id": 1,
            "text": "To rapturous applause, he laid out his vision for “the peace and security of a world without nuclear weapons”."
        },
        {
            "id": 2,
            "text": "It earned him that year’s Nobel peace prize."
        },
        {
            "id": 3,
            "text": "On Friday he will bookend his two terms in office with another appeal for nuclear disarmament, this time during a historic trip to Hiroshima."
        },
        {
            "id": 4,
            "text": "No other sitting US president has ever visited the Japanese city that was razed to the ground by a single atomic bomb in the final days of the second world war."
        },
        {
            "id": 5,
            "text": "An estimated 140,000 people, almost all of them civilians, perished instantly in the vast inferno, or died within a few months from severe burns, blast injuries or radiation sickness."
        },
        {
            "id": 6,
            "text": "Many more succumbed years later to cancers and other radiation-related illnesses."
        },
        {
            "id": 7,
            "text": "The president will make no apology on behalf of his nation for this horrific attack."
        },
        {
            "id": 8,
            "text": "That he has made clear."
        },
        {
            "id": 9,
            "text": "But most of the remaining survivors, known as hibakusha, have not demanded one."
        },
        {
            "id": 10,
            "text": "Their focus instead is on the future – how to realise the oft-cited, long-elusive goal of a nuclear weapon-free world, lest anyone else ever suffer as they have."
        },
        {
            "id": 11,
            "text": "Many hibakusha have been dismayed by the president’s dismal record on disarmament."
        },
        {
            "id": 12,
            "text": "Setsuko Thurlow, who was 13 years old when the building she was in collapsed around her from the atomic blast, wrote in the New York Daily News last week: “We are frustrated by Obama’s eloquent propensity to say one thing and do another.”"
        },
        {
            "id": 13,
            "text": "Under the Obama presidency, contrary to perceptions, the pace of nuclear warhead dismantlement has slowed, not hastened."
        },
        {
            "id": 14,
            "text": "Indeed, the two presidents Bush and Bill Clinton each made greater gains in downsizing the colossal US nuclear stockpile amassed during the cold war."
        },
        {
            "id": 15,
            "text": "But more alarming than this failure to destroy old nuclear weapons has been the Obama administration’s aggressive pursuit of new, “smaller” ones, for which the threshold of use would be lower, according to former military commanders."
        },
        {
            "id": 16,
            "text": "At great expense, the president has bolstered all three components of the nation’s “nuclear triad”: the strategic bombers, intercontinental ballistic missiles and submarine-launched missiles."
        },
        {
            "id": 17,
            "text": "This was the price paid for securing Republican support in 2010 for the ratification of a modest bilateral arms reduction treaty with Russia."
        },
        {
            "id": 18,
            "text": "Obama’s much-publicised “nuclear security summits” largely ignored the greatest source of nuclear insecurity in the world today: 15,000 nuclear weapons, including 1,800 on hair-trigger alert."
        },
        {
            "id": 19,
            "text": "Instead, they focused on measures to keep “vulnerable nuclear material” out of terrorists’ hands – a vital endeavour, certainly, but for all the fanfare the results were small."
        },
        {
            "id": 20,
            "text": "Now the United States is stridently resisting diplomatic moves by two-thirds of the world’s nations to declare nuclear weapons illegal."
        },
        {
            "id": 21,
            "text": "It boycotted UN talks in Geneva this month aimed at setting the stage for negotiations on a prohibition treaty."
        },
        {
            "id": 22,
            "text": "But it cannot veto this initiative, just as it could not veto the processes that led to bans on landmines in 1997 and cluster munitions in 2008."
        },
        {
            "id": 23,
            "text": "While a prohibition on nuclear weapons will not result in disarmament overnight, it will powerfully challenge the notion that these weapons are acceptable for some nations."
        },
        {
            "id": 24,
            "text": "It will place them on the same legal footing as both other types of weapons of mass destruction – namely, chemical and biological weapons."
        },
        {
            "id": 25,
            "text": "In Geneva, Australia spoke neither for nor against a ban."
        },
        {
            "id": 26,
            "text": "Under the caretaker government, it was compelled to remain silent on matters for which there is no bipartisan agreement."
        },
        {
            "id": 27,
            "text": "The Coalition government has fervently opposed the “ban the bomb” movement, arguing that the so-called US “nuclear umbrella” guarantees Australia’s “security and prosperity”."
        },
        {
            "id": 28,
            "text": "Labor, by contrast, has declared its firm support for “the negotiation of a global treaty banning [nuclear] weapons”, welcoming “the growing global movement of nations that is supporting this objective”."
        },
        {
            "id": 29,
            "text": "This was an important addition to its revised national platform in 2015."
        },
        {
            "id": 30,
            "text": "Its new policy, no doubt, will prove unpopular with our powerful ally – whoever may serve as the next commander-in-chief – but it is in harmony with the policies of our nearest neighbours, from whom we have grown increasingly isolated on this issue in recent years."
        },
        {
            "id": 31,
            "text": "Among the most outspoken proponents of a ban are New Zealand, Indonesia, Malaysia, the Philippines and Thailand."
        },
        {
            "id": 32,
            "text": "Australia should look to these and other nuclear-free nations in our region, and beyond, for guidance on disarmament matters – not to a nation bristling with 7,000 nuclear weapons."
        },
        {
            "id": 33,
            "text": "The US will not, alas, lead the way to a world without these horrible weapons."
        },
        {
            "id": 34,
            "text": "Even under one of its most progressive presidents, it has failed abysmally to do so."
        },
        {
            "id": 35,
            "text": "The promise of Prague was broken."
        },
        {
            "id": 36,
            "text": "Let us not get caught up in the hope and hype of Hiroshima."
        },
        {
            "id": 37,
            "text": "To succeed in eliminating nuclear weapons, we must begin by stigmatising and prohibiting such weapons."
        },
        {
            "id": 38,
            "text": "The US will not support us in this endeavour."
        },
        {
            "id": 39,
            "text": "But the overwhelming majority of nations will."
        },
        {
            "id": 40,
            "text": "We must stand firmly on the right side of history."
        },
        {
            "id": 41,
            "text": "The problem is not North Korea or Russia or China, or whoever else we may perceive as the enemy."
        },
        {
            "id": 42,
            "text": "The problem is the weapons these and others possess and threaten to use every day through the doctrine of “deterrence”."
        },
        {
            "id": 43,
            "text": "They are inherently indiscriminate, inhumane and immoral weapons."
        },
        {
            "id": 44,
            "text": "Soon, too, they will be illegal."
        },
        {
            "id": 45,
            "text": "Australia must stop defending them simply out of deference to its ally."
        }
    ]
}