{
    "title": "White House may consider funding for police in schools after Newtown ",
    "text": [
        {
            "id": 0,
            "text": "The Obama administration is considering funding many more police officers in public schools to secure campuses, a leading Democratic senator said, part of a broad gun violence agenda that is likely to include a ban on high-capacity ammunition clips and universal background checks."
        },
        {
            "id": 1,
            "text": "The school safety initiative, one of several under consideration, would make federal dollars available to schools that want to hire police officers and install surveillance equipment, although it is not nearly as far-ranging as the National Rifle Association’s proposal for armed guards in every U.S. school."
        },
        {
            "id": 2,
            "text": "The idea is gaining currency among some Democratic lawmakers, who see it as a potential area of common ground with Republicans who otherwise oppose stricter restrictions on firearms."
        },
        {
            "id": 3,
            "text": "Sen. Barbara Boxer, a liberal Democrat from California, said she presented the plan to Vice President Biden and that he was “very, very interested” and may include it in the policy recommendations he makes to President Obama."
        },
        {
            "id": 4,
            "text": "“If a school district wants to have a community policing presence, I think it’s very important they have it,” Boxer said in an interview Thursday."
        },
        {
            "id": 5,
            "text": "“If they want uniformed officers, they can do it."
        },
        {
            "id": 6,
            "text": "If they want plainclothed officers, they can do it.”"
        },
        {
            "id": 7,
            "text": "But hope of finding an accord over gun laws dimmed considerably Thursday after the NRA lashed out publicly against what it called the administration’s “agenda to attack the Second Amendment” after meeting with Biden and senior White House officials."
        },
        {
            "id": 8,
            "text": "Biden plans to present recommendations from the administration’s working group on gun violence to Obama on Tuesday."
        },
        {
            "id": 9,
            "text": "The vice president said Thursday that he sees an emerging consensus around “universal background checks” for all gun buyers and a ban on high-capacity ammunition magazines."
        },
        {
            "id": 10,
            "text": "Obama, meanwhile, has said he also supports a ban on assault weapons."
        },
        {
            "id": 11,
            "text": "The gun industry has long opposed these restrictions, and the NRA said after its 95-minute White House meeting that it would have nothing more to do with Biden’s task force, foreshadowing a partisan and emotionally charged fight over gun control."
        },
        {
            "id": 12,
            "text": "“It is unfortunate that this administration continues to insist on pushing failed solutions to our nation’s most pressing problems,” the NRA said in a statement."
        },
        {
            "id": 13,
            "text": "“We will not allow law-abiding gun owners to be blamed for the acts of criminals and madmen.”"
        },
        {
            "id": 14,
            "text": "Biden met with other gun-owner groups as well as representatives of hunting and sporting organizations Thursday as he surveys interest groups in the wake of last month’s elementary school massacre in Newtown, Conn., that killed 20 children and six adults."
        },
        {
            "id": 15,
            "text": "Attorney General Eric H. Holder Jr. met separately Thursday with major gun retailers, including Wal-Mart."
        },
        {
            "id": 16,
            "text": "Biden already has spoken with law enforcement leaders, gun violence victims and gun-safety groups and has had conference calls with governors and other state and local elected officials of both parties."
        },
        {
            "id": 17,
            "text": "Biden said that, going into Thursday’s meetings, his task force heard repeatedly about the need to strengthen background checks to keep guns out of the hands of criminals and the mentally ill."
        },
        {
            "id": 18,
            "text": "He said the proposals would go beyond closing a loophole that exempts some private firearms sales, such as transactions at gun shows, from background checks."
        },
        {
            "id": 19,
            "text": "“There is an emerging set of recommendations — not coming from me but coming from the groups we’ve met,” Biden said."
        },
        {
            "id": 20,
            "text": "“There is a surprising, so far, a surprising recurrence of suggestions that we have universal background checks.”"
        },
        {
            "id": 21,
            "text": "These recommendations were not only about “closing the gun-show loophole,” he said, “but total universal background checks, including private sales.”"
        },
        {
            "id": 22,
            "text": "He said the focus would be on how to “strengthen those background checks.”"
        },
        {
            "id": 23,
            "text": "Biden also mentioned strengthening the ability of federal agencies to conduct research about gun violence."
        },
        {
            "id": 24,
            "text": "He drew a comparison between current limits on federal gathering of data about gun violence and 1970s-era restrictions on federal research into the causes of traffic fatalities."
        },
        {
            "id": 25,
            "text": "Biden stressed a need for the government to collect information about “what kind of weapons are used most to kill people” and “what kind of weapons are trafficked weapons.”"
        },
        {
            "id": 26,
            "text": "The administration is weighing solutions beyond gun laws, including mental health and education initiatives."
        },
        {
            "id": 27,
            "text": "Boxer’s school safety plan would restore or add funding to some Community Oriented Policing Services programs that pay for police officers, tip lines, surveillance equipment and secured entrances at public schools."
        },
        {
            "id": 28,
            "text": "After the Newtown shootings, NRA Vice President Wayne La­Pierre proposed that every school be protected by armed guards, who could be volunteers, firefighters or private security personnel."
        },
        {
            "id": 29,
            "text": "Boxer said that her plan is limited to law enforcement officials from the community and that any decision would be up to individual schools."
        },
        {
            "id": 30,
            "text": "“I don’t see why anyone should object to it, left or right,” Boxer said."
        },
        {
            "id": 31,
            "text": "“It’s an area where I think I can find common ground with my colleagues on all sides.”"
        },
        {
            "id": 32,
            "text": "A White House spokesman would not say whether the Biden group has decided to include such a policy in its recommendations."
        },
        {
            "id": 33,
            "text": "Boxer’s proposal is one many school safety ideas under discussion."
        },
        {
            "id": 34,
            "text": "As a senator from Delaware, Biden was one of the leading champions of the COPS program."
        },
        {
            "id": 35,
            "text": "Boxer called it “one of Joe’s proudest achievements.”"
        },
        {
            "id": 36,
            "text": "But the school safety idea also faces some opposition within the Democratic base."
        },
        {
            "id": 37,
            "text": "A coalition of progressive groups — including the NAACP Legal Defense and Education Fund, the Advancement Project, the Alliance for Educational Justice and Dignity in Schools — plans to release a report Friday titled “Police in Schools Are Not the Answer to the Newtown Shooting.”"
        },
        {
            "id": 38,
            "text": "“What seems like a rational solution of let’s have more security in our schools is really the NRA argument — that you fight guns with guns,” said Judith Browne Dianis, co-director of the Advancement Project."
        },
        {
            "id": 39,
            "text": "“The introduction of police officers into schools has detrimental impact on young people.”"
        },
        {
            "id": 40,
            "text": ""
        }
    ]
}