{
    "title": "Labor Department Expected to Make Millions More Eligible for Overtime",
    "text": [
        {
            "id": 0,
            "text": "Millions more Americans who work in excess of 40 hours a week will qualify for overtime pay under a proposed rule the Labor Department is expected to unveil this week—a signature White House initiative aimed at strengthening the middle class and tackling income inequality."
        },
        {
            "id": 1,
            "text": "The agency is proposing to raise to $970 a week the salary threshold that generally determines who is eligible for overtime pay, according to sources familiar with the administration’s plans."
        },
        {
            "id": 2,
            "text": "The increase more than doubles the current threshold of $455 a week."
        },
        {
            "id": 3,
            "text": "Under existing federal rules last updated in 2004, workers who are paid by the hour or earn a salary of less than the threshold generally are eligible for overtime pay, while those with salaries of at least that amount who work in white-collar jobs generally aren’t."
        },
        {
            "id": 4,
            "text": "Read More on Capital Journal Capital Journal is WSJ.com’s home for politics, policy and national security news."
        },
        {
            "id": 5,
            "text": "The new rule would extend overtime protection to about five million workers, a person familiar with details of the plan said."
        },
        {
            "id": 6,
            "text": "The Obama administration has said raising the salary threshold will help address the erosion of long-standing rules that have left millions working overtime without added compensation."
        },
        {
            "id": 7,
            "text": "When President Barack Obama issued his executive order for the rule last year, the White House said 12% of salaried workers were below the current threshold, compared with 18% in 2004 and 65% in 1975."
        },
        {
            "id": 8,
            "text": "The threshold rarely has been raised in recent decades, but that would change under the proposed rule."
        },
        {
            "id": 9,
            "text": "The level would be tied either to wage growth or inflation to ensure the threshold’s buying power doesn’t erode in time."
        },
        {
            "id": 10,
            "text": "“Right now, too many Americans are working long days for less pay than they deserve,” Mr. Obama wrote in an op-ed published Monday on the Huffington Post."
        },
        {
            "id": 11,
            "text": "He blamed a failure to update overtime regulations for years and the exemption aimed at well-paid, white-collar employees that excludes workers making as little as $23,660 a year."
        },
        {
            "id": 12,
            "text": "Mr. Obama said his plan to extend protections to salaried workers earning up to about $50,400 is “good for workers who want fair pay, and it’s good for business owners who are already paying their employees what they deserve—since those who are doing right by their employees are undercut by competitors who aren’t.”"
        },
        {
            "id": 13,
            "text": "Mr. Obama is expected to discuss the rule Thursday at an event in Wisconsin."
        },
        {
            "id": 14,
            "text": "Release of the proposed rule will begin a comment period expected to last months."
        },
        {
            "id": 15,
            "text": "The Labor Department’s proposal isn’t expected to alter which white-collar job duties exempt some employees from receiving overtime."
        },
        {
            "id": 16,
            "text": "Some in the restaurant industry, in particular, were concerned that the new rules would require them to track when workers were performing supervisory tasks, such as setting schedules, and when they were performing tasks typically handled by hourly workers, such as running a cash register."
        },
        {
            "id": 17,
            "text": "Still, the proposal is expected to pit the administration against business groups."
        },
        {
            "id": 18,
            "text": "Republicans and some economists have been warning that updating the rule could impede job growth in the slowly expanding economy."
        },
        {
            "id": 19,
            "text": "For months, critics have argued that the pending regulatory changes, which won’t require congressional approval, would spur employers to circumvent the rules to control costs."
        },
        {
            "id": 20,
            "text": "That could include scaling back salaried workers who become newly eligible for overtime pay under the rule to hourly positions limited to 40 hours a week of work."
        },
        {
            "id": 21,
            "text": "It also could result in businesses reducing employees’ hours or shifting certain lower-level duties to higher-level managers who are exempt from overtime rules."
        },
        {
            "id": 22,
            "text": "“The rules are going to force more people into part-time work, and we’re already seeing that with Obamacare,” said Scott Gittrich, the founder and president of Toppers Pizza Inc. in Whitewater, Wis."
        },
        {
            "id": 23,
            "text": "He said he would adjust employees’ schedules and base-wages to avoid spending more on labor under the new rule."
        },
        {
            "id": 24,
            "text": "White Castle System Inc., a hamburger chain with about 400 general managers who earn annual salaries of $45,000 to $54,000 and don’t qualify for overtime pay, had estimated it would cost the company between $8 million and $12 million a year to compensate the managers for the overtime they work, said Jamie Richardson, a vice president of the Columbus, Ohio, company."
        },
        {
            "id": 25,
            "text": "Months of speculation about what the proposal would contain set off a national debate about what the appropriate salary threshold should be."
        },
        {
            "id": 26,
            "text": "Raising it to about $50,000 would bring the threshold roughly in line with the 1975 level on inflation-adjusted terms."
        },
        {
            "id": 27,
            "text": "Left-leaning groups such as the Economic Policy Institute had called for increasing the threshold to about that amount."
        },
        {
            "id": 28,
            "text": "In a recent paper, the EPI said Americans’ paychecks aren’t keeping pace with their productivity in part because middle- and lower-class workers are logging long hours but not getting overtime pay."
        },
        {
            "id": 29,
            "text": "Labor unions also have called for rules to be updated."
        },
        {
            "id": 30,
            "text": "“This will begin a critical process to take real action that will provide a much-needed boost to America’s workers and our economy as a whole,” the AFL-CIO union federation said in a recent statement."
        },
        {
            "id": 31,
            "text": "But right-leaning groups caution that doubling the threshold would be excessive."
        },
        {
            "id": 32,
            "text": "“The new rules will guarantee that millions of workers will lose jobs and wages to make sure that the government can transfer a politically-motivated payoff” to a few million workers, said Doug Holtz-Eakin, economist and president of the right-leaning American Action Forum."
        },
        {
            "id": 33,
            "text": "The overtime rules are a result of the Fair Labor Standards Act of the 1930s."
        },
        {
            "id": 34,
            "text": "That law established the 40-hour workweek and rules to provide employees with a minimum wage and one-and-half-times their regular rate of pay for working overtime."
        },
        {
            "id": 35,
            "text": ""
        },
        {
            "id": 36,
            "text": ""
        },
        {
            "id": 37,
            "text": ""
        },
        {
            "id": 38,
            "text": ""
        }
    ]
}