{
    "title": "Eric Holder: Attorney General for life?",
    "text": [
        {
            "id": 0,
            "text": "Holder delivers remarks about the shooting of two police officers in Ferguson, Missouri, at the Department of Justice in Washington on Thursday, March 12."
        },
        {
            "id": 1,
            "text": "Holder and his wife, Sharon Malone, look on as artist Simmie Knox unveils Holder's official portrait during a ceremony at the Justice Department in Washington on Friday, February 27."
        },
        {
            "id": 2,
            "text": "Holder testifies at a Senate Judiciary Committee hearing on Thursday, January 29, on oversight of the Justice Department and reform of government surveillance programs."
        },
        {
            "id": 3,
            "text": "Holder wipes away tears in September 2014 as his resignation is announced by President Barack Obama in Washington."
        },
        {
            "id": 4,
            "text": "Holder, who led the Department of Justice for six years, stayed in the position until his replacement, Loretta Lynch, was confirmed."
        },
        {
            "id": 5,
            "text": "Holder talks with Capt."
        },
        {
            "id": 6,
            "text": "Ron Johnson of the Missouri State Highway Patrol in Ferguson, Missouri, in August 2014."
        },
        {
            "id": 7,
            "text": "Holder traveled to Ferguson to oversee the federal government's investigation into a police officer's shooting of 18-year-old Michael Brown."
        },
        {
            "id": 8,
            "text": "Holder leaves after speaking of his disappointment in a Supreme Court ruling that declared a key part of the Voting Rights Act unconstitutional in June 2013."
        },
        {
            "id": 9,
            "text": "Holder takes questions at a news conference in May 2013."
        },
        {
            "id": 10,
            "text": "He said he recused himself from a national security leak investigation in which prosecutors obtained the phone records of Associated Press journalists."
        },
        {
            "id": 11,
            "text": "Holder talks to reporters after meeting with U.S. Rep. Darrell Issa, chairman of the House Oversight and Government Reform Committee, in June 2012."
        },
        {
            "id": 12,
            "text": "Issa and Holder met to discuss releasing documents related to the botched Fast and Furious investigation."
        },
        {
            "id": 13,
            "text": "Holder answers a student's question after a speech commemorating the 100th anniversary of the Duquesne University School of Law in February 2011."
        },
        {
            "id": 14,
            "text": "Holder is greeted by members of Congress as he arrives at the U.S. House of Representatives in May 2010."
        },
        {
            "id": 15,
            "text": "Holder announces in November 2009 that five men accused of the September 11 terror attacks would be tried in a New York civilian court."
        },
        {
            "id": 16,
            "text": "He said the government would seek the death penalty against Khalid Sheikh Mohammed and four others."
        },
        {
            "id": 17,
            "text": "Holder is sworn in as attorney general by Vice President Joe Biden in February 2009."
        },
        {
            "id": 18,
            "text": "Holder's wife, Dr. Sharon Malone, is by his side."
        },
        {
            "id": 19,
            "text": "Holder walks with Caroline Kennedy, daughter of former President John F. Kennedy, in June 2008 after they were tasked with searching for a running mate for then-Sen. Barack Obama."
        },
        {
            "id": 20,
            "text": "Holder shakes hands with then-President Bill Clinton as Attorney General Janet Reno, Holder's boss, looks on at an American Bar Association event at the White House in 1999."
        },
        {
            "id": 21,
            "text": "Holder talks with his father, Eric Holder Sr., after being sworn in as the U.S. attorney for the District of Columbia in 1993."
        },
        {
            "id": 22,
            "text": "U.S. Attorney General Eric Holder attends a meeting with the My Brother's Keeper Task Force to receive a 90-day report on its progress in the Roosevelt Room of the White House in May 2014."
        },
        {
            "id": 23,
            "text": "Holder's resignation was announced in September 2014, but his replacement, Loretta Lynch, was not confirmed by the Senate until April 23, 2015."
        },
        {
            "id": 24,
            "text": "Washington CNN —\n\nThere was a time when Republicans were eager to have Eric Holder gone from the Justice Department."
        },
        {
            "id": 25,
            "text": "That time isn’t now."
        },
        {
            "id": 26,
            "text": "GOP lawmakers began calling for the attorney general’s resignation as early as 2011, and they even held him in contempt of Congress a year later."
        },
        {
            "id": 27,
            "text": "Nowadays the issue keeping Holder in office has nothing to do with him, or Loretta Lynch, the Brooklyn U.S. attorney President Barack Obama picked to succeed him."
        },
        {
            "id": 28,
            "text": "Instead it’s a partisan fight over an abortion measure that is tucked into legislation aimed to thwart human trafficking."
        },
        {
            "id": 29,
            "text": "It’s a bill that – absent the abortion add-on – enjoys overwhelming bipartisan support."
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": "Republicans say they won’t vote on Lynch’s nomination unless Democrats yield on the unrelated bill."
        },
        {
            "id": 32,
            "text": "Some Democrats appear to relish that the fight is showing Republicans the minority party still has power."
        },
        {
            "id": 33,
            "text": "“These should be my closing days,” Holder joked in a speech in recent days."
        },
        {
            "id": 34,
            "text": "“Given the Senate’s delays in scheduling Loretta Lynch’s nomination for a vote, it’s almost as if the Republicans in Congress have discovered a new fondness for me."
        },
        {
            "id": 35,
            "text": "Where was all this affection the last six years?”"
        },
        {
            "id": 36,
            "text": "As he nears the expected end of this tenure, Holder appears to be leaving with negative favorability ratings – among those who know who he is, according to a new CNN/ORC poll."
        },
        {
            "id": 37,
            "text": "Overall, 29% of Americans polled have a favorable impression of him, while 35% have an unfavorable view, and 36% still haven’t heard of him."
        },
        {
            "id": 38,
            "text": "By now, Holder had hoped to be completing his plans for a cross-country driving trip with a friend – a longtime wish for when he left office, he told CNN in an interview last year."
        },
        {
            "id": 39,
            "text": "The fight already has forced lawmakers to postpone hearings for the Justice Department budget, which had been penciled in to begin this week, according to a Justice Department official."
        },
        {
            "id": 40,
            "text": "Postponing those hearings is probably not a bad thing given the contentious tone between Republicans and the attorney general in oversight hearings last fall, which everyone thought would be Holder’s last appearance on Capitol Hill."
        },
        {
            "id": 41,
            "text": "The White House says Holder’s stay is indefinite."
        },
        {
            "id": 42,
            "text": "A Republican congressional aide says the irony that the current fight is keeping Holder around much longer than GOP lawmakers want has come up in meetings among Republican Senators."
        },
        {
            "id": 43,
            "text": "But the stalemate continues."
        },
        {
            "id": 44,
            "text": "Over the past six years, Republicans often used Holder as a stand-in for the President in fights over everything from national security to gun rights."
        },
        {
            "id": 45,
            "text": "They made Holder the first sitting cabinet member to be held in contempt of Congress, in a fight over administration records related to a botched gun investigation known as Fast and Furious."
        },
        {
            "id": 46,
            "text": "In February, when the Senate Judiciary Committee voted to approve Lynch, Sen. Lindsey Graham told Lynch he was eager to see Holder go."
        },
        {
            "id": 47,
            "text": "“Eric Holder is ready to go, and I wish him well,” Graham joked."
        },
        {
            "id": 48,
            "text": "In a city where the late Marion Barry hung around long enough to become known as mayor for life, Holder is beginning to throw playful jabs at the fact that every day he is climbing the chart for longest-serving attorneys general."
        },
        {
            "id": 49,
            "text": "When Lynch’s nomination was announced more than 130 days ago, Holder was No. 4."
        },
        {
            "id": 50,
            "text": "Now he has surpassed Homer Cummings, who served in Franklin Roosevelt’s administration, to become the third-longest serving."
        },
        {
            "id": 51,
            "text": "He has some ways to go before reaching Janet Reno, who served eight years, with Holder as her deputy."
        },
        {
            "id": 52,
            "text": "Sen. Patrick Leahy recently excoriated Republicans for delaying what would be a historic first: the first African American woman attorney general."
        },
        {
            "id": 53,
            "text": "He noted Lynch has already waited longer than the five previous attorneys general, combined."
        },
        {
            "id": 54,
            "text": "By Monday that wait would become longer than the seven previous leaders of the Justice Department, a Leahy spokeswoman says."
        },
        {
            "id": 55,
            "text": "When the stalemate ends, Lynch is expected to win Senate approval by a narrow margin."
        },
        {
            "id": 56,
            "text": ""
        },
        {
            "id": 57,
            "text": "McCain to Durbin: Apologize for Lynch ‘back of the bus’ comments"
        },
        {
            "id": 58,
            "text": "The Justice Department held a tearful farewell party for Holder last month, with a surprise performance by Aretha Franklin."
        },
        {
            "id": 59,
            "text": "The week after the party, Holder held a meeting with aides and asked for an update on Lynch’s nomination, according to a person familiar with the meeting."
        },
        {
            "id": 60,
            "text": "No vote was forthcoming that week, came the answer from Peter Kadzik, who heads the Justice Department’s office of legislative affairs."
        },
        {
            "id": 61,
            "text": "Maybe there’s time for a second farewell party, the attorney general mused."
        },
        {
            "id": 62,
            "text": "This time with Beyonce as the surprise guest."
        }
    ]
}