{
    "title": "Broward County election supervisor at center of Florida recount battle resigns",
    "text": [
        {
            "id": 0,
            "text": "The Florida county election chief who came under considerable fire for incompetence and possible corruption during this month’s recount battles reportedly resigned Sunday."
        },
        {
            "id": 1,
            "text": "Brenda Snipes, the election supervisor for heavily Democratic Broward County, submitted her resignations just hours after submitting final, contentious tallies in the state’s governor and U.S. Senate races, both of which Republicans won by razor-thin margins."
        },
        {
            "id": 2,
            "text": "“It is true."
        },
        {
            "id": 3,
            "text": "She did send it,” Burnadette Norris-Weeks, an attorney who works as a counsel to the Supervisor of Elections Office, told the South Florida Sun-Sentinel."
        },
        {
            "id": 4,
            "text": "According to Ms. Norris-Weeks’s knowledge of an early draft of the letter, Ms. Snipes told officials in the state capital of Tallahassee that she wanted to spend more time with her family."
        },
        {
            "id": 5,
            "text": "Broward County was the slowest of Florida’s major counties to complete election returns, missing several legally-mandated deadlines and losing about 2,000 ballots that had been included in the election-night count but not in the machine recount."
        },
        {
            "id": 6,
            "text": "Republicans from former Gov. Jeb Bush, who appointed her in 2003, to Sen. Marco Rubio and Gov. Rick Scott, had all called for her resignation."
        },
        {
            "id": 7,
            "text": "Some Republicans said the heavily-Democratic county was dragging its feet and mishandling ballots in order to “find” enough votes to elect the two Democrats — Sen. Bill Nelson and gubernatorial hopeful Andrew Gillum, both of whom lost by fractions of one percentage point."
        },
        {
            "id": 8,
            "text": "According to the Sun-Sentinel, it’s not clear when the resignation would take effect, but the letter was sent within hours of the county submitting its mandated recount totals — after the deadline."
        },
        {
            "id": 9,
            "text": "The recounts did not produce the kind of numbers the Democrats had hoped and by Sunday evening, Mr. Nelson had joined Mr. Gillum in conceding defeat."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}