{
    "title": "Obama campaign claims lead on early vote indicators ",
    "text": [
        {
            "id": 0,
            "text": "Led by a surge in Hispanic voters, President Obama’s campaign said Thursday that Democrats are leading the party registration fight in nearly every battleground state this fall as campaign officials try to combat disillusionment among Democrats after last week’s presidential debate."
        },
        {
            "id": 1,
            "text": "The Obama campaign also said that with the exception of Colorado, Democrats are doing better this year than in 2008 in every battleground state that allows voting by mail."
        },
        {
            "id": 2,
            "text": "“At this point in 2008, Republicans had an absentee-ballot-request advantage of 259,000 ballot requests in Colorado, Florida, Iowa, North Carolina and Nevada."
        },
        {
            "id": 3,
            "text": "In 2012, Democrats have cut that margin by 75 percent to just 64,000,” Jeremy Bird, the Obama campaign’s national field director, said in a memo Thursday."
        },
        {
            "id": 4,
            "text": "In 2008, Mr. Obama wound up sweeping those five states."
        },
        {
            "id": 5,
            "text": "Mr. Bird said new voter registration since Aug. 1 has overwhelmingly come in demographics favorable to Democrats, including women, those under 30 and minorities."
        },
        {
            "id": 6,
            "text": "In Pennsylvania, for example, 67 percent of new registrants were under age 30, and 22 percent were women or minorities over that age."
        },
        {
            "id": 7,
            "text": "In Florida, Hispanics have accounted for all of the growth in voter registration."
        },
        {
            "id": 8,
            "text": "But Republicans said last week’s debate energized their voters, who have been signing up to volunteer with the campaign and are now more energized."
        },
        {
            "id": 9,
            "text": "They also said that, in some of the biggest counties in Ohio, registered Republicans generally make up less than a quarter of voters but are accounting for as much as 45 percent of absentee ballots and early votes."
        },
        {
            "id": 10,
            "text": "“Our early vote numbers are outperforming voter registration in battleground states, demonstrating the strength of our ground game and the excitement for the Romney/Ryan ticket,” said Rich Beeson, the campaign’s political director."
        },
        {
            "id": 11,
            "text": "“Not only are we keeping pace with the vaunted Obama machine, but we believe our ground game will put us over the finish line on Election Day.”"
        },
        {
            "id": 12,
            "text": "Talking with reporters Thursday afternoon, Jim Messina, manager of the Obama campaign, said his team has a number of different paths to win the 270 electoral votes needed to win the White House, and said, thanks to last month’s huge fundraising number, it doesn’t have to withdraw from any state it is now contesting."
        },
        {
            "id": 13,
            "text": "“We have the ability financially to compete wherever we want to compete, and that’s what we’re going to do,” he said."
        },
        {
            "id": 14,
            "text": "Meanwhile, new research shows that despite a closely contested Republican primary earlier this year, turnout for presidential and Senate primaries was the lowest on record, with just 15.9 percent of eligible citizens voting."
        },
        {
            "id": 15,
            "text": "“Turnout reached record lows for presidential election years in 15 of 41 states which held statewide primaries in both parties,” said the report by the Center for the Study of the American Electorate."
        },
        {
            "id": 16,
            "text": "“Democratic turnout dropped to record lows in 26 of 41 primaries."
        },
        {
            "id": 17,
            "text": "In the 46 states where Republican primaries were held, there were eight record lows and three record highs.”"
        },
        {
            "id": 18,
            "text": "The findings run counter to the common-sense notion that a close election means high turnout."
        },
        {
            "id": 19,
            "text": "Curtis Gans, the center’s director, said the November election has the potential to be akin to the 1948 race, a very close race in which Harry Truman “slipped back into office in the second-lowest-turnout contest since women were given the vote in 1920.”"
        }
    ]
}