{
    "title": "Biden to mark Labor Day with union event as U.S. campaign enters homestretch",
    "text": [
        {
            "id": 0,
            "text": "LANCASTER, Pa./WASHINGTON (Reuters) - President Donald Trump and Democratic rival Joe Biden took rhetorical swipes at each other on Monday as the presidential campaign entered its traditional homestretch on the U.S. Labor Day holiday."
        },
        {
            "id": 1,
            "text": "Trump described Biden, whom he trails in national polls, as a threat to the economy and “stupid,” while Biden took aim at Trump’s reported disparaging of fallen troops."
        },
        {
            "id": 2,
            "text": "At a White House news conference, Trump said: “Biden and his very liberal running mate (Kamala Harris), the most liberal person in Congress by the way - is not a competent person in my opinion, would destroy this country and would destroy this economy.”"
        },
        {
            "id": 3,
            "text": "He also called Biden “stupid.”"
        },
        {
            "id": 4,
            "text": "Trump has frequently referred to the former vice president as “Sleepy Joe.”"
        },
        {
            "id": 5,
            "text": "Trump pushed back again against a report in The Atlantic that he had referred to fallen U.S. soldiers as “suckers” and “losers,” calling it “a hoax.”"
        },
        {
            "id": 6,
            "text": "The story has dominated news coverage for days and threatens Trump’s support among veterans and military members, a key voting bloc."
        },
        {
            "id": 7,
            "text": "“There’s nobody that has more respect for not only our military, but for people that gave their lives in the military,” Trump said."
        },
        {
            "id": 8,
            "text": "Biden cited the reported remarks while campaigning in the electoral battleground state of Pennsylvania."
        },
        {
            "id": 9,
            "text": "Referring to his son Beau Biden, who served in Iraq as a member of the Delaware National Guard and died of brain cancer in 2015, he said: “Beau was wasn’t a loser or a sucker. ..."
        },
        {
            "id": 10,
            "text": "He served with heroes.”"
        },
        {
            "id": 11,
            "text": "Biden’s visit to Pennsylvania on Monday kicked off a flurry of travel to battleground states this week by both Biden and Trump as some opinion polls show the race tightening with less than 60 days to go until the Nov. 3 election."
        },
        {
            "id": 12,
            "text": "With the coronavirus pandemic and civil unrest over racism and police brutality commanding attention in recent months, Biden is seeking to maintain his edge by painting the Republican president as an ineffectual leader who thrives on chaos and has left the working class behind."
        },
        {
            "id": 13,
            "text": "Trump has struggled to change the contours of the campaign despite highly charged rhetoric on racial polarization and “law and order” intended to motivate his base and draw new supporters in suburban parts of key swing states, such as Pennsylvania, Wisconsin and Michigan."
        },
        {
            "id": 14,
            "text": "LABOR ENDORSEMENTS"
        },
        {
            "id": 15,
            "text": "Biden met with union leaders in Harrisburg, the Pennsylvania capital, and spoke virtually with the leader of the largest federation of U.S. labor unions, AFL-CIO President Richard Trumka."
        },
        {
            "id": 16,
            "text": "He also took questions from union workers and met earlier in the day with union members who served in the U.S. military."
        },
        {
            "id": 17,
            "text": "Biden’s campaign also announced the endorsements of three unions: the Laborers’ International Union of North America, the International Union of Elevator Constructors and the National Federation of Federal Employees."
        },
        {
            "id": 18,
            "text": "Biden promised to be the “strongest labor president” in the history of the country, vowing to hold executives legally accountable if they interfere with union organizing, and to raise the minimum wage and strengthen the National Labor Relations Board."
        },
        {
            "id": 19,
            "text": "“Folks have figured out that it’s not the financial wizards of Wall Street that make this country run."
        },
        {
            "id": 20,
            "text": "It’s you, the essential workers,” Biden said during the virtual event with Trumka."
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": "Trump said that if Biden were elected, the Democrat would mandate another economic shutdown to deal with the coronavirus pandemic."
        },
        {
            "id": 23,
            "text": "“Biden’s plan for the China virus is to shut down the entire U.S. economy,” Trump said."
        },
        {
            "id": 24,
            "text": "“He’d be laying off tens of millions of workers and causing countless deaths from suicide, substance abuse, depression, heart disease and other very serious illnesses.”"
        },
        {
            "id": 25,
            "text": "Trump plans to visit North Carolina, Florida, Michigan and Pennsylvania later in the week, all considered crucial to both candidates’ chances of victory."
        },
        {
            "id": 26,
            "text": "Polls in Pennsylvania, which Trump won narrowly in 2016, have consistently put Biden in the lead, but averages show that margin narrowing to roughly 4 to 5 percentage points, down from about 8 points in late June."
        },
        {
            "id": 27,
            "text": "Biden is scheduled to be back in Pennsylvania on Friday."
        }
    ]
}