{
    "title": "34 U.S. troops suffered brain injuries in Iranian attack, Pentagon says",
    "text": [
        {
            "id": 0,
            "text": "Thirty-four U.S. troops suffered traumatic brain injuries as a result of the Jan. 8 Iranian ballistic missile attack on an American military base in Iraq, Pentagon officials said Friday, revealing that many more service members were affected by the strike than initially reported."
        },
        {
            "id": 1,
            "text": "Pentagon spokesman Jonathan Hoffman told reporters that 17 of the 34 troops remain under medical observation."
        },
        {
            "id": 2,
            "text": "The attack on Al Asad Air Base came amid high tensions between the U.S. and Iran, though President Trump ultimately decided against direct military retaliation after the attack."
        },
        {
            "id": 3,
            "text": "The Iranian attack came just days after a U.S. airstrike killed top Iranian Gen. Qassem Soleimani."
        },
        {
            "id": 4,
            "text": "Both Mr. Trump and military officials initially said there had been no major injuries as a result of the assault."
        },
        {
            "id": 5,
            "text": "But on Jan. 17, the Pentagon revealed that 11 service members were treated for concussion symptoms in the days following the attack."
        },
        {
            "id": 6,
            "text": "Friday’s comments from Pentagon officials confirm that the actual number was much higher."
        },
        {
            "id": 7,
            "text": "The president earlier this week downplayed the injuries."
        },
        {
            "id": 8,
            "text": "“I heard that they had headaches and a couple of other things, but I would say, and I can report, it is not very serious,” Mr. Trump said during a press conference at an economic forum in Switzerland."
        },
        {
            "id": 9,
            "text": "• This article is based in part on wire service reports."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}