{
    "title": "Obama’s year of the veto",
    "text": [
        {
            "id": 0,
            "text": "President Barack Obama’s Keystone veto threat Tuesday was the opening gambit in his fight with the new Republican majorities in Congress looking to derail his post-midterm momentum."
        },
        {
            "id": 1,
            "text": "Worried White House aides spent the last few weeks working behind the scenes to make sure they had the votes to sustain a veto, rounding up enough Democrats willing to stand behind their lame-duck president and prevent him from being humiliated by an override."
        },
        {
            "id": 2,
            "text": "White House press secretary Josh Earnest’s waiting only for the initial text of the bill approving the massive oil pipeline reflected confidence that they’d won this round."
        },
        {
            "id": 3,
            "text": "A veto would come with political complications for Obama."
        },
        {
            "id": 4,
            "text": "Republicans are already pointing to the threat as more evidence of their narrative that he’s a dictatorial president who refuses to listen, even on an issue that has enormous support in public opinion polls."
        },
        {
            "id": 5,
            "text": "Supportive Democrats, though, say they’re eager to see the president dig in and concentrate more on fighting than compromising."
        },
        {
            "id": 6,
            "text": "Senate Majority Leader Mitch McConnell’s (R-Ky.) setting Keystone as the first order of business for the new session, with fast passage through the House expected Friday, was part of a GOP attempt to undercut Obama quickly, and devastatingly, even before he got to his State of the Union address: He’d either have to concede on approving a project he has resisted and his base hates, or kick off his promised era of bipartisan cooperation with what would be only his third veto ever."
        },
        {
            "id": 7,
            "text": "Without Senate Democrats in place to block bills from getting to the president’s desk, vetoes are expected to be a major element of the next two years on issues from Obamacare to environmental regulations to new Iran sanctions."
        },
        {
            "id": 8,
            "text": "Tuesday’s action doesn’t mean Keystone won’t eventually be approved, perhaps in another form, or as part of a larger deal."
        },
        {
            "id": 9,
            "text": "But already, Earnest was hinting at a back-up plan that could keep construction from starting while Obama’s in office: A Nebraska court is still deliberating on the final proposed route for the pipeline, and Earnest said Tuesday that the State Department review process, already used to delay construction, could begin anew then."
        },
        {
            "id": 10,
            "text": "For now, though, the GOP Keystone gambit appears to have failed — though Senate Democrats admit they’re not done counting votes, especially with amendments pending."
        },
        {
            "id": 11,
            "text": "“We have not whipped, and I can’t say with any certainty until we do,” said Sen. Dick Durbin (D-Ill.), who’s doing double duty as whip and acting minority leader while Sen. Harry Reid (D-Nev.) recuperates from injuries sustained while exercising at home last week."
        },
        {
            "id": 12,
            "text": "Republicans, though, think they’ll benefit from the veto threat alone, given the issue’s popularity according to opinion polls."
        },
        {
            "id": 13,
            "text": "The threat “must come as a shock to the American people who spoke loudly in November in favor of bipartisan accomplishments,” McConnell said in a statement Tuesday afternoon, while House Speaker John Boehner (R-Ohio) said Obama is siding with “fringe extremists” in the party."
        },
        {
            "id": 14,
            "text": "But GOP leaders finished Tuesday bearish on their chances."
        },
        {
            "id": 15,
            "text": "“I wouldn’t think we’d get 67 votes to pass this."
        },
        {
            "id": 16,
            "text": "And it’s hard to imagine you’d have people vote to override the veto that didn’t vote for the bill originally,” said Sen. Roy Blunt (R-Mo.), a member of Senate leadership."
        },
        {
            "id": 17,
            "text": "“It may be an example that in the president’s view, his extreme environmental supporters are more important to him than his labor supporters.”"
        },
        {
            "id": 18,
            "text": "Go ahead and pass Keystone, Democratic consultant Steve Murphy warned Republicans, and go ahead and try to override a veto."
        },
        {
            "id": 19,
            "text": "Obama will look the better for it."
        },
        {
            "id": 20,
            "text": "“He’s being decisive and that’s what voters want to see from him,” Murphy said."
        },
        {
            "id": 21,
            "text": "“They should pay attention to the law of unintended consequences."
        },
        {
            "id": 22,
            "text": "It’s going to show him strongly standing up for something where he disagrees with the majority in Congress.”"
        },
        {
            "id": 23,
            "text": "“It’s important to take a stand,” said Sen. Tom Udall (D-N.M.) of Obama’s decision to come out against the pipeline."
        },
        {
            "id": 24,
            "text": "“It’s always better to come out early and signal where you are because then it lets everybody know exactly what’s going to happen."
        },
        {
            "id": 25,
            "text": "If you wait too long, people get committed.”"
        },
        {
            "id": 26,
            "text": "Obama and his aides are relying on math based on what happened when an identical bill went before Congress last year, but senators and aides said they don’t believe Democrats are inclined to shift."
        },
        {
            "id": 27,
            "text": "There appears little chance that 13 Senate Democrats will join with the 54-member Republican caucus to override an expected presidential veto."
        },
        {
            "id": 28,
            "text": "Fourteen Democratic senators supported approval of the pipeline in November when the political argument was the strongest: Sen. Mary Landrieu (D-La.) was desperate to show her congressional clout to save her reelection campaign."
        },
        {
            "id": 29,
            "text": "She and four other Keystone-supporting Democrats are gone, leaving just nine supporters of Keystone in the Democratic caucus."
        },
        {
            "id": 30,
            "text": "Along with the 54 Republicans, that’s four short of a veto override unless a number of Democrats have a surprise change of heart."
        },
        {
            "id": 31,
            "text": "In the House, 40 Democrats would have to back a historic Republican majority to override a veto."
        },
        {
            "id": 32,
            "text": "Thirty-one Democrats supported the pipeline last fall, including several retired or defeated moderate Democrats like Mike McIntyre of North Carolina, John Barrow of Georgia and Jim Matheson of Utah."
        },
        {
            "id": 33,
            "text": "That means Republicans and the White House would have to battle over a handful of centrist Democrats in both chambers if it came down to a veto fight."
        },
        {
            "id": 34,
            "text": "For now, Democrats are confident they can hold the line."
        },
        {
            "id": 35,
            "text": "“There’s support to sustain the veto,” said Sen. Ben Cardin (D-Md.)."
        },
        {
            "id": 36,
            "text": "“I believe in the House or Senate — or both — that we would trip it up.”"
        },
        {
            "id": 37,
            "text": "Many potential changes being discussed in the Senate could upend previous whip counts."
        },
        {
            "id": 38,
            "text": "In a letter sent to fellow Senate Democrats over the weekend, Sen. Chuck Schumer (D-N.Y.) and Sen. Debbie Stabenow (D-Mich.) wrote of forcing the GOP into taking positions on Democratic proposals that they believe could hurt Republicans politically."
        },
        {
            "id": 39,
            "text": "Schumer’s now the point man on Democratic amendments to the Keystone bill that he argues will truly make it a jobs bill — requiring the pipeline to be built with American steel, banning the export of the oil outside the U.S., enacting investment in solar power, prevent states from allowing foreign companies to seize land via eminent domain and boosting spending on energy programs for low-income people."
        },
        {
            "id": 40,
            "text": "If any of Schumer’s amendments — which Republicans do not believe will be approved — were attached to the bill, GOP support could decrease."
        },
        {
            "id": 41,
            "text": "Alternatively, if Sen. Rob Portman (R-Ohio) and Sen. Jeanne Shaheen (D-N.H.) are able to attach their bipartisan energy efficiency legislation, Keystone’s bipartisan credibility would surge, complicating both an Obama veto and Democratic support for sustaining one."
        },
        {
            "id": 42,
            "text": "Stabenow expressed confidence Tuesday in Democrats’ ability to sustain a veto, but added a caveat: “If suddenly they wanted to do a totally different energy package, that’s the only caveat."
        },
        {
            "id": 43,
            "text": "If we were talking about long-term clean energy tax credits and things that actually really did create long-term jobs, that would be different.”"
        },
        {
            "id": 44,
            "text": "Earnest and other Democrats used the still-falling price of oil to justify the president’s continued opposition to Keystone, leading to Republican charges of politically motivated shortsightedness."
        },
        {
            "id": 45,
            "text": "“What goes up must come down, and vice versa,” said North Carolina Gov. Pat McCrory, quoting the band Blood, Sweat and Tears as he walked out of an Oval Office meeting with Obama."
        },
        {
            "id": 46,
            "text": "“That’s what’s going to happen with oil."
        },
        {
            "id": 47,
            "text": "It’s not if, but when.”"
        }
    ]
}