{
    "title": "Barack Obama attacks Trump administration's response to coronavirus pandemic",
    "text": [
        {
            "id": 0,
            "text": "Barack Obama has attacked the Trump administration’s response to the Covid-19 pandemic during speeches to graduating students."
        },
        {
            "id": 1,
            "text": "The comments on Saturday were a rare rebuke of a sitting president from one of his predecessors, and come in the midst of the coronavirus pandemic that has killed more than 88,000 people in the United States, a death toll far higher than any other country, and had devastating and disproportionate effects on communities of color."
        },
        {
            "id": 2,
            "text": "“More than anything, this pandemic has fully, finally torn back the curtain on the idea that so many of the folks in charge know what they’re doing."
        },
        {
            "id": 3,
            "text": "A lot of them aren’t even pretending to be in charge,” Obama said during an online commencement address to graduates of historically black colleges and universities (HBCUs) on Saturday."
        },
        {
            "id": 4,
            "text": "“Doing what feels good, what’s convenient, what’s easy — that’s how little kids think,” he said in a second virtual speech on Saturday evening for graduating US high school students."
        },
        {
            "id": 5,
            "text": "“Unfortunately, a lot of so-called grown-ups, including some with fancy titles and important jobs, still think that way — which is why things are so screwed up."
        },
        {
            "id": 6,
            "text": "“I hope that instead, you decide to ground yourself in values that last, like honesty, hard work, responsibility, fairness, generosity, respect for others.”"
        },
        {
            "id": 7,
            "text": "In an interview with ABC news, Peter Navarro, a top economic adviser to the president, said he was “glad Mr Obama has a new job as Joe Biden’s press secretary”."
        },
        {
            "id": 8,
            "text": "Biden, Obama’s former vice president, is running against Trump for president."
        },
        {
            "id": 9,
            "text": "The former president’s comments came amid dual crises – one a pandemic disproportionately sickening people of color in the US, and another born by the economic impacts of attempts to contain the virus through lockdowns."
        },
        {
            "id": 10,
            "text": "So far, there have been 1.4 million confirmed cases of Covid-19 in the US."
        },
        {
            "id": 11,
            "text": "“Let’s be honest, a disease like this just spotlights the underlying inequalities and extra burdens that black communities have historically had to deal with in this country,” said Obama in the HBCU speech."
        },
        {
            "id": 12,
            "text": "“We see it in the disproportionate impact of Covid-19 on our communities.”"
        },
        {
            "id": 13,
            "text": "Those crises, as well as the high-profile killings of black people by police, loomed large in the virtual event, itself necessitated by the shutdown of large gatherings to stem the spread of the disease."
        },
        {
            "id": 14,
            "text": "“These aren’t normal times."
        },
        {
            "id": 15,
            "text": "You’re being asked to find your way in a world in the middle of a devastating pandemic and a terrible recession,” said Obama."
        },
        {
            "id": 16,
            "text": "He added that the injustices faced by African Americans are not new, and described the recent high-profile killing of Ahmaud Arbery, an unarmed black jogger who was shot and killed after being pursued in broad daylight by a white former police officer and his son through a neighborhood in Georgia."
        },
        {
            "id": 17,
            "text": "“We see it when a black man goes for a jog and some folks feel like they can stop and question and shoot him, if he doesn’t submit to their questioning,” said Obama."
        },
        {
            "id": 18,
            "text": "Congrats to the high school Class of 2020, as well as to the teachers, coaches, and most of all, parents and family who’ve guided you along the way."
        },
        {
            "id": 19,
            "text": "Thanks for letting me be part of your big day!"
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "May 17, 2020"
        },
        {
            "id": 22,
            "text": "He went on to use the circumstances of the online graduation as a rallying cry for new graduates: “If the world’s going to get better, it’s going to be up to you.”"
        },
        {
            "id": 23,
            "text": "Although Obama has largely avoided criticizing Trump’s performance in office, in a call leaked last week the former president described the US government’s coronavirus response as, “an absolute chaotic disaster,” and questioned whether the justice department’s decision to drop charges against former national security advisor Michael Flynn could endanger the “rule of law” in the United States."
        },
        {
            "id": 24,
            "text": "The remarks prompted the US Senate majority leader, Mitch McConnell, to tell the former president to “keep his mouth shut”."
        },
        {
            "id": 25,
            "text": "The week also saw the emergence of #Obamagate, a conspiracy theory pushed by the president that accuses Obama of attempting to frame Trump for colluding with Russia to win the 2016 election."
        },
        {
            "id": 26,
            "text": "One former CIA analyst described as “a hashtag in search of a scandal”."
        },
        {
            "id": 27,
            "text": "Obama’s remarks were preceded by speeches and performances by musicians, actors and entertainers such as Steve Harvey, Anthony Hamilton, Doug E Fresh, Wyclef Jean, Common, Kevin Hart, Wendy Raquel Robinson and Vivica A Fox."
        },
        {
            "id": 28,
            "text": "Messages to graduates tuning in online because they could not hold traditional celebrations on campus were shot through with acknowledgements of America’s history of racial segregation."
        },
        {
            "id": 29,
            "text": "This, speakers said, made the universities essential, while noting the perseverance required to spend a final semester largely online, and the bittersweetness of the moment itself."
        },
        {
            "id": 30,
            "text": "“This is obviously not the way you wanted to graduate, we get that,” said Doc Rivers, coach of the NBA’s Los Angeles Clippers, “But you know what else we know?"
        },
        {
            "id": 31,
            "text": "You’re going to make us all proud.”"
        },
        {
            "id": 32,
            "text": "Graduates, speakers said, would be sent out into an “uncertain world,” but one they had a chance to improve upon."
        },
        {
            "id": 33,
            "text": "“As graduates, you now join the ranks of national and world leaders, influencers,” said Senator Kamala Harris of California."
        },
        {
            "id": 34,
            "text": "“I know this is a trying time, but please do not let the moment of this crisis dampen your ambitions, your hopes or your dreams, because your country needs you,” said Harris."
        },
        {
            "id": 35,
            "text": "She attended the HBCU Howard, recently ran for the Democratic nomination and is a contender to become Joe Biden’s running mate in the 2020 election."
        }
    ]
}