{
    "title": "Biden vows recommendations by Tuesday on curbing gun violence ",
    "text": [
        {
            "id": 0,
            "text": "A federal task force looking for ways to curb gun violence will have a set of recommendations by Tuesday, Vice President Joe Biden announced Thursday."
        },
        {
            "id": 1,
            "text": "Speaking during a week of meetings with disparate groups on various sides of the issue – including some for and others against stricter gun controls – Biden, who oversees the task force, said the recommendations to be given to President Barack Obama will serve as a beginning."
        },
        {
            "id": 2,
            "text": "“This doesn’t mean it is the end of the discussion, but the public wants us to act,” he told reporters."
        },
        {
            "id": 3,
            "text": "Obama called for the task force after last month’s massacre in Newtown, Connecticut, in which 27 people were killed – 20 of them elementary school children."
        },
        {
            "id": 4,
            "text": "Biden said he’s been surprised by how many groups have encouraged universal background checks for all gun owners, including those who purchase through private sales."
        },
        {
            "id": 5,
            "text": "Some states have backlogs of thousands of felons who are never registered on lists aimed at helping prevent dangerous weapons from getting into their hands, he noted."
        },
        {
            "id": 6,
            "text": "The National Rifle Association said it was “disappointed” with a White House task force meeting Thursday, saying it expected mental health, the “marketing of violence to our kids” and school safety to be top topics."
        },
        {
            "id": 7,
            "text": "“We were disappointed with how little this meeting had to do with keeping our children safe and how much it had to do with an agenda to attack the Second Amendment,” the group said in a statement."
        },
        {
            "id": 8,
            "text": "“While claiming that no policy proposals would be prejudged, this task force spent most of its time on proposed restrictions on lawful firearms owners – honest, taxpaying, hardworking Americans.”"
        },
        {
            "id": 9,
            "text": "The group indicated it will now concentrate its efforts through members of Congress."
        },
        {
            "id": 10,
            "text": "NRA President David Keene told CNN’s"
        },
        {
            "id": 11,
            "text": "“The Situation Room with Wolf Blitzer” that little common ground was found."
        },
        {
            "id": 12,
            "text": "An exception was a possible agreement to place “potentially violent” mentally ill people on a national database of those not allowed to buy firearms, Keene said."
        },
        {
            "id": 13,
            "text": "Biden called it a complicated issue, emphasizing that there is “no singular solution to how we deal with” mass shootings."
        },
        {
            "id": 14,
            "text": "Many stakeholders in the issue have met with members of the task force, Biden said, including medical and religious groups, educators and parents."
        },
        {
            "id": 15,
            "text": "Concerns about mental health may be “one of the most important things that we’ve been focusing on,” he said."
        },
        {
            "id": 16,
            "text": "Biden also noted that many firearm deaths in the United States are suicides."
        },
        {
            "id": 17,
            "text": "Referring to one of the most contentious issues – whether to reinstate an assault weapons ban – Biden said he has never heard so much support for “the need to do something about high-capacity magazines.”"
        },
        {
            "id": 18,
            "text": "The task force also was meeting with members of the entertainment industry to discuss violence in movies and TV shows."
        },
        {
            "id": 19,
            "text": "Obama has spoken out about a culture that often “glorifies guns and violence.”"
        },
        {
            "id": 20,
            "text": "Dan Glickman, a former congressman and onetime head of the Motion Picture Association of America, rejects suggestions of links between films and real-life violence."
        },
        {
            "id": 21,
            "text": "“I don’t think the abundance of movies that are put out by the entertainment industry are that violent or cause violence,” he told CNN on Thursday."
        },
        {
            "id": 22,
            "text": "Also, Glickman said, “Hollywood does a pretty good job of letting parents know through its ratings system what kind of movie is coming out – whether there’s violence or sexual conduct or other kinds of things.”"
        },
        {
            "id": 23,
            "text": "Glickman was a U.S. representative from Kansas for nine terms but lost a re-election bid in 1994."
        },
        {
            "id": 24,
            "text": "He blames that loss partly on supporting an assault weapons ban."
        },
        {
            "id": 25,
            "text": "“I would vote for it again and thought it was the right thing to do,” he said Thursday."
        },
        {
            "id": 26,
            "text": "He called it “a very politically sensitive issue,” particularly among law-abiding gun owners who see it as a threat to their ownership of guns."
        },
        {
            "id": 27,
            "text": "Biden said Wednesday that while legislative action is needed to prevent mass shootings, Obama is also exploring executive orders."
        },
        {
            "id": 28,
            "text": "Keene, the NRA president, told CNN that “some things you can do by executive orders, some things you can’t do by executive orders."
        },
        {
            "id": 29,
            "text": "Some things you do by executive orders need money to be implemented, and that’s up to Congress.”"
        },
        {
            "id": 30,
            "text": "Wal-Mart, Dick’s Sporting Goods and Bass Pro Shops were among 10 retailers who were to meet Thursday with Attorney General Eric Holder, who is part of the panel."
        },
        {
            "id": 31,
            "text": "Wal-Mart, the nation’s largest retailer, triggered controversy earlier in the week when it said its officials were unavailable to attend the meeting because of scheduling."
        },
        {
            "id": 32,
            "text": "The company soon reversed its decision, saying it had “underestimated the expectation to attend.”"
        },
        {
            "id": 33,
            "text": "The NRA has argued that it is committed to keeping people protected, but that a focus on stricter gun control is misguided."
        },
        {
            "id": 34,
            "text": "NRA CEO Wayne LaPierre has called for all U.S. schools to have armed guards."
        },
        {
            "id": 35,
            "text": "Keene later told CNN the group supports schools choosing whether they want armed guards."
        }
    ]
}