{
    "title": "Virginia Gov. Ralph Northam: Robert E. Lee statue removed from U.S. Capitol",
    "text": [
        {
            "id": 0,
            "text": "Virginia Gov. Ralph Northam announced Monday that the statue of Confederate Gen. Robert E. Lee has been removed from the U.S. Capitol."
        },
        {
            "id": 1,
            "text": "The life-sized bronze monument is to be moved to the Virginia Museum of History and Culture in Richmond after having stood for 111 years in Washington."
        },
        {
            "id": 2,
            "text": "State Attorney General Mark Herring tweeted Monday that the statue removal “is long overdue.”"
        },
        {
            "id": 3,
            "text": "“We must start telling our complete history and remove these monuments that venerate individuals who fought to maintain slavery in this country,” tweeted Mr. Herring, a Democrat."
        },
        {
            "id": 4,
            "text": "Sculptor Edward Valentine gifted the statue to the collection in 1909 as a commemoration of the general who commanded the Confederate Army of Northern Virginia from 1862 until he surrendered in 1865, according to the Architect of the Capitol website."
        },
        {
            "id": 5,
            "text": "Mr. Northam, a Democrat, established the Commission for Historical Statues in the U.S. Capitol earlier this year to look into the removal and replacement of the monument."
        },
        {
            "id": 6,
            "text": "The commission was created following a wave of Confederate statue removals nationwide sparked by protests over racism and police brutality after George Floyd’s death in police custody in Minneapolis in May."
        },
        {
            "id": 7,
            "text": "State Sen. Louise Lucas, Virginia Democrat and commission chairwoman, along with seven other members, voted unanimously this summer to recommend the statue be removed."
        },
        {
            "id": 8,
            "text": "“Confederate images do not represent who we are in Virginia, that’s why we voted unanimously to remove this statue,” Ms. Lucas said Monday in a statement."
        },
        {
            "id": 9,
            "text": "“I am thrilled that this day has finally arrived, and I thank Governor Northam and the Commission for their transformative work.”"
        },
        {
            "id": 10,
            "text": "Each state is allowed to display two statues in the National Statuary Hall Collection, so the commission voted 6-1 to replace the Lee statue with one of Barbara Rose Johns, who died in 1991 at the age of 56."
        },
        {
            "id": 11,
            "text": "In 1951, the then-16-year-old led a student walkout at a high school in Virginia to protest the conditions at the all-Black school compared to those of a nearby all-White school."
        },
        {
            "id": 12,
            "text": "Her protest caught the attention of NAACP attorneys who filed a lawsuit that became part of the five suits reviewed by the Supreme Court in the Brown v. Board of Education of Topeka case."
        },
        {
            "id": 13,
            "text": "The case led to the 1954 landmark ruling that declared segregation unconstitutional."
        },
        {
            "id": 14,
            "text": "The General Assembly must approve replacing the statue before the commission can choose a sculptor to create it."
        },
        {
            "id": 15,
            "text": "If the replacement is approved, Johns would become the only teenager to be depicted in the historical collection."
        },
        {
            "id": 16,
            "text": "She would stand with George Washington as Virginia’s second statue contribution in the U.S. Capitol."
        },
        {
            "id": 17,
            "text": "Mr. Northam has proposed $500,000 in state funds to pay for the replacement, and he applauded the removal of the monument in a statement Monday."
        },
        {
            "id": 18,
            "text": "“The Confederacy is a symbol of Virginia’s racist and divisive history, and it is past time we tell our story with images of perseverance, diversity, and inclusion,” Mr. Northam said."
        },
        {
            "id": 19,
            "text": "“I look forward to seeing a trailblazing young woman of color represent Virginia in the U.S. Capitol, where visitors will learn about Barbara Johns’ contributions to America and be empowered to create positive change in their communities just like she did.”"
        },
        {
            "id": 20,
            "text": "House Speaker Nancy Pelosi echoed the governor’s sentiments in a statement Monday and said that the removal is “welcome news.”"
        },
        {
            "id": 21,
            "text": "“The halls of Congress are the very heart of our Democracy, and the statues within the Capitol should embody our highest ideals as Americans,” said Mrs. Pelosi, California Democrat."
        },
        {
            "id": 22,
            "text": "“The Congress will continue our work to rid the Capitol of homages to hate, as we fight to end the scourge of racism in our country."
        },
        {
            "id": 23,
            "text": "There is no room for celebrating the bigotry of the Confederacy in the Capitol or any other place of honor in our country.”"
        },
        {
            "id": 24,
            "text": "The House speaker championed legislation this summer to clear the Capitol of other monuments of Confederate leaders and representatives of bigotry, and to strip Confederate leaders’ names from military bases and other structures."
        },
        {
            "id": 25,
            "text": "But it’s up to the states to determine which of their historical figures to display at the Capitol."
        },
        {
            "id": 26,
            "text": "Jefferson Davis, a former senator from Mississippi who was president of the Confederate States of America, is represented by one of two statues from that state."
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": ""
        }
    ]
}