{
    "title": "Bobby Jindal Calls for Senate Leader Mitch McConnell to Resign Next",
    "text": [
        {
            "id": 0,
            "text": "When news of GOP Speaker of the House John Boehner’s resignation filtered into the Values Voter Summit on Friday, Louisiana Governor Bobby Jindal used the occasion to call for GOP Senate Leader Mitch McConnell to follow the Speaker into retirement."
        },
        {
            "id": 1,
            "text": "Kentucky’s Mitch McConnell only came to be the Senate majority leader with the 2014 elections when the GOP gained a sparse majority in the upper chamber, but for Jindal and many conservatives at the Summit, McConnell has already proven he isn’t up for the job."
        },
        {
            "id": 2,
            "text": "“Here’s what I say in response to Speaker Boehner stepping down: Mitch McConnell, it is now your turn,” Jindal told receptive attendees at the conservative Values Voter Summit on Friday."
        },
        {
            "id": 3,
            "text": "The Louisiana Governor, who is running back of the pack for the GOP nomination for president, urged McConnell to “turn in his gavel” along with Boehner."
        },
        {
            "id": 4,
            "text": "But Bobby Jindal went further by blasting the entire GOP caucus in the House of Representatives, characterizing them as do-nothings."
        },
        {
            "id": 5,
            "text": "“That’s one down, that’s 434 more to go,” Jindal thundered."
        },
        {
            "id": 6,
            "text": "“Folks, it is time to fire everybody in D.C.,” he added."
        },
        {
            "id": 7,
            "text": "Gov. Jindal has made attacks on the establishment a mainstay of his campaign for president, criticizing Washington for its failure on such issues as terrorism, immigration, and the defunding of abortion mill operators Planned Parenthood."
        },
        {
            "id": 8,
            "text": "In fact, in the most recent debate, Jindal proclaimed that “it is time to be done with the Republican Party.”"
        },
        {
            "id": 9,
            "text": "During the September 16 debate, Jindal slammed the Senate Republicans for their weakness in the face of Democrats."
        },
        {
            "id": 10,
            "text": "Especially on the Senate’s inability to defund Planned Parenthood, even with the recent gruesome videos that have gone viral, which contain evidence that the group has for decades engaged in the illegal sale and profit from human body parts."
        },
        {
            "id": 11,
            "text": "I wish Republicans in D.C. had half the fight of the Senate Democrats, to get rid of Obamacare, to defund Planned Parenthood."
        },
        {
            "id": 12,
            "text": "If we can’t defund Planned Parenthood now—if we can’t stand for innocent human life after these barbaric videos—it is time to be done with the Republican Party."
        },
        {
            "id": 13,
            "text": "We defunded them in Louisiana, let’s defund them in D.C."
        },
        {
            "id": 14,
            "text": "If we can’t win on that issue, there’s no point for being cheaper Democrats, no point for having a second liberal party, it is time to get rid of the Republican Party, start over with a new one that is at least conservative."
        },
        {
            "id": 15,
            "text": "Give Harry Reid and Pelosi credit, at least they fight for what they believe in."
        },
        {
            "id": 16,
            "text": "I want Senators and House members in D.C. to fight for what we believe in as well."
        },
        {
            "id": 17,
            "text": "It’s time to have Republicans with a backbone in D.C."
        },
        {
            "id": 18,
            "text": ""
        }
    ]
}