{
    "title": "Gibbs: Use of private Clinton emails 'highly unusual'",
    "text": [
        {
            "id": 0,
            "text": "Gibbs: Clinton's use of private emails 'highly unusual'"
        },
        {
            "id": 1,
            "text": "Former White House press secretary Robert Gibbs says he can’t think of a good reason why Hillary Clinton would have used a personal email address for all correspondence when she was secretary of state."
        },
        {
            "id": 2,
            "text": "“I think it is, obviously, highly unusual,” he said on NBC’s"
        },
        {
            "id": 3,
            "text": "“Today” on Tuesday morning, following a report by The New York Times that Clinton used a non-government email to conduct official business, possibly in violation of federal record requirements."
        },
        {
            "id": 4,
            "text": "The State Department acknowledged to POLITICO on Monday that thousands of her emails were not preserved as a result."
        },
        {
            "id": 5,
            "text": "Clinton and her people need to explain the situation in detail, Gibbs said."
        },
        {
            "id": 6,
            "text": "“There are lots of briefings that you have, certainly when you go into the White House about preserving any email that you have, making sure it’s part of your official account,” he added."
        },
        {
            "id": 7,
            "text": "“I think it’s something that they’re going to have to explain in good measure today and probably figure out how to get a lot of those emails, or as many as they can, back to the archives.”"
        },
        {
            "id": 8,
            "text": "Gibbs, who served on President Barack Obama’s campaign in 2008 and in 2012, said it’s easier for Clinton’s critics to give a reason for it happening."
        },
        {
            "id": 9,
            "text": "“I think this is another one of those things the Clinton campaign, such as it is, is going to have to explain,” he said."
        }
    ]
}