{
    "title": "Paul Ryan 1, Donald Trump 0",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump is a proud man."
        },
        {
            "id": 1,
            "text": "He rarely admits that he's wrong."
        },
        {
            "id": 2,
            "text": "He even said, at one point in this campaign, \"A lot of times, when you apologize, they use it as ammunition against [you].\""
        },
        {
            "id": 3,
            "text": "First, on Friday morning, there was Trump's admission that he mistook video of the release of U.S. hostages held by Iran in Geneva as video of a transfer of $400 million from the United States to Iran."
        },
        {
            "id": 4,
            "text": "Then, on Friday night, he endorsed House Speaker Paul D. Ryan's (R-Wis.) reelection after declining to do so just three days prior."
        },
        {
            "id": 5,
            "text": "Oh, and he also endorsed Sens. John McCain (R-Ariz.) and Kelly Ayotte (R-N.H.), whom he also conspicuously declined to back earlier this week."
        },
        {
            "id": 6,
            "text": "\"We will have disagreements, but we will disagree as friends and never stop working together toward victory -- and very importantly, toward real change,\" Trump said of Ryan in Green Bay, Wis."
        },
        {
            "id": 7,
            "text": "The endorsement followed plenty of uncertainty."
        },
        {
            "id": 8,
            "text": "In comments to The Washington Post's Philip Rucker on Tuesday, Trump declined to back Ryan and said nice things about Ryan's primary opponent, Paul Nehlen."
        },
        {
            "id": 9,
            "text": "The snub was particularly notable since Ryan delayed his own endorsement of Trump."
        },
        {
            "id": 10,
            "text": "But given that endorsement eventually arrived, Trump's lack of reciprocation was seen as a political faux pas -- or perhaps a signal to Ryan that his continued criticism of Trump's controversial comments wasn't appreciated."
        },
        {
            "id": 11,
            "text": "Trump also thumbed his nose at Ayotte, citing her lack of direct support."
        },
        {
            "id": 12,
            "text": "“You have a Kelly Ayotte who doesn’t want to talk about Trump, but I'm beating her in the polls by a lot,\" Trump told Rucker."
        },
        {
            "id": 13,
            "text": "\"You tell me."
        },
        {
            "id": 14,
            "text": "Are these people that should be representing us, okay?"
        },
        {
            "id": 15,
            "text": "You tell me.”"
        },
        {
            "id": 16,
            "text": "In the end, though, it looks like a GOP nominee who often says things he might regret had come to regret these comments."
        },
        {
            "id": 17,
            "text": "Trump trails in the presidential race badly in recent polls -- by as much as 15 points -- and the potential for the GOP establishment to desert him was just not something he could take on."
        },
        {
            "id": 18,
            "text": "Ryan has set himself up as the conscience of the GOP."
        },
        {
            "id": 19,
            "text": "He withheld his endorsement of Trump for a long time before coming around, and he has regularly weighed in when the establishment saw Trump going too far."
        },
        {
            "id": 20,
            "text": "But what's most notable here is that Ryan continued his criticism of Trump even after Trump threatened to withhold his endorsement."
        },
        {
            "id": 21,
            "text": "\"We just came out our convention, and"
        },
        {
            "id": 22,
            "text": "yeah he's had a pretty strange run since the convention,\" Ryan told Jerry Bader of Wisconsin local radio station WTAQ in an interview Thursday."
        },
        {
            "id": 23,
            "text": "\"You would think you ought to be focusing on Hillary Clinton -- on all of her deficiencies."
        },
        {
            "id": 24,
            "text": "She is such a weak candidate that one would think we'd be on offense against Hillary Clinton, and it is distressing that that's not what we're talking about these days.\""
        },
        {
            "id": 25,
            "text": "Ryan reassured that his support wasn't a \"blank check\" and even sent a fundraising email that could be read to warn of a potential landslide Trump loss in November."
        },
        {
            "id": 26,
            "text": "If Trump wanted Ryan to kiss the ring and back down, he didn't get it."
        },
        {
            "id": 27,
            "text": "But despite that, he felt the pressure to back the most significant figure in the GOP establishment."
        },
        {
            "id": 28,
            "text": "And in doing so, he also bowed to the pressure he faced to endorse two senators who would be very important to GOP efforts to hold onto the Senate."
        },
        {
            "id": 29,
            "text": "We're past the point where things like this can be cast as Trump truly changing tack and shifting into general election mode."
        },
        {
            "id": 30,
            "text": "But clearly, this was one case in which he bowed to the kind of political reality he usually shrugs at."
        }
    ]
}