{
    "title": "Gun filibuster appears to misfire for conservative backers",
    "text": [
        {
            "id": 0,
            "text": "A filibuster of major gun legislation by a vocal band of conservative Republican senators may have misfired, as a growing number of their GOP colleagues appear ready to help break it when it comes up for a vote on Thursday."
        },
        {
            "id": 1,
            "text": "The public split is a rarity for Senate Republicans, who over the past few years have kept divisions to a minimum."
        },
        {
            "id": 2,
            "text": "At issue is whether to begin debate on the contentious legislation that would, among other things, expand background checks, restrict straw-purchases, and toughen laws on gun trafficking."
        },
        {
            "id": 3,
            "text": "Fourteen Republicans have publicly vowed to block debate from happening, forcing Democratic leaders to get 60 votes in order to take up the bill."
        },
        {
            "id": 4,
            "text": "Senate Republican Leader Mitch McConnell of Kentucky – under pressure from his right flank as he readies a re-election run -signed onto the filibuster even as other senators pushed for an open debate."
        },
        {
            "id": 5,
            "text": "“The senate is a place to debate,” said Sen. Lamar Alexander, R-Tennessee, who will vote to break the filibuster."
        },
        {
            "id": 6,
            "text": "“As far as I’m concerned, for me not to be willing to defend the Second Amendment rights of Tennesseans on the Senate floor is like joining the Grand Ole Opry and not being willing to sing.”"
        },
        {
            "id": 7,
            "text": "Sen. John Cornyn, who as the Senate Republican Whip is second in the GOP chain of command, said he expected the filibuster would be broken because many GOP senators are “eager” to amend the bill, which was written largely by Democrats."
        },
        {
            "id": 8,
            "text": "“I think there will be a fulsome debate,” he said."
        },
        {
            "id": 9,
            "text": "“Notwithstanding the signals from some quarters, we welcome a fulsome debate on this."
        },
        {
            "id": 10,
            "text": "There are some people with some very good ideas, like Sen. (Lindsey)"
        },
        {
            "id": 11,
            "text": "Graham (R-South Carolina) on the mental health issues that should be a sweet spot that could actually pull people together to do something that would be meaningful in preventing a repetition” of mass violence."
        },
        {
            "id": 12,
            "text": "Sen. John McCain, R-Arizona, over the weekend was the first to criticize GOP colleagues calling for a filibuster."
        },
        {
            "id": 13,
            "text": "Even the conservative Wall Street Journal editorial page chastised the filibustering Republicans for not wanting to take up the bill."
        },
        {
            "id": 14,
            "text": "“If conservatives want to prove their gun-control bona fides, the way to do it is to debate the merits and vote on the floor."
        },
        {
            "id": 15,
            "text": "They can always filibuster the final bill if they want to, but it makes no sense to paint themselves into a political box canyon before even knowing what they’re voting on,” the paper said."
        },
        {
            "id": 16,
            "text": "Sen. Ted Cruz, R-Texas, one of the leaders of the filibuster, told conservative radio talk show host Laura Ingraham Wednesday that the criticism of it has been “silly.”"
        },
        {
            "id": 17,
            "text": "“The critics have said we have to have a debate, we need to have a vote."
        },
        {
            "id": 18,
            "text": "We are having a debate and we’re going to have a vote,” he said."
        },
        {
            "id": 19,
            "text": "“The only question is what should the vote threshold be for legislation that would violate potentially the bill of rights."
        },
        {
            "id": 20,
            "text": "I think it should be a minimum of 60 votes.”"
        },
        {
            "id": 21,
            "text": "Cruz accused fellow Republicans of rushing to debate a bill without knowing much about it."
        },
        {
            "id": 22,
            "text": "“I’ll point out that a lot of the Republicans who say they are happy to shut off the debate and move to the bill, they don’t even know what the bill contains,” Cruz said."
        },
        {
            "id": 23,
            "text": "“It’s reminiscent of Nancy Pelosi talking about Obamacare saying we have to pass it to find what it’s in it."
        },
        {
            "id": 24,
            "text": "The bill that Republicans are going on television and saying we gotta move to and vote on, they still don’t know the details because the Democrats haven’t released the details of the bill they’re moving to proceed to.”"
        },
        {
            "id": 25,
            "text": "Another senator backing the filibuster, Sen. Mike Lee, R-Utah, went to the Senate floor on Wednesday to defend his cause."
        },
        {
            "id": 26,
            "text": "He argued the filibuster was helpful because the delay gives senators more time to consider the measure."
        },
        {
            "id": 27,
            "text": "“Contrary to the statements made by the president and my friends across the aisle, and even a few in my own caucus, we have no intention of preventing debate or votes."
        },
        {
            "id": 28,
            "text": "Quite the opposite."
        },
        {
            "id": 29,
            "text": "By objecting to the motion to proceed, we guarantee that the Senate and the American people have at least three additional days to assess and evaluate exactly how this particular bill will affect the rights of law-abiding citizens and whether it will have any significant impact on crime.”"
        },
        {
            "id": 30,
            "text": "Alexander, who hasn’t indicated how he will vote on a final bill, said open debate on the issue will be good for the country."
        },
        {
            "id": 31,
            "text": "“That’s what senators are supposed to do."
        },
        {
            "id": 32,
            "text": "Instead of having deals made and agreements made in back rooms and never having bills and never having amendments, open it up and let the Senate work."
        },
        {
            "id": 33,
            "text": "I think the American people would prefer that I think we’ll have better government if we do.”"
        }
    ]
}