{
    "title": "Just a show? NRA says Biden group set on gun control despite latest meetings",
    "text": [
        {
            "id": 0,
            "text": "Vice President Biden wrapped up a week of meetings Friday as he prepares to finalize his plan to curb gun violence -- but the National Rifle Association claims the meetings are just a show, while the administration presses ahead with new gun-control measures."
        },
        {
            "id": 1,
            "text": "The NRA, which sat down with Biden's task force alongside other gun-owner groups Thursday, said it was \"disappointed\" with \"how much it had to do with an agenda to attack the Second Amendment.\""
        },
        {
            "id": 2,
            "text": "While the administration has said the task force will look at a range of issues to address gun violence in the wake of the Connecticut school shooting -- from mental health to the entertainment industry -- the NRA said Thursday's discussion focused \"on proposed restrictions on lawful firearms owners -- honest, taxpaying, hardworking Americans.\""
        },
        {
            "id": 3,
            "text": "Separately, NRA President David Keene in an interview said Biden was just \"checking a box.\""
        },
        {
            "id": 4,
            "text": "Biden rounded out the week Friday afternoon by meeting representatives from the video-game industry."
        },
        {
            "id": 5,
            "text": "The NRA and other groups, pushing back against calls for new firearms restrictions, have urged Washington to take a close look at violent video games and the role they might play in violence among adolescents."
        },
        {
            "id": 6,
            "text": "Biden told the video-game group Friday that he wanted them to know \"you have not been, quote, singled out.\""
        },
        {
            "id": 7,
            "text": "Biden, asked about the NRA friction, said he found the meeting with gun groups \"very straightforward\" and \"productive.\""
        },
        {
            "id": 8,
            "text": "He said: \"We know there's no silver bullet.\""
        },
        {
            "id": 9,
            "text": "The night before, Biden met with representatives from the entertainment industry."
        },
        {
            "id": 10,
            "text": "Those groups released a statement late Thursday, without saying whether any legislative proposals had been discussed."
        },
        {
            "id": 11,
            "text": "\"The entertainment community appreciates being included in the dialogue around the administration's efforts to confront the complex challenge of gun violence in America,\" said the statement from the Motion Picture Association of America and several other groups."
        },
        {
            "id": 12,
            "text": "\"This industry has a longstanding commitment to provide parents the tools necessary to make the right viewing decisions for their families."
        },
        {
            "id": 13,
            "text": "We welcome the opportunity to share that history and look forward to doing our part to seek meaningful solutions.\""
        },
        {
            "id": 14,
            "text": "Biden says he plans to have a set of proposals on President Obama's desk by Tuesday."
        },
        {
            "id": 15,
            "text": "He gave a glimpse into what was being considered this week, and the list included \"universal\" background checks for gun purchases."
        },
        {
            "id": 16,
            "text": "He said this would include not just closing the so-called gun show loophole but imposing background checks for all transactions, including private sales."
        },
        {
            "id": 17,
            "text": "He also said, \"I've never heard quite as much about the need to do something about high-capacity magazines as I've heard spontaneously from every group that we've met with so far.\""
        },
        {
            "id": 18,
            "text": "Obama and other Democratic lawmakers are already pushing for a renewed assault-weapons ban, but Biden suggested there could be growing support for at least a ban on high-capacity magazines."
        },
        {
            "id": 19,
            "text": "At the same time, the White House has dismissed calls by the NRA to draft a national school security plan to install armed officers at every school in the country."
        },
        {
            "id": 20,
            "text": "The White House has suggested that plan would not be effective."
        },
        {
            "id": 21,
            "text": "But the NRA and other firearms group say the same about proposed restrictions on certain weapons types, noting that assault weapons are not often used in the commission of violent crimes -- handguns are more common."
        },
        {
            "id": 22,
            "text": "Biden also drew complaints from Republican lawmakers when he suggested Wednesday, while meeting with gun control groups, that the administration might go around Congress to implement some provisions."
        },
        {
            "id": 23,
            "text": "\"There are executive orders, executive action that can be taken,\" Biden said."
        },
        {
            "id": 24,
            "text": "He also said separate legislative action would be \"required.\""
        },
        {
            "id": 25,
            "text": "\"Vice President Biden would do well to read the 2nd Amendment and revisit the meaning of the phrase 'shall not be infringed,'\" Rep. Steve Scalise, R-La., said in a statement."
        },
        {
            "id": 26,
            "text": "\"Bypassing Congress to implement radical policies is never acceptable.\""
        },
        {
            "id": 27,
            "text": "."
        }
    ]
}