{
    "title": "Congress avoids shutdown, bickers over 2014 budget",
    "text": [
        {
            "id": 0,
            "text": "Capitol Hill lawmakers finally brought the 2013 budget fight to an end Thursday by approving a bill that ended the threat of a government shutdown – minutes before ratcheting up the partisan warfare over taxes and spending in 2014."
        },
        {
            "id": 1,
            "text": "Members of the House voted 318-109 to send President Barack Obama a bill funding the government through the end of the current fiscal year in September while easing the pain of $85 billion in forced spending cuts disliked by leaders on both sides of the aisle."
        },
        {
            "id": 2,
            "text": "The measure extending current federal funding authority was needed to avoid a partial shutdown of the government on March 27."
        },
        {
            "id": 3,
            "text": "Both houses of Congress are scheduled to be on break over the next two weeks for the Easter and Passover holidays."
        },
        {
            "id": 4,
            "text": "Don’t expect much of a breather, however, in the bitter budget battles that have become one of the hallmarks of a sharply polarized, borderline dysfunctional national legislature."
        },
        {
            "id": 5,
            "text": "The GOP-controlled House also passed a fiscal year 2014 budget Thursday that is guaranteed to go nowhere in the Democratic-run Senate."
        },
        {
            "id": 6,
            "text": "The Republican plan, crafted by recent Mitt Romney running mate Rep. Paul Ryan, cuts taxes while balancing the budget over 10 years by slashing spending by $4.6 trillion, repealing Obama’s health care law and making major changes to Medicare."
        },
        {
            "id": 7,
            "text": "No House Democrats voted for it."
        },
        {
            "id": 8,
            "text": "The Senate voted Thursday on the Ryan budget in what appeared to be a political move to show it could not pass."
        },
        {
            "id": 9,
            "text": "It failed, with 59 senators voting against it and 40 voting in favor."
        },
        {
            "id": 10,
            "text": "Speaker John Boehner, R-Ohio, called the Ryan budget a “bold plan” and a statement of party principles."
        },
        {
            "id": 11,
            "text": "Rep. Chris Van Hollen of Maryland, a member of the Democratic leadership, called it an “uncompromising ideological approach” that would replicate disastrous European austerity policies."
        },
        {
            "id": 12,
            "text": "Not to be outdone, the Democratic-controlled Senate continued its work Thursday on a 2014 budget that cuts the deficit in part by hiking taxes on the wealthy and corporations by $975 billion over the next decade."
        },
        {
            "id": 13,
            "text": "Republicans note taxes already went up at the start of 2013 as part of the fiscal cliff deal."
        },
        {
            "id": 14,
            "text": "GOP leaders insist they won’t raise the overall tax burden another dime."
        },
        {
            "id": 15,
            "text": "Democrats are “serving the needs of government instead of the needs of those who elected them,” declared Senate Minority Leader Mitch McConnell, R-Kentucky."
        },
        {
            "id": 16,
            "text": "As for the rest of the current fiscal year, the measure now set to become law reduces the impact of the $85 billion in forced cuts – called sequestration – by establishing stop-gap budgets for the departments of Agriculture, Commerce, Defense, Homeland Security, Justice, and Veterans Affairs, among other things."
        },
        {
            "id": 17,
            "text": "By crafting new budgets for targeted departments and programs, the package resets priorities and helps better manage the draconian formula of the spending cuts."
        },
        {
            "id": 18,
            "text": "Crafted primarily by Maryland Democratic Sen. Barbara Mikulski and Alabama Republican Sen. Richard Shelby, the measure largely spares a number of politically sensitive programs from the budget ax, including meat inspection and infant nutrition."
        },
        {
            "id": 19,
            "text": "Overall, the legislation locks in $984 billion in non-entitlement program spending – a notable drop from the $1.043 trillion initially approved before the forced sequestration cuts took effect."
        },
        {
            "id": 20,
            "text": "Despite the bill’s bipartisan nature, many members on both sides of the aisle remain unhappy with the outcome."
        },
        {
            "id": 21,
            "text": "Conservatives argue the package is still loaded with pork barrel spending."
        },
        {
            "id": 22,
            "text": "Republican Sens. John McCain of Arizona and Tom Coburn of Oklahoma, for example, questioned the inclusion of $65 million for Pacific coast salmon restoration."
        },
        {
            "id": 23,
            "text": "Sen. Jerry Moran, R-Kansas, complained Wednesday about being denied a vote on an amendment to protect rural airport control towers from closure due to the cuts."
        },
        {
            "id": 24,
            "text": "He accused opponents of stripping critical funds simply to score political points and frame the debate in a way that favors defenders of a larger government."
        },
        {
            "id": 25,
            "text": "It’s “the only explanation I ever get that has any semblance of truth,” Moran said on the Senate floor."
        },
        {
            "id": 26,
            "text": "“By denying the amendment’s passage, we prove that sequestration can’t work, that we can’t cut money from budgets.”"
        },
        {
            "id": 27,
            "text": "More liberal members of Congress blasted the cuts, but said the deal was the only way to avoid a partial government shutdown."
        },
        {
            "id": 28,
            "text": "The cuts are “reckless,” said Rep. Nita Lowey of New York, the top Democrat on the House Appropriations Committee."
        },
        {
            "id": 29,
            "text": "But “a government shutdown could wreak havoc on our already fragile economic recovery and must be prevented.”"
        },
        {
            "id": 30,
            "text": "“Whatever our disagreement on some of these bills, it was worse to shut down government,” added House Minority Leader Nancy Pelosi, D-California."
        }
    ]
}