{
    "title": "White House economic adviser Larry Kudlow foresees another budget fight over border wall",
    "text": [
        {
            "id": 0,
            "text": "Larry Kudlow, a top White House economic adviser, said President Trump’s “tough” 2020 budget blueprint, due out Monday, could trigger a new fight over the his desired U.S.-Mexico border wall."
        },
        {
            "id": 1,
            "text": "The 2020 budget blueprint will include at least $8.6 billion in border wall money, a senior administration official said Sunday."
        },
        {
            "id": 2,
            "text": "About $5 billion is slated to come from the Department of Homeland Security, with $3.6 billion coming from military construction funds."
        },
        {
            "id": 3,
            "text": "“I suppose there will be” another budget fight over the wall, Mr. Kudlow said on “Fox News Sunday.”"
        },
        {
            "id": 4,
            "text": "“I would just say that the whole issue of the wall and border security is of paramount importance,” Mr. Kudlow said."
        },
        {
            "id": 5,
            "text": "“We have a crisis down there."
        },
        {
            "id": 6,
            "text": "I think the president has made that case very effectively.”"
        },
        {
            "id": 7,
            "text": "A standoff over border wall money helped precipitate the recent five-week government shutdown, and Mr. Trump recently declared a national emergency on the southern border the administration says will open up more funding for wall construction."
        },
        {
            "id": 8,
            "text": "The administration recently outlined roughly $8.1 billion in other immediate funding for the wall, which includes nearly $1.4 billion in a recent spending bill, as well as $600 million from asset forfeitures, $2.5 billion from Defense Department counter-narcotics funds, and $3.6 billion from military construction money."
        },
        {
            "id": 9,
            "text": "The House recently passed a resolution disapproving of the president’s emergency declaration, which would affect the military construction money, though the resolution is unlikely to survive a presidential veto if the Senate follows suit."
        },
        {
            "id": 10,
            "text": "The president is proposing a 5 percent cut for domestic discretionary spending, while at the same time calling for a boost for the Defense Department, to $750 billion next year."
        },
        {
            "id": 11,
            "text": "On the defense side, the president plans to park about $174 billion in a special overseas fund that isn’t subject to strict spending caps that Congress has lived under since 2011 — a move that congressional Democrats have rejected as a gimmick."
        },
        {
            "id": 12,
            "text": "“It will be a tough budget,” Mr. Kudlow said."
        },
        {
            "id": 13,
            "text": "“Some of these recent budgets have not been favorable toward spending.”"
        },
        {
            "id": 14,
            "text": "The budget is projected to balance over 15 years and projects that the economy will grow on average by about 3 percent over the next decade, the senior administration official said."
        },
        {
            "id": 15,
            "text": "White House and congressional budget blueprints typically look to get to balance over 10 years."
        },
        {
            "id": 16,
            "text": "But the country’s fiscal picture is getting worse, with the national debt recently surpassing $22 trillion for the first time ever."
        },
        {
            "id": 17,
            "text": "The Treasury Department recently reported that the federal government ran a $310 billion budget deficit for the first four months of fiscal 2019 — a 77 percent increase from a year earlier."
        },
        {
            "id": 18,
            "text": "Mr. Kudlow said he’s not terribly concerned about budget deficits at the moment as long as the administration can keep public debt-to-GDP ratios at a reasonable level."
        },
        {
            "id": 19,
            "text": "“I don’t think good growth policies have to obsess necessarily about the budget deficits and so forth,” Mr. Kudlow said."
        },
        {
            "id": 20,
            "text": "“The economy is $20 trillion and net worth today, household net worth is about $100 trillion."
        },
        {
            "id": 21,
            "text": "So I don’t think that’s a burden on the economy.”"
        },
        {
            "id": 22,
            "text": "He said if the markets were overly concerned about deficits, there would be more of an effect on interest rates."
        },
        {
            "id": 23,
            "text": "“I don’t see it right now,” he said."
        },
        {
            "id": 24,
            "text": "“And again, long run, we do want to reduce the burden of spending and borrowing, absolutely, but always as a share of GDP.”"
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        }
    ]
}