{
    "title": "Donald Trump, Seeing Himself Behind in Polls, Says He Hasn’t ‘Started Yet’",
    "text": [
        {
            "id": 0,
            "text": "Donald J. Trump rarely, if ever, acknowledges he might be losing at anything."
        },
        {
            "id": 1,
            "text": "He expressed bewilderment at a poll during the primary race that showed him behind in the Iowa caucuses."
        },
        {
            "id": 2,
            "text": "He often invokes unscientific polls as examples of his strength, and mentions surveys that have questionable methodology."
        },
        {
            "id": 3,
            "text": "So it was surprising when Mr. Trump, the presumptive Republican presidential nominee, said on Thursday night that he is not beating Hillary Clinton in the most recent presidential polls."
        },
        {
            "id": 4,
            "text": "“I’m four down in one poll, three and a half in another that just came out, and I haven’t started yet,” Mr. Trump, the presumptive Republican presidential nominee, said in a phone interview on Thursday night, a thought he volunteered as he dismissed concerns from Senate Republicans that he may be a drag on their candidacies in the fall."
        },
        {
            "id": 5,
            "text": "“And I have tremendous Republican support,” Mr. Trump said."
        },
        {
            "id": 6,
            "text": "“Unfortunately they never talk about that, they talk about the few rebels.”"
        },
        {
            "id": 7,
            "text": "Mr. Trump did not specify which polls he was referring to, although he mentioned the Real Clear Politics average at another point."
        },
        {
            "id": 8,
            "text": "But Mr. Trump has not led a national poll throughout the month of June, with Mrs. Clinton’s lead ranging from 3 to 12 percentage points, depending on the survey."
        },
        {
            "id": 9,
            "text": "On Friday afternoon, Mr. Trump posted on Twitter a poll and added, “Thank you!”"
        },
        {
            "id": 10,
            "text": "But even that survey showed him a couple of percentage points behind Mrs. Clinton."
        },
        {
            "id": 11,
            "text": "Despite his historically high negative ratings, Mr. Trump suggested he has plenty of time to turn things around."
        },
        {
            "id": 12,
            "text": "“I think I’m going to help,” Mr. Trump said of the Senate candidates."
        },
        {
            "id": 13,
            "text": "And he suggested that senators who were lagging in polls themselves had troubles long before he became the nominee."
        },
        {
            "id": 14,
            "text": "“Certain of these senators you’re talking about are not doing well,” Mr. Trump said, referring to a group who are being aided by former President George W. Bush with fund-raising."
        },
        {
            "id": 15,
            "text": "“Then, if they lose they’ll pin it on Donald Trump,” he said."
        },
        {
            "id": 16,
            "text": "“But I don’t let that happen easily.”"
        }
    ]
}