{
    "title": "Senior DHS official alleges in whistleblower complaint that he was told to stop providing intelligence analysis on threat of Russian interference",
    "text": [
        {
            "id": 0,
            "text": "A senior Department of Homeland Security official alleges that he was told to stop providing intelligence reports on the threat of Russian interference in the 2020 election, in part because it “made the President look bad,” an instruction he believed would jeopardize national security."
        },
        {
            "id": 1,
            "text": "On July 8, Murphy said in the complaint, acting homeland security secretary Chad Wolf told him that an “intelligence notification” regarding Russian disinformation efforts should be “held” because it was unflattering to Trump, who has long derided the Kremlin’s interference as a “hoax” that was concocted by his opponents to delegitimize his victory in 2016."
        },
        {
            "id": 2,
            "text": "It’s not clear who would have seen the notification, but DHS’s intelligence reports are routinely shared with the FBI, other federal law enforcement agencies, and state and local governments."
        },
        {
            "id": 3,
            "text": "Murphy objected to Wolf’s instruction, “stating that it was improper to hold a vetted intelligence product for reasons [of] political embarrassment,” according to a copy of his whistleblower complaint that was obtained by The Washington Post."
        },
        {
            "id": 4,
            "text": "“We flatly deny that there is any truth to the merits of Mr. Murphy’s claim,” said Alexei Woltornist, a DHS spokesman, in a statement sent via email."
        },
        {
            "id": 5,
            "text": "“DHS looks forward to the results of any resulting investigation and we expect it will conclude that no retaliatory action was taken against Mr. Murphy,” Woltornist said."
        },
        {
            "id": 6,
            "text": "“Wolf is focused on thwarting election interference from any foreign powers and attacks from any extremist group,” he added."
        },
        {
            "id": 7,
            "text": "The president’s political interests were often of greater concern to senior leaders at the department than reporting the facts based on evidence, Murphy alleges."
        },
        {
            "id": 8,
            "text": "He claims that Wolf and Ken Cuccinelli, the department’s second-in-command, on various occasions instructed him to massage the language in intelligence reports “to ensure they matched up with the public comments by Trump on the subject of ANTIFA and ‘anarchist’ groups,” according to the complaint."
        },
        {
            "id": 9,
            "text": "Trump has sought to link anti-fascist, or antifa, protesters opposed to police violence with Democratic Party leaders and to associate his opponent, former vice president Joe Biden, with extremists."
        },
        {
            "id": 10,
            "text": "Andrew Bates, a spokesman for the Biden campaign, said in a statement, “If true, these latest revelations cement a pattern of high ranking Trump Administration officials not only keeping law enforcement officials and the American people in the dark about assaults on our democracy, but corrupting intelligence processes to benefit the president politically.”"
        },
        {
            "id": 11,
            "text": "Murphy himself has been a recent subject of controversy."
        },
        {
            "id": 12,
            "text": "He was removed from his position and assigned in July to an administrative role, where he remains."
        },
        {
            "id": 13,
            "text": "His new assignment followed reports by The Post that his office had compiled “intelligence reports” about tweets by journalists who were covering protests in Portland, Ore."
        },
        {
            "id": 14,
            "text": "In his complaint, Murphy called press coverage of his office’s activities “significantly flawed” and said that his team “never knowingly or deliberately collected information on journalists, at least as far as [he] is aware or ever authorized.”"
        },
        {
            "id": 15,
            "text": "Murphy’s complaint prompted mixed reactions among former senior administration officials, who said he had valid and significant concerns but described him as a flawed messenger."
        },
        {
            "id": 16,
            "text": "According to three former senior officials, who spoke on the condition of anonymity to be candid, Murphy was a poor manager and the source of low morale in his office."
        },
        {
            "id": 17,
            "text": "Murphy’s lawyer, Mark Zaid, declined to comment on the criticism from former officials."
        },
        {
            "id": 18,
            "text": "He said, “We’re focused on substantive whistleblower allegations only.”"
        },
        {
            "id": 19,
            "text": "Separately, in a statement Wednesday, Zaid said, “Mr. Murphy followed proper lawful whistleblower rules in reporting serious allegations of misconduct against DHS leadership, particularly involving political distortion of intelligence analysis and retaliation."
        },
        {
            "id": 20,
            "text": "We have alerted both the Executive and Legislative Branches of these allegations and we will appropriately cooperate with oversight investigations, especially in a classified setting.”"
        },
        {
            "id": 21,
            "text": "Murphy’s claims that Trump officials tried to downplay the threat from Russia will add to a chorus of complaints on Capitol Hill that administration officials are withholding vital information about election interference from lawmakers and voters."
        },
        {
            "id": 22,
            "text": "The administration has limited the number of lawmakers who may be briefed on the subject."
        },
        {
            "id": 23,
            "text": "Former DNI Daniel Coats criticizes suspension of in-person briefings to Congress on election security"
        },
        {
            "id": 24,
            "text": "Murphy alleges an ongoing effort by senior officials to obfuscate the threat from Russia in particular."
        },
        {
            "id": 25,
            "text": "He claimed that in May, Wolf told him to stop producing intelligence assessments on Russia and shift the focus on election interference to China and Iran."
        },
        {
            "id": 26,
            "text": "He said Wolf told him “that these instructions specifically originated from White House National Security Advisor Robert O’Brien.”"
        },
        {
            "id": 27,
            "text": "Murphy said he would not comply with the instructions, which he believed would “put the country in substantial and specific danger,” according to the complaint, which was filed Tuesday with the DHS inspector general."
        },
        {
            "id": 28,
            "text": "A White House spokeswoman disputed Murphy’s allegations."
        },
        {
            "id": 29,
            "text": "“Ambassador O’Brien has never sought to dictate the Intelligence Community’s focus on threats to the integrity of our elections or on any other topic; any contrary suggestion by a disgruntled former employee, who he has never met or heard of, is false and defamatory,” Sarah Matthews said in a statement."
        },
        {
            "id": 30,
            "text": "“Rather, Ambassador O’Brien has consistently and publicly advocated for a holistic focus on all threats to our elections — whether from Russia, Iran, China, or any other malign actor.”"
        },
        {
            "id": 31,
            "text": "Rep. Adam B. Schiff (D-Calif.), the chairman of the House Intelligence Committee, said in a statement that Murphy’s complaint “outlines grave and disturbing allegations that senior White House and Department of Homeland Security officials improperly sought to politicize, manipulate, and censor intelligence in order to benefit President Trump politically."
        },
        {
            "id": 32,
            "text": "This puts our nation and its security at grave risk.”"
        },
        {
            "id": 33,
            "text": "The committee has asked Murphy to testify later this month."
        },
        {
            "id": 34,
            "text": "Murphy’s allegations track with concerns from other officials, as well as Democratic lawmakers and national security experts, that the Trump administration has tried to downplay the threat from Russia."
        },
        {
            "id": 35,
            "text": "Last month, the Office of the Director of National Intelligence stated publicly that Russia, China and Iran were engaged in interference campaigns, an assessment that drew sharp rebukes from Democratic lawmakers, who said the administration was trying to equate the efforts of all three countries, when in fact Russia is the only one actively trying to help Trump by attacking Biden."
        },
        {
            "id": 36,
            "text": "Murphy appeared to share those concerns, stating that the analysis in the intelligence notification, which he said was eventually leaked to the press, “attempts to place the actions of Russia on par with those of Iran and China in a manner that is misleading and inconsistent with the actual intelligence data.”"
        },
        {
            "id": 37,
            "text": "Wolf singled out China as a uniquely “menacing actor” and singular threat to U.S. national security during a “State of the Homeland” speech to the department’s senior officials on Wednesday."
        },
        {
            "id": 38,
            "text": "“China has leveraged every aspect of its country including its economy, its military, and its diplomatic power, demonstrating a rejection of Western liberal democracy and continually renewing its commitment to remake the world order in its own authoritarian image,” he said."
        },
        {
            "id": 39,
            "text": "DHS plays a key role in guarding against election interference, mainly by working with state and local governments to ensure that electronic voting systems are protected from hackers and outside manipulation."
        },
        {
            "id": 40,
            "text": "As part of its mission, the department has also sent unclassified bulletins to state and local authorities describing foreign interference."
        },
        {
            "id": 41,
            "text": "Recently, DHS issued a report that Russian media is spreading false allegations that mail-in voting is unsafe, with claims that echo the baseless assertions Trump and Attorney General William P. Barr have made that voting by mail is rife with fraud."
        },
        {
            "id": 42,
            "text": "Murphy stated that after being told to stand down on Russia in May and shift his focus, he made two classified disclosures on the matter later that month to Cuccinelli."
        },
        {
            "id": 43,
            "text": "The second occurred after a deputies-level meeting of the National Security Council on election security."
        },
        {
            "id": 44,
            "text": "Murphy did not provide further details on what he told Cuccinelli but described his concerns as generally having to do with “abuse of authority, willfully withholding intelligence information from Congress, and the improper administration of an intelligence program.”"
        },
        {
            "id": 45,
            "text": "Murphy also made  allegations in the whistleblower complaint that senior Trump administration officials had pressured him to provide what he considered misleading information about suspected terrorists crossing the border with Mexico, as part of an effort to bolster the case for building a border wall."
        },
        {
            "id": 46,
            "text": "DHS officials came under pressure from the White House and then-spokeswoman Sarah Sanders to provide information on “known suspected terrorists” to support construction of the border wall during the government shutdown in January 2019, a former DHS official confirmed."
        },
        {
            "id": 47,
            "text": "The official, who spoke on the condition of anonymity to discuss internal deliberations, was not party to the communications outlined in Murphy’s complaint but said they were consistent with the pressure coming from the White House at the time."
        },
        {
            "id": 48,
            "text": "“We were all under pressure to get data on security threats crossing the border,” said another former senior DHS official who spoke on the condition of anonymity to discuss the matter."
        },
        {
            "id": 49,
            "text": "“The truth was that there is not a significant number of [known suspected terrorists] crossing illegally between ports of entry.”"
        }
    ]
}