{
    "title": "In Virtual Speech To Black Graduates, Obama Says U.S. Lacks Leadership On Coronavirus",
    "text": [
        {
            "id": 0,
            "text": "In Virtual Speech To Black Graduates, Obama Says U.S. Lacks Leadership On Coronavirus"
        },
        {
            "id": 1,
            "text": "Former President Barack Obama delivered a virtual commencement address on Saturday, urging the tens of thousands of graduates from historically black colleges and universities to \"seize the initiative\" amid what he described as a lack of leadership from leaders in the United States to the coronavirus pandemic."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "\"More than anything, this pandemic has fully, finally torn back the curtain on the idea that so many of the folks in charge know what they're doing,\" Obama said in remarks that were streamed online."
        },
        {
            "id": 4,
            "text": "\"A lot of them aren't even pretending to be in charge."
        },
        {
            "id": 5,
            "text": "If the world's gonna be better, it's going to be up to you.\""
        },
        {
            "id": 6,
            "text": "Obama's remarks come as the virus has killed more than 88,000 Americans and crippled the nation's economy."
        },
        {
            "id": 7,
            "text": "He delivered them as part of \"Show Me Your Walk HBCU Edition,\" a virtual commencement hosted Saturday by the comedian Kevin Hart."
        },
        {
            "id": 8,
            "text": "The event included a stream of prominent black athletes, politicians and entertainers — many of whom attended HBCUs themselves."
        },
        {
            "id": 9,
            "text": "While Obama's remarks were billed as a sendoff for graduating seniors — forced by the pandemic to leave campuses across the country and unable to participate in more traditional commencement ceremonies — Obama also appeared to bring the graduates together around a set of shared values."
        },
        {
            "id": 10,
            "text": "The former president made note of the disproportionate impact that the pandemic has had on black communities."
        },
        {
            "id": 11,
            "text": "Black Americans account for a disproportionate number of coronavirus-related deaths in the U.S. There have also been stark racial disparities in the economic impact of the outbreak."
        },
        {
            "id": 12,
            "text": "Addressing these disparities, Obama said that coronavirus \"spotlights the underlying inequalities and extra burdens that black communities have historically had to deal with in this country.\""
        },
        {
            "id": 13,
            "text": "He also made reference to the killing of Ahmaud Arbery, the 25-year-old black man who was fatally shot in Georgia in February, saying there were disparities evident not just in public health, but \"just as we see it when a black man goes for a jog, and some folks feel like they can stop and question and shoot him if he doesn't submit to their questioning.\""
        },
        {
            "id": 14,
            "text": "Obama praised the key role that historically black colleges play in the black community, telling graduates that now more than ever, they have the tools they need to seize their power to make change."
        },
        {
            "id": 15,
            "text": "Obama called on the 2020 class to be \"bold\" and have a \"vision that isn't clouded by cynicism or fear.\""
        },
        {
            "id": 16,
            "text": "Taylor Harris, 22, who attended Hampton University, said she was glad to see Obama and others taking notice of HBCUs given their key role in educating a large population of low income and first-generation students."
        },
        {
            "id": 17,
            "text": "\"I feel like we don't get a lot of recognition — they kind of looked at as second tier compared to Ivy League schools or predominately white institutions,\" said Harris."
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": "\"So I'm just glad that celebrities are taking the chance to embrace our young African-American graduates."
        },
        {
            "id": 20,
            "text": "There are so many statistics that we have overcome, just graduating for college.\""
        },
        {
            "id": 21,
            "text": "Harris left Hampton's campus nine weeks ago, and went home to St. Louis, assuming she'd be back on campus in a matter of weeks."
        },
        {
            "id": 22,
            "text": "\"At first people were excited, it was like a little break,\" Harris said."
        },
        {
            "id": 23,
            "text": "\"But as soon as I got back home and I knew that I couldn't return back to campus, now I'm living out of a suitcase.\""
        },
        {
            "id": 24,
            "text": "Hampton University is planning on holding a commencement ceremony for graduating seniors in September."
        },
        {
            "id": 25,
            "text": "Harris said that's a long way in the future, but she hopes she gets the opportunity to walk across the stage in front of her family and friends, and professors that she said became like family too."
        },
        {
            "id": 26,
            "text": "Obama's remarks on Saturday marked the first of three speeches he is scheduled to deliver to graduating students."
        },
        {
            "id": 27,
            "text": "On Saturday evening, the former president is slated to take part in a prime time special for high school graduates that will air on the major television networks."
        },
        {
            "id": 28,
            "text": "In June, Obama and former first lady Michelle Obama are also scheduled to speak at a commencement hosted by YouTube."
        },
        {
            "id": 29,
            "text": "Over the course of his presidency, Obama gave in-person commencement addresses at three historically black colleges: Hampton University, Howard University and Morehouse College."
        },
        {
            "id": 30,
            "text": "On Saturday, he said that graduates of such institutions are \"inheritors of one of America's proudest traditions\" and that \"no generation has been better positioned to be warriors for justice and remake the world.\""
        },
        {
            "id": 31,
            "text": "Donethe Cyprien, 22, graduated from Morgan State University in Baltimore on Saturday."
        },
        {
            "id": 32,
            "text": "Since Morgan State ended in-person classes, she's been with family in Montgomery County, Maryland."
        },
        {
            "id": 33,
            "text": "\""
        },
        {
            "id": 34,
            "text": "Honestly, it was sad,\" she said after participating in her virtual commencement."
        },
        {
            "id": 35,
            "text": "\"Right now I'm supposed to be at school actually doing all of this."
        },
        {
            "id": 36,
            "text": "Instead, I'm watching my graduation in my bed and texting my friends.\""
        },
        {
            "id": 37,
            "text": "Cyprien said virtual commencements are a nice gesture, but can't replicate what she and other members of the class of 2020 have lost."
        },
        {
            "id": 38,
            "text": "\""
        },
        {
            "id": 39,
            "text": "All those goodbyes, those hugs — all that was supposed to be happening in person.\""
        }
    ]
}