{
    "title": "Poll: GOP presidential race wide open; Hillary Clinton leads Jeb Bush in theoretical matchup",
    "text": [
        {
            "id": 0,
            "text": "The 2016 Republican presidential nominating battle is shaping up as the most wide-open in a generation, with a new Washington Post-ABC News poll showing five prospective candidates within four percentage points of one another at the top and a half-dozen more in the mix."
        },
        {
            "id": 1,
            "text": "The picture is very different on the Democratic side, where former secretary of state Hillary Rodham Clinton is the clear front-runner."
        },
        {
            "id": 2,
            "text": "In a hypothetical matchup, Clinton leads former Florida governor Jeb Bush — seen by many GOP establishment figures as the party’s strongest general-election candidate — 53 percent to 41 percent."
        },
        {
            "id": 3,
            "text": "Clinton’s commanding position is fueled by large leads over Bush with female, non-white and young voters."
        },
        {
            "id": 4,
            "text": "The poll found that neither Clinton nor Bush appears to be weighed down by a dynastic family name."
        },
        {
            "id": 5,
            "text": "Sixty-six percent of all Americans say they view the Clinton family favorably, while 54 percent have a favorable opinion of the Bushes."
        },
        {
            "id": 6,
            "text": "In the GOP primary contest, which is only beginning to take shape as prospective candidates test messages and assemble national networks, nobody has emerged as an anchor in the field."
        },
        {
            "id": 7,
            "text": "Among Republican and GOP-leaning independents, Bush and Sen. Rand Paul (Ky.) share the top ranking at 14 percent, though with a statistically insignificant lead."
        },
        {
            "id": 8,
            "text": "Former Arkansas governor Mike Huckabee runs third at 13 percent, followed by Rep. Paul Ryan (Wis.) at 11 percent and New Jersey Gov. Chris Christie at 10 percent."
        },
        {
            "id": 9,
            "text": "View Graphic"
        },
        {
            "id": 10,
            "text": "Looking ahead to the 2016 elections\n\nSens. Ted Cruz (Tex.) and Marco Rubio (Fla.), Wisconsin Gov. Scott Walker and Texas Gov. Rick Perry follow close behind, while support for Louisiana Gov. Bobby Jindal and Ohio Gov. John Kasich stands in the low single digits."
        },
        {
            "id": 11,
            "text": "The poll shows a wide gulf between the more conservative activists, who make up part of the GOP base, and the party’s more moderate voters."
        },
        {
            "id": 12,
            "text": "Among Republicans who identify as “very conservative,” Huckabee is the clear leader, favored by 21 percent."
        },
        {
            "id": 13,
            "text": "A former Baptist minister whose faith has helped propel his political career, Huckabee is especially strong among white evangelical Protestants, winning 22 percent of that group."
        },
        {
            "id": 14,
            "text": "Paul runs second among the “very conservative” at 13 percent."
        },
        {
            "id": 15,
            "text": "Close behind are Cruz at 11 percent and Rubio and Christie at 10 percent."
        },
        {
            "id": 16,
            "text": "Cruz built a national following with a Senate filibuster over President Obama’s health-care law that led to last fall’s partial federal government shutdown."
        },
        {
            "id": 17,
            "text": "But among Republicans who call themselves “somewhat conservative,” moderate or liberal, Cruz’s support slips to 4 percent."
        },
        {
            "id": 18,
            "text": "The poll shows a reverse trend for Bush."
        },
        {
            "id": 19,
            "text": "While just 7 percent of “very conservative” Republicans and GOP-leaning independents favor the former governor, 18 percent of “somewhat conservative” Republicans and 14 percent of moderates and liberals choose Bush."
        },
        {
            "id": 20,
            "text": "Among more moderate voters, Ryan is the favorite, with 17 percent."
        },
        {
            "id": 21,
            "text": "As Mitt Romney’s vice-presidential running mate, Ryan is the closest the GOP has to an heir apparent, but he has been torn between running for president and pursuing House leadership opportunities."
        },
        {
            "id": 22,
            "text": "Christie, who has struggled to rebound from the George Washington Bridge traffic scandal that engulfed his administration, does not lead among any demographic or ideological group."
        },
        {
            "id": 23,
            "text": "Polling this far out is unreliable at predicting outcomes, and the GOP contest will not get underway until well after November’s midterm elections."
        },
        {
            "id": 24,
            "text": "But polls are closely watched by donors, operatives and others who are starting to size up potential candidates."
        },
        {
            "id": 25,
            "text": "The Post-ABC poll provides some clues about candidates’ strengths and weaknesses."
        },
        {
            "id": 26,
            "text": "Jindal, who has been one of the most aggressive potential candidates in preparing for a presidential campaign, trails almost all of his potential rivals, with 1 percent overall, peaking at 2 percent among registered voters."
        },
        {
            "id": 27,
            "text": "In the wake of Christie’s bridge troubles, some Republican establishment figures buzzed about Walker, who gained national prominence by taking on labor unions in his state and surviving a hard-fought recall campaign in 2012."
        },
        {
            "id": 28,
            "text": "But the poll has Walker in the back of the pack as well, with 5 percent overall."
        },
        {
            "id": 29,
            "text": "Paul — who has been trying to broaden his appeal beyond the libertarian base of his father, former congressman Ron Paul (R-Tex.) — is the prospective candidate with the broadest support across all three ideological groups."
        },
        {
            "id": 30,
            "text": "He wins 13 percent among those who are very conservative, 13 percent of somewhat conservative Republicans and 16 percent among moderates and liberals."
        },
        {
            "id": 31,
            "text": "Many GOP insiders and former Romney donors are trying to draft Bush into the race, believing he would be the party’s best chance to defeat Clinton if she is the Democratic nominee."
        },
        {
            "id": 32,
            "text": "But the poll found Clinton leading Bush by 12 percentage points among registered voters."
        },
        {
            "id": 33,
            "text": "And while Obama’s approval rating has dropped to its lowest point of his presidency, his unpopularity has not rubbed off on Clinton, who outperformed Obama’s 2012 showing across a number of groups."
        },
        {
            "id": 34,
            "text": "Clinton captures a bigger share of her base (she wins 94 percent of Democrats) than Bush does of his (he wins 88 percent of Republicans)."
        },
        {
            "id": 35,
            "text": "Among independents — a group Romney won by five percentage points in 2012 — Clinton edges Bush by a statistically insignificant 47 percent to 44 percent."
        },
        {
            "id": 36,
            "text": "Bush has a slight lead, 49 percent to 45 percent, among white voters, a group that favored Romney by 20 points over Obama."
        },
        {
            "id": 37,
            "text": "Non-white voters overwhelmingly favor Clinton, 74 percent to 20 percent."
        },
        {
            "id": 38,
            "text": "Clinton also holds substantial leads among women (59 percent to 36 percent) and among voters between ages 18 and 39 (61 percent to 33 percent)."
        },
        {
            "id": 39,
            "text": "Both Clinton and Bush could rely on warm feelings about their families, which have been at the forefront of American politics for more than two decades."
        },
        {
            "id": 40,
            "text": "Overall, both families are viewed favorably, among partisans as well as the political middle."
        },
        {
            "id": 41,
            "text": "Among the general public, 55 percent of political independents say they have a favorable view of the Bushes, while 64 percent say so about the Clintons."
        },
        {
            "id": 42,
            "text": "Among Hispanics, the Bushes garner a net favorable rating of 53 percent, although the Clintons are liked by 79 percent."
        },
        {
            "id": 43,
            "text": "The poll shows little evidence of Bush fatigue among conservatives, with 72 percent viewing the Bush family favorably and just 10 percent saying they had a “very unfavorable” opinion of the Bushes."
        },
        {
            "id": 44,
            "text": "The Post-ABC poll was conducted Thursday to Sunday among a random national sample of 1,000 adults, including interviews on conventional telephones and with cellphone-only respondents."
        },
        {
            "id": 45,
            "text": "The margin of sampling error for overall results and among the 855 registered voters interviewed is plus or minus 3.5 percentage points."
        },
        {
            "id": 46,
            "text": "The error margin is five points among the sample’s 424 Republicans and GOP-leaning independents."
        },
        {
            "id": 47,
            "text": ""
        }
    ]
}