{
    "title": "House votes to give furloughed federal workers back pay",
    "text": [
        {
            "id": 0,
            "text": "A bill that provides back pay for furloughed Federal workers during the government shutdown unanimously passed the House during a rare Saturday session on Capitol Hill."
        },
        {
            "id": 1,
            "text": "Some 800,000 federal workers have been stuck at home without pay since October 1 when Congress failed to pass a budget for the new fiscal year."
        },
        {
            "id": 2,
            "text": "On Friday, the White House said the president would sign the measure."
        },
        {
            "id": 3,
            "text": "House Speaker John Boehner and GOP House leadership held the vote as part of a strategy to pass piecemeal spending legislation that addressed the issues brought up by the government shutdown."
        },
        {
            "id": 4,
            "text": "Although Democrats oppose the incremental approach, saying it amounts to conservatives choosing to fund programs and services they like, the bill passed with strong bipartisan support."
        },
        {
            "id": 5,
            "text": "Retroactive pay is guaranteed under the bill, but federal workers can't expect their paychecks until after the government shutdown ends and Congress reaches a resolution on the budget."
        },
        {
            "id": 6,
            "text": "It’s unclear when the Senate might vote on the bill."
        },
        {
            "id": 7,
            "text": "Shortly after the vote both parties in the House held press conferences, giving their separate takes on its significance."
        },
        {
            "id": 8,
            "text": "House Majority Leader Eric Cantor used the vote to highlight the fact that the government shutdown has left many American citizens in the lurch even if back pay for furloughed workers is secured."
        },
        {
            "id": 9,
            "text": "“What about the vets?"
        },
        {
            "id": 10,
            "text": "Do the Democrats not feel it's important to make sure the pain is eased on them?"
        },
        {
            "id": 11,
            "text": "What about the sick children that need access to clinical trials?"
        },
        {
            "id": 12,
            "text": "Is it not as important to ease the pain of the shutdown for them?"
        },
        {
            "id": 13,
            "text": "Or is it just the federal employees that the Democratic minority thinks is important?” Cantor asked."
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": "However, House Democratic Leader Nancy Pelosi shifted the conversation away from the piecemeal funding to the broader issue of how to end the shutdown."
        },
        {
            "id": 16,
            "text": "Pelosi announced that 195 voting House Democrats have signed their names to a letter saying they will support a resolution in line with the $988 billion budget that has received support from some House Republicans."
        },
        {
            "id": 17,
            "text": "The letter to Speaker Boehner demands “a vote on a clean continuing resolution immediately so that government functioning can resume and Americans can move on with their lives.”"
        },
        {
            "id": 18,
            "text": "The letter is consistent with the Democrats long-standing call for a \"clean\" spending resolution without any Obamacare provisions."
        },
        {
            "id": 19,
            "text": "However, Pelosi called the Democrats latest maneuver an “unprecedented offer” because she promises that Democrats will not try to force any new conditions on House negotiations with the Senate."
        },
        {
            "id": 20,
            "text": "If Boehner put the resolution to a vote, Democrats would need about two dozen more votes from Republicans in order to reach the two-thirds majority."
        },
        {
            "id": 21,
            "text": "However, up until now, Boehner has been unwilling to bring the resolution to a vote, and its unlikely House Republicans would defy GOP leadership and side with the Democrats."
        },
        {
            "id": 22,
            "text": "Shortly after the bill passed the House on Saturday, Defense Secretary Chuck Hagel announced that most Defense Department civilian workers who were furloughed would be asked to return to work beginning next week."
        },
        {
            "id": 23,
            "text": "Hagel said Pentagon and Justice Department attorneys have found that the law allows the Department of Defense to bring back employees whose responsibilities contribute to the morale, well-being, capabilities and readiness of service members."
        },
        {
            "id": 24,
            "text": "The House also passed a resolution acknowledging the need for the Armed Forces to have access to religious services on military installations during the government shutdown."
        }
    ]
}