{
    "title": "Biden to withdraw US troops from Afghanistan by September 11",
    "text": [
        {
            "id": 0,
            "text": "Joe Biden will withdraw all the remaining US troops from Afghanistan by September 11, the 20th anniversary of the al-Qaida terrorist attacks on New York and Washington, a senior administration official has confirmed."
        },
        {
            "id": 1,
            "text": "The president is expected to make a formal announcement on Wednesday."
        },
        {
            "id": 2,
            "text": "There are currently about 2,500 US troops in the country, serving alongside 7,000 other foreign troops as part of a Nato coalition."
        },
        {
            "id": 3,
            "text": "Most, if not all, Nato allies are likely to withdraw in coordination with the US."
        },
        {
            "id": 4,
            "text": "“We will remain in lockstep with them as we undergo this operation."
        },
        {
            "id": 5,
            "text": "We went in together, adjusted together and now we will prepare to leave together,” a US official said."
        },
        {
            "id": 6,
            "text": "The drawdown of US troops will begin by 1 May, the withdrawal deadline the Trump administration agreed with the Taliban last year, and will be completed by the 9/11 anniversary."
        },
        {
            "id": 7,
            "text": "“We went to Afghanistan to deliver justice to those who attacked us on September 11th and to disrupt terrorists seeking to use Afghanistan as a safe haven to attack,” a senior administration official said."
        },
        {
            "id": 8,
            "text": "“We believe we achieved that objective some years ago."
        },
        {
            "id": 9,
            "text": "We judge the threat against the homeland now emanating from Afghanistan to be at a level that we can address it, without a persistent military footprint in the country and without remaining at war with the Taliban.”"
        },
        {
            "id": 10,
            "text": "The only remaining US military presence after September 11 this year will be security for the US embassy, a task normally carried out by marines."
        },
        {
            "id": 11,
            "text": "The Biden administration has said it will negotiate with the Afghan government over the precise security arrangements for the diplomatic mission in Kabul."
        },
        {
            "id": 12,
            "text": "About 800,000 US soldiers and other military personnel have served at least once in Afghanistan since the US invasion in 2001, launched in the wake of the September 11 attacks."
        },
        {
            "id": 13,
            "text": "More than 2,300 have been killed, and 20,000 wounded."
        },
        {
            "id": 14,
            "text": "Nearly 50,000 Afghan civilians have died in the conflict since 2001."
        },
        {
            "id": 15,
            "text": "Although the overall civilian death toll decreased last year, there has been an increase in targeted killings."
        },
        {
            "id": 16,
            "text": "The number of women killed in 2020 rose last year and according to the UN, 65 journalists, media professionals and human rights defenders were killed between 1 January 2018 and 31 January 2021."
        },
        {
            "id": 17,
            "text": "Peace talks between the Kabul government and the Taliban have been under way since September, but they suffered a setback this week when the insurgents said they would not attend a US-backed peace summit in Turkey due to begin in a few days."
        },
        {
            "id": 18,
            "text": "A Taliban spokesman, Muhammad Naeem, tweeted on Tuesday that the Taliban would not take part in any such conference “until all foreign forces completely withdraw from our homeland”."
        },
        {
            "id": 19,
            "text": "Fawzia Koofi, an Afghan politician and women’s rights activist said on Twitter: “No war will end with war …"
        },
        {
            "id": 20,
            "text": "The next few months should be used to reach peace."
        },
        {
            "id": 21,
            "text": "The Taliban wanted a US exit, they got it."
        },
        {
            "id": 22,
            "text": "What we want now from Taliban is peace and life in dignity and harmony.”"
        },
        {
            "id": 23,
            "text": "The US military orthodoxy until recently has been that any withdrawal from Afghanistan would have to be “conditions-based”, meaning it was dependent on the security situation and the threat posed by the Taliban to the democratic and social gains of the past 20 years."
        },
        {
            "id": 24,
            "text": "The senior US official briefing reporters on the decision said: “The president has judged that a conditions-based approach, which has been the approach of the past two decades, is a recipe for staying in Afghanistan forever.”"
        },
        {
            "id": 25,
            "text": "Biden pledged to continue the withdrawal from Afghanistan in his presidential campaign."
        },
        {
            "id": 26,
            "text": "Interviewed during the campaign on the CBS programme Face the Nation, Biden was asked if he would feel any responsibility if Afghan human rights, particularly of women, were harmed as a result of the withdrawal."
        },
        {
            "id": 27,
            "text": "“Do I bear responsibility?"
        },
        {
            "id": 28,
            "text": "Zero responsibility,” Biden replied."
        },
        {
            "id": 29,
            "text": "“The responsibility I have is to protect America’s national self-interests and not put our women and men in harm’s way to try to solve every single problem in the world by use of force.”"
        },
        {
            "id": 30,
            "text": "The administration says it will keep sufficient forces in the region to react if al-Qaida or other terrorist groups re-establish training camps inside Afghanistan, but the dispersal of the terrorist threat meant it no longer made sense to keep a permanent force in the country."
        },
        {
            "id": 31,
            "text": "“This is not 2001, it is 2021,” the senior official said."
        },
        {
            "id": 32,
            "text": "“And in 2021, the terrorist threat that we face is real and it emanates from a number of countries indeed a number of continents, from Yemen, from Syria, from Somalia, from other parts of Africa."
        },
        {
            "id": 33,
            "text": "And we have to focus on those aspects of a dispersed and distributed terrorist threat.”"
        },
        {
            "id": 34,
            "text": "Britain has about 750 troops in Afghanistan in non-combat roles, and while no final decision has been made as to what will happen to them, senior defence sources recently indicated that the UK is likely to largely withdraw in parallel with the US."
        },
        {
            "id": 35,
            "text": "“If they go, we’ll all have to go."
        },
        {
            "id": 36,
            "text": "That’s the reality of it,” one British source said."
        },
        {
            "id": 37,
            "text": "Combat operations for UK troops lasted until 2014, and 454 forces personnel or civilians employed by the Ministry of Defence were killed while serving."
        },
        {
            "id": 38,
            "text": "Some UK insiders fear that if the Taliban were to regain control following the withdrawal it could raise a simple question in the minds of the public – “what was it all for?”"
        },
        {
            "id": 39,
            "text": "– although there is a growing belief that the terror threat to western countries is finally reducing."
        },
        {
            "id": 40,
            "text": "US officials said there would be a decisive response to any Taliban attacks on US and allied troops during the withdrawal."
        },
        {
            "id": 41,
            "text": "However, attacks on Afghan troops and civilians have continued despite the peace talks between the Afghan government and the Taliban."
        },
        {
            "id": 42,
            "text": "A suicide car bombing on Tuesday killed a child and at least two other civilians in Farah, western Afghanistan."
        },
        {
            "id": 43,
            "text": "It exploded as residents broke their fast on the first day of Ramadan."
        },
        {
            "id": 44,
            "text": "At least 10 members of the Afghan security forces were killed in the north of the country."
        },
        {
            "id": 45,
            "text": "The imminent announcement of withdrawal drew criticism from Republican leaders and a few Democrats."
        },
        {
            "id": 46,
            "text": "“Foreign terrorists will not leave the US alone because our politicians have grown tired of taking the fight to them,” the Republican Senate minority leader, Mitch McConnell, said, adding that Biden “needs to explain to the American people why he thinks abandoning our partners and retreating in the face of the Taliban will make America safer”."
        },
        {
            "id": 47,
            "text": "Jeanne Shaheen, Democratic senator from New Hampshire, said on Twitter that the withdrawal “undermines our commitment to the Afghan people, particularly Afghan women”."
        },
        {
            "id": 48,
            "text": "“I urge the Biden admin to make every effort between now and September to safeguard the progress made and support our partners in the formation of an inclusive, transitional government,” Shaheen wrote."
        }
    ]
}