{
    "title": "AG Garland Opens Probe into ‘Unconstitutional’ Practices at Minneapolis Police Department",
    "text": [
        {
            "id": 0,
            "text": "Attorney General Merrick Garland announced Wednesday that the Justice Department has opened a civil investigation into potentially “unconstitutional” practices at the Minneapolis police department."
        },
        {
            "id": 1,
            "text": "The guilty verdict against former officer Derek Chauvin for the murder of resident George Floyd “does not address potentially systemic policing issues in Minneapolis,” Garland said during a Wednesday address."
        },
        {
            "id": 2,
            "text": "“Today, I am announcing that the Justice Department has opened a civil investigation to determine whether the Minneapolis police department engages in a pattern or practice of unconstitutional or unlawful policing,” Garland told reporters."
        },
        {
            "id": 3,
            "text": "The investigation will be staffed by attorneys from the Justice Department’s civil rights division and the U.S. Attorney’s Office for the District of Minnesota."
        },
        {
            "id": 4,
            "text": "The attorney general said the new investigation will assess whether the MPD “engages in a pattern or practice of using excessive force,” as well as the force’s “current systems of accountability” for officers accused of misconduct."
        },
        {
            "id": 5,
            "text": "“I know that justice is slow, sometimes elusive, and sometimes never comes,” Garland said."
        },
        {
            "id": 6,
            "text": "“The Justice Department will be unwavering in its pursuit of equal justice under law.”"
        },
        {
            "id": 7,
            "text": "The announcement came after a jury found former officer Chauvin guilty of second- and third-degree murder, as well as second-degree manslaughter, in the Floyd case."
        },
        {
            "id": 8,
            "text": "Chauvin was filmed pinning Floyd to the ground for roughly nine minutes during his arrest last May, during which time Floyd lost consciousness, and was subsequently pronounced dead at the scene."
        },
        {
            "id": 9,
            "text": "Video of the incident sparked massive riots across the U.S. in late May and June 2020, as well as demonstrations against racism and police brutality that continued throughout the summer."
        },
        {
            "id": 10,
            "text": ""
        }
    ]
}