{
    "title": "Trump officials interfered with CDC reports on Covid-19",
    "text": [
        {
            "id": 0,
            "text": "The CDC's Morbidity and Mortality Weekly Reports are authored by career scientists and serve as the main vehicle for the agency to inform doctors, researchers and the general public about how Covid-19 is spreading and who is at risk."
        },
        {
            "id": 1,
            "text": "Such reports have historically been published with little fanfare and no political interference, said several longtime health department officials, and have been viewed as a cornerstone of the nation's public health work for decades."
        },
        {
            "id": 2,
            "text": "But since Michael Caputo, a former Trump campaign official with no medical or scientific background, was installed in April as the Health and Human Services department's new spokesperson, there have been substantial efforts to align the reports with Trump's statements, including the president's claims that fears about the outbreak are overstated, or stop the reports altogether."
        },
        {
            "id": 3,
            "text": "Caputo and his team have attempted to add caveats to the CDC's findings, including an effort to retroactively change agency reports that they said wrongly inflated the risks of Covid-19 and should have made clear that Americans sickened by the virus may have been infected because of their own behavior, according to the individuals familiar with the situation and emails reviewed by POLITICO."
        },
        {
            "id": 4,
            "text": "Caputo's team also has tried to halt the release of some CDC reports, including delaying a report that addressed how doctors were prescribing hydroxychloroquine, the malaria drug favored by Trump as a coronavirus treatment despite scant evidence."
        },
        {
            "id": 5,
            "text": "The report, which was held for about a month after Caputo’s team raised questions about its authors’ political leanings, was finally published last week."
        },
        {
            "id": 6,
            "text": "It said that \"the potential benefits of these drugs do not outweigh their risks.\""
        },
        {
            "id": 7,
            "text": "In one clash, an aide to Caputo berated CDC scientists for attempting to use the reports to \"hurt the President\" in an Aug. 8 email sent to CDC Director Robert Redfield and other officials that was widely circulated inside the department and obtained by POLITICO."
        },
        {
            "id": 8,
            "text": "\"CDC to me appears to be writing hit pieces on the administration,\" appointee Paul Alexander wrote, calling on Redfield to modify two already published reports that Alexander claimed wrongly inflated the risks of coronavirus to children and undermined Trump's push to reopen schools."
        },
        {
            "id": 9,
            "text": "\"CDC tried to report as if once kids get together, there will be spread and this will impact school re-opening . . ."
        },
        {
            "id": 10,
            "text": "Very misleading by CDC and shame on them."
        },
        {
            "id": 11,
            "text": "Their aim is clear.\""
        },
        {
            "id": 12,
            "text": "Alexander also called on Redfield to halt all future MMWR reports until the agency modified its years-old publication process so he could personally review the entire report prior to publication, rather than a brief synopsis."
        },
        {
            "id": 13,
            "text": "Alexander, an assistant professor of health research at McMaster University near Toronto whom Caputo recruited this spring to be his scientific adviser, added that CDC needed to allow him to make line edits — and demanded an \" immediate stop \" to the reports in the meantime."
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": "\"The reports must be read by someone outside of CDC like myself, and we cannot allow the reporting to go on as it has been, for it is outrageous."
        },
        {
            "id": 16,
            "text": "Its lunacy,\" Alexander told Redfield and other officials."
        },
        {
            "id": 17,
            "text": "\"Nothing to go out unless I read and agree with the findings how they CDC, wrote it and I tweak it to ensure it is fair and balanced and 'complete.'\""
        },
        {
            "id": 18,
            "text": "CDC officials have fought the efforts to retroactively change reports but have increasingly allowed Caputo and his team to review them before publication, according to the three individuals with knowledge of the situation."
        },
        {
            "id": 19,
            "text": "Caputo also helped install CDC’s interim chief of staff last month, two individuals added, ensuring that Caputo himself would have more visibility into an agency that has often been at odds with HHS political officials during the pandemic."
        },
        {
            "id": 20,
            "text": "Paul Alexander uses red type to call for inserting text and accuses CDC officials of trying to use the reports to undermine President Donald Trump."
        },
        {
            "id": 21,
            "text": "Asked by POLITICO about why he and his team were demanding changes to CDC reports, Caputo praised Alexander as \"an Oxford-educated epidemiologist\" who specializes \"in analyzing the work of other scientists,\" although he did not make him available for an interview."
        },
        {
            "id": 22,
            "text": "\"Dr. Alexander advises me on pandemic policy and he has been encouraged to share his opinions with other scientists."
        },
        {
            "id": 23,
            "text": "Like all scientists, his advice is heard and taken or rejected by his peers,\" Caputo said in a statement."
        },
        {
            "id": 24,
            "text": "Caputo also said that HHS was appropriately reviewing the CDC's reports."
        },
        {
            "id": 25,
            "text": "“Our intention is to make sure that evidence, science-based data drives policy through this pandemic—not ulterior deep state motives in the bowels of CDC,\" he said."
        },
        {
            "id": 26,
            "text": "Caputo's team has spent months clashing with scientific experts across the administration."
        },
        {
            "id": 27,
            "text": "Alexander this week tried to muzzle infectious-disease expert Anthony Fauci from speaking about the risks of the coronavirus to children, and The Washington Post reported in July that Alexander had criticized the CDC's methods and findings."
        },
        {
            "id": 28,
            "text": "But public health experts told POLITICO that they were particularly alarmed that the CDC's reports could face political interference, praising the MMWRs as essential to fighting the pandemic."
        },
        {
            "id": 29,
            "text": "\"It's the go-to place for the public health community to get information that's scientifically vetted,\" said Jennifer Kates, who leads the Kaiser Family Foundation's global health work."
        },
        {
            "id": 30,
            "text": "In an interview with POLITICO, Kates rattled off nearly a dozen examples of MMWR reports that she and other researchers have relied on to determine how Covid-19 has spread and who's at highest risk, including reports on how the virus has been transmitted in nursing homes, at churches and among children."
        }
    ]
}