{
    "title": "Republicans may call back IRS official who refused to testify ",
    "text": [
        {
            "id": 0,
            "text": "Republican Rep. Darrell Issa declared Thursday that the embattled IRS official who refused to testify Wednesday had no right to do so, and is now looking to haul her back before his committee."
        },
        {
            "id": 1,
            "text": "The chairman of the House oversight committee made the call after consulting with attorneys about IRS official Lois Lerner's bizarre appearance before the panel on Wednesday."
        },
        {
            "id": 2,
            "text": "Lerner, the head of the exempt organizations division which oversaw the controversial targeting of conservative groups, caused confusion Wednesday morning when she pleaded the Fifth and refused to answer questions -- but also delivered an opening statement in which she asserted her innocence."
        },
        {
            "id": 3,
            "text": "Though Issa dismissed her from the hearing room, he questioned at the time whether she had waived her rights by delivering the statement."
        },
        {
            "id": 4,
            "text": "A spokesman told Fox News on Thursday that Issa had reached a decision."
        },
        {
            "id": 5,
            "text": "\"After consulting with counsel, Chairman Issa has concluded that Ms. Lerner's 5th amendment assertion is no longer valid,\" spokesman Ali Ahmad said."
        },
        {
            "id": 6,
            "text": "\"She remains under subpoena, the Committee is looking at recalling her for testimony.\""
        },
        {
            "id": 7,
            "text": "Issa, citing the concerns over Lerner's comments, never actually adjourned the hearing -- where other current and former Treasury and IRS officials testified."
        },
        {
            "id": 8,
            "text": "He only called it into recess."
        },
        {
            "id": 9,
            "text": "The thinking among Republicans is that they can still call her back to testify."
        },
        {
            "id": 10,
            "text": "Issa told Fox News on Thursday that she can't put the genie \"back in the bottle.\""
        },
        {
            "id": 11,
            "text": "Republicans are accusing Lerner of trying to have it both ways."
        },
        {
            "id": 12,
            "text": "\"If you could do it the way she wants to do it, then every defendant would come, say 'I didn't rob the bank, and I'm not going to answer the prosecutor's questions,'\""
        },
        {
            "id": 13,
            "text": "Rep. Trey Gowdy, R-S.C., told Fox News. \""
        },
        {
            "id": 14,
            "text": "So we'd all in life like to get out our version without having to answer anyone else's questions."
        },
        {
            "id": 15,
            "text": "It's just not fair."
        },
        {
            "id": 16,
            "text": "And I don't think it's legal.\""
        },
        {
            "id": 17,
            "text": "In her opening statement, Lerner asserted her innocence."
        },
        {
            "id": 18,
            "text": "\"I have not done anything wrong,\" she said."
        },
        {
            "id": 19,
            "text": "\"I have not broken any laws."
        },
        {
            "id": 20,
            "text": "I have not violated any IRS rules or regulations, and I have not provided false information to this or any other congressional committee.\""
        },
        {
            "id": 21,
            "text": "Lerner is represented by lawyer William W. Taylor, who is noted for winning a dismissal of all charges against former IMF director Dominique Strauss-Kahn in a high-profile sexual assault case."
        },
        {
            "id": 22,
            "text": "It's unclear whether Lerner can avoid another round of questioning by the committee."
        },
        {
            "id": 23,
            "text": "Rep. Elijah Cummings, D-Md., the top Democrat on the committee who was as tough as any Republican on the IRS witnesses Wednesday, said he thought Lerner was still in her right to refuse to answer questions."
        },
        {
            "id": 24,
            "text": "\"I'd like to see (hearings) run like a federal court."
        },
        {
            "id": 25,
            "text": "Unfortunately, this is not a federal court and she does have a right,\" Cummings said Wednesday."
        },
        {
            "id": 26,
            "text": "\"And we have to adhere to that.\""
        },
        {
            "id": 27,
            "text": "A brief assessment by the Cato Institute agreed, saying that unlike in a courtroom, Lerner could in a hearing room \"selectively\" invoke her Fifth Amendment right."
        },
        {
            "id": 28,
            "text": "Former IRS Commissioner Doug Shulman, who stayed to testify Wednesday, endured a tough round of questioning for the second day in a row."
        },
        {
            "id": 29,
            "text": "Lawmakers were visibly frustrated as he struggled to explain why he didn't notify Congress after learning of the practice last year."
        },
        {
            "id": 30,
            "text": "But lawmakers are itching to question Lerner, having aired a string of complaints about her own failure to notify Congress."
        },
        {
            "id": 31,
            "text": "Lerner touched off the public controversy when, at an American Bar Association conference this month, she apologized for the IRS' practice of targeting conservative organizations for additional scrutiny."
        },
        {
            "id": 32,
            "text": "It was the first time the agency acknowledged the practice."
        },
        {
            "id": 33,
            "text": "She said she hadn't revealed the information sooner, because she was never asked."
        },
        {
            "id": 34,
            "text": "But just two days before the ABA conference, Lerner was specifically asked about the investigation."
        },
        {
            "id": 35,
            "text": "Rep. Joseph Crowley, D-N.Y., who had asked her about it, later called her answer evasive."
        },
        {
            "id": 36,
            "text": "\"The bottom line is you cannot lie to Congress, and you cannot be evasive, you cannot try to mislead Congress,\" he said."
        }
    ]
}