{
    "title": "Donald Trump works a football crowd in Iowa, hints at new 'nice' playbook",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "US Republican presidential nominee Donald Trump speaks during rally at the Atkinson Country Club in Atkinson, New Hampshire on November 4, 2016."
        },
        {
            "id": 2,
            "text": "Members of the Secret Service rush Republican presidential candidate Donald Trump off the stage at a campaign rally in Reno, Nev., on Saturday, Nov. 5, 2016."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "Trump vs. the tape on Obama and the protester"
        },
        {
            "id": 5,
            "text": "LYNDEN, WA - MAY 07: Republican presidential candidate Donald Trump gives a speech during a rally at the The Northwest Washington Fair and Event Center on May 7, 2016 in Lynden, Washington."
        },
        {
            "id": 6,
            "text": "Trump became the Republican presumptive nominee following his landslide win in Indiana on Tuesday."
        },
        {
            "id": 7,
            "text": "Former Democratic US Presidential candidate Hillary Clinton speaks to staff and supporters at the New Yorker hotel after her defeat in the presidential election November 9, 2016 in New York."
        },
        {
            "id": 8,
            "text": "Green Party presidential nominee Jill Stein waits to be introduced prior to a press conference at the National Press Club August 23, 2016 in Washington, DC."
        },
        {
            "id": 9,
            "text": "Donald Trump 'trying to be nice' in Iowa"
        },
        {
            "id": 10,
            "text": "Story highlights Was it a softer-edged Donald Trump mingling with a football crowd in Iowa?"
        },
        {
            "id": 11,
            "text": "\"Everyone's capable, everyone's competent,\" Trump tells CNN in describing his upcoming debate rivals \"I'm trying to be nice,\" he adds —\n\nWith still months to go before the Iowa caucuses, Donald Trump hopped in a golf cart here at Iowa State University and took a victory lap."
        },
        {
            "id": 12,
            "text": "Hundreds of rowdy football fans swarmed the businessman-turned-presidential candidate Saturday as he zipped around the football stadium – each extending a hand, hoping for a high-five, and maybe a selfie."
        },
        {
            "id": 13,
            "text": "“Go get ‘em Donald!”"
        },
        {
            "id": 14,
            "text": "one man shouted as Trump worked the tailgating crowd before the day’s Iowa-Iowa State game."
        },
        {
            "id": 15,
            "text": "“I love you!”"
        },
        {
            "id": 16,
            "text": "a woman cried out, rushing in for a picture."
        },
        {
            "id": 17,
            "text": "All the while, The Donald marveled, urging this reporter to take note of the enthusiastic throngs of Iowans and asking if other candidates could galvanize throngs of people in the same way."
        },
        {
            "id": 18,
            "text": "“What a crowd, huh?”"
        },
        {
            "id": 19,
            "text": "Trump told CNN."
        },
        {
            "id": 20,
            "text": "“I’m honored by it."
        },
        {
            "id": 21,
            "text": "You see it, you’ve been following me and it’s been amazing and we just came out with a great poll in Iowa where we’re far and away in first place and you understand why.”"
        },
        {
            "id": 22,
            "text": "But even as Trump veered off in his favorite direction toward the polling that has consistently shown him leading the pack of now 16 Republican candidates, he hinted at something just as new as the camo-colored version of his now-iconic Make America Great Again cap that sat on his head: a Donald Trump with softer edges."
        },
        {
            "id": 23,
            "text": "After weeks of slamming candidates for what he perceives as their low-energy campaigning, Trump didn’t jab when asked whether he would be facing off with a bunch of sleepers on the stage of 11 at the second Republican debate on Wednesday."
        },
        {
            "id": 24,
            "text": "“No, no, no sleepers."
        },
        {
            "id": 25,
            "text": "Everyone’s capable, everyone’s competent"
        },
        {
            "id": 26,
            "text": "and you do what you need to do."
        },
        {
            "id": 27,
            "text": "You know I’ve been doing this for a long time and I want to make America great again"
        },
        {
            "id": 28,
            "text": "I know how to do it,” Trump said."
        },
        {
            "id": 29,
            "text": "Competent and capable are rarely words that leave Trump’s mouth as he discusses his rivals, whom he’s invariably slammed as “weak,” “boring,” an “idiot” and “spoiled brat.”"
        },
        {
            "id": 30,
            "text": "Is a different Trump emerging?"
        },
        {
            "id": 31,
            "text": "“Well, I’m trying to be nice,” he said."
        },
        {
            "id": 32,
            "text": "But as Trump works on sanding out his rougher edges, he isn’t losing the showmanship that has marked his business and political career, and makes him a crowd favorite at every event he attends."
        },
        {
            "id": 33,
            "text": "Disembarking from his golf cart to walk to the state Republican Party’s tent in a parking lot strewn with beer cans and Solo cups, Trump engaged with one not-so-sober college football fan after the next."
        },
        {
            "id": 34,
            "text": "“Get this man some Fireball!”"
        },
        {
            "id": 35,
            "text": "a college student cried out, calling for the college favorite cinnamon-flavored whiskey."
        },
        {
            "id": 36,
            "text": "The merriment was briefly interrupted at times by those not looking to play a part in the Trump spectacle, and a dozen protesters met Trump at the state GOP tent holding signs that slammed Trump for his immigration views, including one that read, “No human being is illegal you colonizing white supremacist.”"
        },
        {
            "id": 37,
            "text": "Others shouted obscenities, with at least one person calling Trump a “racist” – cries that were quickly drowned out by Trump supporters chanting the billionaire’s trademarked name: “Trump, Trump, Trump, Trump!”"
        },
        {
            "id": 38,
            "text": "Trump worked the crowd like a seasoned political pro, shaking hands, signing autographs and stopping briefly for one selfie after the next."
        },
        {
            "id": 39,
            "text": "“He has an honest tongue,” one inebriated Iowa State University student said in the only clean part of an expletive-laced rant explaining his support for Trump."
        },
        {
            "id": 40,
            "text": "Bryan Elliott, a 29-year-old National Guardsman who served one tour of duty in Afghanistan, quickly jumped in to explain why voters should really support Trump: his foreign policy views and his business experience."
        },
        {
            "id": 41,
            "text": "“Everybody else’s foreign policy is bulls–t,” Elliott said."
        },
        {
            "id": 42,
            "text": "“I’m going to vote for him because he runs a f—ing business.”"
        },
        {
            "id": 43,
            "text": "Others were downright enthusiastic, crying out that Trump would be the next president and promising to support him."
        },
        {
            "id": 44,
            "text": "“You can do it."
        },
        {
            "id": 45,
            "text": "Don’t back down,” one man shouted as Trump walked by."
        },
        {
            "id": 46,
            "text": "Amid the throngs of chanting supporters, some skeptics also emerged."
        },
        {
            "id": 47,
            "text": "Bryannah Slate, a sophomore at Iowa State University, said that she wasn’t sure whether she could support Trump, but, like the others, she thronged the GOP front-runner to catch a glimpse of a man who’s fortunes are rising with the polls."
        },
        {
            "id": 48,
            "text": "“If he’s a future president, that’d be awesome, to see him,” she said."
        }
    ]
}