{
    "title": "John Boehner's Fiscal Cliff Approach Unpopular With Voters",
    "text": [
        {
            "id": 0,
            "text": "Voters are not impressed by House Speaker John Boehner's handling of \"fiscal cliff\" negotiations, according to a new Washington Post-ABC News poll."
        },
        {
            "id": 1,
            "text": "Just 25 percent of voters approve of the Ohio Republican's handling of budget negotiations, compared with 49 percent who approve of President Barack Obama's."
        },
        {
            "id": 2,
            "text": "And while Obama gets 79 percent approval from Democratic voters, Boehner garners only 39 percent approval from Republicans."
        },
        {
            "id": 3,
            "text": "He gets lower marks from moderates than from \"very conservative\" Republicans."
        },
        {
            "id": 4,
            "text": "\"Fiscal cliff\" is the nickname for the moment at the end of the year when big automatic spending cuts are scheduled to take effect and Bush-era tax cuts are set to expire."
        },
        {
            "id": 5,
            "text": "The Congressional Budget Office has warned that if Congress fails to make the spending cuts and tax hikes less severe, it could cause a recession."
        },
        {
            "id": 6,
            "text": "President Obama has long insisted that the tax cuts should be allowed to expire on household incomes above $250,000, while Boehner has been adamant that no tax rates should increase."
        },
        {
            "id": 7,
            "text": "Popular opinion has long been on Obama's side, as polls have consistently shown that the public favors higher taxes on higher incomes."
        },
        {
            "id": 8,
            "text": "An earlier Washington Post-Pew poll showed that most Americans would blame Republicans if fiscal cliff talks fail."
        },
        {
            "id": 9,
            "text": "A handful of Republicans in the House, most notably Rep. Tom Cole (R-Okla.), have broken ranks to urge Boehner to give in to Obama on the top marginal tax rates."
        },
        {
            "id": 10,
            "text": "Senate Majority Leader Harry Reid (D-Nev.) said Tuesday that Boehner hasn't been getting much help from other top Republicans in the House."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": "\"Boehner's having trouble finding help from his leadership as to what they're to do,\" Reid said."
        },
        {
            "id": 13,
            "text": "\"The speaker has to make an important decision -- whether he's going to save his speakership or the country.\""
        }
    ]
}