{
    "title": "Former Colorado Gov. John Hickenlooper Is Running For President In 2020",
    "text": [
        {
            "id": 0,
            "text": "Former Colorado Gov. John Hickenlooper is adding his name to the list of presidential hopefuls."
        },
        {
            "id": 1,
            "text": "The Democrat and self-described “extreme moderate” announced his 2020 run for the White House on Monday morning in a YouTube video that highlights his accomplishments as a Colorado businessman-turned-politician while also directly attacking President Donald Trump."
        },
        {
            "id": 2,
            "text": "“I’ve stood up to my fair share of bullies,” Hickenlooper says in the campaign video after flashing clips of Trump."
        },
        {
            "id": 3,
            "text": "“Join me, and we’ll repair the damage done to our country and be stronger than ever.”"
        },
        {
            "id": 4,
            "text": "The video touts several advances in Colorado during his eight years as governor, including methane regulations, rising health care coverage rates, statewide economic growth and stricter gun laws ― including universal background checks and a ban on high-capacity magazines."
        },
        {
            "id": 5,
            "text": "Former Colorado Gov. John Hickenlooper announced his presidential candidacy on Monday in a campaign video that ticked off his achievements while also attacking President Donald Trump."
        },
        {
            "id": 6,
            "text": "That gun control legislation followed several mass shootings in his state, including the 2012 shooting at an Aurora movie theater that killed 12 people and wounded several dozen more."
        },
        {
            "id": 7,
            "text": "“Just offering thoughts and prayers,” he remarks in his video, “would never again be sufficient.”"
        },
        {
            "id": 8,
            "text": "“I’m running for president because we need dreamers in Washington, but we also need to get things done,” he says in the video."
        },
        {
            "id": 9,
            "text": "“I’ve proven again and again I can bring people together to produce the progressive change Washington has failed to deliver.”"
        },
        {
            "id": 10,
            "text": "I’ve proven again and again I can bring people together to produce the progressive change Washington has failed to deliver."
        },
        {
            "id": 11,
            "text": "Hickenlooper has been vocal about his presidential ambitions for some time but delayed announcing his candidacy until after his second gubernatorial term ended on Jan. 8."
        },
        {
            "id": 12,
            "text": "Those two terms as governor followed two terms as mayor of Denver and the launch of a successful brewpub company."
        },
        {
            "id": 13,
            "text": "To test his electoral chances, Hickenlooper has been traveling the country and raising money for his federal leadership PAC."
        },
        {
            "id": 14,
            "text": "In its first four months, Giddy Up PAC pulled in more than $600,000 ― 80 percent of which came from people in Colorado, ﻿The Colorado Sun reported."
        },
        {
            "id": 15,
            "text": "In early January, Hickenlooper told Denver station KDVR that upcoming trips to key primary states like Iowa and New Hampshire were to see if “someone from an interior state like Colorado can get traction. ..."
        },
        {
            "id": 16,
            "text": "Can you raise enough money to compete on the national landscape?”"
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "Even if his state doesn’t hold the same fundraising power as some other states, he said it makes up for that in its message to voters."
        },
        {
            "id": 19,
            "text": "“What I do think that we’ve done in Colorado, this notion of finding ways to bring people together who normally don’t compromise"
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "I still believe that that has currency and value in America,” Hickenlooper, who has earned praise for his efforts to achieve bipartisan compromise, told the station."
        },
        {
            "id": 22,
            "text": "A poll taken for The Des Moines Register, CNN and Mediacom in December found that the majority of Iowa’s likely Democratic caucusgoers ― 67 percent ― think they don’t know enough about Hickenlooper to assess him as a presidential candidate."
        },
        {
            "id": 23,
            "text": "Twenty-four percent of respondents said they have a very favorable or mostly favorable opinion of him, while the remaining 9 percent said they have a mostly or very unfavorable view of him."
        },
        {
            "id": 24,
            "text": "Hickenlooper plans to attend a public rally in Denver on Thursday at Civic Center Park."
        },
        {
            "id": 25,
            "text": "He will then tour Iowa on Friday and Saturday, according to his campaign."
        }
    ]
}