{
    "title": "Michael Hayden: President Obama to hold his ground",
    "text": [
        {
            "id": 0,
            "text": "Hayden said the biggest task for Obama in his speech is to be reassuring."
        },
        {
            "id": 1,
            "text": "Hayden: Obama to hold his ground\n\nAhead of a high-profile speech about changes to the National Security Agency by President Barack Obama, former NSA Director Michael Hayden said Friday he doesn’t believe any of the proposed reforms will change the way the government collects intelligence."
        },
        {
            "id": 2,
            "text": "“I think what we are going to see in the speech, Joe, is all of the language in the speech kind of fading left about transformation and transparency and checks and balances, but, frankly, I think the substance of the speech is going to be holding his ground,” Hayden told MSNBC’s “Morning Joe” host Joe Scarborough based on news reports of what Obama will unveil on Friday."
        },
        {
            "id": 3,
            "text": "“I don’t know that American intelligence agencies are going to be doing a whole lot of things different in a week, a month, or a year than what they are doing right now,” Hayden continued."
        },
        {
            "id": 4,
            "text": "( Also on POLITICO: Public 'all over the map' on NSA)\n\nShortly after Hayden’s appearance on MSNBC, news broke that Obama would be proposing that the NSA relinquish control over the phone data the NSA collects, but would not offer up who should collect the data instead."
        },
        {
            "id": 5,
            "text": "But Hayden said the biggest task for Obama in his speech is to be reassuring."
        },
        {
            "id": 6,
            "text": "“His mission here, I don’t think, is to change what we’re doing."
        },
        {
            "id": 7,
            "text": "His mission here is to make people more comfortable about what it is that the intelligence agencies are doing,” Hayden said."
        },
        {
            "id": 8,
            "text": "( Also on POLITICO: Obama to halt part of NSA program)"
        },
        {
            "id": 9,
            "text": "The retired general and former CIA director said the big questions Obama will have to address on the NSA’s phone data collection are where the data is held and how it can be queried."
        },
        {
            "id": 10,
            "text": "“I think the president’s going to punt the first question to Congress and NSA will continue to hold the data, and Congress won’t come up with an acceptable change,” Hayden said."
        },
        {
            "id": 11,
            "text": "On the second question, Hayden said he was concerned about requiring intelligence agencies to go to a judge every time they want to query data."
        },
        {
            "id": 12,
            "text": "“I was the director of NSA prior to 9/11, and if you direct the agency that they’ve got to go to a judge before they query data that is already there and already lawfully collected, that really feels like Sept. 10 to me,” Hayden said."
        },
        {
            "id": 13,
            "text": "“It’s a pre-9/11 mindset, and that would make me feel uncomfortable.”"
        },
        {
            "id": 14,
            "text": "The president’s 11 a.m. speech is the culmination of a months-long review of the surveillance programs made public last summer by leaker Edward Snowden."
        },
        {
            "id": 15,
            "text": "Before Hayden’s interview, the White House had not confirmed what changes to the program Obama would suggest making."
        }
    ]
}