{
    "title": "What it means to take 'The Fifth'",
    "text": [
        {
            "id": 0,
            "text": "Lois Lerner, the head of the IRS unit handling tax-exempt status, invoked her Fifth Amendment right against self-incrimination before the House Oversight Committee on Wednesday."
        },
        {
            "id": 1,
            "text": "She is in the spotlight following a Treasury inspector general’s report that found her unit used political criteria to screen applications for tax-exempt status from tea party and other conservative organizations."
        },
        {
            "id": 2,
            "text": "Lerner joins a long line of officials who “took the Fifth” when called to testify before Congress."
        },
        {
            "id": 3,
            "text": "Former Enron CEO Kenneth Lay, former lobbyist Jack Abramoff, retired Lt. Col. Oliver North and several Justice Department officials all invoked that privilege before Congress due to concerns that anything they may have said could have been used against them in court."
        },
        {
            "id": 4,
            "text": "Here is what the Fifth Amendment to the U.S. Constitution says:\n\nNo person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury, except in cases arising in the land or naval forces, or in the Militia, when in actual service in time of War or public danger; nor shall any person be subject for the same offense to be twice put in jeopardy of life or limb; nor shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use, without just compensation."
        },
        {
            "id": 5,
            "text": "What that last part – also known as the “self-incrimination clause” – generally means is that a witness cannot be forced to make statements that he or she feels might be negative or used against them."
        },
        {
            "id": 6,
            "text": "The right must be affirmatively waived."
        },
        {
            "id": 7,
            "text": "Invoking the Fifth Amendment is usually done to avoid answering specific questions."
        },
        {
            "id": 8,
            "text": "In Lerner’s case, the Justice Department is investigating the IRS saga and agency officials have faced pointed questions from lawmakers at three hearings."
        },
        {
            "id": 9,
            "text": "It remains unclear whether she ultimately will be compelled to testify by the Oversight panel."
        },
        {
            "id": 10,
            "text": "Republicans have questioned whether Lerner voided her right not to testify when she read her opening statement."
        },
        {
            "id": 11,
            "text": "“I have not done anything wrong."
        },
        {
            "id": 12,
            "text": "I have not broken any laws."
        },
        {
            "id": 13,
            "text": "I have not violated any IRS rules and regulations,” she said."
        },
        {
            "id": 14,
            "text": "Committee Chairman Darrell Issa, R-California, dismissed her with a warning she could be called back."
        }
    ]
}