{
    "title": "Trump to visit El Paso and Dayton following shootings",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump will visit El Paso, Texas, and Dayton, Ohio, in the coming days, following mass shootings in the cities over the weekend, the White House confirmed on Monday."
        },
        {
            "id": 1,
            "text": "Counselor to the President Kellyanne Conway told reporters at the White House on Monday that Trump will travel to Dayton and El Paso, she said, to express his condolences and help provide resources."
        },
        {
            "id": 2,
            "text": "Trump wants to hear more, she said, from the mayors of the cities and those directly affected."
        },
        {
            "id": 3,
            "text": "Conway did not specify which day Trump would go but El Paso Mayor Dee Margo, who did not meet with Trump during his last trip to the city, earlier this year, said he would meet with the President while he visits Wednesday to discuss his community’s specific needs in his capacity as mayor."
        },
        {
            "id": 4,
            "text": "On Tuesday, Vice President Mike Pence said he will join the President on his upcoming visits to the two cities."
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "Twenty-two people were killed and more than two dozen injured as a result of Saturday’s shooting in El Paso, which was one of three major mass shootings across the US in the past week."
        },
        {
            "id": 7,
            "text": "Nine people died and 27 others were injured as a result of the shooting in Dayton."
        },
        {
            "id": 8,
            "text": "On Monday, Trump delivered an address at the White House, calling on the country to condemn white supremacy and vowing to take action to prevent further gun massacres."
        },
        {
            "id": 9,
            "text": "But Trump stopped short of acknowledging his own divisive and racist rhetoric."
        },
        {
            "id": 10,
            "text": "And he failed to endorse any measures that would expand background checks for firearm sales, despite endorsing such laws earlier in the day."
        },
        {
            "id": 11,
            "text": "Trump also did not mention specific measures to limit access to firearms except proposing “red flag” laws, which would prevent firearms access to people who are mentally ill."
        },
        {
            "id": 12,
            "text": "During his speech, Trump mistakenly offered condolences to those who perished in Toledo – some 150 miles from the Dayton shooting."
        },
        {
            "id": 13,
            "text": "The mix-up appeared to strike a nerve with Dayton Mayor Nan Whaley, who said she hadn’t gotten confirmation of Trump’s visit when asked about it Monday."
        },
        {
            "id": 14,
            "text": "“I’ve heard that he’s coming Wednesday"
        },
        {
            "id": 15,
            "text": "but I have not gotten a call,” Whaley said."
        },
        {
            "id": 16,
            "text": "“And you know, he might be going to Toledo, I don’t know.”"
        },
        {
            "id": 17,
            "text": "Margo said he is “already getting the emails and the phone calls” from “people with lots of time on their hands.”"
        },
        {
            "id": 18,
            "text": "“We’re dealing with a tragedy of 22 people who have perished by the hateful, evil act of a white supremacist,” the mayor said."
        },
        {
            "id": 19,
            "text": "He continued, “I don’t know how we deal with evil."
        },
        {
            "id": 20,
            "text": "I don’t have a textbook for dealing with it other than the Bible."
        },
        {
            "id": 21,
            "text": "I’m sorry."
        },
        {
            "id": 22,
            "text": "We are going to go through this."
        },
        {
            "id": 23,
            "text": "The President is coming out."
        },
        {
            "id": 24,
            "text": "I will meet with the President."
        },
        {
            "id": 25,
            "text": "I guess for people who have lots of time on their hands, I will deal with the emails and phone calls.”"
        },
        {
            "id": 26,
            "text": "Democratic Rep. Veronica Escobar, who represents El Paso, told MSNBC on Monday morning that the President wasn’t welcome in her community."
        },
        {
            "id": 27,
            "text": "“Words have consequences, and the President has made my community and my people the enemy,” Escobar said."
        },
        {
            "id": 28,
            "text": "“He has told the country that we are people to be feared, people to be hated."
        },
        {
            "id": 29,
            "text": "He has done that at his rallies."
        },
        {
            "id": 30,
            "text": "He has done that through his Twitter.”"
        },
        {
            "id": 31,
            "text": ""
        }
    ]
}