{
    "title": "Tuesday's primaries a test of Trump's influence, hold potential for upsets: A look at the races to watch",
    "text": [
        {
            "id": 0,
            "text": "Several states are holding primary elections Tuesday, including some contests that could prove pivotal in determining whether Republicans or Democrats will control the Senate next year."
        },
        {
            "id": 1,
            "text": "A tight special U.S. House election also is being held in Ohio as a young Democrat hopes to upset a Republican who has garnered the support of President Trump, Ohio Gov. John Kasich and other party leaders."
        },
        {
            "id": 2,
            "text": "Early Tuesday, Trump urged Ohio voters to get out and vote for Republican State Sen. Troy Balderson for Congress, over his opponent, Democrat Danny O'Connor."
        },
        {
            "id": 3,
            "text": "\"Ohio, vote today for Troy Balderson for Congress."
        },
        {
            "id": 4,
            "text": "His opponent, controlled by Nancy Pelosi, is weak on Crime, the Border, Military, Vets, your 2nd Amendment - and will end your Tax Cuts."
        },
        {
            "id": 5,
            "text": "Troy will be a great Congressman."
        },
        {
            "id": 6,
            "text": "#MAGA,\" Trump tweeted early Tuesday."
        },
        {
            "id": 7,
            "text": "The Ohio race and others could put Trump’s influence to the test."
        },
        {
            "id": 8,
            "text": "Read on for a preview of some of the major elections on Tuesday."
        },
        {
            "id": 9,
            "text": "Missouri\n\nRepublicans are set to pick their candidate to take on Sen. Claire McCaskill, the Democratic incumbent, in the fall."
        },
        {
            "id": 10,
            "text": "McCaskill has represented Missouri in the Senate since 2007, but Fox News has her bid for re-election rated as a toss-up."
        },
        {
            "id": 11,
            "text": "Out of a crowded field of Republican candidates, Missouri Attorney General Josh Hawley has emerged as a favorite, even securing Trump’s endorsement months before the primary election."
        },
        {
            "id": 12,
            "text": "A lawyer who helped successfully argue before the Supreme Court a case for Hobby Lobby to be exempted from certain ObamaCare rules, Hawley has investigated alleged misuse of a charity donor list by former Missouri Gov. Eric Greitens, a Republican, while he was still in office."
        },
        {
            "id": 13,
            "text": "Greitens eventually resigned earlier this year after allegations of an affair that was at times violent and non-consensual surfaced."
        },
        {
            "id": 14,
            "text": "Austin Petersen, who unsuccessfully sought the Libertarian Party nomination for president in 2016, and Tony Monetti, an Air Force veteran and restaurant owner, are also running for the Republican nomination."
        },
        {
            "id": 15,
            "text": "MISSOURI SENATE CANDIDATE RAFFLING MACHINE"
        },
        {
            "id": 16,
            "text": "THAT CAN PRINT ‘UNTRACEABLE’ GUN PARTS\n\nMonetti has been endorsed by former vice presidential nominee Sarah Palin."
        },
        {
            "id": 17,
            "text": "Petersen is supported by the Republican Liberty Caucus."
        },
        {
            "id": 18,
            "text": "Missouri voters will also decide on a so-called right-to-work referendum on whether the state should ban compulsory union fees in all private-sector workplaces."
        },
        {
            "id": 19,
            "text": "Michigan\n\nGov. Rick Snyder, a Republican, can’t run for re-election due to term limits, but the race to replace him is anything but simple."
        },
        {
            "id": 20,
            "text": "For the Democrats, Abdul El-Sayed, Shri Thanedar and Gretchen Whitmer are battling for the nomination."
        },
        {
            "id": 21,
            "text": "Whitmer, a former county prosecutor and member of the state legislature, has emerged as the establishment favorite."
        },
        {
            "id": 22,
            "text": "El-Sayed, on the other hand, has campaigned as a more progressive choice with Sen. Bernie Sanders and Alexandria Ocasio-Cortez both lending their support to the man hoping to become Michigan’s first Muslim governor."
        },
        {
            "id": 23,
            "text": "Michigan Attorney General Bill Schuette, Lt. Gov. Brian Calley, state Sen. Pat Colbeck and Dr. Jim Hines are vying for the GOP nod."
        },
        {
            "id": 24,
            "text": "Trump endorsed Schuette nearly a year ago, saying he will be good for job growth in Michigan."
        },
        {
            "id": 25,
            "text": "As for Senate, two Republicans are hoping to secure the GOP nomination to take on incumbent Sen. Debbie Stabenow, a Democrat."
        },
        {
            "id": 26,
            "text": "African-American business executive and Iraq War pilot John E. James is taking on Sandy Pensler, a detergent manufacturer, in the August contest."
        },
        {
            "id": 27,
            "text": "FOX NEWS MIDTERM ELECTIONS HEADQUARTERS"
        },
        {
            "id": 28,
            "text": "Trump has endorsed James, who he called “spectacular.”"
        },
        {
            "id": 29,
            "text": "“Rarely have I seen a candidate with such great potential,” Trump said in a July tweet."
        },
        {
            "id": 30,
            "text": "While Fox News rates the gubernatorial race as a toss-up, the Senate election in November still remains likely safe for Democrats."
        },
        {
            "id": 31,
            "text": "In 2016, Trump narrowly eked out a victory over Democrat Hillary Clinton in Michigan."
        },
        {
            "id": 32,
            "text": "Voters in Michigan are able to cast so-called “straight ticket” ballots, meaning they would fill in one bubble to vote for all of one party’s candidates for office."
        },
        {
            "id": 33,
            "text": "Typically, voters were only able to pick Republicans or Democrats, but this year the Libertarian Party also qualified to nominate candidates for the ballot."
        },
        {
            "id": 34,
            "text": "“It certainly is historic, both for Michigan and for Libertarians."
        },
        {
            "id": 35,
            "text": "Many people see it as a real opportunity to bring new blood and new activists into the party,” Michigan Libertarian Party chairman Bill Hall told MLive.com."
        },
        {
            "id": 36,
            "text": "According to the Detroit News, Bill Gelineau and John Tatar are both battling for the Libertarian gubernatorial nomination as well, hoping to secure enough votes to ensure the party appears on the 2020 ballot."
        },
        {
            "id": 37,
            "text": "Kansas\n\nGov. Jeff Colyer is seeking his first full term leading the state, but the race is expected to be tough."
        },
        {
            "id": 38,
            "text": "Colyer was serving as Kansas’ lieutenant governor when Trump selected Sam Brownback to be the U.S. ambassador-at-large for international religious freedom in January 2018 — thus elevating Colyer into the state’s top position."
        },
        {
            "id": 39,
            "text": "Kansas Secretary of State Kris Kobach is also vying for the Republican nomination."
        },
        {
            "id": 40,
            "text": "Kobach was the vice chairman of the White House’s controversial voter fraud commission, which was dismantled by Trump earlier this year as it faced multiple legal battles and oppositions from states."
        },
        {
            "id": 41,
            "text": "His involvement with the group has earned him the scorn of the American Civil Liberties Union (ACLU), which has sent negative flyers to voters ahead of the primary election."
        },
        {
            "id": 42,
            "text": "Trump endorsed Kobach the day before the primary, saying he has been \"a strong and early supporter\" of the president."
        },
        {
            "id": 43,
            "text": "LIFELONG NEW YORKER JOINS STUDENTS IN KANSAS GOVERNOR RUN THAT HAS ‘NO RULES’"
        },
        {
            "id": 44,
            "text": "Former state Sen. Jim Barnett, Patrick Kucera, Tyler Ruzich, insurance commissioner Ken Selzer and Joseph Tutera Jr. are also running for the GOP nod."
        },
        {
            "id": 45,
            "text": "Barnett has been endorsed by the Kansas City Star and made headlines earlier this year when he picked his wife to be his running mate."
        },
        {
            "id": 46,
            "text": "Fox News rates the gubernatorial race as lean-Republican, but Democrats are hoping to change the governorship back to blue for the first time since 2011 — especially if Kobach wins."
        },
        {
            "id": 47,
            "text": "State Sen. Laura Kelly, former Wichita Mayor Carl Brewer and former Kansas Secretary of Agriculture Joshua Svaty have emerged as the three front-runners in the Democratic primary."
        },
        {
            "id": 48,
            "text": "The candidates have fought over ties to the National Rifle Association and plans for women’s reproductive health care in the state, according to KMUW public radio station."
        },
        {
            "id": 49,
            "text": "Washington\n\nSen. Maria Cantwell, a Democrat, is running for her fourth term in the U.S. Senate — but not without a fight from nearly 30 challengers."
        },
        {
            "id": 50,
            "text": "That group that includes: 13 Republicans, four Democrats, five independents and one Libertarian, among others."
        },
        {
            "id": 51,
            "text": "Former Washington GOP chairwoman Susan Hutchison has emerged as the leading Republican contender to take on Cantwell, according to the Seattle Times."
        },
        {
            "id": 52,
            "text": "WASHINGTON STATE EMPLOYEES SUE TO ‘ESCAPE’ UNION AFTER JANUS SUPREME COURT RULING"
        },
        {
            "id": 53,
            "text": "According to FiveThirtyEight, Cantwell has voted with Trump’s agenda 25 percent of the time, including with the nomination of some Cabinet appointees: Robert Wilkie for secretary of veterans affairs, Robert Lighthizer for trade representative, Sonny Perdue for agriculture secretary and Dan Coats for director of national intelligence."
        },
        {
            "id": 54,
            "text": "Fox News rates the Senate race as likely Democrat, but Hutchison told the Seattle Times, “We wouldn’t have this crowded ballot if Maria Cantwell wasn’t vulnerable.”"
        },
        {
            "id": 55,
            "text": "Clinton solidly beat Trump in Washington in the 2016 presidential election."
        },
        {
            "id": 56,
            "text": "Ohio"
        },
        {
            "id": 57,
            "text": "It’s not a primary election, but Trump’s influence will certainly be tested in Tuesday’s special House election in Ohio."
        },
        {
            "id": 58,
            "text": "The open seat came with the resignation of Rep. Pat Tiberi in the 12th district, which has been represented by Republicans for nearly 40 years."
        },
        {
            "id": 59,
            "text": "But Democrat Danny O’Connor is hoping to change that in his race against Republican state Sen. Troy Balderson."
        },
        {
            "id": 60,
            "text": "Polls have shown a tight race between the two, even though Balderson has been endorsed by Trump and Ohio Gov. John Kasich."
        },
        {
            "id": 61,
            "text": "The president made an appearance in Ohio just a few days before the election to lend his support as well."
        },
        {
            "id": 62,
            "text": "“A vote for Danny boy and the Democrats is a vote to let criminals and drugs pour into our country,” Trump said of Balderson’s opponent."
        },
        {
            "id": 63,
            "text": "“And to let MS-13 run wild in our communities."
        },
        {
            "id": 64,
            "text": "And you know what they do once they’re there.”"
        },
        {
            "id": 65,
            "text": "On Twitter, Trump has called O’Connor a “puppet” for House Minority Leader Nancy Pelosi."
        },
        {
            "id": 66,
            "text": ""
        }
    ]
}