{
    "title": "Biden to Withdraw All Troops from Afghanistan by September 11",
    "text": [
        {
            "id": 0,
            "text": "President Biden has decided to withdraw all American soldiers from Afghanistan by September 11, multiple outlets reported on Tuesday."
        },
        {
            "id": 1,
            "text": "Biden will keep around 3,000 troops in Afghanistan past the May withdrawal date called for by the Trump administration, U.S. officials told the New York Times."
        },
        {
            "id": 2,
            "text": "However, those troops would be brought home by the fall."
        },
        {
            "id": 3,
            "text": "Biden is expected to announce the decision on Wednesday."
        },
        {
            "id": 4,
            "text": "In addition to U.S. troops, about 7,000 soldiers from other nations are currently stationed in the country, most of them NATO personnel."
        },
        {
            "id": 5,
            "text": "The U.S. is currently attempting to negotiate a peace deal between the Afghan government and Taliban fighters."
        },
        {
            "id": 6,
            "text": "The Taliban has threatened to attack U.S. forces if there is no withdrawal by May 1."
        },
        {
            "id": 7,
            "text": "“The reality is that the United States has big strategic interests in the world, like non-proliferation, like an increasingly aggressive and assertive Russia, like North Korea and Iran,” and China, a person familiar with withdrawal deliberations told the Washington Post."
        },
        {
            "id": 8,
            "text": "“The main threats to the American homeland are actually from other places: from Africa, from parts of the Middle East — Syria and Yemen….Afghanistan"
        },
        {
            "id": 9,
            "text": "just does not rise to the level of those other threats at this point.”"
        },
        {
            "id": 10,
            "text": "Advertisement\n\nAdvertisement\n\nU.S. intelligence agencies concluded that the Afghan government will have difficulty countering offensives from the Taliban, in an annual threat assessment report."
        },
        {
            "id": 11,
            "text": "Advertisement\n\n“The Afghan government will struggle to hold the Taliban at bay if the coalition withdraws support,” the report states."
        },
        {
            "id": 12,
            "text": ""
        }
    ]
}