{
    "title": "Trump wins Nevada caucuses",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump trounced his rivals in the Nevada caucuses on Tuesday, notching his third consecutive victory and giving the Manhattan mogul even more momentum heading into Super Tuesday next week, when voters in a dozen states will cast their ballots."
        },
        {
            "id": 1,
            "text": "Trump’s decisive win, which the Associated Press announced immediately after polls closed, was propelled by an electorate even more enraged than the ones that had swept him to wins in New Hampshire and South Carolina, and a second-place showing in Iowa."
        },
        {
            "id": 2,
            "text": "\"We love Nevada."
        },
        {
            "id": 3,
            "text": "We love Nevada,” Trump declared in his victory speech."
        },
        {
            "id": 4,
            "text": "\"You're going to be proud of your president and you're going to be even prouder of your country.\""
        },
        {
            "id": 5,
            "text": "For the first time in the 2016 primary season, media entrance polls showed that a majority of voters, 57 percent of Nevada caucus-goers, said they were \"angry\" with the federal government."
        },
        {
            "id": 6,
            "text": "And, as significantly, they want to bring in an outsider to fix it."
        },
        {
            "id": 7,
            "text": "More than three in five caucus-goers said they favor someone from outside the political establishment rather than a candidate with political experience as president."
        },
        {
            "id": 8,
            "text": "It all added up to Trump’s biggest night yet."
        },
        {
            "id": 9,
            "text": "\"Now we’re winning, winning, winning,” Trump said."
        },
        {
            "id": 10,
            "text": "“And soon the country is going to start winning, winning, winning.”"
        },
        {
            "id": 11,
            "text": "The outcome was bad news for Marco Rubio, who is now 0 for 4 in the February contests, and Ted Cruz, who won the Iowa caucuses but finished a disappointing third in South Carolina on Saturday."
        },
        {
            "id": 12,
            "text": "Those two senators continued to vie for the crucial mantle of the best candidate to eventually take down Trump."
        },
        {
            "id": 13,
            "text": "With 100 percent of precincts reporting, Trump finished first with a whopping 46 percent of the vote, with Rubio and Cruz trailing far behind."
        },
        {
            "id": 14,
            "text": "Rubio came in second with 24 percent of the vote, while Cruz finished third with a little more than 21 percent."
        },
        {
            "id": 15,
            "text": "Rubio skipped an election-night speech, while an exhausted-looking Cruz proclaimed himself the only legitimate alternative to Trump."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "\"The only campaign that has beaten Donald Trump and the only campaign that can beat Donald Trump is this campaign,” Cruz told supporters."
        },
        {
            "id": 18,
            "text": "Stopping Trump now looks like a steeper proposition after he trampled Rubio and Cruz on Tuesday, scoring huge wins across nearly every cross-section of the Republican Party."
        },
        {
            "id": 19,
            "text": "Entrance polls show Trump won moderate voters and very conservative voters by huge margins."
        },
        {
            "id": 20,
            "text": "He won in rural and urban areas, and among voters with only high school diplomas and those with post-graduate degrees."
        },
        {
            "id": 21,
            "text": "Trump even handily bested Cruz among his supposed base of evangelical Christians, and, though the sample was small, topped his two Cuban-American opponents among Hispanic caucus-goers."
        },
        {
            "id": 22,
            "text": "Trump reveled in the details."
        },
        {
            "id": 23,
            "text": "\"I love the evangelicals!” he yelled."
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": "\"Number one with Hispanics,” he bragged."
        },
        {
            "id": 26,
            "text": "And he pointedly called out the home states of his remaining rivals — Texas for Cruz, Florida for Rubio and Ohio for John Kasich — as places he now leads in the polls and will win in the coming weeks."
        },
        {
            "id": 27,
            "text": "“It’s going to be an amazing two months,” he said."
        },
        {
            "id": 28,
            "text": "\"We might not even need the two months to be honest, folks.\""
        },
        {
            "id": 29,
            "text": "Indeed, it's not clear where anyone can next beat Trump, though Cruz looked ahead to Texas, which votes on March 1, in his speech."
        },
        {
            "id": 30,
            "text": "\"I cannot wait to get home to the great state of Texas,” he said."
        },
        {
            "id": 31,
            "text": "Cruz and Rubio now face a political calendar that plays even more to Trump’s strengths: massive made-for-TV rallies and free national media coverage, with a dozen states voting in only seven days."
        },
        {
            "id": 32,
            "text": "Kasich, who finished in last place on Tuesday night, continued to insist he was in the race to stay."
        },
        {
            "id": 33,
            "text": "His chief strategist, John Weaver, released a memo after the race was called, taking aim at Rubio, Kasich's rival for the mantle of establishment favorite."
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": "\"Contrary to what his campaign is trying to portray, Senator Rubio just endured another disappointing performance despite being the highest spending candidate in Nevada,\" the memo read."
        },
        {
            "id": 36,
            "text": "\"Republicans are now left to wonder whether investing in Marco Rubio is throwing good money after bad.\""
        },
        {
            "id": 37,
            "text": "Cruz, who was neck-and-neck with Rubio in early returns, also said the Florida senator underperformed."
        },
        {
            "id": 38,
            "text": ""
        },
        {
            "id": 39,
            "text": "\"Marco Rubio started working early and put a significant amount of resources into making Nevada the one early state he could win,\" Cruz's campaign wrote in a statement. \""
        },
        {
            "id": 40,
            "text": "But despite the hype, Rubio still failed to beat Donald Trump.\""
        },
        {
            "id": 41,
            "text": "Low turnout put a particular premium on early organizing, in which both Rubio and Cruz quietly invested."
        },
        {
            "id": 42,
            "text": "Cruz had the backing of the state’s Republican attorney general, Adam Laxalt, and made appeals to Nevada’s rural voters with a television ad highlighting his opposition to the fact that the federal government controls 85 percent of the state’s land."
        },
        {
            "id": 43,
            "text": "(Kasich targeted the same issue in TV ads, as well.)"
        },
        {
            "id": 44,
            "text": "Rubio, meanwhile, tried to connect with Nevada voters from his time living there as a child in the late 1970s and early 1980s, telling audiences about how his father worked as a bartender at Sam's Town and his mother as a maid at the Imperial Palace."
        },
        {
            "id": 45,
            "text": "(He still has numerous cousins in the state.)"
        },
        {
            "id": 46,
            "text": "Rubio’s family’s dabbled with Mormonism during those years and Rubio hoped an active Mormon political network that lifted Mitt Romney to a landslide win, with 50 percent of the vote, would turn out for him."
        },
        {
            "id": 47,
            "text": "But it didn't happen."
        },
        {
            "id": 48,
            "text": "Stumping in rural Nevada on caucus day, Trump continued to boast of his strong poll numbers in states coming up on the voting calendar."
        },
        {
            "id": 49,
            "text": "He warned supporters to be wary of “dishonest stuff” from Cruz, whom he dubbed a \"baby\" and a \"liar.\""
        },
        {
            "id": 50,
            "text": ""
        },
        {
            "id": 51,
            "text": ""
        },
        {
            "id": 52,
            "text": "And Trump issued a warning shot to Rubio to beware taking him on: The two have largely avoided tangling, but that could change as Rubio builds on his second-place finish in South Carolina on Saturday."
        },
        {
            "id": 53,
            "text": "“When he hits me, ugh, is he gonna be hit,” Trump said."
        },
        {
            "id": 54,
            "text": "“Actually, I can’t wait.\""
        },
        {
            "id": 55,
            "text": "Trump was in a far more ebullient mood at his victory rally, where he stood behind a lectern for his third straight win, flanked by two of his sons."
        },
        {
            "id": 56,
            "text": "Alluding to his practice in his earlier life of raking in money whenever he had the chance, Trump said: Now we’re going to get greedy for the United States."
        },
        {
            "id": 57,
            "text": "Trump walked off the stage mouthing, “USA, USA, USA.”"
        },
        {
            "id": 58,
            "text": ""
        }
    ]
}