{
    "title": "Harry Reid taps Elizabeth Warren as envoy to liberal groups",
    "text": [
        {
            "id": 0,
            "text": "Reid taps Warren as envoy to liberals\n\nSenate Democrats have enlisted progressive firebrand Elizabeth Warren to be a member of their leadership team, giving a major platform to a liberal icon just a week after Democrats took a beating at the polls and lost control of the Senate."
        },
        {
            "id": 1,
            "text": "Harry Reid, the incoming Senate minority leader, had engaged in private talks with the Massachusetts freshman to create a special leadership post for the former Harvard professor, and the leadership elections Thursday solidified the new Democratic team."
        },
        {
            "id": 2,
            "text": "The title will be strategic policy adviser to the Democratic Policy and Communications Committee — a specially created position that puts Warren into a much more prominent position in the Senate hierarchy."
        },
        {
            "id": 3,
            "text": "In the new position, Warren is expected to serve as a go-between to liberal groups to ensure their voice is part of the leadership’s private deliberations."
        },
        {
            "id": 4,
            "text": "A Reid spokesman said she will have a “role in shaping policy and messaging.”"
        },
        {
            "id": 5,
            "text": "( Also on POLITICO: Clinton left out by liberal donor club)"
        },
        {
            "id": 6,
            "text": "Adding Warren, Democrats say, would bring in a nationally known name who could help sharpen the Democratic message as it goes toe-to-toe with the new Senate Republican majority."
        },
        {
            "id": 7,
            "text": "The move would likely be viewed favorably by an increasingly liberal caucus."
        },
        {
            "id": 8,
            "text": "But elevating Warren could also be seen as an indication that the new Senate Democratic minority is less interested in bipartisan compromises,even as the White House and Senate Republicans are signaling they want to cut deals in the new Congress."
        },
        {
            "id": 9,
            "text": "The position was discussed at a closed-door Senate Democratic Caucus meeting on Thursday."
        },
        {
            "id": 10,
            "text": "At that meeting, Reid — along with his chief deputies, Dick Durbin of Illinois, Chuck Schumer of New York and Patty Murray of Washington state — are all expected to be elected, respectively, to the top four posts in the new Democratic minority."
        },
        {
            "id": 11,
            "text": "Montana Sen. Jon Tester, a second-term Democrat, is expected to be named chairman of the Democratic Senatorial Campaign Committee, sources say."
        },
        {
            "id": 12,
            "text": "Reid, however, faced some resistance in his caucus on Thursday when he was elected minority leader."
        },
        {
            "id": 13,
            "text": "Sen. Claire McCaskill of Missouri said Thursday she won’t support him."
        },
        {
            "id": 14,
            "text": "Joe Manchin of West Virginia, Heidi Heitkamp of North Dakota and Mary Landrieu of Louisiana, were also defectors."
        },
        {
            "id": 15,
            "text": "( From POLITICO Magazine: What Happened to Warren the Watchdog?)"
        },
        {
            "id": 16,
            "text": "“I’m open to change,” Manchin said."
        },
        {
            "id": 17,
            "text": "But Reid, who has been Democratic leader since 2005, still has overwhelming support within his caucus, which will likely have 46 members in the next Congress."
        },
        {
            "id": 18,
            "text": "Many of them benefited from his aggressive fundraising during their campaigns in recent years, and he has awarded a number of Democrats with key committee positions over the years."
        },
        {
            "id": 19,
            "text": "No Democrat is expected to challenge him for the post."
        },
        {
            "id": 20,
            "text": "Opening up the lame-duck session of Congress"
        },
        {
            "id": 21,
            "text": "Wednesday, Reid said his goal was not to obstruct the new majority."
        },
        {
            "id": 22,
            "text": "Citing his time as minority leader under President George W. Bush, Reid said, “I have been able to strike compromise with my Republican colleagues, and I’m ready to do it again.”"
        },
        {
            "id": 23,
            "text": "Follow @politico"
        }
    ]
}