{
    "title": "Obama Vows Firm Stance on Deficit-Reduction Plan",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — President Obama reassured leaders of labor and progressive groups on Tuesday that he will not yield to Congressional Republicans and extend Bush-era tax cuts for the wealthiest Americans as he negotiates for a deficit-reduction plan to avoid looming tax increases and spending cuts."
        },
        {
            "id": 1,
            "text": "And Mr. Obama’s spokesman, Jay Carney, confirmed that the president’s starting point in the budget talks with Congressional leaders that open Friday at the White House would be the 80-page deficit-reduction package that Mr. Obama sent Congress in September 2011."
        },
        {
            "id": 2,
            "text": "It calls for $1.6 trillion in new revenues — twice the sum that Speaker John A. Boehner was willing to consider back then."
        },
        {
            "id": 3,
            "text": "“The president has put forward a very specific plan that will be what he brings to the table when he sits down with Congressional leaders,” Mr. Carney told reporters at his daily White House briefing."
        },
        {
            "id": 4,
            "text": "The $4 trillion, 10-year plan includes the commitment to $1.1 trillion in spending cuts that Mr. Obama and Congress have already agreed to, he added, as well as additional spending cuts that include $340 billion in savings from Medicare and Medicaid."
        },
        {
            "id": 5,
            "text": "And, Mr. Carney said, Mr. Obama “insists as the essence of balance that revenue be included — $1.6 trillion in revenue.”"
        },
        {
            "id": 6,
            "text": "The president’s initial bargaining posture reflects the leverage he gained, by both parties’ reckoning, through his own re-election and the additional seats in Congress that his party won last week."
        },
        {
            "id": 7,
            "text": "The newly elected candidates will not be part of the lame-duck Congress that opened this week."
        },
        {
            "id": 8,
            "text": "Mr. Boehner and other Republicans are nonetheless chastened by their parties’ losses and have signaled a new openness to raising revenues as part of an accord that also reduces long-term spending for the costly entitlement benefit programs, chiefly Medicare and Medicaid."
        },
        {
            "id": 9,
            "text": "Mr. Carney suggested, as other White House officials have, that Mr. Obama’s victory amounted to a mandate for a “balanced” deficit reduction plan that includes higher taxes from the wealthy since the president campaigned on that issue."
        },
        {
            "id": 10,
            "text": "“One of the useful things about this past year and the election is that these matters that the president and Congress will be deciding in the coming days and weeks and months were front and center during the campaign season,” he said."
        },
        {
            "id": 11,
            "text": "Yet Mr. Carney followed by noting the conciliatory tone that Mr. Obama struck in his post-election comments late last week."
        },
        {
            "id": 12,
            "text": "“He also said very clearly that he is not wedded to every aspect of his plan, and that he understands that in order to reach an agreement, everyone needs to compromise, and that compromise should not be a dirty word in Washington,” Mr. Carney said."
        },
        {
            "id": 13,
            "text": "But the president, in his White House meeting with union leaders and the heads of various progressive groups, emphasized instead how tough he will be in the coming budget talks."
        },
        {
            "id": 14,
            "text": "Throughout his first term, Mr. Obama’s liberal base has complained that he is too quick to compromise, and leaders went to the White House primed to stiffen his spine."
        },
        {
            "id": 15,
            "text": "“We are very, very committed so that the middle class and workers don’t end up paying the tab for a party we didn’t get to go to, and the president is committed to that as well,” said Richard L. Trumka, president of the A.F.L.-C.I.O., as he left the White House."
        },
        {
            "id": 16,
            "text": "In an interview later, Mary Kay Henry, the president of the Service Employees International Union, said of the hourlong session, “There was strong agreement that we have to pass the extension of the middle-class tax cuts, and we’re hoping that the extreme right wing in the Congress is willing to listen to the mandate of the people and work with the president to have the wealthiest Americans pay their fair share.”"
        }
    ]
}