{
    "title": "Reid puts GOP in a bind over Romney's taxes",
    "text": [
        {
            "id": 0,
            "text": "Republican sources say they’re in a Catch-22 situation on how to reply to Senate Majority Leader Harry Reid’s claims that GOP presidential candidate Mitt Romney went 10 years without paying taxes."
        },
        {
            "id": 1,
            "text": "They understand that they’re taking Reid’s bait and that responding to his unsubstantiated claims against Romney keeps alive the issue of Romney’s refusing to release his tax returns."
        },
        {
            "id": 2,
            "text": "Still, these GOP sources say they feel that if they do not respond to such a serious charge from such a high-ranking Democrat, it will look like a tacit admission Reid is right."
        },
        {
            "id": 3,
            "text": "Republicans stepped up attempts to undermine Reid’s unsubstantiated allegations Monday, saying Reid and other Democrats’ accusations are being orchestrated by President Barack Obama’s campaign – specifically his senior campaign adviser, David Axelrod."
        },
        {
            "id": 4,
            "text": "To that end, Republican National Committee spokesman Sean Spicer noted that Axelrod visited Senate Democrats for their weekly lunch last Tuesday."
        },
        {
            "id": 5,
            "text": "Later that afternoon, a Huffington Post story was published with Reid’s allegations about the presumptive GOP nominee not paying any taxes."
        },
        {
            "id": 6,
            "text": "“You’ve got to wonder if the so-called source is Axelrod himself,” Spicer said."
        },
        {
            "id": 7,
            "text": "“Hours after meeting with Axelrod, Reid comes out and makes baseless accusations?”"
        },
        {
            "id": 8,
            "text": "Axelrod flatly denied that allegation, calling it “completely false” and saying he “never had any such discussion.”"
        },
        {
            "id": 9,
            "text": "“Instead of pointing fingers in every direction, they can put the whole matter to rest by simply observing the standard George Romney and a generation of candidates have set by releasing the returns,” Axelrod said."
        },
        {
            "id": 10,
            "text": "In a separate article posted Monday, the Huffington Post reported that it interviewed Reid days before Axelrod’s visit, making any influence from the top Obama official’s Capitol Hill visit impossible."
        },
        {
            "id": 11,
            "text": "By trying to tie Reid’s remarks to the Obama campaign, Republicans are trying to hit Democrats where it could hurt most: the president’s credibility."
        },
        {
            "id": 12,
            "text": "That comes after the GOP response to Reid got increasingly hostile and personal over the weekend."
        },
        {
            "id": 13,
            "text": "“I’m not going to respond to a dirty liar who hasn’t filed a single page of tax returns himself (and) complains about people with money but lives in the Ritz-Carlton here down the street,” Republican National Committee Chairman Reince Priebus said on ABC News."
        },
        {
            "id": 14,
            "text": "“And the fact that we’re going to spend any time talking about it is ridiculous.”"
        },
        {
            "id": 15,
            "text": "Sen. Lindsey Graham of South Carolina also used the “L” word to describe Reid’s statements, which were repeated on the Senate floor later in the week, saying the majority leader is “making things up.”"
        },
        {
            "id": 16,
            "text": "“What he did on the floor of the Senate is so out of bounds."
        },
        {
            "id": 17,
            "text": "I think he’s lying about his statement, of knowing something about Romney,” Graham said Sunday on CNN’s “State of the Union.”"
        },
        {
            "id": 18,
            "text": "As for Reid, he tried to turn the focus right back to where he wants it."
        },
        {
            "id": 19,
            "text": "“This whole issue is not about me,” Reid said in his home state of Nevada on Monday."
        },
        {
            "id": 20,
            "text": "“Mitt Romney’s the first presidential candidate since his dad ran not to release his income tax returns."
        },
        {
            "id": 21,
            "text": "He’s released one income tax return, and that points toward the Bahamas, Switzerland and a few other foreign countries."
        },
        {
            "id": 22,
            "text": "This whole controversy will end very quickly if he releases his income tax returns, like everybody else has done.”"
        },
        {
            "id": 23,
            "text": "Romney has released his tax return from 2010 and an estimate from 2011."
        },
        {
            "id": 24,
            "text": "He has vowed to release his full 2011 return once it’s completed, but he will not release past years’, as previous presidential candidates have done."
        },
        {
            "id": 25,
            "text": "Meanwhile, Reid chief of staff David Krone insisted Monday, again, that he knows who Reid’s source is – and that the source is credible."
        },
        {
            "id": 26,
            "text": "“I know who this person is, and if I thought this person was not credible, I would say something to Sen. Reid."
        },
        {
            "id": 27,
            "text": "I would try to shut it down."
        },
        {
            "id": 28,
            "text": "This person is credible,” Krone said."
        },
        {
            "id": 29,
            "text": "“This person has asked Reid to protect the confidentiality of this person, but it’s real,” he continued."
        },
        {
            "id": 30,
            "text": "“This person told him this."
        },
        {
            "id": 31,
            "text": "This person said it to Sen. Reid.”"
        },
        {
            "id": 32,
            "text": "Multiple Democratic sources insist that Reid made the allegations against Romney on his own but also admit the Obama campaign is not telling him to back off."
        },
        {
            "id": 33,
            "text": "Sources close to Reid say he knew full well he would be challenged by Republicans and the media for accusing Romney of not paying taxes for 10 years but not offering any proof."
        },
        {
            "id": 34,
            "text": "But these sources say Reid didn’t care – in fact, he was eager to do it."
        },
        {
            "id": 35,
            "text": "Growing up impoverished in a trailer with no running water in Searchlight, Nevada, Reid literally fought his way out as a boxer."
        },
        {
            "id": 36,
            "text": "As a politician, he has never been afraid to punch below the belt, especially when he dislikes someone personally, and by all accounts Reid has a strong personal disregard for Romney."
        },
        {
            "id": 37,
            "text": "Through the years he has called President George W. Bush a loser and a liar, named then-Federal Reserve Chairman Alan Greenspan a political hack and gone after Sen. John McCain during the 2008 presidential race as someone too temperamental to be president."
        },
        {
            "id": 38,
            "text": "But Republicans say this time, Reid took it too far, not only because he won’t back up his accusation beyond citing a confidential source but because he chose to attack Romney on the issue from the Senate floor."
        },
        {
            "id": 39,
            "text": "Romney himself pushed back against Reid’s accusations twice last week, insisting that he has paid a lot of money in taxes – and telling the majority leader to either “put up or shut up.”"
        }
    ]
}