{
    "title": "Mystery Dem briefly voted yes, on Ryan budget",
    "text": [
        {
            "id": 0,
            "text": "For a brief moment there during the House vote Thursday morning on the budget proposed by Rep. Paul Ryan, it seemed that the GOP plan — generally reviled by Democrats — had attracted a tiny bit of support from across the aisle."
        },
        {
            "id": 1,
            "text": "Make that one lonely Democratic “yes” vote."
        },
        {
            "id": 2,
            "text": "On the budget that Democratic leaders have called a Medicare-slashing, Big-Oil-subsidizing horror-show?"
        },
        {
            "id": 3,
            "text": "That was a surprise."
        },
        {
            "id": 4,
            "text": "Alas, for Republicans who no doubt would have liked to call their plan “bipartisan,” the sole Dem vote disappeared from the “yes” column before the vote was gavelled to a close."
        },
        {
            "id": 5,
            "text": "The final tally was 221-207, with zero Democrats voting for the proposal."
        },
        {
            "id": 6,
            "text": "It’s entirely likely that a Democrat accidentally voted in favor, then realized his or her error and switched it."
        },
        {
            "id": 7,
            "text": "That’s not uncommon."
        },
        {
            "id": 8,
            "text": "What with all the votes members have to keep straight, and clumsiness when using that vote-card machine (swipe of a card, then hit a red button for no, green for yes, and yellow for present) mistakes can happen."
        },
        {
            "id": 9,
            "text": "Or, perhaps, the “yes” vote had a very rapid change of heart."
        },
        {
            "id": 10,
            "text": "We don’t know."
        },
        {
            "id": 11,
            "text": "And a spokeswoman for the Democratic whip’s office didn’t immediately return our call looking to identify the vote-flipper."
        },
        {
            "id": 12,
            "text": "As it turns out, 10 Republicans voted against the bill — and we can only assume those votes weren’t mistakes — meaning there was bipartisan opposition."
        },
        {
            "id": 13,
            "text": "But the bipartisan support was merely fleeting."
        }
    ]
}