{
    "title": "DOJ's Election Crimes Chief Steps Down",
    "text": [
        {
            "id": 0,
            "text": "Richard Pilger, director of the Election Crimes branch of the Department of Justice, has resigned from his post."
        },
        {
            "id": 1,
            "text": "The move came after Attorney General Bill Barr issued a memo to federal prosecutors authorizing them to probe “specific allegations” of voter fraud ahead of the results of the presidential race being certified, according to NBC News."
        },
        {
            "id": 2,
            "text": "“Having familiarized myself with the new policy and its ramifications, and in accord with the best tradition of the John C. Keeney Award for Exceptional Integrity and Professionalism (my most cherished Departmental recognition), I must regretfully resign from my role as director of the Election Crimes branch,” Pilger said in a letter to colleagues."
        },
        {
            "id": 3,
            "text": "“I have enjoyed very much working with you for over a decade to aggressively and diligently enforce federal criminal election law, policy, and practice without partisan fear or favor."
        },
        {
            "id": 4,
            "text": "I thank you for your support in that effort.”"
        },
        {
            "id": 5,
            "text": "According to The New York Times, Pilger also told colleagues he would move to a nonsupervisory role working on corruption prosecutions."
        },
        {
            "id": 6,
            "text": "Barr’s memo clears the way for prosecutors to get around Justice Department policy that normally would have prevented such overt measures before the election is certified."
        },
        {
            "id": 7,
            "text": "Barr's move effectively cuts Pilger's Election Crimes operation out of the process, which may have contributed to his resignation, one source says."
        },
        {
            "id": 8,
            "text": "President Donald Trump is claiming there has been a widespread, multi-state conspiracy by Democrats to skew the vote tally in Joe Biden's favor."
        },
        {
            "id": 9,
            "text": "Mainstream news organizations called the election for Biden Saturday, but Trump has refused to concede, alleging election irregularities in several states, and has gone to court over the outcome."
        },
        {
            "id": 10,
            "text": "Newsmax has not called the race and is waiting for the legal process to play out."
        }
    ]
}