{
    "title": "Trump cannot block grand jury subpoena for his tax returns, court rules",
    "text": [
        {
            "id": 0,
            "text": "A federal appeals court on Wednesday ruled that President Trump Donald TrumpJan."
        },
        {
            "id": 1,
            "text": "6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE cannot block enforcement of a New York grand jury subpoena for eight years of his tax returns."
        },
        {
            "id": 2,
            "text": "The ruling, from a three-judge panel for the U.S. Court of Appeals for the 2nd Circuit, affirms a federal judge's decision in August that rejected Trump's claims that the subpoena from Manhattan District Attorney Cyrus Vance Jr. was overly broad and issued in bad faith."
        },
        {
            "id": 3,
            "text": "The parties have agreed to temporarily halt enforcement of the subpoena."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "The Manhattan District Attorney's Office last year subpoenaed Trump's accounting firm, Mazars USA, for the president's personal and business tax returns and other financial records."
        },
        {
            "id": 6,
            "text": "Trump initially challenged the subpoena by arguing that presidents have sweeping immunity from the criminal process."
        },
        {
            "id": 7,
            "text": "In July, the Supreme Court rejected that argument and sent the case back to the lower courts for further proceedings."
        },
        {
            "id": 8,
            "text": "Trump then filed a new complaint that argued that the subpoena is too broad and amounts to presidential harassment."
        },
        {
            "id": 9,
            "text": "The appeals court rejected the argument that the subpoena is too broad."
        },
        {
            "id": 10,
            "text": "Trump had argued that the subpoena casts too wide of a net, claiming that the New York prosecutors' grand-jury investigation is limited to payments made by his former lawyer, Michael Cohen Michael Dean CohenTrump Organization faces new scrutiny in New York civil probe Michael Cohen:"
        },
        {
            "id": 11,
            "text": "Trump bluffing about another White House bid Eric Trump lawyer in New York attorney general's fraud case quits MORE, ahead of the 2016 presidential election to two women who allege that they had affairs with Trump."
        },
        {
            "id": 12,
            "text": "Trump has denied the affairs."
        },
        {
            "id": 13,
            "text": "But the appeals court said in its opinion that Trump's complaint \"never actually alleges that the grand jury was not investigating anything other than the 2016 Michael Cohen payments.\""
        },
        {
            "id": 14,
            "text": "Cohen in 2018 pleaded guilty to charges of bank fraud, tax fraud and campaign law violations."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "The district attorney's office has suggested in previous court filings that the subpoena is part of an investigation into potentially extensive criminal conduct at the Trump Organization."
        },
        {
            "id": 17,
            "text": "The prosecutors have suggested that Trump and his businesses could be investigated for tax and insurance fraud."
        },
        {
            "id": 18,
            "text": "\"Even if the grand jury were testing the truth of public allegations alone, such reports, taken together, fully justify the scope of the grand jury subpoena at issue in this case,\" they wrote last month."
        },
        {
            "id": 19,
            "text": "\"In particular, public reports have alleged that Trump Organization executives used fraudulent financial statements as part of long-standing practices of overstating assets sent to potential business partners and lenders and minimizing assets in tax returns,\" prosecutors added."
        },
        {
            "id": 20,
            "text": "The appeals court on Wednesday also rejected arguments Trump made that the subpoena is too broad because it seeks information from a variety of entities, seeks materials from businesses with operations outside of Manhattan, seeks many types of documents, seeks documents that cover a nine-year period and seeks documents that are not relevant to the criminal investigation."
        },
        {
            "id": 21,
            "text": "Additionally, the appeals court rejected Trump's argument that the district attorney's office issued the subpoena with the intent to harass him."
        },
        {
            "id": 22,
            "text": "\"Even accounting for the public status and visibility of the President, as well as the political interest in his tax returns, none of the facts asserted in the [second amended complaint], accepted as true, would be sufficient for such a claim to prevail,\" the appeals court judges wrote."
        },
        {
            "id": 23,
            "text": "The Manhattan District Attorney's office declined a request for comment from The Hill"
        },
        {
            "id": 24,
            "text": "Jay Sekulow Jay Alan SekulowGOP political operatives indicted over illegal campaign contribution from Russian national in 2016 57 House Republicans back Georgia against DOJ voting rights lawsuit The Hill's Morning Report - Presented by TikTok - New video of riot unnerves many senators MORE, Trump's attorney, said Wednesday following the ruling that his team would be filing a motion for a stay with the Supreme Court."
        },
        {
            "id": 25,
            "text": "Trump in August called the DA office's inquiry a \"continuation of the witch hunt\" against him and his administration."
        },
        {
            "id": 26,
            "text": "— Updated at 11:21 a.m."
        },
        {
            "id": 27,
            "text": ""
        }
    ]
}