{
    "title": "Michael Brown's Family: What Else Do They Need To Arrest Killer Of Our Son?",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- After a preliminary autopsy this weekend revealed that Michael Brown was shot at least six times, the teenager's mother had just one question on Monday for police: \"What else do we need to give them to arrest the killer of my child?\""
        },
        {
            "id": 1,
            "text": "The independent autopsy found that Brown was shot at least six times, including twice in the head."
        },
        {
            "id": 2,
            "text": "Members of Brown's family surrounded their attorney, Benjamin Crump, at a press conference Monday as he described their emotional turmoil and called for a fair investigation into the teen's death."
        },
        {
            "id": 3,
            "text": "Brown's mother, Lesley McSpadden, wants justice for her son and is desperate for answers, Crump said."
        },
        {
            "id": 4,
            "text": "Dr. Michael Baden, the former New York City chief medical examiner who conducted the autopsy, also addressed the media, saying there was \"no evidence of a struggle\" -- a key detail at odds with the police's reported accounts of what transpired moments before an officer shot and killed Brown on Aug. 9."
        },
        {
            "id": 5,
            "text": "\""
        },
        {
            "id": 6,
            "text": "The family has a right to know how their loved one died,\" Baden said."
        },
        {
            "id": 7,
            "text": "Baden and Professor Shawn Parcells, a pathologist assistant based in Kansas who helped with the autopsy, said they could not establish the order of bullets fired at Brown."
        },
        {
            "id": 8,
            "text": "But they believe Brown died from a final bullet fired through the top of his skull because all of the other gunshot wounds were survivable, Baden said."
        },
        {
            "id": 9,
            "text": "The information is largely consistent with eyewitness accounts of Brown's fatal encounter with police earlier this month."
        },
        {
            "id": 10,
            "text": "A friend who was with Brown at the time said the teen, who was unarmed, had his hands in the air and was trying to surrender."
        },
        {
            "id": 11,
            "text": "At a height of 6-foot-4, Brown's head would have been facing downward when the final bullet entered his head, Baden said."
        },
        {
            "id": 12,
            "text": "\"We believe that given those types of facts, it shows this officer should have been arrested,\" Darryl Parks, another family attorney, said."
        },
        {
            "id": 13,
            "text": "The questions surrounding Brown's death \"could have been answered on Day One if you were really trying to have transparency be the objective,\" Crump said of local police. \""
        },
        {
            "id": 14,
            "text": "The Brown family wanted to have this autopsy performed on their behalf because ... they did not want to be left having to rely on the autopsy done by the St. Louis law enforcement agencies, the same individuals they feel are responsible for executing their son in broad daylight.\""
        },
        {
            "id": 15,
            "text": "The family \"begged and pleaded\" to have an independent autopsy performed, Crump added."
        },
        {
            "id": 16,
            "text": "Baden appeared to criticize the Ferguson police for the way the case was handled, noting that putting information out sooner on Brown's death and talking to his family could have calmed tensions within the community."
        },
        {
            "id": 17,
            "text": "In the week since Brown was killed, Ferguson has been rocked by unrest and riots."
        },
        {
            "id": 18,
            "text": "Local police were heavily criticized for withholding details about the fatal shooting and attempting to quash largely peaceful protests, prompting state highway patrol officers to take over the law enforcement efforts in the community."
        },
        {
            "id": 19,
            "text": "Tensions flared again over the weekend after Missouri Gov. Jay Nixon (D) imposed a curfew, leading to a new round of clashes between protesters and police."
        },
        {
            "id": 20,
            "text": "Nixon announced an executive order on Monday to send National Guard troops to Ferguson."
        }
    ]
}