{
    "title": "Donald Trump, Ben Carson set the pace for 2016 GOP field in Iowa: poll",
    "text": [
        {
            "id": 0,
            "text": "Real estate mogul Donald Trump is leading the 2016 GOP field in the early state of Iowa, with retired neurosurgeon Ben Carson 6 points behind and the rest of the field well back, according to a poll released Friday."
        },
        {
            "id": 1,
            "text": "Mr. Trump was at 27 percent support, followed by Mr. Carson at 21 percent and Sen. Ted Cruz of Texas at 9 percent, a Quinnipiac poll said."
        },
        {
            "id": 2,
            "text": "“With five months until the balloting, anything can happen."
        },
        {
            "id": 3,
            "text": "But the field has become a two-tiered contest — Donald Trump and Ben Carson ahead, and everyone else far behind,” said Peter A. Brown, assistant director of the Quinnipiac University Poll."
        },
        {
            "id": 4,
            "text": "Former Florida Gov. Jeb Bush was at 6 percent, followed by former Hewlett-Packard CEO Carly Fiorina, Ohio Gov. John Kasich and Sen. Marco Rubio of Florida at 5 percent apiece."
        },
        {
            "id": 5,
            "text": "A Quinnipiac survey taken in late June had Wisconsin Gov. Scott Walker in the lead at 18 percent, followed by Mr. Trump and Mr. Carson at 10 percent each."
        },
        {
            "id": 6,
            "text": "Mr. Walker was at 3 percent in the new poll, behind Sen. Rand Paul of Kentucky and former Arkansas Gov. Mike Huckabee at 4 percent apiece."
        },
        {
            "id": 7,
            "text": "In line with some of the numbers from other polls, likely Republican caucus-goers said by a 79 percent to 15 percent margin that experience outside of Washington, D.C., is better for a president than Washington experience."
        },
        {
            "id": 8,
            "text": "“The Iowa Republican Caucus looks like a two-man race in which the Washington experience that has traditionally been a major measuring stick that voters have used to choose candidates is now a big negative,” Mr. Brown said."
        },
        {
            "id": 9,
            "text": "“Perhaps even more surprising, given the 17-member field of candidates vying for the Republican presidential nomination, is that more than half the votes in the Quinnipiac University poll of likely-GOP caucus-goers are going to three candidates who have never held political office — Donald Trump, Ben Carson and Carly Fiorina,” Mr. Brown said."
        },
        {
            "id": 10,
            "text": "Mr. Carson was the best-liked of the candidates with a 79 percent/6 percent favorable/unfavorable split."
        },
        {
            "id": 11,
            "text": "Ms. Fiorina had a 62 percent/8 percent split and Mr. Trump had a 60 percent/35 percent split."
        },
        {
            "id": 12,
            "text": "Mr. Trump also topped the “no way” list at 25 percent, followed by Mr. Bush at 23 percent and New Jersey Gov. Chris Christie at 14 percent."
        },
        {
            "id": 13,
            "text": "Fifty-six percent said Mr. Trump is honest and trustworthy and 61 percent said he cares about their needs and problems."
        },
        {
            "id": 14,
            "text": "Eighty-three percent said he has strong leadership qualities, and 52 percent said he has the right temperament and personality to handle an international crisis."
        },
        {
            "id": 15,
            "text": "Meanwhile, 88 percent said Mr. Carson is honest and trustworthy and 85 percent said he cares about their needs and problems."
        },
        {
            "id": 16,
            "text": "Seventy-six percent said he has strong leadership qualities and 72 percent said he has the right personality and temperament to handle an international crisis."
        },
        {
            "id": 17,
            "text": "“Trump’s 27-21 percent lead over Carson obscures what appears to be the former surgeon’s stronger growth potential in recruiting new supporters when other candidates leave the race."
        },
        {
            "id": 18,
            "text": "Carson has a higher favorability rating than Trump and a higher score for honesty and empathy,” Mr. Brown said."
        },
        {
            "id": 19,
            "text": "“Trump has an edge on leadership, but Carson has a 20-point margin when it comes to having the right temperament and personality to handle an international crisis.”"
        },
        {
            "id": 20,
            "text": "The survey of 1,038 likely Iowa GOP Caucus participants was taken from from Aug. 27 to Sept. 8 and has a margin of error of plus or minus 3 percentage points."
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        }
    ]
}