{
    "title": "Poll: Clinton, Trump in statistical dead heat",
    "text": [
        {
            "id": 0,
            "text": "Democratic presidential nominee Hillary Clinton. Democrats worry negative images are defining White House Heller won't say if Biden won election Whitmer trailing GOP challenger by 6 points in Michigan governor race: poll MORE leads Republican nominee Donald Trump Donald TrumpJan."
        },
        {
            "id": 1,
            "text": "6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE by just 4 points in a new national poll, within its margin of error."
        },
        {
            "id": 2,
            "text": "Clinton leads Trump, 47 percent to 43 percent, among likely voters in the Washington Post-ABC News poll released early Sunday."
        },
        {
            "id": 3,
            "text": "Libertarian nominee Gary Johnson Gary Earl JohnsonBiden broadened Democratic base, cut into Trump coalition: study New Mexico lawmakers send recreational marijuana bills to governor Judge throws out murder convictions, releases men jailed for 24 years MORE has 5 percent support, and the Green Party’s Jill Stein has 2 percent."
        },
        {
            "id": 4,
            "text": "In a two-way race, Clinton maintains a 4-point lead over Trump, 50 percent to 46 percent."
        },
        {
            "id": 5,
            "text": "In a similar poll just before the first presidential debate of 2016 in late September, Clinton led Trump by 2 points in a four-way race, 46 percent to 44 percent."
        },
        {
            "id": 6,
            "text": "The new poll was conducted following the release of a 2005 tape in which Trump makes lewd comments about kissing and groping women without their consent."
        },
        {
            "id": 7,
            "text": "Almost 70 percent of respondents said they believe Trump probably made unwanted sexual advances, the Post reported."
        },
        {
            "id": 8,
            "text": "Most also said his apology was insincere."
        },
        {
            "id": 9,
            "text": "More than half of all respondents, 64 percent, said the tape won’t make a difference in their votes."
        },
        {
            "id": 10,
            "text": "The poll of 740 likely voters, conducted Oct. 10–13, has a margin of error of 4 percentage points."
        },
        {
            "id": 11,
            "text": "Clinton leads Trump by 11 points in a four-way race and 10 points in a two-candidate match-up in an NBC News/Wall Street Journal poll also released Sunday morning."
        },
        {
            "id": 12,
            "text": "Clinton has a 5.5-point lead nationally according to a RealClearPolitics average of polling."
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}