{
    "title": "Joe Biden: I was wrong to say ‘Shylocks’ ",
    "text": [
        {
            "id": 0,
            "text": "Biden was referring to bank and moneylenders haggling people serving the U.S. overseas, Biden: I was wrong to say 'Shylocks'\n\nVice President Joe Biden said Wednesday that it was a “poor choice of words” for him to use the term “Shylocks” in a recent speech."
        },
        {
            "id": 1,
            "text": "On Tuesday, the Anti-Defamation League’s national director, Abraham Foxman, had said the word “Shylocks” promoted an anti-Semitic stereotype."
        },
        {
            "id": 2,
            "text": "“When someone as friendly to the Jewish community and open and tolerant an individual as is Vice President Joe Biden, uses the term ‘Shylocked’ to describe unscrupulous moneylenders dealing with service men and women, we see once again how deeply embedded this stereotype about Jews is in society,” Foxman said in a statement."
        },
        {
            "id": 3,
            "text": "Biden responded in a statement, saying, “Abe Foxman has been a friend and adviser of mine for a long time."
        },
        {
            "id": 4,
            "text": "He’s correct, it was a poor choice of words, particularly as he said coming from ‘someone as friendly to the Jewish community and open and tolerant an individual as is Vice President Joe Biden.’"
        },
        {
            "id": 5,
            "text": "He’s right.”"
        },
        {
            "id": 6,
            "text": "Biden used the term when he spoke at the 40th anniversary celebration for the Legal Services Corporation and referred to his son, Delaware Attorney General Beau Biden, and his experience while in Iraq."
        },
        {
            "id": 7,
            "text": "“People would come up to him and talk about what was happening to them at home in terms of foreclosures, in terms of bad loans that were being — I mean, these Shylocks who took advantage of these women and men while overseas,” Biden said."
        },
        {
            "id": 8,
            "text": "While Biden was referring to bank representatives and moneylenders haggling with people serving the United States overseas, the term originally comes from William Shakespeare’s “The Merchant of Venice.”"
        },
        {
            "id": 9,
            "text": "In the play, Shylock is a Jewish moneylender, and use of the name to refer to greed has been called offensive by organizations such as the ADL, among others."
        },
        {
            "id": 10,
            "text": "“Shylock represents the medieval stereotype about Jews and remains an offensive characterization to this day,” Foxman said on Tuesday."
        },
        {
            "id": 11,
            "text": "“The Vice President should have been more careful.”"
        },
        {
            "id": 12,
            "text": "Later Wednesday, the Anti-Defamation League sent out a statement that said that Biden had reached out to Foxman on the phone earlier that day."
        },
        {
            "id": 13,
            "text": "“There is no truer friend of the Jewish people than Joe Biden,” Foxman said in a news release."
        },
        {
            "id": 14,
            "text": "“Not only has he been a stalwart against anti-Semitism and bigotry, but he has the courage and forthrightness to admit a mistake and use it as an opportunity to learn and to teach others about the harmful effects of stereotypes."
        },
        {
            "id": 15,
            "text": "He has turned a rhetorical gaffe into a teachable moment.”"
        },
        {
            "id": 16,
            "text": "He added, “Clearly there was no ill-intent here, but"
        },
        {
            "id": 17,
            "text": "Joe and I agreed that perhaps he needs to bone up on his Shakespeare.”"
        },
        {
            "id": 18,
            "text": "It did not take long for Biden, who has been known for his gaffes, found himself in another controversy surrounding his comments."
        },
        {
            "id": 19,
            "text": "Later on Wednesday, Biden referred to Asia as “the Orient,” a term that Republican National Committee Asian-American Spokesperson Ninio Fetalvo called “offensive to both Asian-Americans and our Asian allies abroad” and presented “unacceptable imperialist undertones” according to a statement."
        },
        {
            "id": 20,
            "text": "“You know, on the way back from Mumbai to go meet with President Xi in China, I stopped in Singapore to meet with a guy named Lee Kuan Yew, who most foreign policy experts around the world say is the wisest man in the Orient,” Biden said during his visit to Iowa."
        }
    ]
}