{
    "title": "Obama, Boehner speak by telephone after GOP counter-offer",
    "text": [
        {
            "id": 0,
            "text": "House Speaker John Boehner and President Barack Obama spoke on the phone Tuesday evening after House Republican leaders sent a new offer on a deal to avoid the fiscal cliff on Tuesday."
        },
        {
            "id": 1,
            "text": "\"We sent the White House a counter-offer that would achieve tax and entitlement reform to solve our looming debt crisis and create more American jobs,\" Michael Steel, spokesman for House Speaker Boehner, told CNN."
        },
        {
            "id": 2,
            "text": "Steel confirmed the speaker and the president spoke on the phone but declined to give any further detail about the call or the new GOP proposal."
        },
        {
            "id": 3,
            "text": "The latest Republican plan comes in response to a proposal that the administration sent to Boehner on Monday, a senior GOP aide told CNN, following Sunday's meeting between the speaker and the president–their first face-to-face meeting in over a year."
        },
        {
            "id": 4,
            "text": "The offer that came Monday included a new revenue number of $1.4 trillion, down from the $1.6 trillion that the Obama administration originally proposed, according a Democratic source."
        },
        {
            "id": 5,
            "text": "The source also said the offer was paired with \"a serious spending cut number with real entitlement reform.\""
        },
        {
            "id": 6,
            "text": "But a House GOP aide told CNN of the White House’s offer that \"$1.4 isn't really progress this late in the game.”"
        },
        {
            "id": 7,
            "text": "Steel echoed remarks that Boehner made on the House floor earlier Tuesday, saying Republicans await further specifics from the president on what kind of spending cuts he would include in a deal."
        },
        {
            "id": 8,
            "text": "\"As the Speaker said today, we're still waiting for the White House to identify what spending cuts the president is willing to make as part of the 'balanced approach' he promised the American people."
        },
        {
            "id": 9,
            "text": "The longer the White House slow-walks this process, the closer our economy gets to the fiscal cliff,\" Steel said."
        },
        {
            "id": 10,
            "text": "The exchange of new proposals signals that despite public statements by Boehner and top Congressional Democrats that talks are stalled on the major issues of revenue and significant cuts to entitlement programs like Medicare, negotiations behind the scenes have picked up."
        }
    ]
}