{
    "title": "Macabre Video of Fake Trump Shooting Media and Critics Is Shown at His Resort",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — A video depicting a macabre scene of a fake President Donald Trump shooting, stabbing and brutally assaulting members of the news media and his political opponents was shown at a conference for his supporters at his Miami resort last week, according to footage obtained by The New York Times."
        },
        {
            "id": 1,
            "text": "Several of Mr. Trump’s top surrogates — including his son Donald Trump Jr., his former spokeswoman Sarah Huckabee Sanders and the governor of Florida, Ron DeSantis — were scheduled to speak at the three-day conference, which was held by a pro-Trump group, American Priority, at Trump National Doral Miami."
        },
        {
            "id": 2,
            "text": "Ms. Sanders and a person close to Mr. Trump’s son said on Sunday that they did not see the video at the conference."
        },
        {
            "id": 3,
            "text": "Stephanie Grisham, the White House press secretary, said on Twitter Monday that while Mr. Trump has not seen the video, “based upon everything he has heard, he strongly condemns” it."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "The @POTUS @realDonaldTrump has not yet seen the video, he will see it shortly, but based upon everything he has heard, he strongly condemns this video."
        },
        {
            "id": 6,
            "text": "The video, which includes the logo for Mr. Trump’s 2020 re-election campaign, comprises a series of internet memes."
        },
        {
            "id": 7,
            "text": "The most violent clip shows Mr. Trump’s head superimposed on the body of a man opening fire inside the “Church of Fake News” on parishioners who have the faces of his critics or the logos of media organizations superimposed on their bodies."
        },
        {
            "id": 8,
            "text": "It appears to be an edited scene of a church massacre from the 2014 dark comedy film “Kingsman: The Secret Service.”"
        },
        {
            "id": 9,
            "text": "The disclosure that the video was played shows how Mr. Trump’s anti-media language has influenced his supporters and bled into their own propaganda."
        },
        {
            "id": 10,
            "text": "Mr. Trump has made attacks on the news media a mainstay of his presidency, and he tweeted a similar — but far less violent video — in 2017."
        },
        {
            "id": 11,
            "text": "In recent weeks as he has confronted impeachment proceedings, he has ramped up his attacks on the news media, repeatedly calling it the “enemy of the people.”"
        },
        {
            "id": 12,
            "text": "A person who attended the conference last week took a video of the clip on his phone and had an intermediary send it to a reporter for The Times."
        },
        {
            "id": 13,
            "text": "Parts of the video were posted on YouTube in 2018 by a user with a history of creating pro-Trump mash-ups."
        },
        {
            "id": 14,
            "text": "The organizer of the event said in a statement on Sunday that the clip had been played at the conference, saying it was part of a “meme exhibit.”"
        },
        {
            "id": 15,
            "text": "He denounced the video and said his organization was looking into how it was shown at the event."
        },
        {
            "id": 16,
            "text": "“Content was submitted by third parties and was not associated with or endorsed by the conference in any official capacity,” said the organizer, Alex Phillips."
        },
        {
            "id": 17,
            "text": "“American Priority rejects all political violence and aims to promote a healthy dialogue about the preservation of free speech."
        },
        {
            "id": 18,
            "text": "This matter is under review.”"
        },
        {
            "id": 19,
            "text": "Organizers declined to say exactly where at Mr. Trump’s resort the video was shown."
        },
        {
            "id": 20,
            "text": "A person close to Mr. Trump’s son said he was unaware that the video had been played at the conference."
        },
        {
            "id": 21,
            "text": "Ms. Sanders said she was unaware of the video’s existence until a Times reporter contacted her."
        },
        {
            "id": 22,
            "text": "“I was there to speak at a prayer breakfast, where I spoke about unity and bringing the country together,” Ms. Sanders said."
        },
        {
            "id": 23,
            "text": "“I wasn’t aware of any video, nor do I support violence of any kind against anyone.”"
        },
        {
            "id": 24,
            "text": "A spokesman for Mr. Trump’s campaign said he knew nothing about the video."
        },
        {
            "id": 25,
            "text": "“That video was not produced by the campaign, and we do not condone violence,” said Tim Murtaugh, the spokesman."
        },
        {
            "id": 26,
            "text": "A DeSantis spokeswoman did not respond to an email seeking comment."
        },
        {
            "id": 27,
            "text": "The video depicts a scene inside the “Church of Fake News,” where parishioners rise as Mr. Trump — dressed in a black pinstripe suit and tie — walks down the aisle."
        },
        {
            "id": 28,
            "text": "Many parishioners’ faces have been replaced with the logos of news media organizations, including PBS, NPR, Politico, The Washington Post and NBC."
        },
        {
            "id": 29,
            "text": "Mr. Trump stops in the middle of the church, pulls a gun out of his suit jacket pocket and begins a graphic rampage."
        },
        {
            "id": 30,
            "text": "As the parishioners try to flee, the president fires at them."
        },
        {
            "id": 31,
            "text": "He shoots Black Lives Matter in the head, and also shoots Vice News."
        },
        {
            "id": 32,
            "text": "Some of those in the church try to apprehend Mr. Trump."
        },
        {
            "id": 33,
            "text": "He fends them off and makes his way toward the altar, knocking over several pews."
        },
        {
            "id": 34,
            "text": "He wrestles a parishioner with a Vice News logo as a face to the ground and then shoots the person at point blank range."
        },
        {
            "id": 35,
            "text": "In the background, the former F.B.I. director, James B. Comey, is seen trying to get away."
        },
        {
            "id": 36,
            "text": "From there, Mr. Trump attacks a range of his critics."
        },
        {
            "id": 37,
            "text": "He strikes the late Arizona senator John McCain in the back of the neck."
        },
        {
            "id": 38,
            "text": "He hits the television personality Rosie O’Donnell in the face and then stabs her in the head."
        },
        {
            "id": 39,
            "text": "He strikes Representative Maxine Waters, Democrat of California."
        },
        {
            "id": 40,
            "text": "He lights the head of Senator Bernie Sanders, a Democratic presidential rival, on fire."
        },
        {
            "id": 41,
            "text": "He takes Senator Mitt Romney, Republican of Utah, hostage before throwing him to the ground."
        },
        {
            "id": 42,
            "text": "Then he strikes former President Barack Obama in the back and throws him against a wall."
        },
        {
            "id": 43,
            "text": "Others shown in the video include Mika Brzezinski of MSNBC; former Secretary of State Hillary Clinton; former President Bill Clinton; the film producer Harvey Weinstein; and Representative Adam B. Schiff, the California Democrat who as chairman of the House Intelligence Committee is overseeing an impeachment inquiry of Mr. Trump."
        },
        {
            "id": 44,
            "text": "The clip ends with Mr. Trump putting a stake into the head of a person with a CNN logo for a face."
        },
        {
            "id": 45,
            "text": "Mr. Trump then stands on the altar, admiring his rampage, and smiles."
        },
        {
            "id": 46,
            "text": "The video is similar in style to one Mr. Trump tweeted in July 2017, in which he is shown at a wrestling match body slamming CNN’s logo and beating it up."
        },
        {
            "id": 47,
            "text": "The president was roundly criticized for encouraging violence against journalists by posting that clip, but his supporters enjoyed it, and helped make the tweet viral."
        },
        {
            "id": 48,
            "text": "Throughout his 2016 campaign and presidency, Mr. Trump has sought to demonize the news media, partly out of frustration about the coverage of his administration and partly because he likes to have an opponent to target."
        },
        {
            "id": 49,
            "text": "Mr. Trump has also sought to undermine confidence in the mainstream media, some of his advisers acknowledge privately, to make people doubt the accuracy of less favorable accounts of what goes on in his administration."
        },
        {
            "id": 50,
            "text": "The president said at a rally on Friday that there was an “unholy alliance of corrupt Democrat politicians, deep-state bureaucrats and the fake news media.”"
        }
    ]
}