{
    "title": "Donald Trump relents over Paul Ryan re-election",
    "text": [
        {
            "id": 0,
            "text": "US presidential candidate Donald Trump has publicly backed House Speaker Paul Ryan days after snubbing him in a spat at the top of the Republican Party."
        },
        {
            "id": 1,
            "text": "Mr Trump shocked party members on Tuesday when he refused to endorse Mr Ryan and Senator John McCain in their campaigns for re-election in November."
        },
        {
            "id": 2,
            "text": "Mr Ryan, the party's highest-ranking elected official, had himself long delayed endorsing Mr Trump."
        },
        {
            "id": 3,
            "text": "\"I support and endorse our Speaker..."
        },
        {
            "id": 4,
            "text": "Paul Ryan,\" Mr Trump said on Friday."
        },
        {
            "id": 5,
            "text": "\"We need unity - we have to win this election,\" Mr Trump said during a campaign stop in Green Bay, Wisconsin - Mr Ryan's home state."
        },
        {
            "id": 6,
            "text": "While they might \"disagree on a couple of things\", they agreed on a lot as well, he added."
        },
        {
            "id": 7,
            "text": "He also endorsed Sen McCain and New Hampshire Sen Kelly Ayotte."
        },
        {
            "id": 8,
            "text": "In his earlier interview for the Washington Post, Mr Trump had said he was \"just not quite there yet\" when asked if he would endorse Mr Ryan and Arizona Sen McCain."
        },
        {
            "id": 9,
            "text": "It was the same phrase used by Mr Ryan before he finally endorsed the Republican presidential candidate."
        },
        {
            "id": 10,
            "text": "Mr Ryan and Sen McCain had both criticised Mr Trump's attacks on the bereaved parents of a US Muslim soldier killed in Iraq."
        },
        {
            "id": 11,
            "text": "The soldier, Humayun Khan, was killed by a car bomb in 2004 in Iraq at the age of 27."
        },
        {
            "id": 12,
            "text": "Donald Trump is drawing tens of thousands to his rallies."
        },
        {
            "id": 13,
            "text": "While this may be irrelevant in a national electorate that numbers in the hundreds of millions, the adulation of crowds is catnip to even the most jaded of candidates."
        },
        {
            "id": 14,
            "text": "Then there's the torrent of money that Mr Trump has unleashed - more than $80m (£61m) in July, thanks to a flood of small-donor contributions."
        },
        {
            "id": 15,
            "text": "Presidential hopefuls with enthusiastic audiences and campaign coffers full of cash aren't prone to humble exits."
        },
        {
            "id": 16,
            "text": "Ever since Mr Trump descended that golden escalator to announce his candidacy last July, his campaign has been a roller-coaster ride for the Republican establishment, alternating between reluctant acceptance and sky-is-falling hysteria."
        },
        {
            "id": 17,
            "text": "This week has marked one of the more pronounced troughs in this journey, but the general election sprint is only just beginning."
        },
        {
            "id": 18,
            "text": "There may still be peaks of resigned accommodation ahead."
        },
        {
            "id": 19,
            "text": "If Mr Trump can get back on message with a few carefully modulated speeches and at least a handful of news cycles without outrageous statements, the polls could again narrow to within a more typical partisan split."
        },
        {
            "id": 20,
            "text": "There's nothing the media like more than a good candidate comeback story."
        },
        {
            "id": 21,
            "text": ""
        }
    ]
}