{
    "title": "Biden To Choose Antony Blinken For Secretary Of State",
    "text": [
        {
            "id": 0,
            "text": "Biden to Nominate Antony Blinken for Secretary Of State."
        },
        {
            "id": 1,
            "text": "ET\n\nPresident-elect Joe Biden will nominate Antony Blinken for the coveted secretary of state post."
        },
        {
            "id": 2,
            "text": "Blinken, 58, has extensive foreign policy experience, serving as deputy secretary of state and deputy national security adviser under President Barack Obama."
        },
        {
            "id": 3,
            "text": "A graduate of Harvard University and Columbia Law School, Blinken began his foreign policy career during the Clinton administration."
        },
        {
            "id": 4,
            "text": "He worked as Democratic staff director for the U.S. Senate Foreign Relations Committee from 2002 to 2008, where he worked closely with Biden."
        },
        {
            "id": 5,
            "text": "He went on to serve as then-Vice President Biden's national security adviser."
        },
        {
            "id": 6,
            "text": "Blinken is currently managing partner at WestExec Advisors, a firm he co-founded."
        },
        {
            "id": 7,
            "text": "For Biden, choosing Blinken signals a return to a more traditional foreign policy that favors strong international relationships, NPR's Michele Kelemen says."
        },
        {
            "id": 8,
            "text": "Biden's secretary of state pick, which will require Senate confirmation, was first reported by Bloomberg News and later confirmed by NPR."
        },
        {
            "id": 9,
            "text": "In addition to Blinken, the Biden team announced a number of other high-profile foreign policy and national security picks on Monday."
        },
        {
            "id": 10,
            "text": "Among them is Jake Sullivan, who will serve as national security adviser in the new administration."
        },
        {
            "id": 11,
            "text": "Sullivan served as Blinken's successor as the former vice president's national security adviser and had previously worked at the State Department under Hillary Clinton."
        },
        {
            "id": 12,
            "text": "Biden also named Linda Thomas-Greenfield, an experienced diplomat with more than three decades at the Foreign Service under her belt, as the ambassador to the United Nations."
        },
        {
            "id": 13,
            "text": "If confirmed, Blinken's early work, according to The Associated Press, would be focused heavily on repairing relationships between Washington and foreign governments and allies that have been strained under President Trump's \"America First\" policy, in which long-held alliances have frequently been challenged."
        },
        {
            "id": 14,
            "text": "Blinken will also be tasked with boosting the beleaguered State Department, an agency that has experienced substantial turnover under Trump, with many longtime diplomats and career staffers leaving."
        },
        {
            "id": 15,
            "text": "An Office of Inspector General (OIG) report from January found that, \"Workforce management issues are pervasive, affecting programs and operations domestically and overseas and across functional areas and geographic regions.\""
        },
        {
            "id": 16,
            "text": "A hiring freeze that was ordered by Trump in 2017 and that stretched until 2018 compounded the agency's ability to maintain staffing levels, the report went on to say."
        },
        {
            "id": 17,
            "text": "\""
        },
        {
            "id": 18,
            "text": "Employees told OIG that the hiring freeze contributed to excessive workloads, and the lack of transparency about the objectives intended to be achieved by the hiring freeze caused some to be concerned about losing their jobs,\" the report said."
        },
        {
            "id": 19,
            "text": "Susan Rice, the former national security adviser under Obama, was rumored to have been on the short list for the top State Department job."
        },
        {
            "id": 20,
            "text": "However, by choosing Blinken, Biden avoids what was likely to have been a Senate battle over her nomination."
        },
        {
            "id": 21,
            "text": "Rice would have faced criticism over the handling of the terrorist attack on the U.S. diplomatic compound in Benghazi, Libya, in 2012."
        },
        {
            "id": 22,
            "text": "Under pressure that year, Rice took herself out of consideration for the secretary of state's job after Clinton resigned the post."
        },
        {
            "id": 23,
            "text": "Biden was also rumored to be considering Delaware Democratic Sen. Chris Coons, but that choice would have put yet another Senate seat in contention just as Democrats are awaiting two runoff elections that will determine which party controls the chamber."
        },
        {
            "id": 24,
            "text": "Biden has forged ahead with the transition process after being declared the winner in the Nov. 3 election despite Trump's refusal to concede, subsequent unsuccessful legal challenges in various states where he lost and his refusal to participate in the transition process."
        },
        {
            "id": 25,
            "text": ""
        }
    ]
}