{
    "title": "Conference Gives Obama Opportunity to Discuss Poverty and Race",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — President Obama on Tuesday called for liberals and conservatives to break through their decades-long disagreements about how to confront abject poverty in America, but he expressed skepticism that it would happen."
        },
        {
            "id": 1,
            "text": "Speaking to a gathering of faith leaders at Georgetown University, Mr. Obama said it was his job to “guard against cynicism” while pursuing policies that might improve the lives of poor people in the country."
        },
        {
            "id": 2,
            "text": "He said he believed that conservatives cared about the poor."
        },
        {
            "id": 3,
            "text": "But in an hourlong conversation with a liberal professor and a conservative economist, Mr. Obama lamented what he said was a refusal by his Republican adversaries in Washington to put their concern into practice."
        },
        {
            "id": 4,
            "text": "“Talk to any of my Republican friends,” Mr. Obama told several hundred people attending the school’s poverty conference."
        },
        {
            "id": 5,
            "text": "“They will say, No. 1, they care about the poor — and I believe them."
        },
        {
            "id": 6,
            "text": "But when it comes to actually establishing budgets, making choices, prioritizing, that’s when it starts breaking down.”"
        },
        {
            "id": 7,
            "text": "The president said his unsuccessful effort to raise taxes on hedge fund managers was an example of the refusal by conservatives to compromise for the benefit of the poor."
        },
        {
            "id": 8,
            "text": "He noted that the top 25 hedge fund managers make more than all of the nation’s kindergarten teachers combined."
        },
        {
            "id": 9,
            "text": "He said that hedge fund managers were not evil, but that Republicans should be willing to tax their incomes at the same level as they do kindergarten teachers’."
        },
        {
            "id": 10,
            "text": "“If we can’t ask from society’s lottery winners to just make that modest investment, then really, this conversation is for show,” Mr. Obama said."
        },
        {
            "id": 11,
            "text": "He added later, “If we can’t bridge that gap, I suspect we are not going to make as much progress as we need to.”"
        },
        {
            "id": 12,
            "text": "Mr. Obama’s appearance at the Georgetown conference was the latest indication of his new interest in talking about the poorest citizens."
        },
        {
            "id": 13,
            "text": "During two campaigns and most of his time in office, Mr. Obama has often portrayed himself as the champion of a middle class fighting to recover from a devastating economic collapse."
        },
        {
            "id": 14,
            "text": "But eruptions of racial tensions after black men were killed by the police in Baltimore, Ferguson, Mo., and Staten Island have accelerated a shift in the later stages of Mr. Obama’s presidency, as the nation’s first black president begins to refocus his administration’s attention on the plight of the poor, especially in African-American communities."
        },
        {
            "id": 15,
            "text": "In Tuesday’s discussion with Robert D. Putnam, a Harvard professor, and Arthur C. Brooks, the president of the American Enterprise Institute, Mr. Obama said it was important for liberals to accept the importance of character and values in confronting the poverty and violence in some of America’s communities."
        },
        {
            "id": 16,
            "text": "“I am a black man who grew up without a father, and I know the costs that I paid for that,” Mr. Obama said."
        },
        {
            "id": 17,
            "text": "But he blamed Republicans for suggesting that a focus on values means that government does not have to invest in public institutions like early childhood education, job training or public infrastructure that could benefit the poor."
        },
        {
            "id": 18,
            "text": "And he chided religious organizations for sometimes focusing too heavily on issues like abortion rather than keeping the pressure on politicians to confront poverty."
        },
        {
            "id": 19,
            "text": "“This is oftentimes viewed as a nice-to-have relative to an issue like abortion,” Mr. Obama said."
        },
        {
            "id": 20,
            "text": "“I think that there’s more power to be had there, a more transformative voice that’s available around these issues” from religious groups."
        },
        {
            "id": 21,
            "text": "Mr. Obama has long argued for building “ladders of opportunity” for those who are struggling economically."
        },
        {
            "id": 22,
            "text": "But as he campaigned in the elections of 2008 and 2012, he frequently spoke about ensuring that those ladders reach middle-income workers."
        },
        {
            "id": 23,
            "text": "When he became president, he pursued policies aimed at helping workers get jobs, increase their salaries, purchase homes, pay for college and buy health care."
        },
        {
            "id": 24,
            "text": "His recent, frequent emphasis on the severely poor is new, as is his increasing willingness to speak bluntly, and often, about the needs of African-Americans, and especially young black men."
        },
        {
            "id": 25,
            "text": "After the rioting in Baltimore that followed the death of Freddie Gray last month, Mr. Obama called for national “soul searching” about poverty and accused Americans of failing to pay attention to the plight of the poorest citizens except “when a CVS burns,” a reference to the looting in the city."
        },
        {
            "id": 26,
            "text": "The simmering racial tensions, he said, must be addressed in part by confronting poverty."
        },
        {
            "id": 27,
            "text": "That was followed within days by the president’s announcement of a private-sector expansion of a White House initiative, My Brother’s Keeper, which is aimed at helping young black men reach their potential."
        },
        {
            "id": 28,
            "text": "In his remarks after the eruption of violence in Baltimore, Mr. Obama said the nation’s leaders must strive to break the cycle of poverty and crime."
        },
        {
            "id": 29,
            "text": "“If you have impoverished communities that have been stripped away of opportunity, where children are born into abject poverty,” he said, it is more likely that those children “end up in jail or dead, than they go to college.”"
        },
        {
            "id": 30,
            "text": "If the United States does not confront that cycle, he said during long and impassioned remarks in the Rose Garden last month, “we’ll go through the same cycles of periodic conflicts between the police and communities and the occasional riots in the streets, and everybody will feign concern until it goes away, and then we go about our business as usual.”"
        },
        {
            "id": 31,
            "text": "Mr. Putnam, who was on the panel with Mr. Obama on Tuesday, is the author of a recent book called “Our Kids: The American Dream in Crisis.”"
        },
        {
            "id": 32,
            "text": "In the book, Mr. Putnam argues that poor children in America are at a growing economic and social disadvantage compared with children raised in families with means."
        },
        {
            "id": 33,
            "text": "Mr. Obama has expressed admiration for Mr. Putnam’s research, including a previous book, “Bowling Alone,” which describes how the social fabric of many communities in America is weakening."
        },
        {
            "id": 34,
            "text": "In an interview with The New York Times in July 2013, Mr. Obama praised Mr. Putnam’s research on the impact of economic inequality."
        },
        {
            "id": 35,
            "text": "“It applies to a city like Galesburg,” Mr. Obama said in the interview, after a speech in that Illinois city, “where 30 years ago, anybody in this town who wanted to find a job, they could go get a job."
        },
        {
            "id": 36,
            "text": "They could go get it at the Maytag plant."
        },
        {
            "id": 37,
            "text": "They could go get it with the railroad."
        },
        {
            "id": 38,
            "text": "It might be hard work, it might be tough work, but they could buy a house with it.”"
        },
        {
            "id": 39,
            "text": "Mr. Obama added, “That’s what’s been eroding over the last 20, 30 years, well before the financial crisis.”"
        },
        {
            "id": 40,
            "text": "But even in that interview, which took place well before the recent police shootings involving young black men, Mr. Obama predicted that the country’s economic anxiety would exacerbate racial tensions."
        },
        {
            "id": 41,
            "text": "“They may get worse,” he said, “because people will feel as if they’ve got to compete with some other group to get scraps from a shrinking pot."
        },
        {
            "id": 42,
            "text": "If the economy is growing, everybody feels invested."
        },
        {
            "id": 43,
            "text": "Everybody feels as if we’re rolling in the same direction.”"
        }
    ]
}