{
    "title": "Key Impeachment Witness Vindman 'Escorted' From White House, His Lawyer Says",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "President Trump, who has expressed anger about officials who testified in his impeachment inquiry, fired two of them on Friday."
        },
        {
            "id": 3,
            "text": "Trump recalled European Union Ambassador Gordon Sondland and ended the White House National Security Council assignment of Lt. Col. Alexander Vindman."
        },
        {
            "id": 4,
            "text": "In tweets Saturday, Trump addressed Vindman's firing, saying, \"I don't know him, never spoke to him, or met him (I don't believe!)"
        },
        {
            "id": 5,
            "text": "but, he was very insubordinate, reported contents of my 'perfect' calls incorrectly ... was given a horrendous report by his superior, the man he reported to, who publicly stated that Vindman had problems with judgement, adhering to the chain of command and leaking information."
        },
        {
            "id": 6,
            "text": "In other words, 'OUT'.\""
        },
        {
            "id": 7,
            "text": "Vindman's attorney, David Pressman, called Trump's claims about Vindman \"obviously false,\" adding that \"they conflict with the clear personnel record and the entirety of the impeachment record of which the President is well aware."
        },
        {
            "id": 8,
            "text": "While the most powerful man in the world continues his campaign of intimidation, while too many entrusted with political office continue to remain silent, Lieutenant Colonel Vindman continues his service to our country as a decorated, active duty member of our military.\""
        },
        {
            "id": 9,
            "text": "The swift actions Friday — coming only two days after Trump's acquittal — incensed his critics. \""
        },
        {
            "id": 10,
            "text": "President Trump is exacting his retribution, removing those who complied with subpoenas, came forward, and testified about his misconduct,\" Rep. Adam Schiff, who led the House impeachment inquiry, said on Twitter Friday night."
        },
        {
            "id": 11,
            "text": "\"This is as clear a case of retribution as I've seen during my 27 years in the Senate,\" Sen. Dianne Feinstein, the ranking member on the Senate Judiciary Committee, said in a statement."
        },
        {
            "id": 12,
            "text": "Vindman, the Ukraine expert at the National Security Council who became a star witness in the House impeachment hearings on President Trump's dealings with the country, was \"escorted\" out of the White House on Friday, his lawyer said, adding Trump had \"decided to exact revenge.\""
        },
        {
            "id": 13,
            "text": "Sondland, a Trump campaign donor who has served as United States ambassador to the European Union, said in a statement Friday that he was \"advised today that the President intends to recall me effective immediately as United States ambassador to the European Union.\""
        },
        {
            "id": 14,
            "text": "\"I am grateful to President Trump for having given me the opportunity to serve, to Secretary Pompeo for his consistent support, and to the exceptional and dedicated professionals at the U.S. Mission to the European Union,\" Sondland wrote."
        },
        {
            "id": 15,
            "text": "\"I am proud of our accomplishments."
        },
        {
            "id": 16,
            "text": "Our work here has been the highlight of my career.\""
        },
        {
            "id": 17,
            "text": "Vindman's twin brother, Lt. Col. Yevgeny Vindman, was also fired from the National Security Council on Friday, Pressman said."
        },
        {
            "id": 18,
            "text": "The Vindman brothers have been reassigned to the Department of the Army, a department spokesperson confirmed."
        },
        {
            "id": 19,
            "text": "The department would not provide further information."
        },
        {
            "id": 20,
            "text": "The National Security Council declined comment on Vindman's departure."
        },
        {
            "id": 21,
            "text": "Earlier Friday, Trump was asked by a reporter whether Vindman would be leaving."
        },
        {
            "id": 22,
            "text": "\"I'm not happy with him."
        },
        {
            "id": 23,
            "text": "You think I'm supposed to be happy with him?"
        },
        {
            "id": 24,
            "text": "I'm not."
        },
        {
            "id": 25,
            "text": "They'll make that decision."
        },
        {
            "id": 26,
            "text": "You'll be hearing,\" Trump said."
        },
        {
            "id": 27,
            "text": "Vindman, who immigrated from Ukraine as a child and is a decorated Iraq war veteran, was part of a group of officials who listened as Trump make his July 25 phone call to Ukrainian President Volodymyr Zelenskiy."
        },
        {
            "id": 28,
            "text": "He reported the call to NSC lawyers and said he was concerned that Trump had pressed Zelenskiy to investigate a political rival."
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": "\"Frankly, I couldn't believe what I was hearing."
        },
        {
            "id": 31,
            "text": "It was probably an element of shock that maybe in certain regards my worst fear about how Ukrainian policy could play out, was playing out and how this was likely to have significant implications for U.S. national security,\" Vindman testified."
        },
        {
            "id": 32,
            "text": "Vindman had testified that his assignment at the White House was scheduled end in July and that he would return to the Army afterward."
        },
        {
            "id": 33,
            "text": "Sondland had worked on Ukraine policy with Trump's personal lawyer Rudy Giuliani."
        },
        {
            "id": 34,
            "text": "He dealt directly with Zelenskiy and said Trump was looking for an investigation in exchange for an Oval Office meeting."
        },
        {
            "id": 35,
            "text": "Sondland testified that \"everyone was in the loop\" about what was going on."
        },
        {
            "id": 36,
            "text": "But he also said Trump told him: \"I want nothing."
        },
        {
            "id": 37,
            "text": "I want no quid pro quo."
        },
        {
            "id": 38,
            "text": "I just want Zelenskiy to do the right thing\" — words that Trump and his allies used to try to deflate Democrats' impeachment arguments."
        },
        {
            "id": 39,
            "text": "Sondland and Vindman join a long list of other witnesses in the Trump impeachment investigation who have moved on from their jobs."
        },
        {
            "id": 40,
            "text": "Former Ukraine Ambassador Marie Yovanovich has retired from the foreign service."
        },
        {
            "id": 41,
            "text": "William Taylor, who had replaced Yovanovich in Ukraine after Trump recalled her, left in early January."
        },
        {
            "id": 42,
            "text": "Kurt Volker, the special envoy to Ukraine, resigned as the impeachment process was unfolding."
        },
        {
            "id": 43,
            "text": "Jennifer Williams, a career foreign service officer who was assigned to Vice President Mike Pence's office, recently left for a new position."
        },
        {
            "id": 44,
            "text": "And Tim Morrison, Vindman's boss at the NSC, left after he testified."
        },
        {
            "id": 45,
            "text": "Today, Lieutenant Colonel Alexander Vindman was escorted out of the White House where he has dutifully served his country and his President."
        },
        {
            "id": 46,
            "text": "He does so having spoken publicly once, and only pursuant to a subpoena from the United States Congress."
        },
        {
            "id": 47,
            "text": "There is no question in the mind of any American why this man's job is over, why this country now has one less soldier serving it at the White House."
        },
        {
            "id": 48,
            "text": "LTC Vindman was asked to leave for telling the truth."
        },
        {
            "id": 49,
            "text": "His honor, his commitment to right, frightened the powerful."
        },
        {
            "id": 50,
            "text": "During his decades of service to this country, LTC Alexander Vindman has served quietly but dutifully, and he has served with honor."
        },
        {
            "id": 51,
            "text": "He came into the public eye only when subpoenaed to testify before Congress, and he did what the law demanded."
        },
        {
            "id": 52,
            "text": "In recent months, many entrusted with power in our political system have cowered out of fear."
        },
        {
            "id": 53,
            "text": "And, yet, a handful of men and women, not endowed with prestige or power, but equipped only with a sense of right borne out of years of quiet service to their country made different choices."
        },
        {
            "id": 54,
            "text": "They courageously chose to honor their duty with integrity, to trust the truth, and to put their faith in country ahead of fear."
        },
        {
            "id": 55,
            "text": "And they have paid a price."
        },
        {
            "id": 56,
            "text": "The truth has cost LTC Alexander Vindman his job, his career, and his privacy."
        },
        {
            "id": 57,
            "text": "He did what any member of our military is charged with doing every day: he followed orders, he obeyed his oath, and he served his country, even when doing so was fraught with danger and personal peril."
        },
        {
            "id": 58,
            "text": "And for that, the most powerful man in the world — buoyed by the silent, the pliable, and the complicit — has decided to exact revenge."
        },
        {
            "id": 59,
            "text": "LTC Alexander Vindman leaves the White House today."
        },
        {
            "id": 60,
            "text": "But we must not accept the departure of truth, duty, and loyalty that he represents."
        },
        {
            "id": 61,
            "text": "In this country right matters, and so does truth."
        },
        {
            "id": 62,
            "text": "Truth is not partisan."
        },
        {
            "id": 63,
            "text": "If we allow truthful voices to be silenced, if we ignore their warnings, eventually there will be no one left to warn us."
        },
        {
            "id": 64,
            "text": ""
        }
    ]
}