{
    "title": "Rangel hits Obama over 'embarrassing' lack of diversity in new Cabinet ",
    "text": [
        {
            "id": 0,
            "text": "President Obama took more fire from the left Thursday over what critics say is a lack of diversity in his second-term Cabinet appointments."
        },
        {
            "id": 1,
            "text": "“It’s embarrassing as hell,” said Rep. Charles B. Rangel, New York Democrat, on MSNBC’s “Jansing & Co.”"
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "As the president gears up for his second term, Mr. Obama’s first four appointments have been white men:"
        },
        {
            "id": 4,
            "text": "Sen. John F. Kerry of Massachusetts to replace Secretary of State Hillary Rodham Clinton, former Sen. Chuck Hagel to serve as defense secretary; counterterrorism adviser John Brennan to head the CIA and White House Chief of Staff Jack Lew to take over as Treasury secretary."
        },
        {
            "id": 5,
            "text": "With the surprise departure Wednesday of Labor Secretary Hilda L. Solis, some liberals are reminding Mr. Obama that he criticized Republican Mitt Romney during the presidential campaign for saying he once consulted “binders of women” to find qualified female aides."
        },
        {
            "id": 6,
            "text": "“We’ve been through this with Mitt Romney,” Mr. Rangel said."
        },
        {
            "id": 7,
            "text": "Mr. Obama “has had four years to work the bench, to know the second team, so that in the second term these people should be just as experienced as any other American."
        },
        {
            "id": 8,
            "text": "You have to [appoint women and minorities] because it’s the right thing to do as a symbol of what America stands for — and that’s whether you’re Republican or Democrat.”"
        },
        {
            "id": 9,
            "text": "White House press secretary Jay Carney said the president’s record on diversity “speaks for itself,” and he pointed to Mr. Obama’s appointment of two female Supreme Court justices, among other nominations and hirings."
        }
    ]
}