{
    "title": "GOP contenders Nearly silent on Colorado Springs shooting",
    "text": [
        {
            "id": 0,
            "text": "Republican presidential front-runner Donald Trump, like most other GOP candidates, did not mention the Planned Parenthood slayings in a rally in Sarasota, Fla., on Saturday."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "The Republican presidential field, which for much of the year has been full-throated in its denunciations of Planned Parenthood, has been nearly silent about the shooting in Colorado at one of its facilities that left a police officer and two others dead."
        },
        {
            "id": 3,
            "text": "In contrast, all three of the leading Democratic contenders quickly issued statements in support of Planned Parenthood."
        },
        {
            "id": 4,
            "text": "President Obama, meanwhile, focused on the episode as more impetus for a renewed push to stop “the easy accessibility of weapons of war on our streets to people who have no business wielding them."
        },
        {
            "id": 5,
            "text": "Period."
        },
        {
            "id": 6,
            "text": "Enough is enough.”"
        },
        {
            "id": 7,
            "text": "Not until much more is known about alleged gunman Robert Lewis Dear Jr. and his precise motivations will the political implications of his actions become clear."
        },
        {
            "id": 8,
            "text": "It was suspected, according to a law enforcement official, that heated rhetoric surrounding the issue of abortion influenced Dear’s actions."
        },
        {
            "id": 9,
            "text": "The setting he chose was one that has developed particular resonance this election cycle, after an antiabortion group released a series of secretly filmed videos in which Planned Parenthood officials discuss the techniques and financial aspects of harvesting fetal tissue samples for scientific research."
        },
        {
            "id": 10,
            "text": "A suspected gunman is in custody after a shooting at a Planned Parenthood clinic in Colorado left three people dead, including one police officer."
        },
        {
            "id": 11,
            "text": "Here's what else we know about the incident."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": "The videos, which Planned Parenthood noted were heavily edited, showed the officials talking about gruesome details with clinical detachment."
        },
        {
            "id": 14,
            "text": "Many Republicans have also accused Planned Parenthood of selling such tissue, which would be illegal and which the organization vehemently denies."
        },
        {
            "id": 15,
            "text": "[Undercover video shows Planned Parenthood official discussing fetal organs used for research]\n\nStopping federal funding of the organization has become a rallying cry of Republican politicians and a battle flag in the larger, decades-long political struggle over abortion rights."
        },
        {
            "id": 16,
            "text": "Democrats have also been vociferous in their defense of the organization, which they say is a crucial provider of women’s health services."
        },
        {
            "id": 17,
            "text": "As a presidential campaign issue, criticism of Planned Parenthood reached a crescendo during the Sept. 16 GOP presidential debate at the Ronald Reagan Presidential Library in Simi Valley, Calif."
        },
        {
            "id": 18,
            "text": "“I dare Hillary Clinton, Barack Obama to watch these tapes."
        },
        {
            "id": 19,
            "text": "Watch a fully formed fetus on the table, its heart beating, its legs kicking while someone says we have to keep it alive to harvest its brain."
        },
        {
            "id": 20,
            "text": "This is about the character of our nation,” former Hewlett-Packard chief executive Carly Fiorina said during the debate."
        },
        {
            "id": 21,
            "text": "Her characterization of the video was incorrect, conflating the image of a fetus with a voice claiming to witness another scene."
        },
        {
            "id": 22,
            "text": "But it packed an emotional wallop, and Fiorina has continued to insist that it was accurate."
        },
        {
            "id": 23,
            "text": "[Fact-checking the second round of GOP debates]\n\nPresident Obama condemned the slayings at a Colorado Planned Parenthood and called for greater gun control measures: “Enough is enough.”"
        },
        {
            "id": 24,
            "text": "(Michael Reynolds/European Pressphoto Agency)\n\nFiorina has not said anything publicly about the shootings at the clinic, but a campaign spokeswoman noted that she is scheduled to appear on “Fox News Sunday.”"
        },
        {
            "id": 25,
            "text": "The only GOP contenders to make reference to the Colorado shooting as of late Saturday were Sen. Ted Cruz (R-Tex.), Ohio Gov. John Kasich and former Florida governor Jeb Bush."
        },
        {
            "id": 26,
            "text": "All expressed sympathy for the victims, though none of the three mentioned Planned Parenthood."
        },
        {
            "id": 27,
            "text": "Bush, however, said: “There is no acceptable explanation for this violence, and I will continue to pray for those who have been impacted.”"
        },
        {
            "id": 28,
            "text": "Cruz tweeted Saturday morning: “Praying for the loved ones of those killed, those injured & first responders who bravely got the situation under control in Colorado Springs.”"
        },
        {
            "id": 29,
            "text": "The reactions of Colorado’s two senators were also telling of the political sensitivities."
        },
        {
            "id": 30,
            "text": "Democrat Michael F. Bennet tweeted: “Our thoughts tonight are with the victims and their families, Planned Parenthood, and the city and police department of Colorado Springs”"
        },
        {
            "id": 31,
            "text": "The state’s junior senator, Republican Cory Gardner — who defeated incumbent Mark Udall last year in an election that Democrats tried to make a referendum on reproductive rights — issued a statement Saturday night that did not mention the site of the killings."
        },
        {
            "id": 32,
            "text": "Gardner said that he and his wife, Jaime, were “deeply saddened by the events that unfolded in Colorado Springs earlier today."
        },
        {
            "id": 33,
            "text": "This senseless act of violence is truly tragic and our hearts are with the victims and their families during this difficult time.”"
        },
        {
            "id": 34,
            "text": "At a rally Saturday in Sarasota, Fla., GOP front-runner Donald Trump stressed his opposition to gun control but talked only about the terrorist attacks in Paris."
        },
        {
            "id": 35,
            "text": "“If some of those folks that were just slaughtered in Paris, if a couple of guns were in that room that were held by the good guys, you would’ve had a different story, let me tell you,” Trump said."
        },
        {
            "id": 36,
            "text": "Leading Democrats expressed support and sympathy for Planned Parenthood, but most stopped short of asserting that the gunman was motivated by animosity toward the organization and one of the services it offers."
        },
        {
            "id": 37,
            "text": "Sen. Bernie Sanders of Vermont, however, seemed to be edging in that direction."
        },
        {
            "id": 38,
            "text": "“While we still do not know the shooter’s motive, what is clear is that Planned Parenthood has been the subject of vicious and unsubstantiated statements attacking an organization that provides critical health care for millions of Americans,” Sanders said."
        },
        {
            "id": 39,
            "text": "“I strongly support Planned Parenthood and the work it is doing, and hope people realize that bitter rhetoric can have unintended consequences.”"
        },
        {
            "id": 40,
            "text": "His rivals for the Democratic nomination, former secretary of state Hillary Clinton and former Maryland governor Martin O’Malley, contained their comments to tweets that included the hashtag “#StandWithPP.”"
        },
        {
            "id": 41,
            "text": "In Saturday’s statement, Obama said, “We don’t yet know what this particular gunman’s so-called motive was for shooting twelve people, or for terrorizing an entire community, when he opened fire with an assault weapon and took hostages at a Planned Parenthood center in Colorado.”"
        },
        {
            "id": 42,
            "text": "“What we do know is that he killed a cop in the line of duty, along with two of the citizens that police officer was trying to protect,” he said."
        },
        {
            "id": 43,
            "text": "“And we know that more Americans and their families had fear forced upon them.”"
        },
        {
            "id": 44,
            "text": ""
        }
    ]
}