{
    "title": "Washington Post-ABC News poll: Clinton holds four-point lead in aftermath of Trump tape",
    "text": [
        {
            "id": 0,
            "text": "The newest Washington Post-ABC News poll shows Democratic presidential Hillary Clinton with a 4-percentage-point lead over Republican nominee Donald Trump among likely voters."
        },
        {
            "id": 1,
            "text": "Respondents were also asked about Donald Trump's lewd comments about women, and how locked-in their votes are."
        },
        {
            "id": 2,
            "text": "With three weeks until Election Day, Hillary Clinton holds a four-point lead over Donald Trump in the race for the White House, according to a new Washington Post-ABC News poll, with the Republican nominee hobbled by persistent perceptions that he is not qualified to be president."
        },
        {
            "id": 3,
            "text": "The poll was conducted during one of the most tumultuous periods of Trump’s candidacy, after the release of a video in which he spoke about taking sexual advantage of women and during a time when numerous women have accused him of sexual misconduct."
        },
        {
            "id": 4,
            "text": "Nearly 7 in 10 respondents believe Trump probably made unwanted sexual advances, and a majority say his apology for boasts about forcing himself on women on a hot-mic videotape was insincere."
        },
        {
            "id": 5,
            "text": "Nonetheless, the controversy appeared to have had only a minimal impact on his overall support."
        },
        {
            "id": 6,
            "text": "Overall, Clinton leads Trump by 47-43 percent among likely voters, a slight edge given the survey’s four-percentage-point error margin."
        },
        {
            "id": 7,
            "text": "Libertarian Party nominee Gary Johnson has the support of 5 percent, and Green Party nominee Jill Stein is at 2 percent."
        },
        {
            "id": 8,
            "text": "Among registered voters, the poll shows a similar four-point margin, with Clinton at 44, Trump at 40, Johnson at 6 and Stein at 3."
        },
        {
            "id": 9,
            "text": "In a two-way matchup, Clinton leads Trump by 50-46 percent among likely voters and by 50-44 percent among registered voters."
        },
        {
            "id": 10,
            "text": "The current findings show only slight changes from the last Post-ABC survey, which was taken on the eve of the first presidential debate."
        },
        {
            "id": 11,
            "text": "At that time, Clinton held an insignificant two-point edge over Trump among likely voters."
        },
        {
            "id": 12,
            "text": "The findings are somewhat better for Trump than other polls taken since the video, but if Clinton were to maintain such an advantage until Election Day, that could translate into a sizable electoral college majority."
        },
        {
            "id": 13,
            "text": "Supporters of both candidates are locked in, with 88 percent of Trump supporters and 89 percent of Clinton backers saying they will “definitely” support their current preference."
        },
        {
            "id": 14,
            "text": "The survey also underscored the hardening of the lines between those supporting Trump and those who are not."
        },
        {
            "id": 15,
            "text": "One question in particular highlighted this divide."
        },
        {
            "id": 16,
            "text": "Asked whether it was appropriate for Trump to say that, if he were in charge of law enforcement in this country, his opponent would be in jail for her use of a private email server, about 4 in 10 likely voters said yes, compared with 57 percent who said no."
        },
        {
            "id": 17,
            "text": "More than 7 in 10 Republicans and more than 8 in 10 Trump supporters called the language appropriate."
        },
        {
            "id": 18,
            "text": "There is clearly less enthusiasm on the part of Clinton’s and Trump’s supporters than previous nominees have enjoyed at this stage of the campaign."
        },
        {
            "id": 19,
            "text": "Fully 83 percent of Clinton’s backers and 79 percent of Trump’s supporters say they are very or somewhat enthusiastic about their candidate."
        },
        {
            "id": 20,
            "text": "Four years ago at this time, more than 90 percent of both President Obama’s and Republican nominee Mitt Romney’s supporters described themselves as enthusiastic."
        },
        {
            "id": 21,
            "text": "Meanwhile, antipathy toward the other side is at extremely high levels, as 87 percent of likely voters supporting Trump have a “strongly unfavorable” view of Clinton, and 90 percent of Clinton backers have a strong negative view of Trump."
        },
        {
            "id": 22,
            "text": "The Oct. 7 release of the 11-year-old “Access Hollywood” video, which captured Trump on a hot mic speaking in crude and degrading ways about women, brought a torrent of criticism on Trump and caused significant defections among Republican elected officials."
        },
        {
            "id": 23,
            "text": "Trump issued a series of statements apologizing for what he said on the video, but nearly 6 in 10 likely voters say they do not think the apology was sincere, including more than one-fifth of Republicans and more than 6 in 10 independents."
        },
        {
            "id": 24,
            "text": "The poll also finds that slightly more than a third of all likely voters say the video will make them less likely to vote for him, including 13 percent of Republicans."
        },
        {
            "id": 25,
            "text": "Trump denied during the second presidential debate that he had ever engaged in the kind of behavior he talked about in the video."
        },
        {
            "id": 26,
            "text": "He held that position when confronted days later by accusations from multiple women who said he had groped them."
        },
        {
            "id": 27,
            "text": "The Post-ABC poll indicates that an overwhelming majority of likely voters doubt those denials, with 68 percent saying Trump probably has made unwanted sexual advances on women and 14 percent saying he probably has not."
        },
        {
            "id": 28,
            "text": "Almost half of Republicans think he has probably engaged in such behavior, while 22 percent say he has not, and the rest have no opinion."
        },
        {
            "id": 29,
            "text": "Trump repeatedly tried to brush aside his comments as “locker room banter.”"
        },
        {
            "id": 30,
            "text": "Asked whether his comments are typical of locker room talk among men, just more than 4 in 10 likely voters said yes, while 52 percent said it was “beyond how men typically talk.”"
        },
        {
            "id": 31,
            "text": "There was little difference in the way men and women answered this question: About 4 in 10 men and 4 in 10 women say this is typical locker room talk."
        },
        {
            "id": 32,
            "text": "There was a significant variance among white voters based on levels of education, however, with 53 percent of whites without college degrees calling it typical and 55 percent of whites with college degrees saying it went beyond typical conversation among men."
        },
        {
            "id": 33,
            "text": "As he has come under criticism on the issue of his treatment of women, Trump has countered by pointing to Bill Clinton, saying that what the former president did and has been accused of doing regarding women is far worse."
        },
        {
            "id": 34,
            "text": "Trump also has accused Hillary Clinton of intimidating her husband’s accusers."
        },
        {
            "id": 35,
            "text": "This line of attack finds support among only a minority of voters."
        },
        {
            "id": 36,
            "text": "When asked to compare the two issues — Trump’s vs. Bill Clinton’s treatment of women or what Hillary Clinton did on behalf of her husband — there is no equivalence."
        },
        {
            "id": 37,
            "text": "While 55 percent say the issue of Trump’s treatment of women is a legitimate issue in the campaign, 62 percent say what Hillary Clinton may have done is not a legitimate issue, and 67 percent say Bill Clinton’s treatment is not a legitimate issue."
        },
        {
            "id": 38,
            "text": "Both Clinton and Trump are viewed unfavorably by majorities of Americans."
        },
        {
            "id": 39,
            "text": "Clinton’s current net negative is 14 points (42 percent favorable and 56 percent unfavorable), while Trump’s is 25 points (37 percent favorable and 62 percent unfavorable)."
        },
        {
            "id": 40,
            "text": "At the same time, neither is viewed as honest and trustworthy, with 60 percent of likely voters saying Clinton is not and 62 percent saying Trump is not."
        },
        {
            "id": 41,
            "text": "A slight majority (52 percent) say Clinton does not have strong moral character, and a much larger 66 percent say Trump does not have it."
        },
        {
            "id": 42,
            "text": "On these questions, there are significant and predictable partisan differences in perceptions of the candidates, yet 30 percent of likely voters who support Trump say he doesn’t have a strong moral character."
        },
        {
            "id": 43,
            "text": "Three times as many of his supporters say Clinton lacks it."
        },
        {
            "id": 44,
            "text": "On two other attributes, however, Clinton is viewed positively and Trump is viewed negatively, and these help to highlight the obstacles that remain in Trump’s path as he attempts to make up ground lost over the past month."
        },
        {
            "id": 45,
            "text": "Six in 10 say Clinton is qualified to be president, consistent with views of her readiness over many months."
        },
        {
            "id": 46,
            "text": "Meanwhile, almost 6 in 10 (57 percent) of likely voters say Trump is not qualified, also a level that has moved little through the course of the general election."
        },
        {
            "id": 47,
            "text": "On the question of fitness — who has the kind of personality and temperament to serve as president — there is a similar mismatch between the candidates."
        },
        {
            "id": 48,
            "text": "Almost 6 in 10 likely voters say Clinton has the right temperament, while 62 percent say Trump does not."
        },
        {
            "id": 49,
            "text": "Trump also has no advantage in trust to handle a series of major campaign issues."
        },
        {
            "id": 50,
            "text": "He is roughly even with Clinton in trust to handle the economy, terrorism and immigration, but he trails on handling ethics in government and by large margins on dealing with an international crisis, advocating women’s rights and looking out for the middle class."
        },
        {
            "id": 51,
            "text": "Perceptions of Trump on these issues and attributes have changed only a little in the aftermath of the “Access Hollywood” video, in part perhaps because he was judged so negatively before the video became public."
        },
        {
            "id": 52,
            "text": "Taken together, the findings on these questions point to what could be a hard ceiling in Trump’s support, which he so far has been unable to change."
        },
        {
            "id": 53,
            "text": "Republicans have urged him for months to become more disciplined and to demonstrate greater stability as a candidacy."
        },
        {
            "id": 54,
            "text": "His last big opportunity to do so will come on Wednesday when he and Clinton meet in Las Vegas for their final debate."
        },
        {
            "id": 55,
            "text": "Many Republicans said after the second debate that Trump had done well in making his arguments as a change candidate while portraying Clinton as part of a failed status quo."
        },
        {
            "id": 56,
            "text": "But at 45 percent to 33 percent, more likely voters say Clinton prevailed in the town hall debate in St. Louis."
        },
        {
            "id": 57,
            "text": "The Post-ABC poll was conducted Oct. 10-13 among a random national sample of 1,152 adults reached on cellular and landline phones."
        },
        {
            "id": 58,
            "text": "The margin of sampling error for overall results is plus or minus three percentage points; the margin of error is 3.5 points among the sample of 920 registered voters and four points among the sample of 740 likely voters."
        },
        {
            "id": 59,
            "text": ""
        }
    ]
}