{
    "title": "Trump seizes on judge’s ruling that Pennsylvania lockdown is ‘unconstitutional’",
    "text": [
        {
            "id": 0,
            "text": "Shutdown restrictions ordered by Pennsylvania Gov. Tom Wolf to slow the spread of the novel coronavirus were unconstitutional, a federal judge ruled Monday — a decision that was quickly celebrated by President Trump, who said he hopes the decision is followed by similar pronouncements in other states."
        },
        {
            "id": 1,
            "text": "The case stemmed from a complaint filed in May by four Pennsylvania counties — Butler, Fayette, Greene and Washington — that argued against the state’s orders to close “non-life-sustaining” businesses and limit gatherings to 25 people indoors or 250 people outdoors."
        },
        {
            "id": 2,
            "text": "William Stickman opined “open-ended” measures imposed on people are an overreaching violation of constitutional rights."
        },
        {
            "id": 3,
            "text": "“The court believes that defendants undertook their actions in a well-intentioned effort to protect Pennsylvanians from the virus,” the ruling said."
        },
        {
            "id": 4,
            "text": "“However, good intentions toward a laudable end are not alone enough to uphold governmental action against a constitutional challenge.”"
        },
        {
            "id": 5,
            "text": "Within hours after the decision was filed, Trump retweeted nearly two dozen posts about the blow to the Democratic governor’s oversight of his state."
        },
        {
            "id": 6,
            "text": "In one post, seniors wag their fingers and peel off their face coverings to the beat of Twisted Sister’s “We’re Not Gonna Take It.”"
        },
        {
            "id": 7,
            "text": "“PENNSYLVANIA GOVERNOR TOM WOLF AN YOUR STUPID WIFE ....."
        },
        {
            "id": 8,
            "text": "YOUR NOT GOING TO MURDER US !!!"
        },
        {
            "id": 9,
            "text": "TRUMP 2020 …"
        },
        {
            "id": 10,
            "text": "WE LOVE PENNSYLVANIA,” the caption read."
        },
        {
            "id": 11,
            "text": "At a “Latinos for Trump” roundtable Monday night, the president claimed, without evidence, states will open everything Nov. 4 and said he hopes other judges will strike down coronavirus mandates."
        },
        {
            "id": 12,
            "text": "“We hope that’s going to happen in North Carolina,” he said."
        },
        {
            "id": 13,
            "text": "“We hope it’s going to happen in Michigan, too, because it’s just totally shut down.”"
        },
        {
            "id": 14,
            "text": "Trump has repeatedly criticized Democratic governors for shutting down their states’ economies in efforts to curb the spread of the virus."
        },
        {
            "id": 15,
            "text": "Court examines North Carolina’s new law that requires photo IDs for voting"
        },
        {
            "id": 16,
            "text": "Wolf will seek a stay of the decision and file an appeal to the U.S. Court of Appeals for the 3rd Circuit, his spokesperson Lyndsay Kensinger wrote in a statement to The Post."
        },
        {
            "id": 17,
            "text": "“The actions taken by the administration were mirrored by governors across the country and saved, and continue to save lives in the absence of federal action,” Kensinger wrote."
        },
        {
            "id": 18,
            "text": "“This decision is especially worrying as Pennsylvania and the rest of the country are likely to face a challenging time with the possible resurgence of covid-19 and the flu in the fall and winter.”"
        },
        {
            "id": 19,
            "text": "Kensinger said the ruling would not affect current restrictions, with many already lifted as the state has partially reopened."
        },
        {
            "id": 20,
            "text": "The judicial decision comes as new infections reported in Pennsylvania have leveled."
        },
        {
            "id": 21,
            "text": "The state’s seven-day average for daily cases was 743."
        },
        {
            "id": 22,
            "text": "Pennsylvania has totaled 145,063 reported infections since the start of the pandemic."
        },
        {
            "id": 23,
            "text": "The state has among the lowest infections per capita in the nation."
        },
        {
            "id": 24,
            "text": "‘Shameful, dangerous and irresponsible’:"
        },
        {
            "id": 25,
            "text": "Nevada governor blasts Trump for indoor rally against state rules"
        },
        {
            "id": 26,
            "text": "The majority of Pennsylvania voters surveyed, 62 percent, said the governor has done a good job handling the pandemic, according to a Monmouth University poll in August."
        },
        {
            "id": 27,
            "text": "In contrast, 53 percent of the voters disapproved of how Trump has responded to the crisis."
        },
        {
            "id": 28,
            "text": "White House coronavirus response coordinator Deborah Birx praised Wolf in a Sept. 3 press briefing in Harrisburg, saying his state was making “great progress.”"
        },
        {
            "id": 29,
            "text": "Conservatives have challenged Democratic state leaders’ handling of the pandemic, bringing legal cases against restrictions that limit individual freedoms."
        },
        {
            "id": 30,
            "text": "In Michigan, the state’s appeals court ruled in August for Democratic Gov. Gretchen Whitmer, denying Republican lawmakers’ challenge of her emergency declarations."
        }
    ]
}