{
    "title": "Obama says FCC should reclassify the internet's regulatory status",
    "text": [
        {
            "id": 0,
            "text": "In a rather dramatic development, President Obama today announced that he wants the FCC to reclassify internet service providers as telecommunications services."
        },
        {
            "id": 1,
            "text": "This is a huge deal for network neutrality advocates."
        },
        {
            "id": 2,
            "text": "To understand the debate, we have to go back to 1996, the year Congress last overhauled telecommunications law."
        },
        {
            "id": 3,
            "text": "In that year, Congress established two legal categories:\n\nTelecommunications services are services such as a traditional phone line that are considered common carriers."
        },
        {
            "id": 4,
            "text": "The law imposes a wide variety of legal obligations on telecommunications services and gives the FCC broad discretion to regulate them."
        },
        {
            "id": 5,
            "text": "are services such as a traditional phone line that are considered common carriers."
        },
        {
            "id": 6,
            "text": "The law imposes a wide variety of legal obligations on telecommunications services and gives the FCC broad discretion to regulate them."
        },
        {
            "id": 7,
            "text": "Information services are services that allow people to store, process, and publish information online — like old-school AOL, or modern services like YouTube or Facebook."
        },
        {
            "id": 8,
            "text": "These services are exempt from most FCC regulations."
        },
        {
            "id": 9,
            "text": "Since 1996, there's been a fight over how to classify broadband services offered by incumbents such as Comcast and Verizon."
        },
        {
            "id": 10,
            "text": "Many open internet activists have argued that the law requires them to be treated as telecommunications services."
        },
        {
            "id": 11,
            "text": "But in a 2005 case, the Supreme Court ruled that the FCC could classify them as information services if they wanted to."
        },
        {
            "id": 12,
            "text": "That's what the FCC has done ever since."
        },
        {
            "id": 13,
            "text": "That decision came back to haunt the agency earlier this year."
        },
        {
            "id": 14,
            "text": "The US Court of Appeals for the DC Circuit ruled that because the FCC had previously classified broadband as a low-regulation \"information service,\" it could not impose strong network neutrality regulations on them."
        },
        {
            "id": 15,
            "text": "The FCC could officially change its mind and declare broadband a telecommunications service."
        },
        {
            "id": 16,
            "text": "That would give the agency the power to enact strong network neutrality regulations."
        },
        {
            "id": 17,
            "text": "And that's what Obama is asking them to do."
        },
        {
            "id": 18,
            "text": "So even though the question of classification status sounds incredibly dull and obscure, it's really a huge deal."
        },
        {
            "id": 19,
            "text": "Watch Obama's statement on why he's making the switch below (text of the plan here), and read Tim Lee's deeper explanation of the network neutrality debate."
        }
    ]
}