{
    "title": "Moderna reports 'positive' results from early data on coronavirus vaccine",
    "text": [
        {
            "id": 0,
            "text": "The biotech company Moderna on Monday reported “positive” data on its potential coronavirus vaccine from an early clinical trial, raising hopes about the effort."
        },
        {
            "id": 1,
            "text": "The company said early data from a phase one clinical trial showed that people given the potential vaccine generated an immune response similar to that in people who had recovered from the disease."
        },
        {
            "id": 2,
            "text": "The levels of neutralizing antibodies were “at or above” the levels seen in blood samples from people who have recovered from the coronavirus, Moderna said in a statement."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "Still, that early result is only from the first eight participants in the trial."
        },
        {
            "id": 5,
            "text": "“These interim Phase 1 data, while early, demonstrate that vaccination with mRNA-1273 elicits an immune response of the magnitude caused by natural infection starting with a dose as low as 25 [micrograms],” Tal Zaks, chief medical officer at Moderna, said in a statement."
        },
        {
            "id": 6,
            "text": "“These data substantiate our belief that mRNA-1273 has the potential to prevent COVID-19 disease and advance our ability to select a dose for pivotal trials,” he added, referring to the potential vaccine."
        },
        {
            "id": 7,
            "text": "The company also said the vaccine was “generally safe and well tolerated.”"
        },
        {
            "id": 8,
            "text": "All side-effects, including redness in one participant around the injection site, have so far been “transient and self-resolving,” the company noted, adding that no “serious” side-effects have been reported."
        },
        {
            "id": 9,
            "text": "Additionally, the potential vaccine was successful in preventing the virus from replicating in mice’s lungs in another study, Moderna said."
        },
        {
            "id": 10,
            "text": "The company, which is working with the National Institute of Allergy and Infectious Diseases, led by Anthony Fauci Anthony FauciApproval by Halloween to vaccinate kids could offer a truly thankful Thanksgiving season Trump on what would prevent 2024 bid: 'I guess a bad call from a doctor' Overnight Health Care — Presented by Indivior — CDC panel approves boosters for some, but not based on jobs MORE, is about to begin a phase two trial and said it hopes to begin a phase three trial in July."
        },
        {
            "id": 11,
            "text": "“We are investing to scale up manufacturing so we can maximize the number of doses we can produce to help protect as many people as we can from SARS-CoV-2,” said the company’s CEO, Stéphane Bancel."
        },
        {
            "id": 12,
            "text": ""
        }
    ]
}