{
    "title": "Trump aide Peter Navarro warned 'as many as 1.2 million souls' could be lost to coronavirus: reports",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON – While President Donald Trump played down concerns about the coronavirus in January and February, a top White House adviser warned that a coronavirus pandemic could cost the country trillions of dollars and endanger millions of Americans, according to two new reports."
        },
        {
            "id": 1,
            "text": "Peter Navarro, the top trade and manufacturing aide to the president, laid out the warning in two memos - one on Jan. 29 and another on Feb. 23, according to reports from the New York Times and Axios."
        },
        {
            "id": 2,
            "text": "Trump has repeatedly said that no one could have predicted the coronavirus pandemic."
        },
        {
            "id": 3,
            "text": "In the first memo, which was sent to the National Security Council, Navarro outlined that the U.S. should implement a China travel ban, according to the reports."
        },
        {
            "id": 4,
            "text": "The virus originated from Wuhan, China."
        },
        {
            "id": 5,
            "text": "Coronavirus live updates:Donald Trump hints at second stimulus check"
        },
        {
            "id": 6,
            "text": "“The lack of immune protection or an existing cure or vaccine would leave Americans defenseless in the case of a full-blown coronavirus outbreak on U.S. soil,” Navarro said in the first memo, according to the Times."
        },
        {
            "id": 7,
            "text": "“This lack of protection elevates the risk of the coronavirus evolving into a full-blown pandemic, imperiling the lives of millions of Americans.\""
        },
        {
            "id": 8,
            "text": "At the time of Navarro's first memo, aides were skeptical of his motives, Axios reported."
        },
        {
            "id": 9,
            "text": "Navarro in the past has been hawkish on China."
        },
        {
            "id": 10,
            "text": "Trump in late January played down concerns over the virus."
        },
        {
            "id": 11,
            "text": "On Jan. 24, the president told reporters that \"we have it totally under control\" that it's \"going to be just fine.\""
        },
        {
            "id": 12,
            "text": "The same day of Navarro's first memo on Jan. 29, the White House coronavirus task force was formed."
        },
        {
            "id": 13,
            "text": "Trump announced a day later that he was blocking travel from China."
        },
        {
            "id": 14,
            "text": "'Second opinion:' Trump aide Peter Navarro questions Anthony Fauci's caution on anti-malaria drug"
        },
        {
            "id": 15,
            "text": "The second memo, which was addressed to Trump and was unsigned but attributed to Navarro, laid the ground work for supplemental requests from Congress, Axios reported."
        },
        {
            "id": 16,
            "text": "“This is NOT a time for penny-pinching or horse trading on the Hill,” Navarro wrote in the second memo sent on Feb. 23."
        },
        {
            "id": 17,
            "text": "The memo also warned that an “increasing probability of a full-blown COVID-19 pandemic that could infect as many as 100 million Americans, with a loss of life of as many as 1.2 million souls,\" according to the Times."
        },
        {
            "id": 18,
            "text": "Congress has since approved a $2 trillion relief coronavirus package."
        },
        {
            "id": 19,
            "text": "Navarro is now coordinating the use of the Defense Production Act for the White House"
        },
        {
            "id": 20,
            "text": "On Feb. 24, Trump wrote in a tweet: \"The Coronavirus is very much under control in the USA.\""
        },
        {
            "id": 21,
            "text": "Despite the warnings from Navarro, Trump in the past several weeks has claimed that \"nobody\" could have predicted the coronavirus pandemic."
        },
        {
            "id": 22,
            "text": "\"I would view it as is something that just surprised the whole world,\" he said on March 19. \""
        },
        {
            "id": 23,
            "text": "And if people would have known about it, it could have stopped – stopped being in place."
        },
        {
            "id": 24,
            "text": "Nobody knew there'd be a pandemic or an epidemic of this proportion."
        },
        {
            "id": 25,
            "text": "Nobody had ever seen anything like this before.\""
        },
        {
            "id": 26,
            "text": "More:Facing a crisis that rivals Pearl Harbor, world's superpower pleads for coronavirus aid"
        },
        {
            "id": 27,
            "text": "During remarks on March 26, Trump said: \"Nobody would have ever thought a thing like this could have happened.\""
        },
        {
            "id": 28,
            "text": "Reports of Navarro's memos come several days reports that he had a heated argument with National Institute of Allergy and Infectious Diseases director Anthony Fauci over whether the White House should be doing more to promote an anti-malarial drug, hydroxychloroquine, as a treatment for coronavirus."
        },
        {
            "id": 29,
            "text": "Trump has repeatedly promoted the drug, recently saying that it's “being tested now\" and “there are some very strong, powerful signs” of the potential of the drug as a treatment."
        },
        {
            "id": 30,
            "text": "Fauci has maintained that there is still only anecdotal information and that more rigorous studies need to be done to see the true effect of the drug, according to the reports."
        },
        {
            "id": 31,
            "text": "However, the White House coronavirus task force has agreed to surge the supply of hydroxychloroquine to hot zones."
        }
    ]
}