{
    "title": "CDC may urge Americans to cover faces in public: report",
    "text": [
        {
            "id": 0,
            "text": "The U.S. Centers for Disease Control and Prevention (CDC) may urge Americans to cover their faces in public to protect themselves and others amid the coronavirus pandemic, The Washington Post is reporting."
        },
        {
            "id": 1,
            "text": "The recommendation, if approved, would call for Americans to use cloth coverings instead of surgical and N95 masks, which have been in short supply at hospitals and medical facilities across the country, the Post noted, adding that the coverings could potentially lower the risk of an infected person transmitting the virus."
        },
        {
            "id": 2,
            "text": "Talks are still ongoing, an anonymous federal official confirmed to the newspaper."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "A second official said that the recommendation could help “flatten the curve” of the virus's spread."
        },
        {
            "id": 5,
            "text": "The CDC does not currently recommend that healthy people wear masks or coverings over their face, instead recommending that everyone engage in social distancing and stand at least six feet apart."
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "President Trump, asked Monday at the daily White House briefing if everyone should wear nonmedical masks, told reporters that the option is \"certainly something we could discuss” and that “it could be something like that for a limited period of time.”"
        },
        {
            "id": 8,
            "text": "Former Food and Drug Administration Commissioner Scott Gottlieb recommended the change as the lead author of a pandemic response plan published Sunday by the American Enterprise Institute."
        },
        {
            "id": 9,
            "text": "The report says that “everyone, including people without symptoms, should be encouraged to wear nonmedical fabric face masks while in public.”"
        },
        {
            "id": 10,
            "text": "During an interview with CBS’s “Face the Nation” on Sunday, he said people should consider wearing a cotton mask, adding: “We should be putting out guidelines from the CDC on how you can develop a mask on your own.”"
        },
        {
            "id": 11,
            "text": "However, some worry that a mask could become contaminated and not be properly cleaned or disposed of, leading to transmission of the coronavirus, the Post reported."
        },
        {
            "id": 12,
            "text": "Ilhem Messaoudi, a University of California at Irvine epidemiologist, told the newspaper that the virus is spread through heavy respiratory droplets."
        },
        {
            "id": 13,
            "text": "“Given the shortage of PPE available to our healthcare workforce, it is irresponsible for anyone to suggest that we should all don masks, reducing the supply for nurses and physicians who do not have the luxury of treating symptomatic, very sick patients from 6 feet away,” Messaoudi said."
        },
        {
            "id": 14,
            "text": "“Homemade masks theoretically could offer some protection if the materials and fit were optimized, but this is uncertain,” Jeffrey Duchin, a top health official in Seattle and King County, Wash., told the Post."
        },
        {
            "id": 15,
            "text": "“It’s also possible that mask-wearing might increase the risk for infection if other recommendations (like hand washing and distancing) are less likely to be followed or if the mask is contaminated and touched.”"
        },
        {
            "id": 16,
            "text": "“Well-designed homemade or commercially manufactured masks for the public that did not draw on the supply needed by healthcare workers could potentially provide some protection,” he added."
        }
    ]
}