{
    "title": "Facebook Bans Trump ‘at Least’ Until He Leaves Office",
    "text": [
        {
            "id": 0,
            "text": "President Trump speaks during a rally in Washington, D.C., January 6, 2021."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "Facebook announced Thursday that it is banning President Trump from the platform “indefinitely,” at least until he is out of office."
        },
        {
            "id": 3,
            "text": "“We believe the risks of allowing the President to continue to use our service during this period are simply too great,” Facebook CEO Mark Zuckerberg wrote in a statement."
        },
        {
            "id": 4,
            "text": "“Therefore, we are extending the block we have placed on his Facebook and Instagram accounts indefinitely and for at least the next two weeks until the peaceful transition of power is complete.”"
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "Trump will also be blocked from posting on Instagram, which is owned by Facebook."
        },
        {
            "id": 7,
            "text": "The social media giant’s decision came after pro-Trump rioters stormed the Capitol building on Wednesday, breaking past security and entering the Senate chamber."
        },
        {
            "id": 8,
            "text": "Facebook, Twitter, and YouTube, which is owned by Google, were all lambasted by critics who said the tech companies could have done more to prevent the escalation of violence."
        },
        {
            "id": 9,
            "text": "Twitter took a similar step to Facebook Wednesday evening, temporarily blocking Trump’s account for 12 hours, saying it was weighing banning him permanently."
        },
        {
            "id": 10,
            "text": "Prior to locking his account, Twitter also deleted three of Trump’s tweets, including a video message the president tweeted out after the mob of Trump supporters broke into the Capitol urging them to remain peaceful and return home."
        },
        {
            "id": 11,
            "text": "The president had repeated his claim in the video that the election was rife with voter fraud."
        },
        {
            "id": 12,
            "text": "Facebook and YouTube also deleted the video from their platforms."
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}