{
    "title": "Appeals court hears Obamacare case that could focus 2020 debate",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "Obamacare faces a three-judge panel Tuesday in New Orleans that will weigh whether the healthcare law is unconstitutional."
        },
        {
            "id": 3,
            "text": "The timing of the case means that a decision from the court, and a potential appeal to the Supreme Court after that, could bring Obamacare's future to the center of political debate ahead of the 2020 presidential election."
        },
        {
            "id": 4,
            "text": "Such an outcome would put President Trump on the spot to argue his vision for an alternative while congressional Democrats would accuse Republicans of being uncommitted to Obamacare's protections for the sick, as they did ahead of the 2018 midterm elections."
        },
        {
            "id": 5,
            "text": "The lawsuit, Texas v. United States, has the support of the Trump administration and was filed by Republican state officials who say that Obamacare must be thrown out as a result of the law's fine on the uninsured being zeroed out in the 2017 tax law ."
        },
        {
            "id": 6,
            "text": "They argue that the fine was central to making the rest of the law work and that without it the entire law should crumble."
        },
        {
            "id": 7,
            "text": "The case heads Tuesday to the Fifth Circuit Court of Appeals, considered one of the most conservative appeals courts in the country."
        },
        {
            "id": 8,
            "text": "Judges Carolyn Dineen King, Jennifer Walker Elrod, and Kurt Engelhardt will hear the oral arguments."
        },
        {
            "id": 9,
            "text": "They are appointees of President Jimmy Carter, President George W. Bush, and President Trump, respectively."
        },
        {
            "id": 10,
            "text": "Texas is being appealed after U.S. District Judge Reed O’Connor in the Northern District of Texas sided with GOP state officials in December and declared Obamacare unconstitutional."
        },
        {
            "id": 11,
            "text": "California and other Democrat-led states appealed the case to the Fifth Circuit, arguing that Congress never intended to undo other parts of Obamacare when it eliminated the individual mandate."
        },
        {
            "id": 12,
            "text": "The case could eventually land before the Supreme Court, which may only choose to take it up if the Fifth Circuit upholds O'Connor's ruling."
        },
        {
            "id": 13,
            "text": "The Supreme Court twice ruled to uphold Obamacare, in 2012 and 2015, but that was under a different judicial makeup."
        },
        {
            "id": 14,
            "text": "Since those rulings, conservative justices and Trump appointees Neil Gorsuch and Brett Kavanaugh have been confirmed by the GOP-controlled Senate."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": "DEM AGs LAUNCH AD BLITZ TO ATTACK GOP FOR OBAMACARE LAWSUIT: Democratic attorneys general have launched a multi-million-dollar ad campaign to condemn the GOP attorneys general who filed that suit in 2018 arguing that the Affordable Care Act should be deemed unconstitutional and invalidated."
        },
        {
            "id": 20,
            "text": "The Democratic campaign will include ads in Louisiana, Indiana, Utah, Missouri, and West Virginia newspapers, as well as digital ads."
        },
        {
            "id": 21,
            "text": "Farah Melendez, political director at the Democratic Attorneys General Association, said, “These health care hypocrites are attacking the critical care people in their states rely on to go to the doctor, afford prescription medication, and take care of sick kids and family members.”"
        },
        {
            "id": 22,
            "text": "GOP FRESHMAN CONGRESSMAN UNVEILS PLAN TO HELP ‘CHANGE THE NARRATIVE’ ON HEALTHCARE:"
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": "Rep. Chip Roy has introduced legislation that would expand health savings accounts, which are tax-free funds people can use to pay for healthcare."
        },
        {
            "id": 25,
            "text": "Under his proposal, the accounts would be renamed \"Health Freedom Accounts,\" with employers and charitable organizations allowed to contribute."
        },
        {
            "id": 26,
            "text": "\"I obviously hope it'll get the attention of my colleagues and the president, but I'm in this for the long game,\" the Texas Republican said."
        },
        {
            "id": 27,
            "text": "\"I want to work to shape the conversation."
        },
        {
            "id": 28,
            "text": "I want people to know it's OK to be unafraid of your beliefs.\""
        },
        {
            "id": 29,
            "text": "TRUMP TO SIGN EO TO SET DRUG PRICES BASED ON FOREIGN PRICES: The White House is writing an executive order that would reduce what the United States pays for drugs , making the cost closer to the lowest price paid elsewhere in the world."
        },
        {
            "id": 30,
            "text": "Trump told reporters Friday that the White House is drawing up a “favored nations clause,” which stipulates that companies cannot offer one nation certain terms without offering those terms to other nations."
        },
        {
            "id": 31,
            "text": "Trump has long decried what he calls a “global freeloading” system that allows drug companies to charge the United States more than they do other countries."
        },
        {
            "id": 32,
            "text": "BIDEN VOWS TO BRING BACK OBAMACARE INDIVIDUAL MANDATE: Presidential candidate Joe Biden vowed to bring back the Obama-era individual mandate, which, before being zeroed out in the 2017 tax law, forced Americans to pay a penalty if they were uninsured."
        },
        {
            "id": 33,
            "text": "In a Friday CNN interview, Biden said reinstating the unpopular penalty was part of his plan to ensure that all Americans have health coverage."
        },
        {
            "id": 34,
            "text": "KAMALA HARRIS PRAISES WOMAN’S ‘COURAGE TO SPEAK’ ABOUT HER ABORTION:"
        },
        {
            "id": 35,
            "text": "At a NARAL Pro-Choice America campaign stop in Iowa Wednesday, Sen. Kamala Harris thanked a woman for sharing her personal story about undergoing an abortion."
        },
        {
            "id": 36,
            "text": "The undecided voter named Katie said lawmakers have been trying to take a woman’s power to choose whether to have an abortion away, and the California Democrat said to her, “Let’s also do what we need to do around litigation against these bad laws, but let’s also from a proactive position think about how this is a fundamental issue of justice.\""
        },
        {
            "id": 37,
            "text": "CMS CHIEF OF STAFF AND FORMER CONSULTANT AT MULTI-BILLION-DOLLAR FIRM GETS NEW JOB AT HHS:"
        },
        {
            "id": 38,
            "text": "Paul Mango, chief of staff at the Centers for Medicare and Medicaid Services, will take the newly created position of Health and Human Services deputy chief of staff for policy."
        },
        {
            "id": 39,
            "text": "HHS Secretary Alex Azar said Friday, “Paul is a highly regarded healthcare and policy leader whom I have known for more than a decade, and I cannot imagine a better choice for this new role.”"
        },
        {
            "id": 40,
            "text": "Prior to taking a job at CMS, Mango worked as a healthcare consultant for the firm McKinsey and Co., where he said he guided insurers and health systems in navigating Obamacare regulations, a program he has called a “disaster.”"
        },
        {
            "id": 41,
            "text": "FEDERAL COURT REINSTATES FREEZE ON TRUMP’S TITLE X RULE:"
        },
        {
            "id": 42,
            "text": "The Ninth Circuit Court of Appeals decided Wednesday to reconsider last month’s decision to permit Trump’s"
        },
        {
            "id": 43,
            "text": "Title X funding rule to withhold federal money from family planning clinics that provide or directly refer patients for abortions."
        },
        {
            "id": 44,
            "text": "The court decided not only to hear the case about Title X funding again but to block the June decision made by three Republican judges to allow the rule to take effect."
        },
        {
            "id": 45,
            "text": "“Although we are heartened that the injunctions were reinstated, this is still the beginning of a long judicial process,” said Julie Rabinovitz, president and CEO of Essential Access Health."
        },
        {
            "id": 46,
            "text": "FEDERAL JUDGE TEMPORARILY BLOCKS OHIO ABORTION BAN:"
        },
        {
            "id": 47,
            "text": ""
        },
        {
            "id": 48,
            "text": "U.S. District Judge Michael Barrett, appointed by Bush in 2006, issued a preliminary injunction of a law banning abortion in Ohio once a fetal heartbeat is detected."
        },
        {
            "id": 49,
            "text": "Barrett said the law violates the 1992 Planned Parenthood v. Casey decision, which said women should not face “undue burden” when it comes to seeking abortions."
        },
        {
            "id": 50,
            "text": "RESEARCHERS REMOVED"
        },
        {
            "id": 51,
            "text": "AIDS VIRUS FROM MICE: University of Nebraska scientists eliminated HIV from a small sample of mice with functioning human genes, cells, and tissues, using long-lasting HIV drugs to suppress the virus developed at the UN Medical Center and gene-editing therapy meant to cut HIV DNA from genomes in the mice, a therapy developed by researchers at Temple University."
        },
        {
            "id": 52,
            "text": "Researchers hope to continue studying effects of combined therapies in animals and soon move to clinical trials in humans."
        },
        {
            "id": 53,
            "text": "The Rundown\n\nNPR With rural health care stretched thin, more patients turn to telehealth"
        },
        {
            "id": 54,
            "text": "Kaiser Health News Sobering up: In an alcohol-soaked nation, more seek booze-free social spaces"
        },
        {
            "id": 55,
            "text": "Tampa Bay Times At Tampa General Hospital, 3-D printers are removing guesswork for doctors and patients\n\nWashington Post Social workers and custodians help form the backbone of a campus."
        },
        {
            "id": 56,
            "text": "But Virginia schools have lost billions for those jobs\n\nTennessean Harrow Health CEO took on Martin Shkreli before moving company to Nashville\n\n"
        }
    ]
}