{
    "title": "Why retirement of Lois Lerner doesn't end IRS tea party scandal (+video)",
    "text": [
        {
            "id": 0,
            "text": "Lois Lerner, the Internal Revenue Service official under fire for her department’s targeting of tea party groups, has retired effective Monday, according to the IRS."
        },
        {
            "id": 1,
            "text": "But that development does not end the scandal that burst into the open last May, when Ms. Lerner revealed that tea party groups were undergoing extra scrutiny in their applications for tax exemption."
        },
        {
            "id": 2,
            "text": "Lerner, who was director of the IRS’s section on tax-exempt organizations, had been placed on paid administrative leave, and remains under subpoena by the House Oversight and Government Reform Committee, which is investigating the scandal."
        },
        {
            "id": 3,
            "text": "“Lois Lerner’s exit from the IRS does not alter the Oversight Committee’s interest in understanding why applicants for tax exempt status were targeted and inappropriately treated because of their political beliefs,” Rep. Darrell Issa (R) of California, chairman of the committee, said in a statement."
        },
        {
            "id": 4,
            "text": "Sen. Orrin Hatch of Utah, the top Republican on the Senate Finance Committee, also signaled his continued interest in the IRS targeting scandal."
        },
        {
            "id": 5,
            "text": "“Just because Lois Lerner is retiring from the IRS does not mean the investigation is over,” Senator Hatch said in a statement."
        },
        {
            "id": 6,
            "text": "“Far from it."
        },
        {
            "id": 7,
            "text": "In fact, there are many serious unanswered questions that must be addressed so we can get to the truth.”"
        },
        {
            "id": 8,
            "text": "The brouhaha has been a political boon to conservatives, who had long suspected they were being targeted by the government in an effort to undermine their activities."
        },
        {
            "id": 9,
            "text": "The issue is likely to figure in efforts to energize conservatives for the 2014 midterms."
        },
        {
            "id": 10,
            "text": "Republicans already control the House, but have a shot at taking over the Senate."
        },
        {
            "id": 11,
            "text": "Lerner emerged early as a key figure in the targeting scandal."
        },
        {
            "id": 12,
            "text": "In fact, it was she who brought the practice to light in public on May 10, when she responded to an audience question – later revealed to be planted – at a legal conference."
        },
        {
            "id": 13,
            "text": "She stated that the targeting was “absolutely incorrect,” “insensitive,” and “inappropriate,” and that “the IRS would like to apologize for that.”"
        },
        {
            "id": 14,
            "text": "At a congressional hearing on May 22, Lerner said she was proud of her government service, and had done nothing wrong."
        },
        {
            "id": 15,
            "text": "Then she refused to testify, citing her constitutional right against self-incrimination."
        },
        {
            "id": 16,
            "text": "Starting in 2010, the IRS began subjecting groups with names that contained conservative keywords, such as “tea party” and “patriot,” to additional scrutiny in their requests for tax exemption, which delayed their applications."
        },
        {
            "id": 17,
            "text": "It was later revealed that some progressive groups, such as those associated with the Occupy movement, had undergone similar targeting, but not nearly as many as the tea party groups."
        },
        {
            "id": 18,
            "text": "A report by the Treasury Department’s inspector general for tax administration (TIGTA) released on May 14 found that inappropriate criteria were used to identify tax-exempt applications for review, and that Lerner herself had been briefed on the targeting in June 2011."
        },
        {
            "id": 19,
            "text": "Bloomberg News reported Monday that an internal IRS board was going to propose starting the process of firing Lerner, though it had not concluded that she had acted with political bias or willful misconduct."
        },
        {
            "id": 20,
            "text": "The report also indicated her pension would not have been different had she been fired."
        },
        {
            "id": 21,
            "text": "In a statement Monday confirming Lerner’s retirement, the IRS sought to reassure the public that the agency had reformed its procedures."
        },
        {
            "id": 22,
            "text": "“The IRS is making important progress on fixing the underlying management and organizational deficiencies in the EO [exempt organizations] area identified by TIGTA,” the statement said."
        },
        {
            "id": 23,
            "text": "“Our goal is to restore the public’s faith and trust in the tax system.”"
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": "The statement continued: “We have sent nearly 400,000 pages of documents to Congress and facilitated dozens of employee interviews."
        },
        {
            "id": 28,
            "text": "We look forward to continuing to cooperate with Congress and other investigations.”"
        },
        {
            "id": 29,
            "text": "Public faith in the IRS is especially critical as the Affordable Care Act (ACA) is about to go into effect."
        },
        {
            "id": 30,
            "text": "It will be the IRS’s responsibility to determine whether individuals have health insurance, as mandated under the ACA."
        }
    ]
}