{
    "title": "Arizona Latinos Prefer Barack Obama, Richard Carmona ",
    "text": [
        {
            "id": 0,
            "text": "Mitt Romney has a problem with Latino voters nationwide, but things look particularly bleak for him in Arizona."
        },
        {
            "id": 1,
            "text": "A poll posted Wednesday by Latino Decisions found 80 percent of Latino voters in Arizona prefer President Barack Obama to Romney -- eight points higher than the percentage of Latinos nationwide who support the president in other surveys from the firm."
        },
        {
            "id": 2,
            "text": "There's bad news in the poll for down-ticket GOP candidates as well."
        },
        {
            "id": 3,
            "text": "Three-quarters of Latino voters said they prefer Democratic candidate Richard Carmona to Rep. Jeff Flake (R-Ariz.) in the senatorial race."
        },
        {
            "id": 4,
            "text": "And 67 percent of those polled said they will vote Democrat in congressional races."
        },
        {
            "id": 5,
            "text": "Latinos make up 30 percent of the population in Arizona, which is typically a red state."
        },
        {
            "id": 6,
            "text": "The state's recent history of harsh immigration legislation may be a partial culprit for the Latino community's Democratic preference in the polls."
        },
        {
            "id": 7,
            "text": "Nearly 70 percent of Latinos voters said immigration was either the top issue or among the most important to them."
        },
        {
            "id": 8,
            "text": "Large majorities said Romney and Flake's statements on immigration -- both oppose comprehensive immigration reform -- make them less enthusiastic about the Republican Party."
        },
        {
            "id": 9,
            "text": "There is significant support for Obama's immigration platform, particularly a recently implemented policy to stop deporting some undocumented young people."
        },
        {
            "id": 10,
            "text": "More than half of the Latino voters polled said they knew an undocumented immigrant between the ages of 5 and 31."
        },
        {
            "id": 11,
            "text": "Romney said last week he would honor deferred action given by the president, but end the policy -- which would leave a majority of those who have applied out in the cold."
        },
        {
            "id": 12,
            "text": "A separate tracking poll of Colorado Latino voters out Wednesday from Latino Decisions also found Obama leading Romney by big margins."
        },
        {
            "id": 13,
            "text": "The same proportion as in Arizona -- 55 percent -- said they knew an undocumented immigrant between the ages of 5 and 31, and a majority supported the president's policy."
        }
    ]
}