{
    "title": "Feinstein says Obama may be 'too cautious'",
    "text": [
        {
            "id": 0,
            "text": "Feinstein says there are reports that one of the Taliban said he would return to the battlefield."
        },
        {
            "id": 1,
            "text": "Feinstein says Obama may be ‘too cautious’"
        },
        {
            "id": 2,
            "text": "The chairwoman of the Senate Intelligence Committee says President Barack Obama might be taking too long to respond to the growing threat from Islamic militants in Iraq and Syria."
        },
        {
            "id": 3,
            "text": "“I’ve learned one thing about this president, and that is he’s very cautious."
        },
        {
            "id": 4,
            "text": "Maybe, in this instance, too cautious,” Sen. Dianne Feinstein (D-Calif.) said in an interview aired Sunday on NBC’s “Meet the Press.”"
        },
        {
            "id": 5,
            "text": "Feinstein said she agrees with an op-ed by Republican Sens. John McCain of Arizona and Lindsey Graham of South Carolina over the weekend in The New York Times calling for an immediate military plan to confront the Islamic State of Iraq and the Levant."
        },
        {
            "id": 6,
            "text": "ISIL’s goal, she said, is to take the Iraqi capital of Baghdad and attack the American Embassy there."
        },
        {
            "id": 7,
            "text": "Though Obama was widely criticized last week for saying the White House didn’t have a strategy for dealing with ISIL, Feinstein said the Pentagon and State Department have been planning for some time."
        },
        {
            "id": 8,
            "text": "And, she said, she hopes those plans will “coalesce” into a strategy that a coalition of allies can use to confront the militant group."
        },
        {
            "id": 9,
            "text": "Feinstein did praise Obama for including the new Iraqi government in the planning."
        },
        {
            "id": 10,
            "text": "“What I understand he is trying to do is give an opportunity for this new Iraqi government … to make a move that offers an alternative to the Sunni people in [the] country,” she said."
        }
    ]
}