{
    "title": "Trump suggests he will send U.S. troops to the Mexican border",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — President Trump suggested Tuesday he might try to put U.S. troops on the Mexican border until his anti-migration wall is built."
        },
        {
            "id": 1,
            "text": "Saying he has spoken with Defense Secretary Jim Mattis — \"we're going to be doing this militarily\" — Trump told reporters: \"Until we can have a wall and proper security, we're going to be guarding our border with the military ..."
        },
        {
            "id": 2,
            "text": "that's a big step.\""
        },
        {
            "id": 3,
            "text": "But Trump did not elaborate on the plan when asked at a press conference two hours later."
        },
        {
            "id": 4,
            "text": "\"The Mexican border is very unprotected by our laws,\" he said, suggesting that Congress would need to take up the issue."
        },
        {
            "id": 5,
            "text": "Congressional lawmakers have blocked funding for Trump's wall, saying it is unnecessary and likely to be ineffective."
        },
        {
            "id": 6,
            "text": "Sending troops to the border would not be unprecedented."
        },
        {
            "id": 7,
            "text": "President George W Bush sent 6,000 National Guard troops to the Mexican border under an agreement with the governors of California, Arizona, New Mexico and Texas in 2006."
        },
        {
            "id": 8,
            "text": "Those troops supported the U.S. Border Patrol but did not engage in law enforcement for legal reasons."
        },
        {
            "id": 9,
            "text": "Operation Jump Start, as it was known, lasted about two years."
        },
        {
            "id": 10,
            "text": "Then in 2010, President Barack Obama sent 1,200 National Guard troops to the border in an effort to win GOP support for an immigration bill."
        },
        {
            "id": 11,
            "text": "Republicans insisted that Obama \"secure the border\" before they would vote to overhaul the immigration system."
        },
        {
            "id": 12,
            "text": "Now Republicans control the White House and Congress, but with Democrats having enough numbers to filibuster in the Senate."
        },
        {
            "id": 13,
            "text": "Trump has become increasingly exasperated with bipartisan immigration talks, blaming Democrats for not making a deal."
        },
        {
            "id": 14,
            "text": "And he's stepped up his anti-immigration rhetoric, targeting asylum-seekers from Central America passing through Mexico en route to the United States."
        },
        {
            "id": 15,
            "text": "\"We cannot have people flowing into our country illegally, disappearing, and, by the way, never showing up to court,\" Trump said."
        },
        {
            "id": 16,
            "text": "It's a policy that the White House has repeatedly criticized, calling it \"catch-and-release.\""
        },
        {
            "id": 17,
            "text": "Trump took credit for stopping the caravan, saying pressure on Mexico helped to turn it back."
        },
        {
            "id": 18,
            "text": "He also alluded to his threat to kill off the North American Free Trade Agreement with Mexico and Canada, saying \"NAFTA's been a terrible deal for the United States.\""
        },
        {
            "id": 19,
            "text": "The caravan in and of itself \"doesn't irritate me,\" Trump said."
        },
        {
            "id": 20,
            "text": "\"The caravan makes me very sad that this could happen to the United States.\""
        },
        {
            "id": 21,
            "text": ""
        }
    ]
}