{
    "title": "Biden set to withdraw U.S. troops from Afghanistan by Sept. 11",
    "text": [
        {
            "id": 0,
            "text": "President Joe Biden plans to withdraw the remaining 2,500 U.S. troops from Afghanistan by Sept. 11, 2021, 20 years to the day after the al Qaeda attacks that triggered America’s longest war, U.S. officials said on Tuesday."
        },
        {
            "id": 1,
            "text": "The disclosure of the plan came on the same day that the U.S. intelligence community released a gloomy outlook for Afghanistan, forecasting \"low\" chances of a peace deal this year and warning that its government would struggle to hold the Taliban insurgency at bay if the U.S.-led coalition withdraws support."
        },
        {
            "id": 2,
            "text": "Biden's decision would miss a May 1 deadline for withdrawal agreed to with the Taliban by his predecessor Donald Trump."
        },
        {
            "id": 3,
            "text": "The insurgents had threatened to resume hostilities against foreign troops if that deadline was missed."
        },
        {
            "id": 4,
            "text": "But Biden would still be setting a near-term withdrawal date, potentially allaying Taliban concerns."
        },
        {
            "id": 5,
            "text": "The Democratic president will publicly announce his decision on Wednesday, the White House said."
        },
        {
            "id": 6,
            "text": "A senior Biden administration official said the pullout would begin before May 1 and could be complete well before the Sept. 11 deadline."
        },
        {
            "id": 7,
            "text": "Significantly, it will not would be subject to further conditions, including security or human rights.\""
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "The president has judged that a conditions-based approach, which has been the approach of the past two decades, is a recipe in staying in Afghanistan forever,\" the official, speaking on condition of anonymity, said in a briefing with reporters."
        },
        {
            "id": 10,
            "text": "U.S. Secretary of State Antony Blinken and U.S. Defense Secretary Lloyd Austin are expected to discuss the decision with NATO allies in Brussels on Wednesday, sources said."
        },
        {
            "id": 11,
            "text": "Biden's decision suggests he has concluded that the U.S. military presence will no longer be decisive in achieving a lasting peace in Afghanistan, a core Pentagon assumption that has long underpinned American troop deployments there."
        },
        {
            "id": 12,
            "text": "\"There is no military solution to the problems plaguing Afghanistan, and we will focus our efforts on supporting the ongoing peace process,\" the senior administration official said."
        },
        {
            "id": 13,
            "text": "The U.S. intelligence report, which was sent to Congress, stated: \"Kabul continues to face setbacks on the battlefield, and the Taliban is confident it can achieve military victory.\""
        },
        {
            "id": 14,
            "text": "It remains unclear how Biden’s move would impact a planned 10-day summit starting April 24 about Afghanistan in Istanbul that is due to include the United Nations and Qatar."
        },
        {
            "id": 15,
            "text": "The Taliban said they would not take part in any summits that would make decisions about Afghanistan until all foreign forces had left the country."
        },
        {
            "id": 16,
            "text": "1/3 Marine General Kenneth McKenzie, head of U.S. Central Command, speaks with U.S. troops while visiting Forward Operating Base Fenty in Jalalabad, Afghanistan, September 9, 2019."
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "The May 1 deadline had already started to appear less and less likely in recent weeks, given the lack of preparations on the ground to ensure it could be done safely and responsibly."
        },
        {
            "id": 19,
            "text": "U.S. officials have also blamed the Taliban for failing to live up to commitments to reduce violence and some have warned about persistent Taliban links to al Qaeda."
        },
        {
            "id": 20,
            "text": "It was those ties that triggered U.S. military intervention in 2001 following al Qaeda's Sept. 11 attacks, when hijackers slammed airplanes into the World Trade Center in New York City and the Pentagon outside Washington, killing almost 3,000 people."
        },
        {
            "id": 21,
            "text": "The Biden administration has said al Qaeda does not pose a threat to the U.S. homeland now."
        },
        {
            "id": 22,
            "text": "'ABANDON THE FIGHT'\n\nSenate Republican Leader Mitch McConnell accused Biden of planning to \"turn tail and abandon the fight in Afghanistan."
        },
        {
            "id": 23,
            "text": "\" It was Trump, a Republican, who had agreed to the May 1 withdrawal."
        },
        {
            "id": 24,
            "text": "\"Precipitously withdrawing U.S. forces from Afghanistan is a grave mistake,\" McConnell said, adding that effective counter-terrorism operations require presence and partners on the ground."
        },
        {
            "id": 25,
            "text": "There currently are about 2,500 U.S. troops in Afghanistan, down from a peak of more than 100,000 in 2011."
        },
        {
            "id": 26,
            "text": "About 2,400 U.S. service members have been killed in the course of the Afghan conflict and many thousands more wounded."
        },
        {
            "id": 27,
            "text": "Officials in Afghanistan are bracing for the withdrawal."
        },
        {
            "id": 28,
            "text": "\"We will have to survive the impact of it and it should not be considered as Taliban's victory or takeover,\" said a senior Afghan government source, speaking on condition of anonymity."
        },
        {
            "id": 29,
            "text": "Although successive U.S. presidents sought to extricate themselves from Afghanistan, those hopes were confounded by concerns about Afghan security forces, endemic corruption in Afghanistan and the resiliency of a Taliban insurgency that enjoyed safe haven across the border in Pakistan."
        },
        {
            "id": 30,
            "text": "Democratic U.S. Senator Bob Menendez, chairman of the Senate Foreign Relations Committee, said the United States could cut off financial assistance to Afghanistan \"if there is backsliding on civil society, the rights that women have achieved."
        },
        {
            "id": 31,
            "text": "\" Under previous Taliban rule, the rights of women and girls were curtailed."
        },
        {
            "id": 32,
            "text": "Democratic Senator Jack Reed, chairman of Senate Armed Services, called it a very difficult decision for Biden."
        },
        {
            "id": 33,
            "text": "\"There is no easy answer,\" Reed said."
        },
        {
            "id": 34,
            "text": ""
        }
    ]
}