{
    "title": "Trump complains about lack of funding for border wall in ‘ridiculous’ spending bill",
    "text": [
        {
            "id": 0,
            "text": "President Trump lashed out at congressional Republicans on Thursday, questioning their strategy of pushing off a messy fight over border wall funding until after the midterm elections in November."
        },
        {
            "id": 1,
            "text": "This is the second time in recent days Trump has suggested Republican leaders are being duped by Democrats when it comes to wall funding, openly questioning the GOP’s calculated strategy to avoid a shutdown."
        },
        {
            "id": 2,
            "text": "Trump has threatened to shut down the government at least seven times in the past six weeks"
        },
        {
            "id": 3,
            "text": "Earlier this week, the Senate passed a short-term spending bill that would keep the government running through Dec. 7."
        },
        {
            "id": 4,
            "text": "It aims to avert a government shutdown at the end of the month and includes far less funding than Trump sought for his long-promised wall on the U.S.-Mexico border."
        },
        {
            "id": 5,
            "text": "“I want to know, where is the money for Border Security and the WALL in this ridiculous Spending Bill, and where will it come from after the Midterms?”"
        },
        {
            "id": 6,
            "text": "Trump wrote on Twitter."
        },
        {
            "id": 7,
            "text": "“Dems are obstructing Law Enforcement and Border Security."
        },
        {
            "id": 8,
            "text": "REPUBLICANS MUST FINALLY GET TOUGH!”"
        },
        {
            "id": 9,
            "text": "The 93-to-7 vote in the Senate came less than two weeks before the Sept. 30 deadline when government funding expires unless Congress and Trump intervene."
        },
        {
            "id": 10,
            "text": "The House is expected to take up the bill next week, and Trump’s tweet injected further uncertainty into the process."
        },
        {
            "id": 11,
            "text": "It remains unclear whether he would sign the bill."
        },
        {
            "id": 12,
            "text": "Senate Democrats have agreed to $1.6 billion for Trump’s wall in 2019, far short of the $5 billion that Trump is seeking."
        },
        {
            "id": 13,
            "text": "Convinced they do not have the votes in the Senate to get Trump the money he wants,"
        },
        {
            "id": 14,
            "text": "GOP leaders elected to put off a fight over Trump’s signature campaign issue until after the midterms."
        },
        {
            "id": 15,
            "text": "But Trump’s tweet on Thursday raises the question many Republicans so far have been unwilling to answer: how can they assure him they will be able to secure wall funding after the midterm elections?"
        },
        {
            "id": 16,
            "text": "If Republicans lose control of the House of Representatives in the midterm elections, or even if they keep control but lose a number of seats, the new Congress will not be sworn in until early January."
        },
        {
            "id": 17,
            "text": "This will put enormous pressure on lawmakers from both parties during the lame duck session of Congress that runs between the midterm elections and early 2019, as they will be jostling for power."
        },
        {
            "id": 18,
            "text": "The president has toyed repeatedly with shutting down the government to try to get more funding for the border wall, at times saying there would not be a shutdown and other times saying he would welcome one."
        },
        {
            "id": 19,
            "text": "Congressional Republicans are convinced that a shutdown just ahead of the midterms would be disastrous."
        },
        {
            "id": 20,
            "text": "The construction of a wall along the Mexico border was one of Trump’s top campaign promises."
        },
        {
            "id": 21,
            "text": "Although he long vowed it would be paid for by the Mexican government, he has since demanded that Congress pay for the wall, saying the money would somehow be recouped later from Mexico."
        },
        {
            "id": 22,
            "text": "The Mexican government has repeatedly refused to pay for the wall."
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}