{
    "title": "Federal Judge Blocks Obama's Executive Actions On Immigration",
    "text": [
        {
            "id": 0,
            "text": "Federal Judge Blocks Obama's Executive Actions On Immigration"
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "Two days before the first of President Obama's executive actions on immigration were to take effect, the new rules have been put on hold by a federal judge's ruling in South Texas."
        },
        {
            "id": 3,
            "text": "U.S. District Judge Andrew Hanen said the president overstepped his authority."
        },
        {
            "id": 4,
            "text": "In more than 120 pages of court documents issued late Monday, Hanen halted both the new Deferred Action for Parents of Americans and Lawful Permanent Residents as well as the expansions Obama had planned to make to the Deferred Action for Childhood Arrivals program."
        },
        {
            "id": 5,
            "text": "If the executive actions providing legal status to millions of people were to take effect, Hanen wrote, \"The genie would be impossible to put back into the bottle.\""
        },
        {
            "id": 6,
            "text": "Speaking to reporters at the White House, President Obama said Justice Department will appeal this decision and he is confident that the executive action he took is \"well within my authority.\""
        },
        {
            "id": 7,
            "text": "\"I strongly disagree with Judge Hanen's decision,\" Homeland Security Secretary Jeh C. Johnson said."
        },
        {
            "id": 8,
            "text": "But he adds that because of the injunction, his agency \"will not begin accepting requests for the expansion of DACA tomorrow, February 18, as originally planned."
        },
        {
            "id": 9,
            "text": "Until further notice, we will also suspend the plan to accept requests for DAPA.\""
        },
        {
            "id": 10,
            "text": "Johnson also stated that the court's order \"does not affect the existing DACA,\" and that it will not change the enforcement priorities he outlined when President Obama set his plan in motion last November."
        },
        {
            "id": 11,
            "text": "Obama also called on Congress to act."
        },
        {
            "id": 12,
            "text": "He said he had taken this action, because he would not \"stand by and do nothing.\""
        },
        {
            "id": 13,
            "text": "He said while he disagreed with Hanen's opinion, \"I respect the ruling.\""
        },
        {
            "id": 14,
            "text": "Our original post continues:"
        },
        {
            "id": 15,
            "text": "The Justice Department will appeal the judge's temporary injunction, the White House says."
        },
        {
            "id": 16,
            "text": "\"The district court's decision wrongly prevents these lawful, commonsense policies from taking effect and the Department of Justice has indicated that it will appeal that decision,\" White House press secretary Josh Earnest said in a statement released Tuesday morning."
        },
        {
            "id": 17,
            "text": "The injunction gives 26 states more time to form legal arguments against the actions, which were expected to protect as many as 4 million people who are in the U.S. illegally from being deported."
        },
        {
            "id": 18,
            "text": "The plan also includes an option to apply for work permits."
        },
        {
            "id": 19,
            "text": "The states had argued that the changes would cause \"dramatic and irreparable injuries,\" as NPR's Richard Gonzales reports on Morning Edition."
        },
        {
            "id": 20,
            "text": "\"For example, the state of Texas estimates that it was spending $1.3 million sending police to deal with border security during that surge of unaccompanied minors that crossed the border this past summer.\""
        },
        {
            "id": 21,
            "text": "On the other side of the issue, Gonzales says, \"there are 12 states, the District of Columbia and 33 mayors across the country who are supporting the Obama administration."
        },
        {
            "id": 22,
            "text": "They say the executive action would benefit them, because workers who are here illegally would come out of the shadows and work and pay taxes.\""
        },
        {
            "id": 23,
            "text": "Obama announced his plan weeks after last November's midterm elections, saying that he was taking action because Congress hadn't sent him a bill addressing the problems in America's immigration system."
        },
        {
            "id": 24,
            "text": "Before the ruling came out late Monday, the U.S. Citizenship and Immigration Services agency had been preparing to begin accepting applications under the new rules Wednesday."
        },
        {
            "id": 25,
            "text": "As member-station KUT in Austin reports, the Texas lawsuit against the president's executive orders was initially filed in December by Gov. Greg Abbott, who was then the state's attorney general."
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": "\"[Abbott] accused the president of violating several provisions of the U.S. Constitution, including one that gives Congress jurisdiction over immigration laws."
        },
        {
            "id": 28,
            "text": "Abbott also argued that Texas would be irreparably harmed by the action."
        },
        {
            "id": 29,
            "text": "He cited as proof last summer's surge of undocumented immigrants from Central America who entered Texas illegally through the Rio Grande Valley.\""
        },
        {
            "id": 30,
            "text": "Welcoming the injunction, the current attorney general in Texas, Ken Paxton, called it \"a victory for the rule of law in America and a crucial first step in reining in President Obama's lawlessness.\""
        },
        {
            "id": 31,
            "text": "In his decision, Judge Hanen, an appointee of President George W. Bush who has been in his post since 2002, also noted that there has been a political and national debate over how to handle both legal and illegal immigration."
        },
        {
            "id": 32,
            "text": "He added, \"To date, however, neither the President nor any member of Congress has proposed legislation capable of resolving these issues in a manner that could garner the necessary support to be passed into law.\""
        }
    ]
}