{
    "title": "NRA's LaPierre slams Obama administration over gun proposals",
    "text": [
        {
            "id": 0,
            "text": "Proposed universal background checks of firearms purchases won’t stop gun violence, but would serve agendas of people “bent on destroying the Second Amendment,” a top National Rifle Association official told a conservative political conference on Friday."
        },
        {
            "id": 1,
            "text": "Wayne LaPierre, the executive vice president of the influential NRA, received repeated cheers and prolonged applause at the Conservative Political Action Conference when he took on proposals to toughen gun laws in the aftermath of the Connecticut school massacre that killed 20 first graders last December."
        },
        {
            "id": 2,
            "text": "According to LaPierre, an arrogant political and media elite wants to subvert the bedrock right to freedom that he said made America better than other countries."
        },
        {
            "id": 3,
            "text": "He repeatedly questioned the logic and even the sanity of President Barack Obama’s administration and other advocates of new gun laws, and he implored supporters to “stand up and fight” now and in future elections to protect their right to own guns."
        },
        {
            "id": 4,
            "text": "“No matter what the elitists who scorn you say, let them be damned,” LaPierre declared."
        },
        {
            "id": 5,
            "text": "In particular, LaPierre took aim at Vice President Joe Biden for saying recently that a 12-gauge shotgun would provide better protection for women under threat at home than a high-powered semi-automatic rifle targeted by a proposed ban."
        },
        {
            "id": 6,
            "text": "“The vice president of the United States actually told women facing an attack to just empty their shotguns into the air,” LaPierre said."
        },
        {
            "id": 7,
            "text": "“Honestly, have they lost their minds over at the White House?”"
        },
        {
            "id": 8,
            "text": "With the crowd cheering, he added: “Keep your advice, we’ll keep our guns.”"
        },
        {
            "id": 9,
            "text": "The Senate Judiciary Committee this week sent four proposals to the full Senate for consideration, including an updated ban on semi-automatic firearms modeled after military assault weapons."
        },
        {
            "id": 10,
            "text": "Other measures would expand federal gun laws against gun trafficking and straw purchases and broaden background checks to include private firearms sales."
        },
        {
            "id": 11,
            "text": "A fourth proposal that would establish a framework for the Department of Education to set safety guidelines aimed at protecting schools from gun violence was the only one to get significant bipartisan support from the committee."
        },
        {
            "id": 12,
            "text": "LaPierre insisted Friday that expanded background checks were a first step toward a liberal desire to create a national gun registry."
        },
        {
            "id": 13,
            "text": "“In the end, there are only two reasons for government to create that federal registry of gun owners – to tax them or to take them,” he said."
        },
        {
            "id": 14,
            "text": "Supporters of expanded checks deny the legislation would create such a registry."
        },
        {
            "id": 15,
            "text": "LaPierre repeated the NRA’s call for armed guards in every U.S. school and expressed bemused frustration with those who ridiculed his position."
        },
        {
            "id": 16,
            "text": "Noting a Department of Homeland Security video that advised people threatened by an armed attacker to fight back with any weapon handy, such as a pair of scissors, LaPierre responded with scorn."
        },
        {
            "id": 17,
            "text": "“Let’s get this straight,” he said to applause."
        },
        {
            "id": 18,
            "text": "“To protect our children at school, we recommend a trained professional with a gun and they recommend scissors?"
        },
        {
            "id": 19,
            "text": "And they say we’re crazy?"
        },
        {
            "id": 20,
            "text": "It’s sheer madness.”"
        }
    ]
}