{
    "title": "Trade Adviser Warned White House in January of Risks of a Pandemic",
    "text": [
        {
            "id": 0,
            "text": "A top White House adviser starkly warned Trump administration officials in late January that the coronavirus crisis could cost the United States trillions of dollars and put millions of Americans at risk of illness or death."
        },
        {
            "id": 1,
            "text": "The warning, written in a memo by Peter Navarro, President Trump’s trade adviser, is the highest-level alert known to have circulated inside the West Wing as the administration was taking its first substantive steps to confront a crisis that had already consumed China’s leaders and would go on to upend life in Europe and the United States."
        },
        {
            "id": 2,
            "text": "“The lack of immune protection or an existing cure or vaccine would leave Americans defenseless in the case of a full-blown coronavirus outbreak on U.S. soil,” Mr. Navarro’s memo said."
        },
        {
            "id": 3,
            "text": "“This lack of protection elevates the risk of the coronavirus evolving into a full-blown pandemic, imperiling the lives of millions of Americans.”"
        },
        {
            "id": 4,
            "text": "Dated Jan. 29, it came during a period when Mr. Trump was playing down the risks to the United States, and he would later go on to say that no one could have predicted such a devastating outcome."
        },
        {
            "id": 5,
            "text": "Mr. Navarro said in the memo that the administration faced a choice about how aggressive to be in containing an outbreak, saying the human and economic costs would be relatively low if it turned out to be a problem along the lines of a seasonal flu."
        },
        {
            "id": 6,
            "text": "But he went on to emphasize that the “risk of a worst-case pandemic scenario should not be overlooked” given the information coming from China."
        },
        {
            "id": 7,
            "text": "In one worst-case scenario cited in the memo, more than a half-million Americans could die."
        },
        {
            "id": 8,
            "text": "A second memo that Mr. Navarro wrote, dated Feb. 23, warned of an “increasing probability of a full-blown COVID-19 pandemic that could infect as many as 100 million Americans, with a loss of life of as many as 1-2 million souls.”"
        },
        {
            "id": 9,
            "text": "At that time, Mr. Trump was still downplaying the threat of the virus."
        },
        {
            "id": 10,
            "text": "The administration was considering asking Congress for more money to address the situation, and the second memo, which circulated around the West Wing and was obtained by The Times, urged an immediate supplemental spending appropriation from Congress of at least $3 billion."
        },
        {
            "id": 11,
            "text": "“This is NOT a time for penny-pinching or horse trading on the Hill,” Mr. Navarro wrote in the second memo, which was unsigned but which officials attributed to him."
        },
        {
            "id": 12,
            "text": "It was unclear whether Mr. Trump saw the second memo, whose contents were first reported by Axios."
        },
        {
            "id": 13,
            "text": "The second memo seemed aimed at members of the White House Task Force established by Mr. Trump to manage the crisis, and reflected deep divisions within the administration about how to proceed and persistent feuding between Mr. Navarro and many other top officials about his role and his views."
        },
        {
            "id": 14,
            "text": "“Any member of the Task Force who wants to be cautious about appropriating funds for a crisis that could inflict trillions of dollars in economic damage and take millions of lives has come to the wrong administration,” the memo said."
        },
        {
            "id": 15,
            "text": "Among other things, the memo called for an increase funding for the government to purchase personal protective equipment for health care workers, estimating they would need “at least a billion face masks” over a four-to-six-month period."
        },
        {
            "id": 16,
            "text": "The administration ended up asking for $2.5 billion."
        },
        {
            "id": 17,
            "text": "Congress then approved $8 billion."
        },
        {
            "id": 18,
            "text": "Mr. Navarro is now the administration’s point person for supply chain issues for medical and other equipment needed to deal with the virus."
        },
        {
            "id": 19,
            "text": "The January memo written by Mr. Navarro was dated the same day that Mr. Trump named the task force to deal with the threat, and as the administration was weighing whether to bar some travelers from China, an option being pushed by Mr. Navarro."
        },
        {
            "id": 20,
            "text": "Mr. Trump would approve the limits on travel from China the next day, though it would be weeks before he began taking more aggressive steps to head off spread of the virus."
        },
        {
            "id": 21,
            "text": "Questions about Mr. Trump’s handling of the crisis, especially in its early days when he suggested it was being used by Democrats to undercut his re-election prospects, are likely to define his presidency."
        },
        {
            "id": 22,
            "text": "Mr. Navarro’s memo is evidence that some in the upper ranks of the administration had at least considered the possibility of the outbreak turning into something far more serious than Mr. Trump was acknowledging publicly at the time."
        },
        {
            "id": 23,
            "text": "Neither Mr. Navarro nor spokespeople for the White House responded to requests for comment."
        },
        {
            "id": 24,
            "text": "The memo, which was reviewed by The New York Times, was sent from Mr. Navarro to the National Security Council and then distributed to several officials across the administration, people familiar with the events said."
        },
        {
            "id": 25,
            "text": "It reached a number of top officials as well as aides to Mick Mulvaney, then the acting chief of staff, they said, but it was unclear whether Mr. Trump saw it."
        },
        {
            "id": 26,
            "text": "Mr. Navarro is a well-established China hawk who has long been mistrustful of the country’s government and trade practices."
        },
        {
            "id": 27,
            "text": "Both Mr. Navarro and Matthew Pottinger, the chief deputy at the National Security Council, were among the few officials urging colleagues in January to take a harder line in relation to the growing threat of the coronavirus."
        },
        {
            "id": 28,
            "text": "But their warnings were seen by other officials as primarily reflecting their concerns about China’s behavior — and their concerns look more prescient in hindsight than they actually were, other officials argue."
        },
        {
            "id": 29,
            "text": "With the subject line “Impose Travel Ban on China?”"
        },
        {
            "id": 30,
            "text": "Mr. Navarro opened the memo by writing, “If the probability of a pandemic is greater than roughly 1%, a game-theoretic analysis of the coronavirus indicates the clear dominant strategy is an immediate travel ban on China.”"
        },
        {
            "id": 31,
            "text": "Mr. Navarro concluded at one point: “Regardless of whether the coronavirus proves to be a pandemic-level outbreak, there are certain costs associated with engaging in policies to contain and mitigate the spread of the disease."
        },
        {
            "id": 32,
            "text": "The most readily available option to contain the spread of the outbreak is to issue a travel ban to and from the source of the outbreak, namely, mainland China.”"
        },
        {
            "id": 33,
            "text": "He suggested that under an “aggressive” containment scenario, a travel ban may need to last as long as 12 months for proper containment, a duration of time that at that point some White House aides saw as unsustainable."
        },
        {
            "id": 34,
            "text": "The travel limits subsequently imposed by Mr. Trump did not entirely ban travel from China, and many travelers from the country continued to stream into the United States."
        },
        {
            "id": 35,
            "text": "Mr. Navarro was at odds with medical experts like Dr. Anthony S. Fauci, who had argued that such travel bans only delay the eventual spread."
        },
        {
            "id": 36,
            "text": "Mr. Navarro alluded to that debate on Saturday during a separate argument with Dr. Fauci in the Situation Room about whether the anti-malaria drug hydroxychloroquine was effective in treating or preventing the virus, according to two people familiar with the events."
        },
        {
            "id": 37,
            "text": "In the memo, Mr. Navarro cautioned that it was “unlikely the introduction of the coronavirus into the U.S. population in significant numbers will mimic a ‘seasonal flu’ event with relatively low contagion and mortality rates.”"
        },
        {
            "id": 38,
            "text": "He noted the history of pandemic flus and suggested the chances were elevated for one after the new pathogen had developed in China."
        },
        {
            "id": 39,
            "text": "“This historical precedent alone should be sufficient to prove the need to take aggressive action to contain the outbreak,” he wrote, going on to say the early estimates of how easily the virus was spreading supported the possibility that the risks were even greater than the history of flu pandemics suggested."
        },
        {
            "id": 40,
            "text": ""
        }
    ]
}