{
    "title": "Obama On Debt Ceiling: 'We Are Not A Deadbeat Nation'",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- President Barack Obama issued a strong warning to Republicans on Monday that he will not negotiate over the debt ceiling or allow Republicans to use it as a bargaining chip."
        },
        {
            "id": 1,
            "text": "\"To even entertain the idea of the United States of America not paying our bills is irresponsible."
        },
        {
            "id": 2,
            "text": "It's absurd,\" Obama said in a press conference."
        },
        {
            "id": 3,
            "text": "The president also responded directly to Republicans who continue to argue that increasing the nation's borrowing limit only contributes to Washington's spending problem."
        },
        {
            "id": 4,
            "text": "He repeatedly emphasized that raising the debt ceiling does not authorize any new spending but simply allows the government to continue to pay for obligations to which Congress has already agreed."
        },
        {
            "id": 5,
            "text": "House Speaker John Boehner (R-Ohio) on Saturday said a failure to raise the debt ceiling would result in \"financial disaster,\" but reiterated demands that the president agree to spending cuts before a vote."
        },
        {
            "id": 6,
            "text": "On Monday, Obama maintained that increasing the debt limit would not represent a concession by Republicans to Democrats, and said he simply would not give in to any demands in exchange for an extension."
        },
        {
            "id": 7,
            "text": "\"They will not collect a ransom in exchange for not crashing the economy,\" Obama said."
        },
        {
            "id": 8,
            "text": "\"The full faith and credit of the United States economy is not a bargaining chip."
        },
        {
            "id": 9,
            "text": "And they better choose quickly because time is running short."
        },
        {
            "id": 10,
            "text": "The last time Republicans in Congress even flirted with this idea, our AAA credit rating was down for the first time in our history.\""
        },
        {
            "id": 11,
            "text": "The president highlighted some of the consequences of not raising the debt ceiling: a delay in Social Security checks and veterans' benefits and the inability to pay U.S. troops or honor contracts for small business owners, air traffic controllers and food inspectors."
        },
        {
            "id": 12,
            "text": "If the country failed to meet these obligations, Obama argued, investors around the world would question the credibility of the United States."
        },
        {
            "id": 13,
            "text": "\"We are not a deadbeat nation,\" Obama said."
        },
        {
            "id": 14,
            "text": "\"So there's a very simple solution to this: Congress authorizes us to pay our bills.\""
        },
        {
            "id": 15,
            "text": "Republican leaders responded immediately to the president's press conference, signaling they will not relent on demands for spending cuts as part of debt ceiling talks."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "\"The President and his allies need to get serious about spending, and the debt-limit debate is the perfect time for it,\" said Senate Minority Leader Mitch McConnell (R-Ky.) in a statement."
        },
        {
            "id": 18,
            "text": "\"I do know that the most important issue confronting the future of our country is our deficit and debt."
        },
        {
            "id": 19,
            "text": "So we are hoping for a new seriousness on the part of the President with regard to the single biggest issue confronting the country and we look forward to working with him to do something about this huge, huge problem.\""
        },
        {
            "id": 20,
            "text": "Boehner issued a similar statement, calling on Obama to reduce government spending."
        },
        {
            "id": 21,
            "text": "\"The House will do its job and pass responsible legislation that controls spending, meets our nation’s obligations and keeps the government running, and we will insist that the Democratic majority in Washington do the same,\" Boehner said."
        },
        {
            "id": 22,
            "text": "Last week, Senate Democratic leaders urged Obama to bypass Congress on raising the debt ceiling in the event of political gridlock."
        },
        {
            "id": 23,
            "text": "But the White House has been reluctant to consider a unilateral action, maintaining that the 14th Amendment -- one such proposed option -- does not give the president the authority to ignore the debt ceiling."
        }
    ]
}