{
    "title": "Mitch McConnell says he’s open to stimulus during lame duck — but there are a lot of wild cards",
    "text": [
        {
            "id": 0,
            "text": "Senate Majority Leader Mitch McConnell, after previously suggesting stimulus could wait until 2021, is now saying he’d back a package this year."
        },
        {
            "id": 1,
            "text": "“As I’ve said repeatedly in the last few months, we need another rescue package,” McConnell said Wednesday."
        },
        {
            "id": 2,
            "text": "“Hopefully the partisan passions that prevented us from doing another rescue package will subside with the election."
        },
        {
            "id": 3,
            "text": "… I think we need to do it before the end of the year.”"
        },
        {
            "id": 4,
            "text": "Does that mean stimulus is actually coming in 2020 for the 21.5 million Americans still receiving unemployment insurance, the cities and states facing massive budget shortfalls, and the businesses around the country struggling to stay open?"
        },
        {
            "id": 5,
            "text": "Hard to say."
        },
        {
            "id": 6,
            "text": "Given how his position has shifted since even last week, it’s possible that McConnell’s stance could well change again."
        },
        {
            "id": 7,
            "text": "And then there are the two other parties that could throw a wrench into things: Democrats, for one, as well as President Donald Trump, who may only have a couple of months left in the White House."
        },
        {
            "id": 8,
            "text": "McConnell’s statements came as Democrats’ hopes of a blue wave in the Senate fade, potentially changing the dynamics of negotiating."
        },
        {
            "id": 9,
            "text": "Republicans have so far managed to stave off defeat in battleground states like Maine and Iowa, while a tight race in North Carolina has yet to be called."
        },
        {
            "id": 10,
            "text": "There’s still a narrow possibility Democrats could retake the Senate by winning two seats in Georgia, but both of those races are long shots, and at least one (if not both) won’t be decided until a January runoff."
        },
        {
            "id": 11,
            "text": "House Democrats, too, have seen losses that could reduce their majority next year."
        },
        {
            "id": 12,
            "text": "As Bloomberg reported, these down-ballot election results could mean Democrats have less leverage on stimulus negotiations than they may have anticipated, since House Speaker Nancy Pelosi will have a narrower majority to work with and Republicans will maintain their bargaining power if they keep control of the Senate."
        },
        {
            "id": 13,
            "text": "(If Democrats retake the Senate, however, they could work with the House to try and pass more comprehensive aid in 2021.)"
        },
        {
            "id": 14,
            "text": "The implications of McConnell’s new position are also unclear."
        },
        {
            "id": 15,
            "text": "While Senate Republicans could bring fresh momentum to the long-stalled talks between Pelosi and the White House, they could also exacerbate the impasse: Thus far, Republicans have prioritized liability protections for businesses while staunchly opposing several provisions Democrats have pushed for, including higher levels of expanded unemployment insurance and state and local aid."
        },
        {
            "id": 16,
            "text": "After months of inaction, there’s no guarantee they’ll be able to bridge these differences — and get Trump’s sign-off — during the lame-duck session."
        },
        {
            "id": 17,
            "text": "McConnell’s reasons for supporting a lame-duck deal aren’t clear either, though it could be a factor of wanting to work with Trump, rather than a potential President Joe Biden."
        },
        {
            "id": 18,
            "text": "“At least some would like to get it done sooner rather than later on their own terms,” theorized Jim Manley, a former staffer for Senate Majority Leader Harry Reid."
        },
        {
            "id": 19,
            "text": "“You can get it done now, or you get it done under a Democratic administration.”"
        },
        {
            "id": 20,
            "text": "A Senate Republican aide told Vox it’s “always the case that you want to deal with the president of your own party.”"
        },
        {
            "id": 21,
            "text": "Some GOP members may also favor holding off so that Biden would be on the hook for adding to the national debt, said Brian Riedl, a senior fellow at the Manhattan Institute who previously served as chief economist for Sen. Rob Portman (R-OH)."
        },
        {
            "id": 22,
            "text": "One area on which the two parties could align is timing: Pelosi has noted her interest in advancing stimulus during the lame-duck session in order to clear the slate for a possible Biden administration."
        },
        {
            "id": 23,
            "text": "Whether she’s more willing to consider Republicans’ offers now that the election is over, though, is no sure thing."
        },
        {
            "id": 24,
            "text": "“We’re not going to go anything like Mitch McConnell has,” Pelosi previously said."
        },
        {
            "id": 25,
            "text": "All of this adds up to a lot of uncertainty about whether anything will actually get done during lame duck."
        },
        {
            "id": 26,
            "text": "Senate Republicans have long pushed for a narrower stimulus package"
        },
        {
            "id": 27,
            "text": "Currently, there are significant differences in the type of stimulus package Senate Republicans would push versus the one House Democrats want."
        },
        {
            "id": 28,
            "text": "Any package that Senate Republicans try to advance during the lame-duck session would likely contain far less spending than what Democrats have proposed."
        },
        {
            "id": 29,
            "text": "A possible bill will probably fall somewhere between the $500 billion measure the Senate voted on in October and the $2.2 trillion offer Pelosi has put forth."
        },
        {
            "id": 30,
            "text": "“At some point after the election, I do believe, there will be a more relaxed effort to try to find a number between the two [on stimulus] that will no doubt leave 10 or 20 Republicans off of it,” Sen. Kevin Cramer (R-ND) told Vox in late October."
        },
        {
            "id": 31,
            "text": "McConnell previously refused to consider two options the House has passed, only scheduling votes on a set of much “skinnier” measures that would include less aid for state and local governments."
        },
        {
            "id": 32,
            "text": "He even urged the White House in October to avoid reaching a compromise with House Democrats ahead of the November contests, the New York Times reported."
        },
        {
            "id": 33,
            "text": "Many members of the Republican conference have said they aren’t interested in backing a bill that includes expansive spending because it could add to the national debt."
        },
        {
            "id": 34,
            "text": "“The focus should not be simply shoving government spending out the door and racking up debt, but rather cutting taxes and cutting regulations on small businesses and job creators so that more Americans can get back to work,” Sen. Ted Cruz (R-TX) told Vox in late October."
        },
        {
            "id": 35,
            "text": "As a result, any measure Senate Republicans prioritize is expected to be limited in scope."
        },
        {
            "id": 36,
            "text": "A $500 billion skinny stimulus the GOP proposed (which failed in the Senate) did not include another round of stimulus checks, for example."
        },
        {
            "id": 37,
            "text": "This past summer, GOP leadership had also offered a more robust $1 trillion option called the HEALS Act, though its price tag prompted backlash from some Republicans."
        },
        {
            "id": 38,
            "text": "Republicans’ successes in the 2020 election demonstrated that a commitment to a smaller bill didn’t necessarily hurt them in the polls, said Riedl."
        },
        {
            "id": 39,
            "text": "“Assuming that the Republicans hold the Senate, the idea of a $2 or $3 trillion dollar stimulus is absolutely dead, particularly because their position was vindicated by the election,” he added."
        },
        {
            "id": 40,
            "text": "McConnell, in his comments this week, provided a glimpse of what he’d be willing to accept in a lame-duck compromise, opening the door to some state and local aid."
        },
        {
            "id": 41,
            "text": "“I’d like to see it done a little more skillfully than simply providing borrowed money for everyone regardless of their need,” he said."
        },
        {
            "id": 42,
            "text": "Whether his openness to stimulus actually translates to movement on these talks, however, depends heavily on the exact provisions Senate Republicans will be willing to support — and whether those match up with Democrats’ demands."
        },
        {
            "id": 43,
            "text": "So far, what the two parties want in another stimulus bill has been quite far apart."
        },
        {
            "id": 44,
            "text": "While Pelosi may face pressure after some unexpected electoral losses, it’s unclear how much she’d be willing to concede even with the election behind her."
        },
        {
            "id": 45,
            "text": "Trump, too, is another unknown:"
        },
        {
            "id": 46,
            "text": "Prior to the election, he said he’d support another stimulus bill, though the president’s economic adviser Stephen Moore recently cast doubt on that possibility."
        },
        {
            "id": 47,
            "text": "“Trump does not want the last thing he does in office [to be] a $2 trillion debt spending bill."
        },
        {
            "id": 48,
            "text": "We want Biden to own that, not Trump,” Moore said Thursday, according to the Washington Post’s Jeff Stein."
        }
    ]
}