{
    "title": "Donald Trump dominates in Nevada",
    "text": [
        {
            "id": 0,
            "text": "Businessman Donald Trump easily won the Nevada GOP caucuses Tuesday, rolling to his third straight victory in the 2016 nomination race and giving him extra momentum heading into the delegate-rich Super Tuesday contests next week."
        },
        {
            "id": 1,
            "text": "CNN called the race for Mr. Trump minutes after the first results became available though the battle for second between Sens. Marco Rubio of Florida and Ted Cruz of Texas went on into the morning."
        },
        {
            "id": 2,
            "text": "Still, Mr. Trump was outpolling his two nearest rivals combined in early returns, raising doubts about the effectiveness of any “Stop Trump” movement."
        },
        {
            "id": 3,
            "text": "With 100 percent of the vote counted, Mr. Trump had 45.9 percent of the vote, with Mr. Rubio at 23.8 percent and Mr. Cruz at 21.3 percent."
        },
        {
            "id": 4,
            "text": "Retired neurosurgeon Ben Carson was at 4.8 percent and Ohio Gov. John Kasich trailing at 3.6 percent."
        },
        {
            "id": 5,
            "text": "“We love Nevada,” Mr. Trump said as he came out for his victory speech."
        },
        {
            "id": 6,
            "text": "“We will be celebrating for a long time tonight — have a good time,” Mr. Trump said, whipping his supporters into a fervor."
        },
        {
            "id": 7,
            "text": "“A couple of months ago, we weren’t expected to win this one, you know that right?"
        },
        {
            "id": 8,
            "text": "We weren’t,” he said."
        },
        {
            "id": 9,
            "text": "“Of course, if you listen to the pundits, we weren’t expected to win too much, and now we are winning, winning winning … and soon the country is going to start winning, winning, winning.”"
        },
        {
            "id": 10,
            "text": "Mr. Trump appeared to capitalize on voter frustration with Washington, with entrance polls showing that about six in 10 caucus voters wanted a candidate from outside the political establishment and were “angry” with the federal government."
        },
        {
            "id": 11,
            "text": "Mr. Trump won 70 percent of those who wanted an outsider and 49 percent who said they were angry."
        },
        {
            "id": 12,
            "text": "He even won 44 percent of the Hispanic vote in Tuesday’s contest."
        },
        {
            "id": 13,
            "text": "Thirty delegates to the Republican National Convention were at stake."
        },
        {
            "id": 14,
            "text": "The victory followed wins in New Hampshire and South Carolina, which together helped erased a lot of the doubts about Mr. Trump’s candidacy that arose from his distant second place showing to Mr. Cruz in the Iowa caucuses."
        },
        {
            "id": 15,
            "text": "Turnout was at a record pace, which overwhelmed some caucus sites and creating some disputes early in the evening."
        },
        {
            "id": 16,
            "text": "CNN said the number of early registrants alone exceeded the entire turnout for the 2012 caucuses, indicating Mr. Trump drove first-time voters to the caucuses."
        },
        {
            "id": 17,
            "text": "The results could intensify the battle between Mr. Rubio and Mr. Cruz, each of whom could benefit from pushing the other one out of the race."
        },
        {
            "id": 18,
            "text": "Mr. Rubio had already moved on to Minnesota, where he has landed endorsements from the state’s former Gov. Tim Pawlenty and former Sen. Norm Coleman, as well as Rep. Jeff Kline."
        },
        {
            "id": 19,
            "text": "Speaking in Minneapolis, Mr. Rubio once again touted his ability to unify the party."
        },
        {
            "id": 20,
            "text": "“This cannot be an election about nominating someone just to making a point,” he said."
        },
        {
            "id": 21,
            "text": "“This cannot be an election about nominating someone because they seem angrier than everybody else."
        },
        {
            "id": 22,
            "text": "We are all angry."
        },
        {
            "id": 23,
            "text": "We are frustrated, but you have to solve a problem.”"
        },
        {
            "id": 24,
            "text": "But the sniping among the non-Trump candidates showed no sign of abating early Wednesday morning."
        },
        {
            "id": 25,
            "text": "Even before the final tally was known, the Cruz and Kasich campaigns were taking aim at Mr. Rubio."
        },
        {
            "id": 26,
            "text": "“Marco Rubio started working early and put a significant amount of resources into making Nevada the one early state he could win, the Cruz camp said in a statement."
        },
        {
            "id": 27,
            "text": "“But despite the hype, Rubio still failed to beat Donald Trump.”"
        },
        {
            "id": 28,
            "text": "Kasich spokesman Jon Weaver said, “Republicans are now left to wonder whether investing in Marco Rubio is throwing good money after bad,” explaining that his boss is a better long-term investment."
        },
        {
            "id": 29,
            "text": "“We continue to increase our financial and political support as more and more Republican leaders recognize the wisdom of our strategy and believe that Governor Kasich has the right combination of experience, authenticity and general election appeal to become President,” he said."
        },
        {
            "id": 30,
            "text": "For his part, Mr. Cruz has endured his roughest stretch in the race, following a disappointing third-place showing in South Carolina and his decision to ask for the resignation of campaign spokesman for circulating an inaccurate video that appeared to show Mr. Rubio dismissing the Bible."
        },
        {
            "id": 31,
            "text": "The episode has provided more ammunition for Mr. Cruz’s rivals who have had a field day accusing him of relying on “dirty tricks” — an attack that started to resonate in the wake of the Iowa caucuses, where members of his team told voters that Mr. Carson was ending his bid before the Iowa caucuses, citing his scheduled return to his home in Florida."
        },
        {
            "id": 32,
            "text": "On Tuesday night, Mr. Cruz told supporters that the first four nominating contests have shown the “undeniable reality” that the “only campaign that has beaten Donald Trump and the only campaign that can beat Donald Trump is this campaign.”"
        },
        {
            "id": 33,
            "text": "“If you are one of the 65 percent of Republicans across the country who doesn’t think Donald is the best candidate to go head-to-head with Hillary [Clinton], who believes we do better in elections when we actually nominate a conservative — then the first four states have performed a vital function of narrowing this race and presenting a clear choice,” Mr. Cruz said."
        },
        {
            "id": 34,
            "text": "“You can chose between two Washington deal-makers or one proven consistent conservative,” he said, distinguishing himself from Mr. Trump and Mr. Rubio."
        },
        {
            "id": 35,
            "text": "Looking forward, Mr. Cruz said the Super Tuesday contests will be the “most important night of the campaign.”"
        },
        {
            "id": 36,
            "text": "It underscored how much he has riding on the March 1 contests, which include his home state of Texas and a slew of other Southern state — including Alabama, Georgia, Oklahoma and Tennessee — that have large evangelical populations that Mr. Cruz has targeted."
        },
        {
            "id": 37,
            "text": "Polls, though, show Mr. Trump also is running strong in several of those contests, as well as in Alaska, Massachusetts, Minnesota, Vermont and Virginia, which also host March 1 contests."
        },
        {
            "id": 38,
            "text": "Before that, the candidates are scheduled to meet Thursday for a debate at the University of Houston hosted by CNN and Telemundo."
        },
        {
            "id": 39,
            "text": ""
        },
        {
            "id": 40,
            "text": ""
        },
        {
            "id": 41,
            "text": ""
        },
        {
            "id": 42,
            "text": ""
        }
    ]
}