{
    "title": "Obama takes fire for Crusades comparison",
    "text": [
        {
            "id": 0,
            "text": "Would be 2016 presidential hopefuls including Rick Santorum and Bobby Jindal seized on President Barack Obama’s comparison of Islamic extremism to the Christian Crusades and other violent excesses during Thursday’s National Prayer Breakfast, decrying the comments as “inappropriate” and “insulting to every person of faith.”"
        },
        {
            "id": 1,
            "text": "Jindal, the Republican governor of Louisiana, referred to Obama’s comments as a “history lesson” that ignores “the issue right in front of his nose.”"
        },
        {
            "id": 2,
            "text": "“We will be happy to keep an eye out for runaway Christians, but it would be nice if he would face the reality of the situation today,” Jindal said in a statement out Friday."
        },
        {
            "id": 3,
            "text": "“The Medieval Christian threat is under control, Mr. President."
        },
        {
            "id": 4,
            "text": "Please deal with the Radical Islamic threat today.”"
        },
        {
            "id": 5,
            "text": "Santorum, who ran for president in 2012 as well, rebuked Obama for ignoring the threat of ISIS and criticizing people of faith."
        },
        {
            "id": 6,
            "text": "“Today’s remarks by the President were inappropriate and his choice of venue was insulting to every person of faith at a time when Christians are being crucified, beheaded, and persecuted across the Middle East,” the former Pennsylvania senator said in a statement."
        },
        {
            "id": 7,
            "text": "The comments, which were intended to illustrate the potential for religion to be used for both good and bad aims, drew fierce criticism from conservatives on Thursday."
        },
        {
            "id": 8,
            "text": "And with Santorum’s decision to weigh in, could rapidly become fodder for attacks from potential 2016 contenders looking to burnish their credentials with the religious right."
        },
        {
            "id": 9,
            "text": "Santorum went on to slam Obama for misunderstanding the threat posed by the rise of Islamic extremism, and accused him of tying modern Christians to “the scourge in the Middle East.”"
        },
        {
            "id": 10,
            "text": "“While Christians of today are taught to live their lives as the reflection of Christ’s love, the radicals of ISIS use their holy texts as a rationale for violence,” he said."
        },
        {
            "id": 11,
            "text": "“To insinuate modern Christians — the same Christian faith that led the abolitionist movement, the Civil Rights Movement, and global charitable efforts fighting disease and poverty — cannot stand up against the scourge we see in the Middle East is wrong.”"
        },
        {
            "id": 12,
            "text": "Santorum also suggested that some Muslims have only been opposed to ISIS’ burning a Jordanian pilot alive because they are opposed to the “tactic,” not the actual murder itself."
        },
        {
            "id": 13,
            "text": "“Some Muslims…[have] sat quietly by as the Islamic State uses brutal violence that is not antithetical to Islam and only objects on tactics,” he said."
        },
        {
            "id": 14,
            "text": "During the National Prayer Breakfast, Obama didn’t downplay the threat posed by ISIS, but instead made the case that “humanity has been grappling with” the tension between the good and bad deeds done in the name of religion for ages."
        },
        {
            "id": 15,
            "text": "“And lest we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ,” he said."
        },
        {
            "id": 16,
            "text": "“In our home country, slavery and Jim Crow all too often was justified in the name of Christ."
        },
        {
            "id": 17,
            "text": "Michelle and I returned from India — an incredible, beautiful country, full of magnificent diversity — but a place where, in past years, religious faiths of all types have, on occasion, been targeted by other peoples of faith, simply due to their heritage and their beliefs — acts of intolerance that would have shocked Gandhiji, the person who helped to liberate that nation.”"
        },
        {
            "id": 18,
            "text": "But conservatives decried his comments as both further evidence of his poor grasp of the threats facing the nation, and insulting to Christians."
        },
        {
            "id": 19,
            "text": "Talk-radio host Rush Limbaugh said he insulted “the whole gamut of Christians,” and Jim Gilmore, the former GOP governor of Virginia, called the comments “the most offensive I’ve ever heard a president make in my lifetime,” according to the New York Times."
        },
        {
            "id": 20,
            "text": "And Catholic League President Bill Donohue — a frequent critic of Obama — called the comments “insulting” and “pernicious” in a statement, and said Obama was trying to “deflect guilt from Muslim madmen.”"
        }
    ]
}