{
    "title": "Georgia's Republican-led legislature passes sweeping voting restrictions",
    "text": [
        {
            "id": 0,
            "text": "Georgia lawmakers on Thursday gave final approval to legislation to impose sweeping new restrictions on voting access in the state that make it harder to vote by mail and give the state legislature more power over elections."
        },
        {
            "id": 1,
            "text": "The measure was signed into law by Governor Brian Kemp, a Republican, on Thursday evening."
        },
        {
            "id": 2,
            "text": "“Significant reforms to our state elections were needed."
        },
        {
            "id": 3,
            "text": "There’s no doubt there were many alarming issues with how the election was handled, and those problems, understandably, led to a crisis of confidence,” Kemp said during prepared remarks shortly after signing the bill."
        },
        {
            "id": 4,
            "text": "Pictures showed him signing the bill watched by six white men, despite criticism that the legislation adds up to voter suppression targeting Black communities whose ballots helped Democrats win the state and its two US Senate seats in the 2020 election."
        },
        {
            "id": 5,
            "text": "I was proud to sign S.B. 202 to ensure elections in Georgia are secure, fair, and accessible."
        },
        {
            "id": 6,
            "text": "I appreciate the hard work of members of the General Assembly to make it easy to vote and hard to cheat."
        },
        {
            "id": 7,
            "text": "— Governor Brian P. Kemp (@GovKemp) March 25, 2021"
        },
        {
            "id": 8,
            "text": "It requires voters to submit ID information with both an absentee ballot request and the ballot itself."
        },
        {
            "id": 9,
            "text": "It limits the use of absentee ballot drop boxes, allows for unlimited challenges to a voter’s qualifications, cuts the runoff election period from nine to four weeks, and significantly shortens the amount of time voters have to request an absentee ballot."
        },
        {
            "id": 10,
            "text": "The legislation also empowers the state legislature, currently dominated by Republicans, to appoint a majority of members on the five-person state election board."
        },
        {
            "id": 11,
            "text": "That provision would strip Georgia’s secretary of state, Brad Raffensperger, a Republican who stood up to Trump after the election, from his current role as chairman of the board."
        },
        {
            "id": 12,
            "text": "The bill creates a mechanism for the board to strip local election boards of their power."
        },
        {
            "id": 13,
            "text": "Gloria Butler, a Democratic state senator, said the bill would make it harder to vote, especially for poor and disabled people."
        },
        {
            "id": 14,
            "text": "“We are witnessing a massive and unabashed assault on voting rights unlike anything we’ve seen since the Jim Crow era,” she said just before the bill passed."
        },
        {
            "id": 15,
            "text": "“This bill is absolutely about opportunities, but it isn’t about opportunities to vote."
        },
        {
            "id": 16,
            "text": "It is about the opportunity to keep control and keep power at any cost,” Jen Jordan, a Democratic state senator, said on Thursday."
        },
        {
            "id": 17,
            "text": "Park Cannon, a Democratic state representative, was arrested on Thursday after knocking on the door of the governor’s office during protests against the legislation’s signing."
        },
        {
            "id": 18,
            "text": "Video captured by a bystander shows Cannon, who is Black, handcuffed with her arms behind her back and being forcibly removed from the state Capitol by two officers, one on each arm."
        },
        {
            "id": 19,
            "text": "She says, “Where are you taking me?”"
        },
        {
            "id": 20,
            "text": "and, “Stop” as she is taken from the building."
        },
        {
            "id": 21,
            "text": "“Why are you arresting her?”"
        },
        {
            "id": 22,
            "text": "This Facebook Live video from @TWareStevens shows the moment authorities detained state Rep. Park Cannon as @GovKemp was behind those doors signing elections restrictions into law."
        },
        {
            "id": 23,
            "text": "#gapol pic.twitter.com/U1xMJ6tZrY — Greg Bluestein (@bluestein) March 25, 2021"
        },
        {
            "id": 24,
            "text": "Protesters outside the state Capitol called the bill “Jim Crow 2.0”, the Atlanta Journal Constitution reported."
        },
        {
            "id": 25,
            "text": "The legislation comes after Georgia saw record turnout in the November election and January US Senate runoffs, including surges among Black and other minority voters."
        },
        {
            "id": 26,
            "text": "It has become the center of national attention because many see it as a crystallization of a national push by Republicans to make it harder to vote."
        },
        {
            "id": 27,
            "text": "Alluding to a measure in the Georgia bill that bans providing food or water to people standing in line to vote, Joe Biden called that national effort “sick” during a Thursday press conference."
        },
        {
            "id": 28,
            "text": "“This makes Jim Crow look like Jim Eagle,” he said."
        },
        {
            "id": 29,
            "text": "Facing opposition from top Republicans in the state, Republicans dropped a push to require voters to give an excuse to vote by mail."
        },
        {
            "id": 30,
            "text": "And amid national outcry, they backed away in recent weeks from proposals to prohibit early voting on Sundays, a day that Black voters have traditionally used in disproportionate numbers to cast ballots."
        },
        {
            "id": 31,
            "text": "The measure that passed on Thursday actually expands weekend early voting in the state, requiring an additional Saturday and authorizing counties to offer it on two Sundays if they choose."
        },
        {
            "id": 32,
            "text": "Republicans seized on that provision in the bill on Thursday to claim that they were actually expanding voter access in Georgia."
        },
        {
            "id": 33,
            "text": "“The bill greatly expands the accessibility of voters in Georgia and greatly improves the process of administration of elections while at the same time providing more accountability to provide that the vote is properly preserved,” Barry Fleming, a GOP state representative who spearheaded the legislation, said on Thursday."
        },
        {
            "id": 34,
            "text": "They offered little substantive justification for why the measure was necessary after an election in which there was record turnout, and in which multiple recounts found no evidence of fraud."
        },
        {
            "id": 35,
            "text": "Instead, they said the bill was necessary to preserve voter confidence."
        },
        {
            "id": 36,
            "text": "The nearly 100-page measure was only formally unveiled last week, when it was abruptly inserted into another two-page bill."
        },
        {
            "id": 37,
            "text": "While the legislation includes several of the measures lawmakers debated, it included some new ideas that had not been fully debated."
        },
        {
            "id": 38,
            "text": "Democrats and voting activists have accused Republicans of trying to ram through a bill without fully vetting it."
        },
        {
            "id": 39,
            "text": "Democrats and voting rights groups are expected to file lawsuits challenging the measure."
        },
        {
            "id": 40,
            "text": ""
        }
    ]
}