{
    "title": "Trump's base-focused midterm approach tested in Ohio and Kansas races Tuesday",
    "text": [
        {
            "id": 0,
            "text": "Washington CNN —\n\nTwo candidates endorsed by President Donald Trump are locked in tight races, with votes from Tuesday’s elections still left to count."
        },
        {
            "id": 1,
            "text": "The special election in a deep-red Ohio congressional district was too close to call Tuesday night, with Republican Troy Balderson holding a narrow lead over Democrat Danny O’Connor."
        },
        {
            "id": 2,
            "text": "In the Republican primary in the Kansas governor’s race, meanwhile, Trump-backed Secretary of State Kris Kobach and incumbent Gov. Jeff Colyer were waiting on results from the highly populated Johnson County, in the Kansas City area."
        },
        {
            "id": 3,
            "text": "The best barometer for November’s midterm elections came in Ohio, where the contest in a congressional district near Columbus that Republicans have held for three decades was too close to call."
        },
        {
            "id": 4,
            "text": "Balderson led by 0.9 percentage points with all early and election day votes counted."
        },
        {
            "id": 5,
            "text": "However, the Ohio secretary of state reported there are 8,483 outstanding absentee and provisional ballots left to count – much more than Balderson’s 1,754-vote lead."
        },
        {
            "id": 6,
            "text": "Balderson and Republicans claimed victory Tuesday night, but O’Connor did not concede the race."
        },
        {
            "id": 7,
            "text": "“We are in a tie ballgame,” he told supporters at his election night party."
        },
        {
            "id": 8,
            "text": "The close race was another ominous sign for the GOP fewer than three months from the midterm elections."
        },
        {
            "id": 9,
            "text": "It was also a sign that the party’s strategy for the race – fully embracing Trump and his bombastic message in hopes of motivating Republican voters, rather than trying to soothe moderates’ worries about the President – could backfire in similar districts in November’s midterm elections."
        },
        {
            "id": 10,
            "text": "Democrats need a net gain of 23 seats to take control of the House, and Republicans are currently defending dozens of districts that are more favorable to Democrats than Ohio’s 12th District, which Trump in 2016 and Mitt Romney in 2012 both won by 11 percentage points."
        },
        {
            "id": 11,
            "text": "The race matched consistent trends in special elections and statewide contests since Trump took office: Turnout sagged in rural, heavily Republican areas; surged in suburban areas; and swung in Democrats’ favor in those suburbs when compared to the 2016 election results."
        },
        {
            "id": 12,
            "text": "For Republicans, it was costly:"
        },
        {
            "id": 13,
            "text": "The Congressional Leadership Fund super PAC and the National Republican Congressional Committee, the House GOP’s campaign arm, poured a combined total of more than $5 million into the race, compared to just $1 million from the Democratic Congressional Campaign Committee."
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "Winning, though, would provide a psychological boost to the GOP after the party suffered a stunning loss in a March special election for a House district outside Pittsburgh."
        },
        {
            "id": 17,
            "text": "In Balderson’s Columbus-area race, the GOP groups’ Trump-like message in television advertisements focused overwhelmingly on latching O’Connor to House Minority Leader Nancy Pelosi and accusing him of being weak on issues such as immigration."
        },
        {
            "id": 18,
            "text": "Trump echoed that message on Saturday, when he visited Delaware County for a pro-Balderson rally."
        },
        {
            "id": 19,
            "text": "Balderson also got a boost from second-term Ohio Gov. John Kasich, a Republican who endorsed him late in the race, even as he sounded an alarm over the Trump-driven tactics, warning that they had alienated suburban women, in particular."
        },
        {
            "id": 20,
            "text": "No matter the special election’s outcome, Balderson and O’Connor are set for a rematch in November."
        },
        {
            "id": 21,
            "text": "Awaiting results in Kansas"
        },
        {
            "id": 22,
            "text": "In the Republican primary for Kansas governor, Trump on Monday endorsed Kobach, the Kansas secretary of state known for his crusade for restrictive voting laws, over incumbent Colyer."
        },
        {
            "id": 23,
            "text": "In doing so, he ignored the pleas of the Republican Governors Association to stay out of the race."
        },
        {
            "id": 24,
            "text": "Kobach is widely seen as uniquely vulnerable in a general election due to his controversial national profile."
        },
        {
            "id": 25,
            "text": "Kobach and Colyer were locked in a tight race as ballots were counted."
        },
        {
            "id": 26,
            "text": "The two each had about 41% of the vote, but Johnson County, the heavily populated suburbs of Kansas City, had yet to fully report early into Wednesday morning."
        },
        {
            "id": 27,
            "text": "There’s still enough outstanding vote left to count there that could determine the outcome of the contest."
        },
        {
            "id": 28,
            "text": "Kansas is a deep-red state – Trump won there by 20 percentage points in 2016 – and any Republican would be favored in the gubernatorial election in November."
        },
        {
            "id": 29,
            "text": "But Democrats believe momentum from this spring’s protests over education funding against Republicans who control the state government could make the state surprisingly competitive this fall."
        },
        {
            "id": 30,
            "text": "And Kobach – who publicly backed Trump’s false claim that millions of people voted illegally in 2016 and who advocates a hard-line approach to immigration – could alienate Republican voters in areas like the Kansas City and Wichita suburbs."
        },
        {
            "id": 31,
            "text": "The concern extends to Kobach’s potential impact on two potentially competitive congressional races in Kansas, too – including Rep. Kevin Yoder’s re-election bid in the 3rd District, a top Democratic target."
        },
        {
            "id": 32,
            "text": "Missouri voters pick Hawley, reject right-to-work"
        },
        {
            "id": 33,
            "text": "In Missouri, voters selected the GOP establishment’s preference, Attorney General Josh Hawley, as their candidate to challenge Democratic Sen. Claire McCaskill."
        },
        {
            "id": 34,
            "text": "The state, which Trump won by 19 percentage points in 2016, is one of the GOP’s best pick-up opportunities for a US Senate seat in November."
        },
        {
            "id": 35,
            "text": "The bigger story, though, was voters’ overwhelming rejection of Missouri’s right-to-work law."
        },
        {
            "id": 36,
            "text": "Labor unions’ $16 million campaign against the union-busting law was successful despite the Republican-dominated state legislature moving the referendum from November’s general election to the lower-turnout August primary."
        },
        {
            "id": 37,
            "text": "A test for the left"
        },
        {
            "id": 38,
            "text": "After Alexandria Ocasio-Cortez’s stunning primary victory in New York against Rep. Joe Crowley, progressives hoped to demonstrate that their policies can win over voters in the middle of the country."
        },
        {
            "id": 39,
            "text": "But the Ocasio-Cortez and Bernie Sanders-backed"
        },
        {
            "id": 40,
            "text": "Abdul El-Sayed’s bid for Michigan governor fell short, CNN projects, as the establishment favorite, former state Senate Minority Leader Gretchen Whitmer, nabbed the Democratic nomination and a November date with Republican Attorney General Bill Schuette."
        },
        {
            "id": 41,
            "text": "Sanders, who defeated Hillary Clinton in the state back in 2016, and Ocasio-Cortez lined up to back El-Sayed, who ran on an innovative “Medicare for all” plan and proposals for public broadband and tuition-free college."
        },
        {
            "id": 42,
            "text": "But Whitmer, a respected liberal legislator who painted El-Sayed’s platform as unrealistic in the purple state, kept the race close in areas El-Sayed needed to win big and ran up the score everywhere else."
        },
        {
            "id": 43,
            "text": "Another progressive challenger, Cori Bush, was trounced in her Democratic primary in Missouri against Rep. William Lacy Clay."
        },
        {
            "id": 44,
            "text": "Progressive candidates fared better in Kansas, where James Thompson won the Democratic nomination in the 4th District and faces Rep. Ron Estes."
        },
        {
            "id": 45,
            "text": "In Kansas’$2 3rd District, CNN projects that Sharice Davids will win the Democratic nomination."
        },
        {
            "id": 46,
            "text": "Other top candidates in the six-way primary were Brent Welder, a Bernie Sanders- and Alexandria Ocasio-Cortez- backed candidate, and Tom Niermann, a teacher running a more moderate campaign with a long list of local officials’ endorsements."
        },
        {
            "id": 47,
            "text": "Davids, an EMILY’s List-endorsed former MMA fighter, is attempting to become the first Native American lesbian in Congress."
        },
        {
            "id": 48,
            "text": "She will take on Yoder in the primary election."
        }
    ]
}