{
    "title": "U.S. Announces More Sanctions Against Russia",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — The United States added new sanctions against Russia on Monday, expanding the list of targets but concentrating on the myriad holdings of four billionaires viewed as part of President Vladimir V. Putin’s financial circle."
        },
        {
            "id": 1,
            "text": "Accusing Russia of failing to live up to its agreement to defuse the crisis in Ukraine, the Obama administration took aim at 17 banks, energy companies, investment accounts and other firms controlled by the four men, in what amounted to an attempt to constrain the assets available to Mr. Putin’s close associates and perhaps to the president himself."
        },
        {
            "id": 2,
            "text": "Although the measures do not explicitly target Mr. Putin, American officials indicated that the choice of targets was intended to send a message to him that any hidden assets he might have could ultimately be affected."
        },
        {
            "id": 3,
            "text": "In addition to the firms, the administration imposed sanctions on seven other prominent Russian figures, including two longtime Putin advisers: Igor I. Sechin, president of the state-owned Rosneft oil company, and Sergei V. Chemezov, the director general of Rostec, the Russian state corporation overseeing high-technology industries."
        },
        {
            "id": 4,
            "text": "The European Union said it would follow with sanctions on 15 Russians."
        },
        {
            "id": 5,
            "text": "“The goal here is not to go after Mr. Putin personally,” President Obama told reporters in Manila, where he was wrapping up a weeklong trip to Asia."
        },
        {
            "id": 6,
            "text": "“The goal is to change his calculus” and “to encourage him to actually walk the walk and not just talk the talk when it comes to diplomatically resolving the crisis in Ukraine.”"
        },
        {
            "id": 7,
            "text": "The sanctions follow several previous rounds of punitive measures that to date have not noticeably changed Mr. Putin’s calculus, and American officials privately expected no different result in the short term."
        },
        {
            "id": 8,
            "text": "“We don’t expect there to be an immediate change in Russian policy,” said one administration official, briefing reporters under ground rules in which he would not be identified."
        },
        {
            "id": 9,
            "text": "“What we need to do is to steadily show the Russians that there are going to be much more severe economic pain” and isolation."
        },
        {
            "id": 10,
            "text": "Administration officials, including some in the more hawkish camp, said the new sanctions were a more serious effort than earlier rounds."
        },
        {
            "id": 11,
            "text": "Some said the “secondary effects” of chilling business with those targeted were becoming more significant, and they expressed optimism that the Europeans were more willing to talk about tougher measures after a team of European military observers was taken captive by pro-Russian forces in eastern Ukraine."
        },
        {
            "id": 12,
            "text": "Mr. Obama will host Chancellor Angela Merkel of Germany at the White House later this week to coordinate whatever the next steps will be against Mr. Putin’s government."
        },
        {
            "id": 13,
            "text": "Ms. Merkel, whose country has extensive economic, cultural and historical ties to Russia, is seen as the linchpin of any coordinated effort, and Mr. Obama has made it his priority to maintain a united front with the Europeans against Russia."
        },
        {
            "id": 14,
            "text": "Map of European energy imports that come from Russia."
        },
        {
            "id": 15,
            "text": "Critics called the latest sanctions inadequate."
        },
        {
            "id": 16,
            "text": "“I expected more from these U.S. sanctions,” said Cliff Kupchan, a Russia analyst at the Eurasia Group, a firm that advises businesses."
        },
        {
            "id": 17,
            "text": "“To have a shot at changing Putin’s calculus, we’ve got to get serious on economic measures — at least hit a large Russian bank."
        },
        {
            "id": 18,
            "text": "We missed the target today.”"
        },
        {
            "id": 19,
            "text": "Anders Aslund, a Russia scholar at the Peterson Institute for International Economics, said the sanctions were “a whimper” after the tough talk by Mr. Obama and Secretary of State John Kerry."
        },
        {
            "id": 20,
            "text": "But he added that the intent was clearly to send a message to Mr. Putin about any hidden wealth."
        },
        {
            "id": 21,
            "text": "“This is going after Putin personally, not the Russian economy,” Mr. Aslund said."
        },
        {
            "id": 22,
            "text": "“And it’s telling him we know where you have your money."
        },
        {
            "id": 23,
            "text": "We don’t need to sanction you personally.”"
        },
        {
            "id": 24,
            "text": "The actions will freeze any assets in the United States and bar Americans from doing business with the individuals and firms listed."
        },
        {
            "id": 25,
            "text": "The individuals will also be denied visas to enter the United States."
        },
        {
            "id": 26,
            "text": "Moreover, the United States will cut off the export or re-export of American-made products to 13 of the companies and deny export licenses for high-technology items that could contribute to Russia’s military capabilities."
        },
        {
            "id": 27,
            "text": "The 17 firms targeted were all tied to Russian businessmen who were targeted in previous rounds of sanctions."
        },
        {
            "id": 28,
            "text": "Eleven of the companies are linked to Gennady N. Timchenko, including the Stroytransgaz Group, the pipeline construction arm of Gazprom, and the Volga Group, his private investment holding company."
        },
        {
            "id": 29,
            "text": "Mr. Timchenko was a co-founder of the Gunvor Group, a commodities trading firm in which the Treasury Department has previously said Mr. Putin has personal investments."
        },
        {
            "id": 30,
            "text": "Gunvor has adamantly denied that Mr. Putin has any financial ties to the company, and Mr. Timchenko has sold his shares in Gunvor."
        },
        {
            "id": 31,
            "text": "Three other firms targeted on Monday were tied to Arkady and Boris Rotenberg: InvestCapitalBank, SMP Bank and Stroygazmontazh."
        },
        {
            "id": 32,
            "text": "Three others were subsidiaries of Yuri V. Kovalchuk’s Bank Rossyia:"
        },
        {
            "id": 33,
            "text": "Abros, Zest and Sobinbank."
        },
        {
            "id": 34,
            "text": "The Treasury Department has referred to Mr. Kovalchuk as the personal cashier for Mr. Putin."
        },
        {
            "id": 35,
            "text": "Others targeted Monday were Dmitri N. Kozak, a deputy prime minister; Vyacheslav V. Volodin, a deputy chief of staff to Mr. Putin; Aleksei Pushkov, chairman of the international affairs committee of the State Duma, the lower house of Parliament; Oleg Belavantsev, appointed by Mr. Putin last month as presidential envoy overseeing the annexed Crimean Peninsula; and Yevgeny Murov, director of Russia’s Federal Protective Service."
        },
        {
            "id": 36,
            "text": "Although administration officials said over the weekend that they also expected Aleksei B. Miller, the head of the energy giant Gazprom, to be targeted, he was not on Monday’s list, but he may be added later."
        },
        {
            "id": 37,
            "text": "“Today’s targeted sanctions, taken in close coordination with the E.U., will increase the impact we have already begun to see on Russia’s own economy as a result of Russia’s actions in Ukraine and from U.S. and international sanctions,” Jacob J. Lew, the Treasury secretary, said in a statement."
        },
        {
            "id": 38,
            "text": "In imposing sanctions on Mr. Sechin, the administration has targeted a top partner of Exxon Mobil, which has multiple joint ventures with Rosneft."
        },
        {
            "id": 39,
            "text": "It is not known if Mr. Sechin has any assets in the United States to freeze, but he will no longer be permitted into the country to consult with his Exxon Mobil partners."
        },
        {
            "id": 40,
            "text": "Exxon Mobil had no comment on Monday."
        },
        {
            "id": 41,
            "text": "That the sanctions covered no large publicly listed Russian companies came as a relief to traders in Moscow."
        },
        {
            "id": 42,
            "text": "Russia’s benchmark Micex index closed with a modest gain of 1.5 percent."
        },
        {
            "id": 43,
            "text": "“It looked to be on the light side” of what the markets expected, said one banker in Moscow, speaking on the condition of anonymity."
        },
        {
            "id": 44,
            "text": "“This was more of a reminder that a new phase of sanctions is possible.”"
        }
    ]
}