{
    "title": "GOP members of Wayne County Board of Canvassers say they want to rescind votes to certify",
    "text": [
        {
            "id": 0,
            "text": "Both Republican members of the Wayne County Board of Canvassers signed affidavits late Wednesday saying they want to rescind their votes to certify the county's election results."
        },
        {
            "id": 1,
            "text": "It is not clear what effect, if any, the affidavits have."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "\"It means absolutely nothing,\" said Jonathan Kinloch, a Democratic member of the Wayne County Board of Canvassers, who said the affidavits are a ploy to be used in an existing or future lawsuit."
        },
        {
            "id": 4,
            "text": "Kinloch said the board even approved a second motion waiving reconsideration of the certification."
        },
        {
            "id": 5,
            "text": "\"We had a definite deadline of 14 days to certify, and they knew that."
        },
        {
            "id": 6,
            "text": "This is now out of our purview,\" he said."
        },
        {
            "id": 7,
            "text": "The affidavits signed by Monica Palmer and William Hartmann are the latest development in ongoing legal and other disputes over Michigan's election results as Republican President Donald Trump seeks to overturn results in key states that show Democrat Joe Biden winning the presidency with 306 electoral votes, compared to 232 for Trump."
        },
        {
            "id": 8,
            "text": "A total of 270 electoral votes is needed to win the presidency."
        },
        {
            "id": 9,
            "text": "Palmer told the Free Press Tuesday Trump telephoned her Tuesday night, after the board meeting, though she did not say what the discussed."
        },
        {
            "id": 10,
            "text": "The Associated Press, citing anonymous sources, reported Thursday that Trump also reached out to Hartmann."
        },
        {
            "id": 11,
            "text": "On Tuesday, Palmer and Hartmann drew outrage when they initially voted not to certify Wayne County's election results, citing concerns about alleged irregularities surrounding vote counts in Detroit."
        },
        {
            "id": 12,
            "text": "Certification is normally a routine step and the two no votes from Republicans created a temporary deadlock on the four-member board, with the two Democratic members voting in favor of certification."
        },
        {
            "id": 13,
            "text": "More:What persuaded the GOP members of Wayne County Board of Canvassers to reverse course"
        },
        {
            "id": 14,
            "text": "More:Wayne County canvassers doxxed and threatened over votes"
        },
        {
            "id": 15,
            "text": "The actions drew charges of racism because more than 200,000 Black Michiganders would have their votes disallowed by such an action."
        },
        {
            "id": 16,
            "text": "Palmer's comment that she would be willing to certify results in Detroit's suburbs — which experienced some of the same clerical errors that Detroit did — but not in Detroit, was seen as particularly outrageous."
        },
        {
            "id": 17,
            "text": "Both Palmer and Hartmann changed their votes on certification to \"yes\" Tuesday after strong criticism and heartfelt appeals from citizens participating in the board meeting over Zoom."
        },
        {
            "id": 18,
            "text": "But in the affidavits signed late Wednesday, both said they feel they made those votes under pressure and false pretenses and would now like to rescind their votes."
        },
        {
            "id": 19,
            "text": "Palmer and Hartmann said they were promised a comprehensive and independent audit of Wayne County precincts and counting boards where the number of votes recorded as cast in the poll books did not match the number of ballots counted."
        },
        {
            "id": 20,
            "text": "Both said they now believe the state does not intend to carry through with such an audit."
        },
        {
            "id": 21,
            "text": "Both said they were motivated by concerns over the integrity of the election, not racism."
        },
        {
            "id": 22,
            "text": "\"Late in the evening, I was enticed to agree to certify based on the promise that a full and independent audit would take place,\" Hartmann said in his affidavit."
        },
        {
            "id": 23,
            "text": "\"I would not have agreed to the certification but for the promise of an audit.\""
        },
        {
            "id": 24,
            "text": "Tracy Wimmer, a spokeswoman for Secretary of State Jocelyn Benson, told the Free Press Wednesday she could not comment on an audit, because a request for an audit is the subject of ongoing litigation surrounding the Nov. 3 election."
        },
        {
            "id": 25,
            "text": "In her affidavit, Palmer said: \"As a result of these facts, I rescind my prior vote to certify Wayne County elections.\""
        },
        {
            "id": 26,
            "text": "The Board of State Canvassers, which would be charged with certifying the Wayne County results if the county board did not act, is scheduled to meet Monday to certify election results statewide."
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        }
    ]
}