{
    "title": "Iowa Poll: Bernie Sanders Is Closing In On Hillary Clinton",
    "text": [
        {
            "id": 0,
            "text": "Iowa Poll shows Sen. Bernie Sanders (I-Vt) only 7 points behind Hillary Clinton in the race for the Iowa caucus, a worrying sign for the Democratic frontrunner."
        },
        {
            "id": 1,
            "text": "Clinton leads with 37 percent of likely Democratic caucusgoers, with Sanders following at 30 percent."
        },
        {
            "id": 2,
            "text": "As Clinton's campaign struggles to counter negative press from her ongoing email controversy, Sanders has energized liberal Democrats with impassioned talk of political revolution."
        },
        {
            "id": 3,
            "text": "According to the poll, 96 percent of Sanders supporters said they support him for his ideas, while two percent said their support lies mostly in the fact that they do not support Clinton."
        },
        {
            "id": 4,
            "text": "The poll also includes Vice President Joe Biden, who captured 14 percent."
        },
        {
            "id": 5,
            "text": "He has yet to announce a presidential bid."
        },
        {
            "id": 6,
            "text": "Clinton has lost a third of her support since May, the poll found."
        },
        {
            "id": 7,
            "text": "This is also the first time Clinton has fallen below the 50 percent mark in a Des Moines Register/Bloomberg Politics Iowa Poll this year."
        },
        {
            "id": 8,
            "text": "\"It looks like what people call the era of inevitability is over,\" said J. Ann Selzer, president of Selzer & Co., which conducted the poll."
        },
        {
            "id": 9,
            "text": "While the poll results show a notable departure from Clinton's presumptive lead, they don't necessarily predict what's to come."
        },
        {
            "id": 10,
            "text": "In June 2011, former Rep. Michele Bachmann was polling just one point behind eventual Republican nominee Mitt Romney in Iowa."
        },
        {
            "id": 11,
            "text": "Bachmann finished in sixth place, with a dismal 5 percent of the vote at the caucuses."
        },
        {
            "id": 12,
            "text": "The poll, conducted August 23-26, is based on telephone interviews with 404 likely Democratic caucusgoers."
        },
        {
            "id": 13,
            "text": "The findings have a margin of error of 4.9 percentage points."
        },
        {
            "id": 14,
            "text": "Sanders is currently polling at a hair under 30 percent in the HuffPost Pollster chart, which aggregates all publicly available polls."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        }
    ]
}