{
    "title": "White House Cites Security Concerns in Decision Not to Declassify the Democratic Memo",
    "text": [
        {
            "id": 0,
            "text": "President Trump has decided not to declassify the Democratic rebuttal to a memo that details surveillance abuses at the FBI."
        },
        {
            "id": 1,
            "text": "Trump reviewed the rebuttal just as he did the Republican-authored memo, but decided against making it public because of national security concerns."
        },
        {
            "id": 2,
            "text": "He has asked the authors to remove some sensitive materials."
        },
        {
            "id": 3,
            "text": "White House counsel Donald McGahn notified the House Intelligence Committee in a letter Friday."
        },
        {
            "id": 4,
            "text": "NEW: White House counsel Don McGahn sends a letter to the House Intel Committee saying President Trump will not declassify the Democratic memo at this time pic.twitter.com/vRsBruWqua — Trey Yingst (@TreyYingst) February 10, 2018"
        },
        {
            "id": 5,
            "text": "Top Democrats like Senate Minority Leader Chuck Schumer are fuming."
        },
        {
            "id": 6,
            "text": "“The president’s double standard when it comes to transparency is appalling,” he said in a statement."
        },
        {
            "id": 7,
            "text": "“The rationale for releasing the Nunes memo, transparency, vanishes when it could show information that’s harmful to him.”"
        },
        {
            "id": 8,
            "text": "The Republican-authored memo released last week painted a not-so-pretty picture about how the agency abused FISA to spy on members of the Donald Trump campaign during the 2016 election."
        },
        {
            "id": 9,
            "text": "The report says the FBI used the infamous Russian dossier to get a warrant against Trump foreign policy advisor Carter Page."
        },
        {
            "id": 10,
            "text": "The Democratic version is six pages longer and, according to its authors, contains important context their Republican colleagues omitted."
        },
        {
            "id": 11,
            "text": "Ahead of Trump's review of their response, House Intelligence Committee ranking member Adam Schiff suggested that the White House was in a \"sense of panic\" over special counsel Robert Mueller's investigation into Russian collusion."
        },
        {
            "id": 12,
            "text": "Why else would Trump and his associates be \"putting the government on trial?"
        },
        {
            "id": 13,
            "text": "\""
        },
        {
            "id": 14,
            "text": "He also accused Nunes of \"secretly altering\" the Republican draft of the memo without his colleagues' knowledge."
        },
        {
            "id": 15,
            "text": "President Trump said the initial memo \"vindicated\" him from any claims of Russian collusion."
        }
    ]
}