{
    "title": "Supreme Court Tees Up High-Stakes Cases For Grand Finale",
    "text": [
        {
            "id": 0,
            "text": "The U.S. Supreme Court is set to issue decisions on major cases in the next few days that will have sweeping impacts for the entire nation."
        },
        {
            "id": 1,
            "text": "Earlier in the week, the justices decided cases involving the Fourth Amendment and patents."
        },
        {
            "id": 2,
            "text": "That leaves seven, highly anticipated decisions still to come, including blockbuster cases that could legalize same-sex marriage and gut President Barack Obama's health care law."
        },
        {
            "id": 3,
            "text": "The justices are likely to issue decisions on Thursday, Friday, and perhaps next week."
        },
        {
            "id": 4,
            "text": "Here's a look at what’s still to come, and what’s at stake."
        },
        {
            "id": 5,
            "text": "1. The Affordable Care Act."
        },
        {
            "id": 6,
            "text": "King v. Burwell may strike down a key Obamacare feature because of four words."
        },
        {
            "id": 7,
            "text": "The plaintiffs argue that federal tax credits are available for policies purchased on an exchange “established by the State,” and the federal government is not a state."
        },
        {
            "id": 8,
            "text": "That means subsidies used to buy health insurance from a federal exchange are illegal, the plaintiffs say."
        },
        {
            "id": 9,
            "text": "The government says the spirit of the law makes clear that subsidies are available to anyone who buys insurance on an exchange, whether established by the federal government or a state."
        },
        {
            "id": 10,
            "text": "If the court rules in the plaintiffs' favor, an estimated 8 million people would lose their subsidies, likely leaving them unable to afford health coverage."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": "2. Same-Sex Marriage."
        },
        {
            "id": 13,
            "text": "Obergefell v. Hodges could usher marriage equality to all 50 states."
        },
        {
            "id": 14,
            "text": "The justices will decide whether the Constitution permits states to prohibit same-sex marriage, and whether states can refuse to recognize same-sex marriages performed in another state where it is legal."
        },
        {
            "id": 15,
            "text": "As most states now permit gay marriage, many expect the court to go along with the trend."
        },
        {
            "id": 16,
            "text": "Nationwide support for marriage equality is at record highs, and advocates said they hope the case will be the capstone to decades of litigation."
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "3. Housing Discrimination."
        },
        {
            "id": 19,
            "text": "Texas Department of Housing and Community Affairs v. Inclusive Communities Project.\n\nThe case, closely watched by civil rights groups, will decide whether the Fair Housing Act of 1968 allows people to pursue lawsuits over housing practices that have a discriminatory effect, even if unintentional."
        },
        {
            "id": 20,
            "text": "This type of effectual but unintentional discrimination is referred to as “disparate impact.”"
        },
        {
            "id": 21,
            "text": "The case stems from a lawsuit brought in 2008, when a Texas nonprofit organization sued a state agency, alleging tax subsidies it had distributed promoted segregation."
        },
        {
            "id": 22,
            "text": "Advocates say such claims are critical to address discrimination, while opponents argue that they are unfair and exceedingly costly to policymakers, housing administrators and property owners."
        },
        {
            "id": 23,
            "text": "Justices appeared divided during oral arguments."
        },
        {
            "id": 24,
            "text": "The Obama administration has voiced support for advocates of disparate impact claims."
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": "4. Lethal Injection."
        },
        {
            "id": 27,
            "text": "Glossip v. Gross.\n\nHow should a state execute a convicted murderer?"
        },
        {
            "id": 28,
            "text": "The high court's ruling on lethal injection comes down to the whether a drug administered in executions -- midazolam -- causes cruel and unusual punishment banned by the Constitution."
        },
        {
            "id": 29,
            "text": "The plaintiffs are inmates on Oklahoma's death row, who argue that the drug is not \"humane and effective\" The state says the medicine does not induce \"intense and needless pain and suffering.\""
        },
        {
            "id": 30,
            "text": "Experts predict the court's opinion will be written broadly, unlikely to stoke sweeping death penalty reforms."
        },
        {
            "id": 31,
            "text": ""
        },
        {
            "id": 32,
            "text": "5. Congressional Redistricting."
        },
        {
            "id": 33,
            "text": "Arizona State Legislature v. Arizona Independent Redistricting Commission.\n\nArizona's redistricting case stems from a ballot initiative from 2000 that established an independent redistricting commission to oversee complaints of legislative gerrymandering."
        },
        {
            "id": 34,
            "text": "What happened next was a partisan battle and a lawsuit by Republicans that argued the administration of federal elections should be decided by the \"legislature.\""
        },
        {
            "id": 35,
            "text": "But what does \"legislature\" mean?"
        },
        {
            "id": 36,
            "text": "The redistricting commission argues \"legislature\" means the legislative process, while the legislature says it refers to the legislative \"body.\""
        },
        {
            "id": 37,
            "text": "The case could have consequences for a handful of other states, including California, that have election laws approved in a ballot initiative process."
        },
        {
            "id": 38,
            "text": ""
        },
        {
            "id": 39,
            "text": "6. EPA Emissions Regulations."
        },
        {
            "id": 40,
            "text": "Utility Air Regulatory Group v. EPAet.al."
        },
        {
            "id": 41,
            "text": ""
        },
        {
            "id": 42,
            "text": ""
        },
        {
            "id": 43,
            "text": "A coalition of 21 states, along with coal industry and power plant groups, are challenging Environmental Protection Agency rules meant to clean up dangerous air pollutants, including mercury, nickel and arsenic."
        },
        {
            "id": 44,
            "text": "Did the EPA not factor in costs -- nearly $10 billion annually -- when it issued new emission standards?"
        },
        {
            "id": 45,
            "text": "A federal appeals judge said it didn't."
        },
        {
            "id": 46,
            "text": "The EPA says the agency only has to consider health risks, not costs, when regulating."
        },
        {
            "id": 47,
            "text": ""
        },
        {
            "id": 48,
            "text": "7. Gun Laws and Criminals."
        },
        {
            "id": 49,
            "text": "Johnson v. U.S."
        },
        {
            "id": 50,
            "text": "A challenge to the Armed Career Criminal Act, which mandates a 15-year sentence for any federal firearms offender with three prior convictions for a \"violent felony,\" contends the law is too vague."
        },
        {
            "id": 51,
            "text": "The law is a federal version of state \"three strikes\" rules for repeat offenders, The Wall Street Journal notes."
        },
        {
            "id": 52,
            "text": "The plaintiff, white supremacist Samuel Johnson, had his prison sentence bumped from 10 years to 15 years under the law."
        },
        {
            "id": 53,
            "text": ""
        }
    ]
}