{
    "title": "Recalling Aaron Persky, the Judge Who Showed Brock Turner Leniency, Is a Mistake That Will Haunt Progressives",
    "text": [
        {
            "id": 0,
            "text": "Residents of Santa Clara County, California, voted yesterday to recall Aaron Persky, the superior court judge widely criticized for sentencing Stanford student Brock Turner to just six months in prison."
        },
        {
            "id": 1,
            "text": "Turner was convicted in 2016 of sexually assaulting an incapacitated woman."
        },
        {
            "id": 2,
            "text": "Prosecutors had sought a six-year sentence, but Persky thought Turner probably wasn't a danger to others and was concerned a lengthier prison stint would adversely impact him."
        },
        {
            "id": 3,
            "text": "This outraged Stanford law professor Michelle Dauber—whose daughter is friends with Turner's victim—and so Dauber launched a now-successful campaign to have Persky recalled from office."
        },
        {
            "id": 4,
            "text": "The point of the recall was to hold \"white, privileged men accountable,\" Dauber told The New York Times."
        },
        {
            "id": 5,
            "text": "The prison component of Turner's sentence was indeed lenient."
        },
        {
            "id": 6,
            "text": "But a simple fact has often been absent from this conversation: The six-month sentence wasn't Persky's idea, but rather the recommendation of the probation department."
        },
        {
            "id": 7,
            "text": "And even if Turner should have spent more time behind bars, he is still registered as a sex offender and likely will be for the rest of his life."
        },
        {
            "id": 8,
            "text": "He will have trouble finding a place to live, holding a job, and interacting with young people."
        },
        {
            "id": 9,
            "text": "Sex offenders are treated as pariahs and must obey onerous restrictions, even in cases where they pose almost no risk to others."
        },
        {
            "id": 10,
            "text": "But even people who can't muster any sympathy for Turner should still be concerned about what message Persky's recall will send."
        },
        {
            "id": 11,
            "text": "I understand why members of the Stanford community were upset about the lenient treatment of Turner, and it's easy to imagine white privilege had something to do with it."
        },
        {
            "id": 12,
            "text": "(The California Commission on Judicial Performance, it must be noted, found no \"clear and convincing evidence of bias\" in Persky's decision-making.)"
        },
        {
            "id": 13,
            "text": "But this recall is likely to encourage judges to be tougher in general lest angry voters come for them too."
        },
        {
            "id": 14,
            "text": "This was a blow to leniency for all criminal defendants."
        },
        {
            "id": 15,
            "text": "Evidence already exists that judges impose harsher sentences around election time."
        },
        {
            "id": 16,
            "text": "According to a 2015 Brennan Center study, \"The pressures of upcoming re-election campaigns affect judicial decision-making in criminal cases, making judges more likely to impose longer sentences, affirm death sentences, and even override sentences of life imprisonment to impose the death penalty."
        },
        {
            "id": 17,
            "text": "\" When judges are subjected to normal political considerations, they unsurprisingly behave like politicians, for whom being tough on crime is usually a winning stance."
        },
        {
            "id": 18,
            "text": "That's one reason LaDoris Cordell, a retired California judge and self-described liberal feminist, vehemently opposed the recall effort, according to The Times:\n\nMs. Cordell wears her liberal stripes proudly, but she said she is worried the recall effort could influence judges who might otherwise show leniency in criminal sentencing, undermining a longtime goal to decrease the prison population."
        },
        {
            "id": 19,
            "text": "The impulse toward harsher sentencing, she said, is reminiscent of the measures that have fed large increases of prison populations, like California's three-strikes law, which imposed an automatic life sentence for a third felony conviction."
        },
        {
            "id": 20,
            "text": "Progressives who support criminal justice reform, the repeal of mandatory minimum sentencing, an end to mass incarceration, and rehabilitation should pause before cheering the recall of Judge Persky."
        },
        {
            "id": 21,
            "text": "The window to punish Turner has shut."
        },
        {
            "id": 22,
            "text": "The next person to come before a California judge might be a far less privileged defendant, hoping for mercy and less likely to get it."
        }
    ]
}