{
    "title": "Menendez responds to federal corruption charges, says he’s ‘not going anywhere’",
    "text": [
        {
            "id": 0,
            "text": "Responding to reports that the Justice Department is preparing to charge him with criminal corruption, a defiant Sen. Robert Menendez, New Jersey Democrat, said he is “not going anywhere.”"
        },
        {
            "id": 1,
            "text": "Mr. Menendez maintained that he had “always conducted myself appropriately and in accordance with the law.”"
        },
        {
            "id": 2,
            "text": "CNN first reported Friday that the DOJ is preparing to charge the senator over his relation with Salomon Melgen, a Florida eye doctor, who is one of Mr. Menendez’s main fundraisers and supporters."
        },
        {
            "id": 3,
            "text": "The FBI has been investigating whether Mr. Menendez helped secure contracts with the government of the Dominican Republic on behalf of Mr. Melgen, and also protected Mr. Melgen during a U.S. investigation over Medicare fraud."
        },
        {
            "id": 4,
            "text": "Mr. Menendez disputed the charges."
        },
        {
            "id": 5,
            "text": "“I fight for things I believe important…and for the people of our country,” he said."
        },
        {
            "id": 6,
            "text": "“That’s who I am.”"
        },
        {
            "id": 7,
            "text": "“As we have said before, we believe all of [the] senator’s actions have been appropriate and lawful and the facts will ultimately confirm that,” Tricia Enright, a spokeswoman for Sen. Menendez, said in a statement."
        },
        {
            "id": 8,
            "text": "“Any actions taken by Senator Menendez or his office have been to appropriately address public policy issues and not for any other reason.”"
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        }
    ]
}