{
    "title": "Trump: 2nd Amendment ‘under a threat like never before’",
    "text": [
        {
            "id": 0,
            "text": "LOUISVILLE — Likely GOP presidential nominee Donald Trump on Friday slammed Democratic front-runner Hillary Clinton as historically hostile to gun rights and warned that Mrs. Clinton will get the chance to appoint up to five U.S. Supreme Court justices if she’s elected president."
        },
        {
            "id": 1,
            "text": "“The Second Amendment is under a threat like never before,” Mr. Trump said at the NRA-ILA Leadership Forum at the National Rifle Association’s annual meetings here."
        },
        {
            "id": 2,
            "text": "“Crooked Hillary Clinton is the most anti-gun, anti-Second Amendment candidate ever to run for office."
        },
        {
            "id": 3,
            "text": "“And as I said before, she wants to abolish the Second Amendment,” he said."
        },
        {
            "id": 4,
            "text": "“She wants to take your guns away.”"
        },
        {
            "id": 5,
            "text": "Before he spoke, Mr. Trump was officially endorsed by the NRA, which he called a “fantastic honor.”"
        },
        {
            "id": 6,
            "text": "Mr. Trump said Mrs. Clinton wants to reverse the 2008 District of Columbia v. Heller U.S. Supreme Court decision that affirmed the individual right to keep and bear arms."
        },
        {
            "id": 7,
            "text": "“Hillary said the Supreme Court is wrong on the Second Amendment."
        },
        {
            "id": 8,
            "text": "That’s bad,” he said."
        },
        {
            "id": 9,
            "text": "Congressional Republicans have said they do not plan to hold hearings or a vote this year on Judge Merrick Garland, President Obama’s pick to fill the vacancy on the Supreme Court left by the death of Justice Antonin Scalia."
        },
        {
            "id": 10,
            "text": "Mr. Trump said “it could even be five” judges that the next president will nominate for the high court."
        },
        {
            "id": 11,
            "text": "“If she gets to appoint her judges, she will as part of it abolish the Second Amendment,” he said."
        },
        {
            "id": 12,
            "text": "Mr. Trump said he plans to add to a list of 11 potential Supreme Court picks he recently released, and said he’d like to call on Mrs. Clinton to release a list of her own."
        },
        {
            "id": 13,
            "text": "“I think that in addition to calling for them to name judges, we’ll also call them and let their bodyguards immediately disarm,” he said."
        },
        {
            "id": 14,
            "text": "“They should immediately disarm."
        },
        {
            "id": 15,
            "text": "And let’s see how good they do."
        },
        {
            "id": 16,
            "text": "Let’s see how they feel walking around without their guns [on] their bodyguards.”"
        },
        {
            "id": 17,
            "text": "Mr. Trump said the Second Amendment is “on the ballot” in November."
        },
        {
            "id": 18,
            "text": "“The only way to save our Second Amendment is to vote for a person that you all know named Donald Trump,” he said."
        },
        {
            "id": 19,
            "text": "“I will never let you down."
        },
        {
            "id": 20,
            "text": "I will protect our Second Amendment."
        },
        {
            "id": 21,
            "text": "I will protect our country,” he said."
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        }
    ]
}