{
    "title": "Huckabee: Planned Parenthood shooting is 'domestic terrorism'",
    "text": [
        {
            "id": 0,
            "text": "Republican presidential candidate and former governor of Arkansas Mike Huckabee speaks during the Iowa Faith and Freedom Coalition annual banquet and presidential forum Monday June 22, 2015 in Des Moines, Iowa."
        },
        {
            "id": 1,
            "text": "Republican presidential candidate former Arkansas Governor Mike Huckabee speaks during the Sunshine Summit conference being held at the Rosen Shingle Creek on November 13, 2015 in Orlando, Florida."
        },
        {
            "id": 2,
            "text": "Republican Presidential candidate Mike Huckabee gestures during the under card Republican Presidential debate sponsored by Fox Business and the Republican National Committee at the North Charleston Coliseum and Performing Arts Center in Charleston, South Carolina on January 14, 2016."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "TIMOTHY A. CLARY / AFP /"
        },
        {
            "id": 5,
            "text": "TIMOTHY A. CLARY "
        },
        {
            "id": 6,
            "text": "Story highlights Mike Huckabee called Friday's shootings at a Planned Parenthood clinic 'domestic terrorism' Huckabee also blasted President Barack Obama for the tone of his remarks about ISIS\n\nWashington CNN —\n\nMike Huckabee called the Friday shootings at a Planned Parenthood clinic in Colorado an act of “domestic terrorism.”"
        },
        {
            "id": 7,
            "text": "The former Arkansas governor and Republican presidential contender who’s known for his social conservatism admonished the alleged shooter in an interview with CNN’s Brianna Keilar Sunday on “State of the Union."
        },
        {
            "id": 8,
            "text": "Today’s most-wanted domestic terrorists"
        },
        {
            "id": 9,
            "text": "“What he did is domestic terrorism, and what he did is absolutely abominable, especially to us in the pro-life movement, because there’s nothing about any of us that would condone or in any way look the other way on something like this,” Huckabee said."
        },
        {
            "id": 10,
            "text": "He contrasted anti-abortion activists’ response to the shooting with Secretary of State John Kerry’s comment that the Charlie Hebdo attacks in Paris had a “rationale” that could be understood, while the recent killings there do not."
        },
        {
            "id": 11,
            "text": "“We’re not going to have the kind of language that you heard from John Kerry where he talked about legitimizing or rationalizing terrorist actions,” Huckabee said."
        },
        {
            "id": 12,
            "text": "“There’s no legitimizing, there’s no rationalizing."
        },
        {
            "id": 13,
            "text": "It was mass murder."
        },
        {
            "id": 14,
            "text": "It was absolutely unfathomable."
        },
        {
            "id": 15,
            "text": "And there’s no excuse for killing other people, whether it’s happening inside the Planned Parenthood headquarters, inside their clinics where many millions of babies die, or whether it’s people attacking Planned Parenthood.”"
        },
        {
            "id": 16,
            "text": "In the interview, Huckabee also took shots at President Barack Obama over the tone of his remarks about ISIS and the acceptance of Syrian refugees into the United States in the wake of the Paris attacks."
        },
        {
            "id": 17,
            "text": "Republicans to Obama:"
        },
        {
            "id": 18,
            "text": "Keep Syrian refugees out\n\n“This President has shown considerable more intensity of anger toward Republicans than he has toward ISIS,” Huckabee said."
        },
        {
            "id": 19,
            "text": "“I mean I remember those press conferences – the one in Manila and the one in Turkey prior to that – where you could see the visible, visceral anger this President had as he spoke about Republicans."
        },
        {
            "id": 20,
            "text": "And he was so frustrated that there was not just a universal acceptance of his point of view about relocation of refugees, calling people who disagreed with him as un-American,” Huckabee said."
        },
        {
            "id": 21,
            "text": "“It was harsh."
        },
        {
            "id": 22,
            "text": "And I just want him to show the same kind of anger directed toward the ISIS terrorists, and frankly, all the radical Islamists, that we saw from the French President (Francois)"
        },
        {
            "id": 23,
            "text": "Hollande,” he said."
        },
        {
            "id": 24,
            "text": "“That’s what we all need to do – the family of civilized nations needs to get together and we need to destroy them once and for all.”"
        }
    ]
}