{
    "title": "Sen. Dianne Feinstein: Obama 'Too Cautious' On ISIS",
    "text": [
        {
            "id": 0,
            "text": "Sen. Dianne Feinstein (D-Calif.), the head of the Senate Intelligence Committee, said in an interview to air Sunday on NBC's \"Meet The Press,\" that President Barack Obama had been \"too cautious\" in his response to the threat posed by Islamic State militants in Iraq and Syria."
        },
        {
            "id": 1,
            "text": "Asked by NBC News chief foreign affairs correspondent Andrea Mitchell if Obama's statement that the U.S. did not yet have a strategy to deal with ISIS projected weakness, Feinstein replied, \"I think I've learned one thing about this president, and that is he's very cautious."
        },
        {
            "id": 2,
            "text": "Maybe in this instance, too cautious.\""
        },
        {
            "id": 3,
            "text": "\"I do know that the military, I know that the State Department, I know that others have been putting plans together,\" the senior lawmaker added."
        },
        {
            "id": 4,
            "text": "Feinstein also deviated from Obama's characterization of the Islamic militant group that is laying siege to parts Iraq and Syria as a \"JV team,\" saying \"I think it's a major varsity team,\" and, \"I see nothing that compares with its viciousness.\""
        },
        {
            "id": 5,
            "text": "Feinstein, who has been assessing threats to national security for years on the Senate Intelligence Committee, said, \"This is really the first group that has the wherewithal in terms of financing, the fighting machine in terms of a structure -- a heavy equipment, heavy explosives, the ability to move quickly,\" and, \"this is a group of people who are extraordinarily dangerous."
        },
        {
            "id": 6,
            "text": "And they'll kill with abandon.\""
        },
        {
            "id": 7,
            "text": "Watch the clip from NBC News above."
        }
    ]
}