{
    "title": "Georgia Gov. Kemp Signs GOP Election Bill Amid Outcry",
    "text": [
        {
            "id": 0,
            "text": "Georgia Gov. Brian Kemp drew protests Thursday as he signed into law a sweeping Republican-sponsored overhaul of state elections that includes new restrictions on voting by mail and greater legislative control over how elections are run."
        },
        {
            "id": 1,
            "text": "Democrats and voting rights groups say the law will disproportionately disenfranchise voters of color."
        },
        {
            "id": 2,
            "text": "It is part of a wave of GOP-backed election bills introduced in states around the nation after former President Donald Trump alleged fraud led to his 2020 election defeat."
        },
        {
            "id": 3,
            "text": "As Kemp was delivering remarks shortly after signing the bill, he was interrupted by a commotion inside his ceremonial office and asked an aide \"what's the problem\" before a livestream of the event cut out."
        },
        {
            "id": 4,
            "text": "Just outside Kemp's office were about 10 protesters, including Democratic state Reps. Park Cannon and Erica Thomas, both African Americans."
        },
        {
            "id": 5,
            "text": "Cannon was arrested by Capitol police after knocking on the door of the governor's office during his remarks."
        },
        {
            "id": 6,
            "text": "The Republican changes to voting laws in Georgia follow record-breaking turnout that led to Democrat victories in the presidential contest and two U.S. Senate runoffs in the once reliably red state."
        },
        {
            "id": 7,
            "text": "Kemp signed the bill less than 2 hours after it received final passage in the Georgia General Assembly."
        },
        {
            "id": 8,
            "text": "The bill passed the state House 100-75 earlier Thursday, before the state Senate quickly agreed to House changes 34-20."
        },
        {
            "id": 9,
            "text": "Republicans in the legislature were in support, while Democrats were opposed."
        },
        {
            "id": 10,
            "text": "Democratic Senate Minority Leader Gloria Butler said the bill was filled with \"voter suppression tactics."
        },
        {
            "id": 11,
            "text": "\"\n\n\"We are witnessing right now a massive and unabashed assault on voting rights unlike anything we've seen since the Jim Crow era,\" Butler added."
        },
        {
            "id": 12,
            "text": "Democrat Rep. Rhonda Burnough claimed the bill was based on lies told by Republicans after last November's election."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "\"Georgians turned out in record-breaking numbers because they could access the ballot,\" Burnough said."
        },
        {
            "id": 15,
            "text": "\"Lies upon lies were told about our elections in response, and now this bill is before us built on those same lies.\""
        },
        {
            "id": 16,
            "text": "Among highlights, the law requires a photo ID in order to vote absentee by mail, after more than 1.3 million Georgia voters used that option during the COVID-19 pandemic."
        },
        {
            "id": 17,
            "text": "It also cuts the time people have to request an absentee ballot and limits where ballot drop boxes can be placed and when they can be accessed."
        },
        {
            "id": 18,
            "text": "Republican Rep. Jan Jones said the provisions cutting the time people have to request an absentee ballot are meant to \"increase the likelihood of a voter's vote being cast successfully,\" after concerns were raised in 2020 about mail ballots not being received by counties in time to be counted."
        },
        {
            "id": 19,
            "text": "One of the biggest changes gives the GOP-controlled legislature more control over election administration, a change that has raised concerns among voting rights groups that it could lead to greater partisan influence."
        },
        {
            "id": 20,
            "text": "The law replaces the elected secretary of state as the chair of the state election board with a new appointee of the legislature after Republican Secretary of State Brad Raffensperger rebuffed Trump's attempts to investigate Georgia's election results."
        },
        {
            "id": 21,
            "text": "It also allows the board to remove and replace county election officials deemed to be underperforming."
        },
        {
            "id": 22,
            "text": "That provision is widely seen as something that could be used to target Fulton County, a Democrat stronghold covering most of Atlanta, which came under fire after long lines plagued primary elections over the summer."
        },
        {
            "id": 23,
            "text": "Republican Rep. Barry Fleming, a driving force in crafting the law, said that provision would only be a \"temporary fix, so to speak, that ends and the control is turned back over to the locals after the problems are resolved.\""
        },
        {
            "id": 24,
            "text": "The law also reduces the timeframe in which runoff elections are held, including the amount of early voting for runoffs."
        },
        {
            "id": 25,
            "text": "And it bars outside groups from handing out food or water to people standing in line to vote."
        },
        {
            "id": 26,
            "text": "The law does not contain some of the more contentious proposals floated by Republicans earlier in the session, including limits on early voting Sundays, a popular day for Black churchgoers to vote in \"souls to the polls\" events."
        },
        {
            "id": 27,
            "text": "It instead mandates 2 Saturdays of early voting ahead of general elections, when only one had been mandatory, and leave 2 Sundays as optional."
        },
        {
            "id": 28,
            "text": "But those changes have not tempered opposition from Democrats or voting rights groups."
        },
        {
            "id": 29,
            "text": "About 50 protesters including representatives from the NAACP gathered across from the Capitol building Thursday in opposition."
        },
        {
            "id": 30,
            "text": "During the rally, Bishop Reginald Jackson of the African Methodist Episcopal Church called for a boycott of Coca-Cola Co. products."
        },
        {
            "id": 31,
            "text": "Jackson, who leads more than 400 churches across Georgia, said the Atlanta-based soft drink company had failed to live up to the commitments it made last year to support the Black Lives Matter movement by not forcefully opposing the voting bills pushed by Republicans."
        },
        {
            "id": 32,
            "text": "\"We took them at his word,\" he said of Coca-Cola CEO James Quincey. \""
        },
        {
            "id": 33,
            "text": "Now, when they try to pass this racist legislation, we can't get him to say anything.\""
        }
    ]
}