{
    "title": "Boehner plan is criticized by both sides",
    "text": [
        {
            "id": 0,
            "text": "Republican leaders struggled Tuesday to contain the backlash from conservatives over the GOP’s offer of $800 billion in tax increases to head off the “fiscal cliff” — a move that didn’t impress the White House, even as it spawned a rebellion on the right."
        },
        {
            "id": 1,
            "text": "Conservative lawmakers and interest groups said House Speaker John A. Boehner’s offer abandoned core Republican principles and earned no credit from a White House that has insisted on even bigger tax increases and balked at major spending cuts."
        },
        {
            "id": 2,
            "text": "“This isn’t rocket science,” said Sen. Jim DeMint, South Carolina Republican."
        },
        {
            "id": 3,
            "text": "“Everyone knows that when you take money out of the economy, it destroys jobs, and everyone knows that when you give politicians more money, they spend it.”"
        },
        {
            "id": 4,
            "text": "The conservative Heritage Foundation also dismissed the Republican plan, saying it fails Mr. Boehner’s own test of seriousness because it doesn’t do enough to curtail entitlement spending."
        },
        {
            "id": 5,
            "text": "Even as he faces resistance on higher taxes, Mr. Boehner pivoted Tuesday, saying after a bipartisan meeting with House Republican leaders and a handful of governors that spending cuts are crucial to the deal."
        },
        {
            "id": 6,
            "text": "“Yesterday, Republicans made a good-faith offer to avert the fiscal cliff that includes significant spending cuts and new revenue without raising tax rates on small businesses and costing jobs,” Mr. Boehner said."
        },
        {
            "id": 7,
            "text": "“I will continue to urge governors of both parties to talk to small-business men and women in their states about the impact it will have on small businesses if Washington raises their tax rates, as President Obama is demanding, rather than cutting spending and reforming entitlement programs.”"
        },
        {
            "id": 8,
            "text": "Led by Mr. Boehner, the House’s leadership sent a $2.2 trillion proposal to the White House on Monday that included $900 billion in cuts to entitlement programs and $300 billion in lower discretionary spending, but also promised $800 billion more in taxes, which aides said would come from eliminating deductions and loopholes claimed by the wealthy."
        },
        {
            "id": 9,
            "text": "The White House rejected the proposal, saying it doesn’t believe the Republican numbers add up and noting Mr. Obama will insist that the wealthy pay a higher income tax rate, rather than just have loopholes closed."
        },
        {
            "id": 10,
            "text": "“Unfortunately, the speaker’s proposal right now is still out of balance,” Mr. Obama said Tuesday in a Bloomberg Television interview."
        },
        {
            "id": 11,
            "text": "“You know, he talks, for example, about $800 billion worth of revenues, but he says he’s going to do that by lowering rates."
        },
        {
            "id": 12,
            "text": "And when you look at the math, it doesn’t work.”"
        },
        {
            "id": 13,
            "text": "Republicans and Democrats are trying to avoid the fiscal cliff — the across-the-board tax increases and $110 billion in automatic spending cuts that will kick in at the beginning of next year if lawmakers can’t agree on a budget deal."
        },
        {
            "id": 14,
            "text": "Going over the cliff, many economists predict, would plunge the nation into a short, sharp recession — but over the long haul, the spending cuts and tax increases would leave the federal government in better fiscal and economic shape, the Congressional Budget Office says."
        },
        {
            "id": 15,
            "text": "Lawmakers, though, want to minimize the pain."
        },
        {
            "id": 16,
            "text": "All sides want to extend the lower tax rates for most Americans, leaving the chief dispute over what happens to the tax cuts for couples making $250,000 or more a year."
        },
        {
            "id": 17,
            "text": "In the House, Democrats launched a petition drive to try to circumvent Republicans’ control and force a vote on a bill that would extend tax cuts for most Americans, leaving only the wealthiest without an extension."
        },
        {
            "id": 18,
            "text": "“Everyone here agrees: Taxes should not go up on middle-class families."
        },
        {
            "id": 19,
            "text": "Democrats and Republicans can come together to make that happen,” said Rep. Timothy J. Walz, Minnesota Democrat, who launched the petition."
        },
        {
            "id": 20,
            "text": "If he can gather signatures from a majority of House members — which would mean at least two dozen Republicans — it would force the Democrats’ bill to the floor."
        },
        {
            "id": 21,
            "text": "Some Republicans have backed that legislation, saying they didn’t want to be seen holding tax cuts for the middle class hostage."
        },
        {
            "id": 22,
            "text": "But the bigger problem for Mr. Boehner and his chief lieutenants is trying to keep his right flank from fleeing."
        },
        {
            "id": 23,
            "text": "“This may surprise you, but we were not consulted on the proposal,” Rep. Louie Gohmert said Tuesday."
        },
        {
            "id": 24,
            "text": "He said the framework reminded him of the outline Mr. Boehner and Mr. Obama had been working on during last summer’s debate on raising the debt ceiling."
        },
        {
            "id": 25,
            "text": "“That’s not a good place to start, I wouldn’t think,” the Texas Republican said, adding that he understands what Mr. Boehner is trying to do, but that every time he extends a hand to the White House, it gets slapped back."
        },
        {
            "id": 26,
            "text": "“So why not fall back on principle?” Mr. Gohmert said."
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": "Rep. Steve King, Iowa Republican, said Mr. Boehner’s proposal is better than Mr. Obama’s offer last week, which called for $1.6 trillion in tax increases coupled with $400 billion in potential cuts to health care entitlement programs and hundreds of billions of dollars more in stimulus spending."
        },
        {
            "id": 29,
            "text": "But Mr. King said the Republican leadership plan doesn’t strike the right balance on policy either."
        },
        {
            "id": 30,
            "text": "“In the end, the speaker’s got to be looking at, ‘Where are 218 votes going to come from?’"
        },
        {
            "id": 31,
            "text": "And the closer he gets to the president’s proposal, the harder that is to get [it] out of the Republican conference,” Mr. King said."
        },
        {
            "id": 32,
            "text": "“That’s just a fact.”\n\nMr. Boehner, though, has said he expects to be able to deliver the votes if and when he strikes a deal with Mr. Obama."
        },
        {
            "id": 33,
            "text": "Some House Republicans, while critical of the plan to increase taxes, said they were willing to see where the speaker’s negotiations lead."
        },
        {
            "id": 34,
            "text": "“Right now, he’s kind of in the middle of the theater and the rest of us aren’t, and so we have to give him some flexibility in terms of discussion,” said Rep. Jack Kingston, Georgia Republican."
        },
        {
            "id": 35,
            "text": "“But I’m a guy who believes it’s a spending problem, not a revenue problem.”"
        },
        {
            "id": 36,
            "text": "Rep. Michael C. Burgess of Texas likewise said the party has to play the cards it is dealt and the leadership is doing the best it can — but that he wasn’t about to compromise his principles."
        },
        {
            "id": 37,
            "text": "“Look, the president talks about a mandate."
        },
        {
            "id": 38,
            "text": "I received a mandate also,” he said."
        },
        {
            "id": 39,
            "text": "“I did not run on a platform of raising taxes on anyone — top 2 percent, bottom 2 percent — I did not run on that platform."
        },
        {
            "id": 40,
            "text": "My obligation is to the mandate that I received, and I don’t consider that digging my heels in."
        },
        {
            "id": 41,
            "text": "I consider that representing my constituents.”"
        }
    ]
}