{
    "title": "Bipartisan House Majority Defeats Senate's Unbalanced Budget",
    "text": [
        {
            "id": 0,
            "text": "They'll debate and vote on the balanced, popular, pro-growth GOP alternative later today, but yesterday held an important moment of its own:\n\n\n\nThe House on Wednesday rejected the Senate Democratic budget in a 154-261 vote, with 35 Democrats voting against the blueprint from their upper chamber colleagues."
        },
        {
            "id": 1,
            "text": "House Democrats were instructed to vote for the Senate Democratic budget, but 35 of them defected..."
        },
        {
            "id": 2,
            "text": "The House also rejected the budget from the Congressional Black Caucus (CBC) in a 105-305 vote..."
        },
        {
            "id": 3,
            "text": "The Progressive Caucus budget was also rejected 84-327, but it managed to pick up a few more votes compared to last year."
        },
        {
            "id": 4,
            "text": "Most Democrats voted against this bill, just as they did last year when it was rejected 78-346."
        },
        {
            "id": 5,
            "text": "They would have voted on the president's budget as well, presumably, but it doesn't exist."
        },
        {
            "id": 6,
            "text": "This executive abdication is unparalleled over the last 92 years of American presidents, dating back to the passage of the current law."
        },
        {
            "id": 7,
            "text": "Here's a list of the Democrats who voted no on their own party's budget, perhaps because it raises taxes massively, punts on every major reform, and never, ever balances."
        },
        {
            "id": 8,
            "text": "Coincidentally, many of the blue \"no\" votes were cast by vulnerable incumbents being targeted by the NRCC."
        },
        {
            "id": 9,
            "text": "Funny, that."
        },
        {
            "id": 10,
            "text": "Mary Katharine Ham makes two good points about last evening's events: (1) \"Opposition to Democratic priorities continues to be consistently more bipartisan than the coalition that passed Obamacare.\""
        },
        {
            "id": 11,
            "text": "(2) The 'no' bloc \"may be surprised to learn that they all hate old people and children, or whatever evil it is Democrat Budget Deniers are allegedly guilty of today.\""
        },
        {
            "id": 12,
            "text": "Indeed."
        },
        {
            "id": 13,
            "text": "Stay tuned for updates on Paul Ryan's latest \"Path to Prosperity.\""
        },
        {
            "id": 14,
            "text": "The full floor debate and roll call votes are available on C-SPAN..."
        }
    ]
}