{
    "title": "CDC is 'prepared to work with every school district' for safe reopenings, director says in coronavirus briefing",
    "text": [
        {
            "id": 0,
            "text": "Centers for Disease Control and Prevention Director Robert Redfield on Wednesday said the agency is “prepared to work with every school district” to create a safe reopening this fall for students amid the coronavirus pandemic."
        },
        {
            "id": 1,
            "text": "During the White House Coronavirus Task Force briefing on Wednesday, Redfield said the CDC has outlined \"a number of strategies” for schools across the country to use while reimagining the 2020-2021 school year amid COVID-19."
        },
        {
            "id": 2,
            "text": "TRUMP SAYS HE DISAGREES WITH CDC GUIDELINES TO REOPEN SCHOOLS, CALLS THEM 'IMPRACTICAL'"
        },
        {
            "id": 3,
            "text": "“We are prepared to work with each school jurisdiction to help them use the different strategies we proposed, and use them safely to come up with an optimal strategy for their school,” Redfield explained."
        },
        {
            "id": 4,
            "text": "“It would be personally disappointing to me if we saw individuals using those guidelines as a rationale for not reopening schools.”"
        },
        {
            "id": 5,
            "text": "Redfield added that schools and children are typically “an instrument of transmission with influenza” but noted that the agency does “not have evidence children are driving the transmission cycle” with the novel coronavirus."
        },
        {
            "id": 6,
            "text": "“We’re prepared to work with every school, every district to find the right mixture of strategies to do this safely,” Redfield said."
        },
        {
            "id": 7,
            "text": "“Our recommendations are not prescriptive…there are lots of different options.”"
        },
        {
            "id": 8,
            "text": "Redfield’s comments come after President Trump, early Wednesday, said he disagreed with the CDC’s recommendations, calling them “very tough & expensive” and “impractical.”"
        },
        {
            "id": 9,
            "text": "Vice President Pence, on Wednesday, explained that the president’s comments simply were to underscore Redfield’s—that “we don’t want guidance from the CDC to be a reason for schools not to reopen.”"
        },
        {
            "id": 10,
            "text": "TRUMP VOWS 'PRESSURE' ON GOVERNOR TO REOPEN SCHOOLS IN THE FALL"
        },
        {
            "id": 11,
            "text": "“We want to partner with states to find a way to meet their needs,” Pence said."
        },
        {
            "id": 12,
            "text": "“I think the president’s statement this morning was reflective of that desire.”"
        },
        {
            "id": 13,
            "text": "Pence added that the administration is “confident,” and noted that states are beginning to publish plans for reopening."
        },
        {
            "id": 14,
            "text": "“We reiterated to governors this week that we’re here to partner with them,” Pence continued."
        },
        {
            "id": 15,
            "text": "“I think the president was saying that, if there are aspects of the CDC guidelines that are prescriptive or serve as a barrier to kids getting back to school, we want governors and education officials to know we want to work with them to support their [efforts to reopen.]”"
        },
        {
            "id": 16,
            "text": "Pence also addressed Trump’s threats this week to cut funding for schools, noting that he is simply pushing to “get kids back to school because that’s where they belong.”"
        },
        {
            "id": 17,
            "text": "“We know based on what our best health officials tell us that we can do that in a safe and responsible way,” Pence said."
        },
        {
            "id": 18,
            "text": "“The president is just very serious."
        },
        {
            "id": 19,
            "text": "He believes and we believe that it is absolutely essential for our children’s academic, social and emotional and nutritional needs to be back in the classroom and we’re going to provide leadership from the federal level to do that.”"
        },
        {
            "id": 20,
            "text": "BIDEN 'OF COURSE' WANTS SCHOOLS TO REOPEN IN THE FALL, CAMPAIGN SAYS IT MUST BE DONE 'SAFELY'"
        },
        {
            "id": 21,
            "text": "He added: “I sense a great desire among governors around the country to find a way forward and we made it very clear to them we’re going to partner with them and give them the resources.”"
        },
        {
            "id": 22,
            "text": "Meanwhile, Pence also noted that the administration is “encouraged” by the mortality numbers, noting that “the average fatality rate continues to be low and steady.”"
        },
        {
            "id": 23,
            "text": "Pence said that the mortality rate this week is “90 percent lower than at the height of the pandemic.”"
        },
        {
            "id": 24,
            "text": "“We pledge to work 24 hours a day to continue to keep our losses low,” Pence said."
        },
        {
            "id": 25,
            "text": "As of Wednesday, the United States reported more than 3 million positive cases of the novel coronavirus and more than 131,000 deaths."
        }
    ]
}