{
    "title": "Johnson asks DOJ watchdog to investigate Mueller team phones over erased information",
    "text": [
        {
            "id": 0,
            "text": "Sen. Ron Johnson (R-Wis.), the chair of the Senate Homeland Security Committee, is asking the Justice Department inspector general to investigate new documents that indicate members of former special counsel Robert Mueller’s team erased some records from their official phones."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "\"These reports are troubling and raise concerns about record retention and transparency,\" Johnson wrote in a letter to Department of Justice (DOJ) inspector general Michael Horowitz. \""
        },
        {
            "id": 4,
            "text": "Therefore, I respectfully request that your office open an investigation into this matter to determine what, why, and how information was wiped, whether any wrongdoing occurred, and who these devices belonged to.\""
        },
        {
            "id": 5,
            "text": "The letter comes after documents released by the Justice Department this week say information was scrubbed from at least 15 phones."
        },
        {
            "id": 6,
            "text": "The records cited forgotten passwords, physical damage to the phones and hardware issues to explain the erasures."
        },
        {
            "id": 7,
            "text": "Besides requesting that Horowitz open an investigation into the documents, Johnson is also asking for answers to a number of questions, including when the DOJ was made aware of the issue and if the inspector general has the ability to retrieve the information from the phones."
        },
        {
            "id": 8,
            "text": "He’s asking for answers to his questions by Sept. 18."
        },
        {
            "id": 9,
            "text": "Johnson is also winding down a related probe into the FBI's investigation into the Trump campaign's contact with Russians in 2016, an inquiry that ultimately transformed into Mueller’s probe."
        },
        {
            "id": 10,
            "text": "Sen. Chuck Grassley (R-Iowa), chair of the Senate Finance Committee, has also sent a letter to the FBI and DOJ asking about the wiped phones."
        }
    ]
}