{
    "title": "US official claims pressure to downplay intelligence reports",
    "text": [
        {
            "id": 0,
            "text": "An intelligence analyst at the US Department of Homeland Security (DHS) has said he was put under pressure to downplay the threat of Russian interference in the 3 November election as it \"made the president look bad\"."
        },
        {
            "id": 1,
            "text": "In a whistleblower complaint, Brian Murphy said he had been demoted for refusing to alter reports on this and other issues such as white supremacy."
        },
        {
            "id": 2,
            "text": "The directives were illegal, he said."
        },
        {
            "id": 3,
            "text": "The White House and DHS have both denied the allegations."
        },
        {
            "id": 4,
            "text": "US intelligence agencies concluded that Russia had interfered in the 2016 election but President Donald Trump has rejected allegations that his election victory was influenced by Russia, at times questioning findings from his own agencies."
        },
        {
            "id": 5,
            "text": "An inquiry led by former FBI director Robert Mueller found no evidence of a criminal conspiracy between Mr Trump's 2016 presidential campaign team and Moscow."
        },
        {
            "id": 6,
            "text": "Mr Murphy's complaint was released by the Democrat-led House Intelligence Committee, which has asked Mr Murphy to testify to Congress later in the month."
        },
        {
            "id": 7,
            "text": "The whistleblower reprisal complaint, filed on Tuesday, sets out a number of allegations against former Homeland Security Secretary Kirstjen Nielsen, current Acting Secretary Chad Wolf and his deputy, Ken Cuccinelli."
        },
        {
            "id": 8,
            "text": "Mr Murphy says that, between March 2018 and August 2020, there was a \"repeated pattern of abuse of authority, attempted censorship of intelligence analysis and improper administration of an intelligence program related to Russian efforts to influence and undermine United States interests\"."
        },
        {
            "id": 9,
            "text": "He says he was instructed by Mr Wolf in mid-May to \"cease providing intelligence assessments on the threat of Russian interference... and instead start reporting on interference activities by China and Iran\"."
        },
        {
            "id": 10,
            "text": "These instructions came directly from White House National Security Adviser Robert O'Brien, the complaint says."
        },
        {
            "id": 11,
            "text": "Mr Murphy refused to comply \"as doing so would put the country in substantial and specific danger\" but, in July, he was told the intelligence report should be \"held\" because it \"made the president look bad\"."
        },
        {
            "id": 12,
            "text": "The complaint says Mr Murphy was then removed from future meetings and effectively demoted."
        },
        {
            "id": 13,
            "text": "He is seeking to be reinstated as principal deputy undersecretary in the Office of Intelligence and Analysis."
        },
        {
            "id": 14,
            "text": "Mr Murphy says he was under pressure from the White House to exaggerate the number of migrants with links to terrorism at a time when the administration was implementing tougher measures to halt the flow of undocumented migrants reaching the US-Mexico border, and making the case for a wall."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "\"[Mr Murphy] declined to censor or manipulate the intelligence information,\" the complaint says."
        },
        {
            "id": 17,
            "text": "The complaint also alleges that former Secretary Nielsen knowingly provided \"false material information\" about known or suspected terrorists apprehended at the border during testimony before two House committees, in December 2018 and March 2019."
        },
        {
            "id": 18,
            "text": "He said Ms Nielsen's testimony in March 2019 had included an inflated number and \"constituted a knowing and deliberate submission of false material information\"."
        },
        {
            "id": 19,
            "text": "Ms Nielsen resigned from the post a month later, following complaints from Mr Trump that she was not tough enough on immigration."
        },
        {
            "id": 20,
            "text": "The complaint also details a clash with Mr Cuccinelli over a report in May into the threat posed by white supremacist groups, alleging that Mr Cuccinelli had ordered changes \"in a manner that made the threat appear less severe\"."
        },
        {
            "id": 21,
            "text": "Mr Murphy was also allegedly directed by both Mr Wolf and Mr Cuccinelli to \"modify intelligence assessments\" on left-wing groups such as antifa \"to ensure they matched up with the public comments by President Trump\"."
        },
        {
            "id": 22,
            "text": "Mr Trump has frequently blamed antifa - short for \"anti-fascist\", a loosely affiliated network of mainly far-left activists - for much of the violence that broke out across the US during protests following the death of George Floyd in police custody in May."
        },
        {
            "id": 23,
            "text": "White House spokeswoman Sarah Matthews said: \"Ambassador O'Brien has never sought to dictate the Intelligence Community's focus on threats to the integrity of our elections or on any other topic; any contrary suggestion by a disgruntled former employee, who he has never met or heard of, is false and defamatory.\""
        },
        {
            "id": 24,
            "text": "The Department of Homeland Security also rejected the allegations, with spokesperson Alexei Woltornist saying: \"We flatly deny that there is any truth to the merits of Mr Murphy's claim.\""
        },
        {
            "id": 25,
            "text": "But Adam Schiff, the Democratic Chairman of the House Intelligence Committee, said: \"We will get to the bottom of this, expose any and all misconduct or corruption to the American people, and put a stop to the politicization of intelligence.\""
        }
    ]
}