{
    "title": "Donald Trump goes after Hillary Clinton on guns",
    "text": [
        {
            "id": 0,
            "text": "US Republican presidential nominee Donald Trump speaks during rally at the Atkinson Country Club in Atkinson, New Hampshire on November 4, 2016."
        },
        {
            "id": 1,
            "text": "Members of the Secret Service rush Republican presidential candidate Donald Trump off the stage at a campaign rally in Reno, Nev., on Saturday, Nov. 5, 2016."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "Trump vs. the tape on Obama and the protester"
        },
        {
            "id": 4,
            "text": "LYNDEN, WA - MAY 07: Republican presidential candidate Donald Trump gives a speech during a rally at the The Northwest Washington Fair and Event Center on May 7, 2016 in Lynden, Washington."
        },
        {
            "id": 5,
            "text": "Trump became the Republican presumptive nominee following his landslide win in Indiana on Tuesday."
        },
        {
            "id": 6,
            "text": "Former Democratic US Presidential candidate Hillary Clinton speaks to staff and supporters at the New Yorker hotel after her defeat in the presidential election November 9, 2016 in New York."
        },
        {
            "id": 7,
            "text": "Green Party presidential nominee Jill Stein waits to be introduced prior to a press conference at the National Press Club August 23, 2016 in Washington, DC."
        },
        {
            "id": 8,
            "text": "Donald Trump to NRA: I will not let you down"
        },
        {
            "id": 9,
            "text": "Story highlights Trump dove right into attacking Hillary Clinton"
        },
        {
            "id": 10,
            "text": "He said the Democratic presidential front-runner wants to 'abolish' the 2nd Amendment"
        },
        {
            "id": 11,
            "text": "Donald Trump on Friday told the National Rifle Association that Hillary Clinton would take away the right to bear arms – a position the Democratic front-runner has never taken and immediately denounced."
        },
        {
            "id": 12,
            "text": "Moments after the gun group endorsed Trump, the presumptive GOP nominee dove right into attacking Clinton, saying she “wants to abolish the Second Amendment.”"
        },
        {
            "id": 13,
            "text": "“We’re not going to let that happen,” Trump said."
        },
        {
            "id": 14,
            "text": "“We’re going to preserve it, we’re going to cherish it.”"
        },
        {
            "id": 15,
            "text": "Clinton, who swiftly rebutted Trump’s remarks, has called for universal background checks and stricter controls on firearms, but has never called for the abolition of the 2nd Amendment."
        },
        {
            "id": 16,
            "text": "In fact, on her website, she calls gun ownership “part of the fabric of many law-abiding communities.”"
        },
        {
            "id": 17,
            "text": "Trump’s claim reiterated a statement he made earlier in the month, though on Friday, he suggested that Clinton would take away gun rights via the Supreme Court."
        },
        {
            "id": 18,
            "text": "“If she gets to appoint her judges, she will abolish the Second Amendment,” Trump told an enthusiastic crowd."
        },
        {
            "id": 19,
            "text": "“In my opinion, that’s what she’s going to go for.”"
        },
        {
            "id": 20,
            "text": "She quickly responded to Trump’s speech on Twitter."
        },
        {
            "id": 21,
            "text": "“You’re wrong, @realDonaldTrump."
        },
        {
            "id": 22,
            "text": "We can uphold Second Amendment rights while preventing senseless gun violence,” she tweeted."
        },
        {
            "id": 23,
            "text": "You're wrong, @realDonaldTrump."
        },
        {
            "id": 24,
            "text": "We can uphold Second Amendment rights while preventing senseless gun violence. pic.twitter.com/G7g1AdZWCA — Hillary Clinton (@HillaryClinton) May 20, 2016"
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": "Trump hammered home his argument that gun rights are critical to fighting terrorism – raising the specter of recent terrorist attacks – but spent most of his speech sharpening his attacks on Clinton."
        },
        {
            "id": 28,
            "text": "He even referenced Clinton’s advantage with women voters, arguing that Clinton is telling “every woman that she doesn’t have the right to defend herself” with a firearm."
        },
        {
            "id": 29,
            "text": "“That is so unfair and that is so egregious"
        },
        {
            "id": 30,
            "text": "and I’ll tell you what, my poll numbers with women are starting to go up,” he said."
        },
        {
            "id": 31,
            "text": "Trump also accused Clinton and her husband, former President Bill Clinton, of being hypocritical for having armed Secret Service agents around them while calling for stricter gun control measures, and called on the Clintons to “let their bodyguards immediately disarm.”"
        },
        {
            "id": 32,
            "text": "Trump on Friday was addressing thousands of NRA members gathered here after the group’s CEO, Wayne LaPierre, and the group’s chief lobbyist, Chris Cox, energized the crowd by bashing Clinton and urging Republicans to “get over” their sore feelings about the primary process and unite around the presumptive Republican nominee."
        },
        {
            "id": 33,
            "text": "LaPierre and Cox both argued that the “Second Amendment is on the ballot in November,” a position that Trump also took in his speech."
        },
        {
            "id": 34,
            "text": "While Trump presented himself as a fierce defender of the Second Amendment on Friday, the New York billionaire has not always been such a staunch advocate of the right to bear arms."
        },
        {
            "id": 35,
            "text": "In his 2000 book, “The America We Deserve,” Trump wrote that he supported a ban on assault weapons and argued in favor of a longer waiting period to purchase a gun – both positions the NRA ardently opposes."
        },
        {
            "id": 36,
            "text": "Supreme Court at stake, Trump says"
        },
        {
            "id": 37,
            "text": "Trump, who days earlier released a list of his potential Supreme Court nominees, called on Clinton to do the same, saying the Democrat’s list would be “night and day” from his."
        },
        {
            "id": 38,
            "text": "The real estate magnate called the next president’s ability to appoint at least one Supreme Court justice “one of the biggest and most important reasons to win this time.”"
        },
        {
            "id": 39,
            "text": "Trump’s surrogates at the NRA meeting made the same case in interviews with CNN."
        },
        {
            "id": 40,
            "text": "Sen. Jeff Sessions, the Alabama Republican who heads up Trump’s group of national security advisers, and former Texas Gov. Rick Perry, who ran against Trump in the GOP primary, argued that the appointment of a liberal justice to the Supreme Court could endanger gun rights in America."
        },
        {
            "id": 41,
            "text": "“The Second Amendment is something that’s in jeopardy in this election cycle,” Perry said."
        },
        {
            "id": 42,
            "text": "“I tell people, I say listen, you can argue this thing, you can have a discussion about how many angels can dance at the head of a pin, but at end of the day, you really better keep this simple: Hillary Clinton, Donald Trump, Supreme Court appointment …"
        },
        {
            "id": 43,
            "text": "If you’re a Second Amendment person or anyone who loves the Constitution, Donald Trump’s your man.”"
        },
        {
            "id": 44,
            "text": "Sessions suggested that Trump’s claim that Clinton wants to abolish the Second Amendment was more than just hyperbole, saying “in essence” Clinton would accomplish that by appointing a justice who would reverse the Heller decision."
        },
        {
            "id": 45,
            "text": "In a statement shortly after the group announced its endorsement of Trump, Cox said “the stakes in this year’s presidential election could not be higher for gun owners.”"
        },
        {
            "id": 46,
            "text": "“If Hillary Clinton gets the opportunity to replace Antonin Scalia with an anti-gun Supreme Court justice, we will lose the individual right to keep a gun in the home for self-defense,” Cox said."
        },
        {
            "id": 47,
            "text": "“Mrs. Clinton has said that the Supreme Court got it wrong on the Second Amendment."
        },
        {
            "id": 48,
            "text": "So the choice for gun owners in this election is clear."
        },
        {
            "id": 49,
            "text": "And that choice is Donald Trump.”"
        }
    ]
}