{
    "title": "Heather Nauert, Trump’s pick for U.S. ambassador to the United Nations, withdraws from consideration",
    "text": [
        {
            "id": 0,
            "text": "President Trump’s pick to be the next United Nations ambassador withdrew from consideration Saturday, the State Department said."
        },
        {
            "id": 1,
            "text": "Trump to nominate State Department spokeswoman Heather Nauert as the next U.N. ambassador"
        },
        {
            "id": 2,
            "text": "The withdrawal is related to the employment of a nanny who was in the country illegally, said three people who spoke on the condition of anonymity to discuss the matter soon after Nauert announced her withdrawal."
        },
        {
            "id": 3,
            "text": "But according to a person familiar with Nauert’s situation, the nanny was in the country legally."
        },
        {
            "id": 4,
            "text": "She was a Jamaican national employed by Nauert and her husband 10 years ago."
        },
        {
            "id": 5,
            "text": "Nauert and her husband paid her salary in cash."
        },
        {
            "id": 6,
            "text": "When they discovered she was not paying taxes, they insisted the tax bill be paid, the person said."
        },
        {
            "id": 7,
            "text": "One current and one former U.S. official also familiar with the nomination said that the nanny was in the country legally but was not authorized to work under the visa she held."
        },
        {
            "id": 8,
            "text": "The nanny, whom those speaking on Nauert’s behalf declined to identify by name, is now a U.S. citizen, a U.S. official said."
        },
        {
            "id": 9,
            "text": "Nauert flagged the nanny situation to Diplomatic Security at the outset of the vetting process, and was assured it would not be a sufficient matter to derail her confirmation, said the person, who spoke on the condition of anonymity to discuss the matter."
        },
        {
            "id": 10,
            "text": "Nauert, a former Fox News journalist, served as State Department spokes­­­woman during the tenure of Rex Tillerson, who was forced out last year, and for Secretary of State Mike Pompeo."
        },
        {
            "id": 11,
            "text": "“I am grateful to President Trump and Secretary Pompeo for the trust they placed in me for considering me for the position of U.S. Ambassador to the United Nations,” Nauert said in the release."
        },
        {
            "id": 12,
            "text": "“However, the past two months have been grueling for my family and therefore it is in the best interest of my family that I withdraw my name from consideration,” she said, an apparent reference to the lag in submitting her formal nomination and opposition by some senators to her nomination."
        },
        {
            "id": 13,
            "text": "“Serving in the Administration for the past two years has been one of the highest honors of my life and I will always be grateful to the President, the Secretary, and my colleagues at the State Department for their support,” Nauert said."
        },
        {
            "id": 14,
            "text": "Nauert’s husband and children had remained in New York while she served in Washington."
        },
        {
            "id": 15,
            "text": "It is unclear if she will return as spokeswoman."
        },
        {
            "id": 16,
            "text": "Heather Nauert once cited D-Day in ‘long history’ of U.S.-German relations."
        },
        {
            "id": 17,
            "text": "Now she’s headed to the U.N."
        },
        {
            "id": 18,
            "text": "In the same statement, Pompeo praised Nauert for “unequalled excellence.”"
        },
        {
            "id": 19,
            "text": "“Her personal decision today to withdraw her name from consideration to become the nominee for United States Ambassador to the United Nations is a decision for which I have great respect,” he said."
        },
        {
            "id": 20,
            "text": ""
        }
    ]
}