{
    "title": "'Too bad!': Trump responds to reports of a burglary at Rep. Elijah Cummings' Baltimore home",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON – President Donald Trump took to Twitter on Friday to call attention to a break-in at the home of a Baltimore congressman he has been sharply criticizing for days."
        },
        {
            "id": 1,
            "text": "Trump was referring to reports in Baltimore media that police are investigating a burglary at Rep. Elijah Cummings’ home in West Baltimore that took place on Saturday."
        },
        {
            "id": 2,
            "text": "“Really bad news!"
        },
        {
            "id": 3,
            "text": "The Baltimore house of Elijah Cummings was robbed,” Trump tweeted on Friday."
        },
        {
            "id": 4,
            "text": "“Too bad!”"
        },
        {
            "id": 5,
            "text": "The tweet, which could be read as rubbing it in, drew fire from a Trump ally."
        },
        {
            "id": 6,
            "text": "\"This is so unnecessary,\" former U.N. Ambassador Nikki Haley tweeted in response to Trump."
        },
        {
            "id": 7,
            "text": "Cummings confirmed the incident on Friday, saying the would-be intruder left his home after he yelled."
        },
        {
            "id": 8,
            "text": "“I was notified of the intrusion by my security system, and I scared the intruder away by yelling before the person gained entry into the residential portion of the house,\" Cumming said in a statement."
        },
        {
            "id": 9,
            "text": "\"I thank the Baltimore Police Department for their response and ask that all further inquiries be directed to them.”"
        },
        {
            "id": 10,
            "text": "Trump has been blasting Cummings and his hometown for days."
        },
        {
            "id": 11,
            "text": "The broadsides began with a tweet on Saturday in which he described Cummings’ district as a \"rat and rodent infested mess.\""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}