{
    "title": "Fort Lauderdale shooting suspect ‘lost his mind’ in Iraq, family says",
    "text": [
        {
            "id": 0,
            "text": "The suspected gunman in an airport shooting rampage in Fort Lauderdale, Fla. — Esteban Santiago, 26, an Iraq War veteran — has been charged with federal crimes and could face the death penalty, the Justice Department announced Saturday night."
        },
        {
            "id": 1,
            "text": "Investigators said Saturday that Santiago drew frequent police attention for domestic violence in his Alaska home town and twice was arrested within the last year."
        },
        {
            "id": 2,
            "text": "Two months before the shooting, they said, he was admitted to a mental-health facility after showing up at an FBI field office and telling agents his mind was being controlled, complaining that the government was forcing him to watch Islamic State videos."
        },
        {
            "id": 3,
            "text": "Police held his gun for a month, and then gave it back to him, authorities said."
        },
        {
            "id": 4,
            "text": "Those sporadic run-ins now raise questions about how Santiago evaded detection as he boarded two flights — checking in a weapon — before he landed at the Fort Lauderdale-Hollywood International Airport and allegedly fired at unsuspecting travelers."
        },
        {
            "id": 5,
            "text": "Investigators said they were still trying to determine if there was a terrorism motive."
        },
        {
            "id": 6,
            "text": "A day after the shooting, agents had interviewed more than 100 people, including Santiago, who surrendered after firing all of his ammunition by dropping onto the floor, spread-eagle, near a baggage area when a sheriff’s deputy approached him, according to an FBI affidavit."
        },
        {
            "id": 7,
            "text": "Investigators are scouring Santiago’s electronics and digital media, said a law enforcement official familiar with the case who spoke on the condition of anonymity, trying to determine whether he had any real contact with Islamic State sympathizers and whether that motivated him to carry out the shooting."
        },
        {
            "id": 8,
            "text": "“We have not ruled out anything,” George L. Piro, the FBI special agent in charge of the bureau’s Miami division, said Saturday morning at a briefing."
        },
        {
            "id": 9,
            "text": "“We continue to look at all avenues, all motives for this attack."
        },
        {
            "id": 10,
            "text": "And we continue to look at the terrorism aspect as a motive.”"
        },
        {
            "id": 11,
            "text": "The bloody rampage sent people scrambling through the terminals and across the airfield at one of the country’s busiest airports, shutting down all flights for hours as paramedics and federal and local law enforcement officers flooded the scene."
        },
        {
            "id": 12,
            "text": "Six were injured in the shooting, and dozens more were hurt in the chaos that followed."
        },
        {
            "id": 13,
            "text": "Santiago was placed in federal custody Saturday morning following a lengthy interview by Broward County Sheriff’s deputies and FBI agents."
        },
        {
            "id": 14,
            "text": "The federal charges against him are: performing an act of violence against a person at an airport serving international civil aviation that caused serious bodily injury; using and carrying a firearm during and in relation to a crime of violence; and causing the death of a person through the use of a firearm."
        },
        {
            "id": 15,
            "text": "U.S. airports urge vigilance in aftermath of shooting at Fort Lauderdale airport"
        },
        {
            "id": 16,
            "text": "The FBI is leading a sprawling investigation that spans from Florida to Alaska."
        },
        {
            "id": 17,
            "text": "Names of the victims have not yet been released, because not all families have been notified."
        },
        {
            "id": 18,
            "text": "The Associated Press reported that at least four of the five were vacationers picking up their bags before going to board cruise ships."
        },
        {
            "id": 19,
            "text": "Santiago is believed to have lived most recently in Anchorage with a girlfriend and a young child."
        },
        {
            "id": 20,
            "text": "Neighbors said two other children also lived at the house."
        },
        {
            "id": 21,
            "text": "Local police and FBI officials in a Saturday news conference described his life as chaotic, with frequent police run-ins."
        },
        {
            "id": 22,
            "text": "At least four times in 2016, police were called to Santiago’s house for physical disturbances or domestic violence."
        },
        {
            "id": 23,
            "text": "It is unclear who made those calls."
        },
        {
            "id": 24,
            "text": "In one case, he appears to have taken a plea deal and, in exchange for compliance with its terms, the charges were dismissed."
        },
        {
            "id": 25,
            "text": "When he showed up in November at the local FBI office, he had a newborn and a weapon in the car, said Anchorage police chief Chris Tolley."
        },
        {
            "id": 26,
            "text": "But in an interview at the time with the FBI, Santiago stated that “he did not wish to harm anyone,” said Marlin Ritzman, special agent in charge of the FBI Anchorage field office."
        },
        {
            "id": 27,
            "text": "“Our agents contacted local authorities who took custody of Mr. Santiago and transported him to a local mental-health facility for evaluation,” Ritzman said."
        },
        {
            "id": 28,
            "text": "The FBI interviewed his family members, conducted database reviews and interagency checks, and ultimately closed what it termed an “assessment” of Santiago."
        },
        {
            "id": 29,
            "text": "Santiago’s weapon was logged “for safekeeping,” Tolley said."
        },
        {
            "id": 30,
            "text": "But one month later, the weapon was released to him."
        },
        {
            "id": 31,
            "text": "Santiago arrived in Fort Lauderdale on Friday after flying from Anchorage, with a layover in Minneapolis."
        },
        {
            "id": 32,
            "text": "He traveled alone and checked a single bag — one that contained his firearm, said Jesse Davis, chief of police at Ted Stevens Anchorage International Airport, where passengers routinely check their weapons."
        },
        {
            "id": 33,
            "text": "“We’re a big hunting state, so we get quite a lot of that,” Davis said."
        },
        {
            "id": 34,
            "text": "Travelers are allowed to bring firearms with them onto flights as long as the guns are unloaded, locked in a hard-sided container and in checked baggage, according to the Transportation Security Administration."
        },
        {
            "id": 35,
            "text": "Ammunition can be brought onto flights but also must be placed in checked baggage."
        },
        {
            "id": 36,
            "text": "“Everything appeared normal,” Davis said."
        },
        {
            "id": 37,
            "text": "Santiago checked in for his Delta flight more than four hours early, which was unusual, Davis said, but “didn’t call attention to himself at all.”"
        },
        {
            "id": 38,
            "text": "In Fort Lauderdale, at the Terminal 2 baggage claim, Santiago picked up his bag from the carousel, went to the bathroom and loaded his Walther 9mm semiautomatic handgun, federal officials said."
        },
        {
            "id": 39,
            "text": "When he came out, he began firing, shooting the first people he encountered, according to an FBI affidavit."
        },
        {
            "id": 40,
            "text": "‘There was a trail of blood’:"
        },
        {
            "id": 41,
            "text": "Ari Fleischer was nearly caught in the Fort Lauderdale shooting"
        },
        {
            "id": 42,
            "text": "Mario Andrade, a driver from Carey Limousine, was waiting for his customer, Ari Fleischer, who was White House press secretary under President George W. Bush, near the bottom of the escalator in the Delta baggage area of Terminal 2."
        },
        {
            "id": 43,
            "text": "He was holding a sign with Fleischer’s last name and talking on the phone with another driver."
        },
        {
            "id": 44,
            "text": "Fleischer’s 12:15 p.m. flight was late and it was nearly 1 p.m."
        },
        {
            "id": 45,
            "text": "Then, Andrade heard gunfire."
        },
        {
            "id": 46,
            "text": "“It was very fast, like tat-tat-tat-tat-tat-tat,” Andrade said."
        },
        {
            "id": 47,
            "text": "“I said, ‘Oh my God, someone is shooting!’ ”"
        },
        {
            "id": 48,
            "text": "He said that he immediately dropped to the floor, people were running and he heard screaming all around him."
        },
        {
            "id": 49,
            "text": "Andrade said he looked up and saw a man in a blue shirt who had a gun in his hand."
        },
        {
            "id": 50,
            "text": "The gunman, he said, began walking slowly toward him and had a “surprised look” on his face, “like, Oh my God, what happened?’ ”"
        },
        {
            "id": 51,
            "text": "Relatives told news outlets that Santiago had a history of mental-health problems, including some that followed his military service in Iraq with the Puerto Rico National Guard."
        },
        {
            "id": 52,
            "text": "“Only thing I could tell you was when he came out of Iraq, he wasn’t feeling too good,” his uncle, Hernan Rivera, told Newark’s Star-Ledger newspaper."
        },
        {
            "id": 53,
            "text": "His aunt told the newspaper he was hospitalized after returning from Iraq."
        },
        {
            "id": 54,
            "text": "“He lost his mind,” Ruiz Rivera said in Spanish."
        },
        {
            "id": 55,
            "text": "He had seemed to get the help he needed, and became a father in September, she told Noticias Telemundo."
        },
        {
            "id": 56,
            "text": "But his mental health-issues, she said, worsened in December."
        },
        {
            "id": 57,
            "text": "“They took him to the hospital, but they didn’t tell me what for, but they had him in an isolated room because he was a little wrong in the head and he started to like hear things,” she said."
        },
        {
            "id": 58,
            "text": "The airport reopened Saturday morning for flights, officials said, though they warned that some flights were canceled or rerouted in the wake of Friday’s violence."
        },
        {
            "id": 59,
            "text": "Some travelers were also being directed other two major airports in Miami and West Palm Beach."
        },
        {
            "id": 60,
            "text": ""
        },
        {
            "id": 61,
            "text": ""
        }
    ]
}