{
    "title": "OPINION: Obama’s comparison of Crusades to Islamist terror acts misses mark",
    "text": [
        {
            "id": 0,
            "text": "President Obama put on his preaching clothes yesterday and drove up Connecticut Avenue to the Washington Hilton to deliver a sermon to the choir."
        },
        {
            "id": 1,
            "text": "He took his text from the first chapter of the Book of Moral Equivalence and let the choir have both barrels."
        },
        {
            "id": 2,
            "text": "He spoke from the pulpit of the National Prayer Breakfast, organized as an occasion of Christian congressmen six decades ago, and has evolved into an occasion for politicians to come together not so much to pray as to be seen praying."
        },
        {
            "id": 3,
            "text": "Such prayers are often lectures to heaven, attempts to straighten God out on what’s going on down here."
        },
        {
            "id": 4,
            "text": "Mr. Obama has so far been unable to talk very much about Islamic terrorism, or even to say the words “Islamic” and “terrorism” in the same sentence."
        },
        {
            "id": 5,
            "text": "Perhaps the prayer breakfast was the time and place he had been waiting for, to say what everyone in the world knows is true, that Islam, distorted or not, has been giving the world a royal pain in that certain private place, and should straighten up and fly right into the 21st century."
        },
        {
            "id": 6,
            "text": "Alas, no."
        },
        {
            "id": 7,
            "text": "If he wants an appropriate time and place, he’s still looking for it."
        },
        {
            "id": 8,
            "text": "His speechwriters gave him the usual things to say about religious freedom, the trite and true about how everybody should have the right to practice his faith however he chooses, to change his faith if he chooses, or to practice no faith at all if that’s what nourishes his soul, and no offense if he thinks he doesn’t have one."
        },
        {
            "id": 9,
            "text": "(The pronouns here are collective, including both male and female, but the president, who is politically correct to a considerable fault, avoids pronouns except the vertical one.)"
        },
        {
            "id": 10,
            "text": "He didn’t call out anyone by name, though the place in the world where someone risks keeping his head on his shoulders for changing his religious “faith” is neither Presbyterian nor Buddhist, Hindu nor Hottentot."
        },
        {
            "id": 11,
            "text": "So where are the places the fatwa is feared, where an imam can casually write a sentence of death for the faithful to carry out?"
        },
        {
            "id": 12,
            "text": "He didn’t say."
        },
        {
            "id": 13,
            "text": "He probably figured everyone already knows the answer to that one."
        },
        {
            "id": 14,
            "text": "How can people of faith, he asks, reconcile “the profound good, the strength, the tenacity, the compassion and love that can flow from all our faiths operate alongside those who seek to hijack religious [faith] for their own murderous ends?”"
        },
        {
            "id": 15,
            "text": "Humanity, he said, has been grappling with this puzzle throughout history, and just to make sure that everyone knows who he’s talking about, he called out offenders by name."
        },
        {
            "id": 16,
            "text": "“Lest we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ."
        },
        {
            "id": 17,
            "text": "In our home country, slavery and Jim Crow all too often was justified in the name of Christ.”"
        },
        {
            "id": 18,
            "text": "The president is correct, of course, that many bad things have been done by people who called themselves Christians."
        },
        {
            "id": 19,
            "text": "But they were not celebrated in the faith for the sin and the outrage, bur roundly rebuked: In the words of the ancient black spiritual, “everybody talkin’ ‘bout heaven ain’t goin’ there.”"
        },
        {
            "id": 20,
            "text": "If Mr. Obama wants to think Jim Crow was a Baptist deacon, he’s entitled, and rebuking the hubris of Christians, to challenge them to dismount from the high horse, is a useful thing to do."
        },
        {
            "id": 21,
            "text": "But given the widespread and well-founded suspicion that Mr. Obama is soft on those who, as he says, distort Islam to justify jihad, why did he choose a Christian prayer breakfast to equate the faith of most of his constituents to the barbarism of the cult whose proper name he cannot bring himself to say?"
        },
        {
            "id": 22,
            "text": "Intolerance is all about us, and confronting it is often difficult, and most Christians agree with the president that God compels the faithful to try."
        },
        {
            "id": 23,
            "text": "Mr. Obama’s prescription is a useful one, and maybe in a rare fit of introspection he was preaching not only to the choir but to himself."
        },
        {
            "id": 24,
            "text": "“First,” he said, “we should start with some basic humility."
        },
        {
            "id": 25,
            "text": "I believe that the starting point of faith is some doubt — not being so full of yourself and so confident that you are right and that God speaks only to us, and doesn’t speak to others, that somehow we alone are in possession of the truth.”"
        },
        {
            "id": 26,
            "text": "Strong words, and welcome words."
        },
        {
            "id": 27,
            "text": "We all need to hear them."
        },
        {
            "id": 28,
            "text": "But the president’s invoking the Crusades — the last Crusader left Europe for Jerusalem 700 years ago — sounds like something remembered from a radical mosque."
        },
        {
            "id": 29,
            "text": "He’s preaching tolerance to the wrong congregation."
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": ""
        },
        {
            "id": 32,
            "text": ""
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}