{
    "title": "‘Nationalist’: A president takes a mantle, then shows he means it",
    "text": [
        {
            "id": 0,
            "text": "Is a nationalist simply the opposite of a globalist?"
        },
        {
            "id": 1,
            "text": "Our reporter looks at the term’s various meanings, and what President Trump may be communicating when he uses it."
        },
        {
            "id": 2,
            "text": "Two weeks before a crucial midterm election, the US chief executive has embraced a term that can be benign or hateful depending on context and intent."
        },
        {
            "id": 3,
            "text": "“Nationalist” is not a tag President Trump has hung on himself before."
        },
        {
            "id": 4,
            "text": "It may be close in spirit to “America First” and other familiar slogans."
        },
        {
            "id": 5,
            "text": "But the president generally does not deal in “isms” and “ists” and other precise ideological suffixes."
        },
        {
            "id": 6,
            "text": "And it’s a word critics say has far-right echoes, a charge Mr. Trump appeared to implicitly acknowledge at the Houston rally Monday night at which he unfurled it."
        },
        {
            "id": 7,
            "text": "What’s changed?"
        },
        {
            "id": 8,
            "text": "The president’s final approach to the 2018 midterms seems rooted in an attempt to label Democrats as the party of “them” and the GOP as “us.”"
        },
        {
            "id": 9,
            "text": "His rhetorical approach on Monday deftly defined “nationalist” only as the opposite of unnamed “globalists” who put the fortunes of the whole world above those of America."
        },
        {
            "id": 10,
            "text": "And some observers say that fits with his focus on the alleged danger of a caravan of Central American immigrants moving slowly in the direction of the US-Mexican border from 1,000 miles away."
        },
        {
            "id": 11,
            "text": "At a rally in Houston on Monday night President Trump used a word he said he wasn’t supposed to utter."
        },
        {
            "id": 12,
            "text": "It was an old-fashioned sort of label, he said, one he would now gladly apply to himself."
        },
        {
            "id": 13,
            "text": "The designation?"
        },
        {
            "id": 14,
            "text": "“Nationalist,” Mr. Trump said."
        },
        {
            "id": 15,
            "text": "“Nothing wrong."
        },
        {
            "id": 16,
            "text": "Use that word."
        },
        {
            "id": 17,
            "text": "Use that word,” said the president, as the crowd cheered and began to chant, “USA, USA!”"
        },
        {
            "id": 18,
            "text": "Two weeks before a crucial midterm election, with control of both chambers of Congress possibly at stake, the incumbent US chief executive is suddenly using a descriptive term that can be benign or hateful, uniting or divisive, democratic or authoritarian, depending on its context and the intent of the speaker."
        },
        {
            "id": 19,
            "text": "Why We Wrote This Is a nationalist simply the opposite of a globalist?"
        },
        {
            "id": 20,
            "text": "Our reporter looks at the term’s various meanings, and what President Trump may be communicating when he uses it."
        },
        {
            "id": 21,
            "text": "“Nationalist,” per se, is not a tag Trump has much hung on himself before."
        },
        {
            "id": 22,
            "text": "It may be close in spirit to America First, Make America Great Again, and other familiar Trump slogans."
        },
        {
            "id": 23,
            "text": "But the president generally does not deal in “isms” and “ists” and other precise ideological suffixes."
        },
        {
            "id": 24,
            "text": "Trump instead ascribes his ideas to his own brain and instincts, as opposed to systems of thought dreamed up by others."
        },
        {
            "id": 25,
            "text": "Plus, “nationalism” is indeed dangerous."
        },
        {
            "id": 26,
            "text": "It’s a word critics say has far-right, even fascistic echoes, a charge Trump appeared to implicitly acknowledge Monday night."
        },
        {
            "id": 27,
            "text": "What’s changed?"
        },
        {
            "id": 28,
            "text": "With days before the vote, the president’s final approach to the 2018 midterms seems rooted in an attempt to label Democrats as the party of “them” and the GOP as “us.”"
        },
        {
            "id": 29,
            "text": "It fits with his focus on the alleged danger of a caravan of Central American immigrants moving slowly towards the US-Mexico border, 1,000 miles away."
        },
        {
            "id": 30,
            "text": "And Trump’s rhetorical approach on Monday deftly defined “nationalist” only as the opposite of unnamed “globalists” who put the fortunes of the whole world above those of America."
        },
        {
            "id": 31,
            "text": "Thus he can adopt the slogan without saying exactly what it means, says Jennifer Mercieca, a historian of American political rhetoric at Texas A&M University."
        },
        {
            "id": 32,
            "text": "“It’s very noteworthy that Trump used the word."
        },
        {
            "id": 33,
            "text": "It’s another data point in this democratic erosion, this democratic backsliding, that political scientists and historians are concerned about,” Dr. Mercieca says."
        },
        {
            "id": 34,
            "text": "Nationalist and nationalism are indeed slippery terms."
        },
        {
            "id": 35,
            "text": "At their most basic they describe those who want independence for their own nation – Scottish nationalists want to split from the United Kingdom, for instance."
        },
        {
            "id": 36,
            "text": "The next level of definition includes a national consciousness that places one nation above all others and puts an emphasis on promotion of its culture and interests as opposed to the culture and interests of other countries."
        },
        {
            "id": 37,
            "text": "Nationalism can be a positive, even essential force in modern democracies, according to some analysts."
        },
        {
            "id": 38,
            "text": "The perception of a common national identity is important for unity in countries that depend on the willingness of citizens to pay taxes to support other citizens who they will never encounter, according to John Judis, an author and journalist who has written for Talking Points Memo and The New Republic."
        },
        {
            "id": 39,
            "text": "The supranational initiatives of globalism, such as free trade, floating exchange rates, and the expansion of NATO, have been positive forces in the world, wrote Mr. Judis in an October opinion piece in The New York Times."
        },
        {
            "id": 40,
            "text": "But they have not really delivered as promised."
        },
        {
            "id": 41,
            "text": "The world economy is not downturn-proof, as the Great Recession painfully showed."
        },
        {
            "id": 42,
            "text": "Income growth for all but the top 1 percent remains sluggish."
        },
        {
            "id": 43,
            "text": "Rising immigration brings about a clash of cultures, as it has in centuries past."
        },
        {
            "id": 44,
            "text": "The result: the base of support for Trump and far-right populist politicians of Europe."
        },
        {
            "id": 45,
            "text": "“To achieve their historic objectives, liberals and social democrats will have to respond constructively to, rather than dismiss, the nationalist reaction to globalization,” wrote Judis in October."
        },
        {
            "id": 46,
            "text": "But “state” and “nation” aren’t interchangeable terms."
        },
        {
            "id": 47,
            "text": "The former is a place unified under a government with citizenship and taxes."
        },
        {
            "id": 48,
            "text": "The latter is a place with a common culture, history, and language."
        },
        {
            "id": 49,
            "text": "That easily slides into separatist and racial or ethnic divisions."
        },
        {
            "id": 50,
            "text": "For these and other reasons George Orwell took a dim view of nationalism."
        },
        {
            "id": 51,
            "text": "The author of “Animal Farm” and “1984” wrote that it was in part “the habit of assuming that human beings can be classified like insects.”"
        },
        {
            "id": 52,
            "text": "Patriotism was fine, according to Orwell, and was nothing but devotion to a particular place and way of life, with no wish to force it on somebody else."
        },
        {
            "id": 53,
            "text": "But nationalism was different and more dangerous."
        },
        {
            "id": 54,
            "text": "He said that it involved identifying oneself with a single nation or idea, “placing it beyond good and evil and recognizing no other duty than that of advancing its interests.”"
        },
        {
            "id": 55,
            "text": "On Tuesday, Trump reiterated his embrace of the term."
        },
        {
            "id": 56,
            "text": "“I’m proud of our country, and I am a nationalist,” he said while meeting with officials from Western states in the Oval Office."
        },
        {
            "id": 57,
            "text": "“It’s a word that hasn’t been used too much."
        },
        {
            "id": 58,
            "text": "People use it."
        },
        {
            "id": 59,
            "text": "But I’m very proud."
        },
        {
            "id": 60,
            "text": "I think it should be brought back,” the president added."
        },
        {
            "id": 61,
            "text": "“I’m somebody who wants to help other countries of the world."
        },
        {
            "id": 62,
            "text": "But I also have to take care of – we have to take care of our country."
        },
        {
            "id": 63,
            "text": "We cannot continue to allow ourselves to be duped on military and also duped on trade.”"
        },
        {
            "id": 64,
            "text": "In the United States and Europe today “nationalist” is a word that far-right and white nationalist groups use to define themselves."
        },
        {
            "id": 65,
            "text": "Mercieca of Texas A&M notes that fringe right media approved of Trump’s Monday speech."
        },
        {
            "id": 66,
            "text": "Alex Jones of Infowars loved it (“Unhinged leftists triggered after POTUS denounces globalists” read the Infowars tag line.)"
        },
        {
            "id": 67,
            "text": "The Daily Stormer, a popular white nationalist publication, said that in using “nationalist” Trump had moved the nation’s Overton Window, changing what topics constitute acceptable political speech."
        },
        {
            "id": 68,
            "text": "(“He is pushing the edges of the limits,” the Stormer wrote.)"
        },
        {
            "id": 69,
            "text": "Yet Trump did not say what he believed in, so much as define himself by saying what he did not believe in, Mercieca notes."
        },
        {
            "id": 70,
            "text": "That allows for ambiguity, gives Trump deniability, and sets up flexibility for his future rhetoric."
        },
        {
            "id": 71,
            "text": "Globalists, who put the good of the world as a whole above the good of the US?"
        },
        {
            "id": 72,
            "text": "They don’t care about our country as much, Trump told rally-goers."
        },
        {
            "id": 73,
            "text": "“We can’t have that,” the president said."
        },
        {
            "id": 74,
            "text": "Get the Monitor"
        },
        {
            "id": 75,
            "text": "Stories you care about delivered to your inbox."
        },
        {
            "id": 76,
            "text": "Your email address By signing up, you agree to our Privacy Policy"
        },
        {
            "id": 77,
            "text": "That’s when “nationalist” appeared."
        },
        {
            "id": 78,
            "text": "Nothing wrong with using it, Trump said."
        },
        {
            "id": 79,
            "text": "“You know what I am?"
        },
        {
            "id": 80,
            "text": "I’m a nationalist, OK,” he said."
        },
        {
            "id": 81,
            "text": "It’s noteworthy the president used such a polarizing word, in a polarized time, with a polarized electorate approaching a polarized vote."
        },
        {
            "id": 82,
            "text": "It’s a word that he knew has a disreputable connotation for some, which is why he said, “we’re not supposed to use it.”"
        }
    ]
}