{
    "title": "Bipartisan Group of Senators Say They Reached Agreement on Infrastructure Plan",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON —"
        },
        {
            "id": 1,
            "text": "A bipartisan group of senators announced on Thursday that they had reached an agreement on a framework to invest in the nation’s aging public works system, racing to prove that a compromise was feasible despite deep divisions over how to structure and finance an infrastructure package."
        },
        {
            "id": 2,
            "text": "The announcement came after a dizzying day on Capitol Hill, where senators involved in the bipartisan discussions offered conflicting assessments of their progress and declined to comment on specific proposals."
        },
        {
            "id": 3,
            "text": "But by early evening, five Democrats and five Republicans issued a joint statement announcing an agreement that would be fully paid for, albeit without any specific details about funding."
        },
        {
            "id": 4,
            "text": "The framework is expected to include about $579 billion in new spending as part of an overall package that would cost about $974 billion over five years and about $1.2 trillion over eight years, according to two people familiar with the details, who disclosed them on the condition of anonymity."
        },
        {
            "id": 5,
            "text": "The outline is expected to address a narrower range of physical infrastructure projects and to avoid the Democratic push for tax increases; but it is also likely to suggest indexing the gas tax to inflation as one of the mechanisms for paying for the plan."
        },
        {
            "id": 6,
            "text": "“We are discussing our approach with our respective colleagues and the White House and remain optimistic that this can lay the groundwork to garner broad support from both parties and meet America’s infrastructure needs,” the group said in the statement."
        },
        {
            "id": 7,
            "text": "It was unclear when the 10 lawmakers would release details or legislative text."
        },
        {
            "id": 8,
            "text": "The preliminary agreement faces steep headwinds on Capitol Hill, where lawmakers and aides in both parties remain skeptical that the group can muster the 60 votes needed to overcome a filibuster in the Senate."
        },
        {
            "id": 9,
            "text": "At least 10 Republicans will need to join all 50 Democratic senators for any of the administration’s priorities to clear the chamber."
        },
        {
            "id": 10,
            "text": "Some Republicans remained frustrated that President Biden ended negotiations this week with Senator Shelley Moore Capito of West Virginia, the lead Republican negotiator on infrastructure, who put forward a series of narrower counterproposals."
        },
        {
            "id": 11,
            "text": "Liberal Democrats, for their part, are wary of losing an opportunity to enact key policy priorities, including a series of climate provisions and tax increases on wealthy corporations and individuals."
        },
        {
            "id": 12,
            "text": "They have urged their leaders to focus on delivering the sweeping investments they promised voters."
        },
        {
            "id": 13,
            "text": "The Biden administration had signaled support for a package that accounted for at least $1 trillion in new funds in addition to the expected maintenance of existing programs."
        },
        {
            "id": 14,
            "text": "But White House officials have repeatedly said that indexing the gas tax or establishing a mileage tax for electric vehicles would violate Mr. Biden’s pledge to avoid raising taxes on people who make less than $400,000 a year."
        },
        {
            "id": 15,
            "text": "Democrats briefed the White House staff on the emerging framework, and administration officials are expected to work with lawmakers."
        },
        {
            "id": 16,
            "text": "“The president appreciates the senators’ work to advance critical investments we need to create good jobs, prepare for our clean energy future and compete in the global economy,” said Andrew Bates, a White House deputy press secretary."
        },
        {
            "id": 17,
            "text": "“Questions need to be addressed, particularly around the details of both policy and pay-fors, among other matters.”"
        },
        {
            "id": 18,
            "text": "But the bipartisan group of senators are part of a broader coalition of moderates who have quietly met since Mr. Biden took office in an effort to explore avenues of compromise on a number of issues."
        },
        {
            "id": 19,
            "text": "Moderate Democrats in particular have been resistant to immediately bypassing the need for Republican votes on an infrastructure package, long seen as a particularly ripe area for a bipartisan agreement."
        },
        {
            "id": 20,
            "text": "The five Republicans are Senators Rob Portman of Ohio, Mitt Romney of Utah, Lisa Murkowski of Alaska, Susan Collins of Maine and Bill Cassidy of Louisiana."
        },
        {
            "id": 21,
            "text": "The Democrats are key moderates:"
        },
        {
            "id": 22,
            "text": "Senators Kyrsten Sinema of Arizona, Joe Manchin III of West Virginia, Mark Warner of Virginia, Jeanne Shaheen of New Hampshire and Jon Tester of Montana."
        },
        {
            "id": 23,
            "text": "“I think it’s important that there is this initiative, that again is a bipartisan initiative,” Ms. Murkowski said before the announcement."
        },
        {
            "id": 24,
            "text": "“What is happening now is as Republicans and Democrats, we are going out to folks within our respective conferences, talking about the contours of what we put together to see what that level of support might be.”"
        },
        {
            "id": 25,
            "text": "With razor-thin margins in both chambers, Democratic leaders have begun to quietly work on the legislation needed to use the fast-track budget reconciliation process, which would allow them to move a sweeping infrastructure package with a simple majority."
        },
        {
            "id": 26,
            "text": "But the maneuver would require near unanimity from the caucus and promises to be challenging, given the strict budgetary rules that govern the process."
        },
        {
            "id": 27,
            "text": "“We either need to do it in a bipartisan fashion that gets 60 votes, which shows no sign of occurring given the substance of the ongoing bipartisan negotiations, or we need to be prepared to use the reconciliation process,” said Senator Sheldon Whitehouse, Democrat of Rhode Island and one of the most vocal proponents for the preservation of the climate provisions."
        },
        {
            "id": 28,
            "text": "“It’s got to happen.”"
        },
        {
            "id": 29,
            "text": "Senator Chuck Schumer of New York, the Democratic leader, refused to comment on the details from the bipartisan group as he left the Capitol on Thursday."
        },
        {
            "id": 30,
            "text": "“We continue to proceed on two tracks,” he told reporters."
        },
        {
            "id": 31,
            "text": "“A bipartisan track and a reconciliation track — and both are moving forward.”"
        }
    ]
}