{
    "title": "White House official to tell impeachment investigators he feared Trump’s demands of Ukraine would undermine national security",
    "text": [
        {
            "id": 0,
            "text": "An Army officer assigned to the White House plans to tell House impeachment investigators on Tuesday that he was disturbed by President Trump’s demand that Ukraine investigate one of his political rivals and feared it would undermine U.S. national security."
        },
        {
            "id": 1,
            "text": "Read the document: Opening Statement of Lieutenant Colonel Alexander S. Vindman\n\n“I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications for the U.S. government’s support of Ukraine,” Vindman intends to tell lawmakers, according to a draft of his opening statement."
        },
        {
            "id": 2,
            "text": "Vindman is the first White House official to testify who listened to Trump’s controversial call, which was exposed by a government whistleblower and triggered a historic impeachment inquiry."
        },
        {
            "id": 3,
            "text": "His prepared statement, first reported by the New York Times, bolsters previous testimony by Fiona Hill, his former boss at the National Security Council, and William B. Taylor Jr., the acting ambassador to Ukraine."
        },
        {
            "id": 4,
            "text": "Vindman’s testimony follows House Speaker Nancy Pelosi’s (D-Calif.) call for a vote later this week authorizing the impeachment inquiry."
        },
        {
            "id": 5,
            "text": "Pelosi’s move came in response to Republican criticism that the Democrats’ activities to date amount to a partisan hit job and have denied the president due process."
        },
        {
            "id": 6,
            "text": "House to take first vote on impeachment inquiry of Trump, forcing lawmakers on record"
        },
        {
            "id": 7,
            "text": "In his statement Vindman repeatedly insists he has no partisan bias and asserts that he is motivated by loyalty to the Constitution and the country."
        },
        {
            "id": 8,
            "text": "Vindman and his family fled the Soviet Union when he was 3, and he describes himself as both an immigrant and a patriot."
        },
        {
            "id": 9,
            "text": "“It is my sacred duty and honor to advance and defend OUR country, irrespective of party or politics,” his prepared statement reads."
        },
        {
            "id": 10,
            "text": "Vindman was assigned to the White House in July 2018 after a tour in the Pentagon, where he writes that he authored the U.S. military’s principal strategy for managing competition with Russia."
        },
        {
            "id": 11,
            "text": "In his statement Vindman states that he has never had direct contact or communication with the president."
        },
        {
            "id": 12,
            "text": "He also notes that he is not the whistleblower whose complaint helped spark the impeachment inquiry\n."
        },
        {
            "id": 13,
            "text": "“I do not know who the whistleblower is and I would not feel comfortable to speculate,” his statement reads."
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": "Despite his remove from the White House, Vindman became deeply concerned about the way the president and some of his top advisers were manipulating Ukraine policy to discredit Biden, a possible challenger in the 2020 election."
        },
        {
            "id": 16,
            "text": "Vindman states that Trump’s initial call with the new Ukrainian president, made after Zelensky’s April election, was positive."
        },
        {
            "id": 17,
            "text": "“President Trump expressed his desire to work with President Zelensky and extended an invitation to the White House,” the statement reads."
        },
        {
            "id": 18,
            "text": "Vindman notes that the Ukrainians saw the meeting with Trump as “critical” to solidifying American support in the face of Russian aggression."
        },
        {
            "id": 19,
            "text": "But within weeks of that initial promise, he grew worried that the policy was being hijacked by partisan politics."
        },
        {
            "id": 20,
            "text": "“In the Spring of 2019, I became aware of outside influencers promoting a false narrative of Ukraine,” his statement reads."
        },
        {
            "id": 21,
            "text": "“This alternative narrative undermined U.S. efforts to expand cooperation with Ukraine.”"
        },
        {
            "id": 22,
            "text": "Vindman cites a July 10 meeting in which Gordon Sondland, a major Trump donor and ambassador to the European Union, emphasized that to secure a meeting with Trump, the Ukrainians would have to “deliver investigations into the 2016 election, the Bidens and Burisma,” a Ukrainian natural gas company that had controversially tapped Biden’s son to serve on its board."
        },
        {
            "id": 23,
            "text": "“I stated to Amb."
        },
        {
            "id": 24,
            "text": "Sondland that his statements were inappropriate, that the request to investigate Biden and his son had nothing to do with national security, and that such investigations were not something the National Security Council was going to get involved with or push,” his statements reads."
        },
        {
            "id": 25,
            "text": "Following the briefing, Vindman reported his concerns to the National Security Council’s top lawyer."
        },
        {
            "id": 26,
            "text": "Vindman’s statement notes that an investigation into the Bidens and Burisma would likely inject Ukraine’s new president into U.S. politics and cause the struggling democracy to lose bipartisan support in Congress."
        },
        {
            "id": 27,
            "text": "“This would undermine U.S. national security,” Vindman writes."
        },
        {
            "id": 28,
            "text": "Vindman’s most direct contact with Trump came in the form of preparing documents for the president to sign regarding Ukraine."
        },
        {
            "id": 29,
            "text": "At the direction of his superiors at the NSC, including John Bolton, then the national security adviser, Vindman drafted a memorandum in mid-August that sought to restart $391 million in security aid that was being withheld from Ukraine, according to the Times report."
        },
        {
            "id": 30,
            "text": "But Trump refused to sign it."
        },
        {
            "id": 31,
            "text": "He also drafted a letter in May congratulating Zelensky on his inauguration that Trump declined to sign, according to the Times."
        },
        {
            "id": 32,
            "text": "In his testimony Vindman, like others who have preceded him in the impeachment hearings, emphasizes the importance of Ukraine to the security of the United States."
        },
        {
            "id": 33,
            "text": "“A strong and independent Ukraine is critical to U.S. national security interests because Ukraine is a front-line state and bulwark against Russian aggression,” he writes."
        }
    ]
}