{
    "title": "Senate Unanimously Approves A Bill To Make Juneteenth A Public Holiday",
    "text": [
        {
            "id": 0,
            "text": "Senate Unanimously Approves A Bill To Make Juneteenth A Public Holiday\n\nEnlarge this image toggle caption Abraham Lincoln Presidential Library and Museum via AP Abraham Lincoln Presidential Library and Museum via AP"
        },
        {
            "id": 1,
            "text": "The Senate unanimously approved a bill Tuesday that would make Juneteenth, the date commemorating the end of chattel slavery in the United States, a legal public holiday."
        },
        {
            "id": 2,
            "text": "The holiday is celebrated on June 19, and it began in 1865 when enslaved people in Texas were freed under the Emancipation Proclamation."
        },
        {
            "id": 3,
            "text": "President Abraham Lincoln had signed the proclamation outlawing slavery in most of the United States years earlier, but it was not until 1865 that those in bondage in Texas were freed."
        },
        {
            "id": 4,
            "text": "Race"
        },
        {
            "id": 5,
            "text": "What Is Juneteenth?"
        },
        {
            "id": 6,
            "text": "Historians Explain The Holiday's Importance"
        },
        {
            "id": 7,
            "text": "What Is Juneteenth?"
        },
        {
            "id": 8,
            "text": "Historians Explain The Holiday's Importance Listen · 7:01 7:01"
        },
        {
            "id": 9,
            "text": "The measure is expected to be approved by the Democratic-led House of Representatives as well, but the timing is unclear."
        },
        {
            "id": 10,
            "text": "\"Making Juneteenth a federal holiday is a major step forward to recognize the wrongs of the past,\" Senate Majority Leader Chuck Schumer, D-N.Y., said in a statement, \"but we must continue to work to ensure equal justice and fulfill the promise of the Emancipation Proclamation and our Constitution.\""
        },
        {
            "id": 11,
            "text": "The recognition of Juneteenth as a legal holiday comes amid a broader national reckoning on race and the racism that helped shape America."
        },
        {
            "id": 12,
            "text": "Academic calls to more critically examine the lens through which race has molded public life, including in economics and the justice system, have prompted backlash by some Republican lawmakers who say that viewpoint unfairly villainizes white people and overstates the extent to which racism is foundational to American society."
        },
        {
            "id": 13,
            "text": "Republican legislation to limit teaching a historically accurate picture of U.S. history in public institutions has advanced in some half a dozen states."
        },
        {
            "id": 14,
            "text": "Teachers have warned that these efforts limit their ability to engage critically with their students at a time when much of the national conversation revolves around issues stemming from race."
        }
    ]
}