{
    "title": "Don't 'censor' Trump, top House Republican says after Facebook locks president's account",
    "text": [
        {
            "id": 0,
            "text": "\"President Trump needs to do the right thing and unequivocally condemn yesterday's violence,\" she said."
        },
        {
            "id": 1,
            "text": "\"There are no excuses for the mob and what occurred in the People’s House.\""
        },
        {
            "id": 2,
            "text": "The panel’s Democratic chair, Rep. Frank Pallone (D-N.J.), had called Wednesday for the tech companies to “remove” Trump for “inciting violence and spreading dangerous misinformation” online after his supporters swarmed the Capitol building."
        },
        {
            "id": 3,
            "text": "The debate about how Congress and Silicon Valley should respond to the fomenting of violence in Washington, D.C., played out a day after Facebook, its photo-sharing platform Instagram and Twitter froze the president's accounts."
        },
        {
            "id": 4,
            "text": "Zuckerberg followed up on Thursday by announcing an indefinite suspension of his accounts on Facebook and Instagram, at least until President-elect Joe Biden's swearing-in."
        },
        {
            "id": 5,
            "text": "“We believe the risks of allowing the President to continue to use our service during this period are simply too great,” Zuckerberg wrote in a statement posted to his personal page."
        },
        {
            "id": 6,
            "text": "“Therefore, we are extending the block we have placed on his Facebook and Instagram accounts indefinitely and for at least the next two weeks until the peaceful transition of power is complete.”"
        },
        {
            "id": 7,
            "text": "Twitter and Facebook froze Trump’s accounts Wednesday in reaction to the president’s incendiary response to a mob of his supporters who invaded the U.S. Capitol, in addition to removing several posts from Trump — including a video in which he called the rioters “very special” and professed his admiration for them."
        },
        {
            "id": 8,
            "text": "Separately, YouTube removed that video for violating its policies against content alleging rampant voter fraud in the 2020 elections, though it would allow others to repost the video if they added context."
        },
        {
            "id": 9,
            "text": "YouTube added on Thursday that because of Wednesday's violence, anybody posting a new video making false claims about widespread voter fraud will receive a \"strike\" restricting their ability to upload or stream."
        },
        {
            "id": 10,
            "text": "Three strikes within 90 days will mean permanent removal of the channel."
        },
        {
            "id": 11,
            "text": "The violent breach left at least four people dead and had members of Congress and their staffs hunkered down for hours waiting for the rioters to leave the building after the Capitol’s police force was caught flat-footed by the mass of Trump supporters."
        },
        {
            "id": 12,
            "text": "Zuckerberg said Trump’s handling of the rioters “rightly disturbed people in the US and around the world,” and that it has crossed the line for what the company is willing to accept."
        },
        {
            "id": 13,
            "text": "“Over the last several years, we have allowed President Trump to use our platform consistent with our own rules, at times removing content or labeling his posts when they violate our policies,” he wrote."
        },
        {
            "id": 14,
            "text": "“We did this because we believe that the public has a right to the broadest possible access to political speech, even controversial speech."
        },
        {
            "id": 15,
            "text": "But the current context is now fundamentally different, involving use of our platform to incite violent insurrection against a democratically elected government.”"
        },
        {
            "id": 16,
            "text": "Social media companies have long struggled to calibrate their approach to false and potentially dangerous information on their platforms coming from Trump and other high-profile political leaders."
        },
        {
            "id": 17,
            "text": "They stepped up their enforcement in the run-up to the election and its aftermath, but the actions of the past 24 hours are a dramatic escalation of their confrontation with the sitting president."
        },
        {
            "id": 18,
            "text": "Twitter restricted Trump’s account for the first time Wednesday and ordered him to delete multiple posts in order to regain access to his favored medium."
        },
        {
            "id": 19,
            "text": "The company also threatened to throw him off the platform entirely, a major reversal as it has repeatedly held off previous calls to do so while Trump is in the Oval Office."
        },
        {
            "id": 20,
            "text": "\"Our public interest policy — which has guided our enforcement action in this area for years — ends where we believe the risk of harm is higher and/or more severe,” a Twitter spokesperson said Wednesday."
        },
        {
            "id": 21,
            "text": "As a result of being blocked, Trump was forced to release a statement assenting to an “orderly transition” of power to President-elect Joe Biden via senior White House communications aide Dan Scavino after Congress officially certified the incoming president’s Electoral College victory."
        },
        {
            "id": 22,
            "text": "The companies' actions this week still don't address the deeper problem,"
        },
        {
            "id": 23,
            "text": "incoming Senate Intelligence Chair Mark Warner"
        },
        {
            "id": 24,
            "text": "(D-Va.) said in a statement, pointing to years of concerns about online platforms' role as breeding and organizing grounds for far-right extremists."
        },
        {
            "id": 25,
            "text": "\"While I’m pleased to see social media platforms like Facebook, Twitter and YouTube take long-belated steps to address the President’s sustained misuse of their platforms to sow discord and violence, these isolated actions are both too late and not nearly enough,\" Warner said."
        }
    ]
}