{
    "title": "Obamacare's double-digit rate hike, explained in 400 words",
    "text": [
        {
            "id": 0,
            "text": "Obamacare premiums are on track to rise faster than ever before in 2017."
        },
        {
            "id": 1,
            "text": "The Obama administration released data Monday showing that premiums for midlevel plans will rise, on average, 22 percent between 2016 and 2017."
        },
        {
            "id": 2,
            "text": "Yes, that is a huge increase."
        },
        {
            "id": 3,
            "text": "Last year premiums went up by 7.5 percent."
        },
        {
            "id": 4,
            "text": "Premiums are rising on the Obamacare marketplaces largely because the people who signed up for coverage were sicker than the insurance companies expected."
        },
        {
            "id": 5,
            "text": "This led some health insurers (like Aetna and UnitedHealth) to leave the marketplace."
        },
        {
            "id": 6,
            "text": "The insurance companies that stayed behind realized they’d have to charge higher premiums in order to cover their members’ medical bills."
        },
        {
            "id": 7,
            "text": "What does this mean for Obamacare customers?"
        },
        {
            "id": 8,
            "text": "Most Obamacare enrollees (83 percent) receive subsidies that limit the amount they have to spend on premiums."
        },
        {
            "id": 9,
            "text": "They only have to spend a certain percent of their income, and then the government will cover the rest."
        },
        {
            "id": 10,
            "text": "These people will likely be somewhat insulated from the premium increases."
        },
        {
            "id": 11,
            "text": "But the premium hike could still be disruptive."
        },
        {
            "id": 12,
            "text": "These people might have to switch to a new plan if another insurer is offering a lower premium than the one they currently use."
        },
        {
            "id": 13,
            "text": "But another 17 percent of Obamacare enrollees don’t receive premium subsidies."
        },
        {
            "id": 14,
            "text": "And these people are going to be in a really tough spot."
        },
        {
            "id": 15,
            "text": "They’ll need to decide whether they want to continue spending more to buy their same coverage — or if the insurance doesn’t provide enough value at the higher price."
        },
        {
            "id": 16,
            "text": "What does this mean for the future of the law more generally?"
        },
        {
            "id": 17,
            "text": "That’s really hard to tell right now — but there seems to be two plausible interpretations of the data."
        },
        {
            "id": 18,
            "text": "One is that this is a one-time course correction."
        },
        {
            "id": 19,
            "text": "When Obamacare launched, premiums were much lower than analysts had expected."
        },
        {
            "id": 20,
            "text": "Insurance plans are now bringing their premiums more in line with expectations, and after they do that, they won’t have to make these big rate increases again."
        },
        {
            "id": 21,
            "text": "The other is that this is the start of a series of higher rate increases for the health care law — that these new, high premiums might encourage some healthy people (especially those without subsidies) to leave the individual market."
        },
        {
            "id": 22,
            "text": "Subsides act as a powerful counter-balance to this second scenario, though, by capping enrollees’ contributions."
        },
        {
            "id": 23,
            "text": "In either case, these numbers are bad news for Obamacare — we just don’t know how bad, exactly, the news is at this point."
        }
    ]
}