{
    "title": "In a rare move, Mueller’s office denies BuzzFeed report that Trump told Cohen to lie about Moscow project",
    "text": [
        {
            "id": 0,
            "text": "Special counsel Robert S. Mueller III’s office on Friday denied an explosive report by BuzzFeed News that his investigators had gathered evidence showing President Trump directed his former lawyer, Michael Cohen, to lie to Congress about a prospective business deal in Moscow."
        },
        {
            "id": 1,
            "text": "The statement was remarkable on several levels — first, the special counsel’s office speaks exceedingly rarely, and second, the statement seemed to drive a stake through a sensational allegation that Democratic lawmakers suggested earlier in the day could spell the end of the Trump presidency."
        },
        {
            "id": 2,
            "text": "As earthshaking as the claims in the story were, no other media organizations were able to match them."
        },
        {
            "id": 3,
            "text": "The story published by BuzzFeed on Thursday night attributed to two federal law enforcement officials an incendiary assertion: that Mueller had collected emails, texts and testimony indicating Trump had directed Cohen to lie to Congress about the extent of discussions surrounding a proposed Trump Tower project in Moscow."
        },
        {
            "id": 4,
            "text": "That project never came to pass, but Cohen pleaded guilty last year to lying to Congress about the matter."
        },
        {
            "id": 5,
            "text": "The BuzzFeed report strongly implied the president might have committed a crime, dramatically raising speculation of possible impeachment."
        },
        {
            "id": 6,
            "text": "Within hours, Democrats in Congress were publicly demanding answers."
        },
        {
            "id": 7,
            "text": "The potential consequences of the report were so severe — immediate congressional investigations and a possible legal showdown with the White House — that Mueller decided to take the surprising step of publicly denying his investigation had gathered any such evidence."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "The special counsel’s office has only rarely issued public statements since it was created in May 2017; it had never previously issued a public statement regarding evidence in its investigation into Trump and Russian interference in the 2016 election."
        },
        {
            "id": 10,
            "text": "Inside the Justice Department, the statement was viewed as a huge step, and one that would have been taken only if the special counsel’s office viewed the story as almost entirely incorrect."
        },
        {
            "id": 11,
            "text": "The special counsel’s office seemed to be disputing every aspect of the story that addressed comments or evidence given to its investigators."
        },
        {
            "id": 12,
            "text": "The explicit denial by the special counsel’s office is likely to provide further ammunition to complaints by Trump and his supporters that press coverage of him is unfair and inaccurate."
        },
        {
            "id": 13,
            "text": "Trump weighed in Friday night on Twitter, criticizing BuzzFeed."
        },
        {
            "id": 14,
            "text": "“A very sad day for journalism, but a great day for our country!”"
        },
        {
            "id": 15,
            "text": "he tweeted."
        },
        {
            "id": 16,
            "text": "Following the special counsel’s denial, BuzzFeed insisted its story was correct."
        },
        {
            "id": 17,
            "text": "In a statement, the website’s top editor, Ben Smith, said, “We stand by our reporting and the sources who informed it, and we urge the Special Counsel to make clear what he’s disputing.”"
        },
        {
            "id": 18,
            "text": "The story had claimed Cohen had acknowledged to Mueller’s prosecutors that the president directed him to deceive Congress about key facts linking the president to the proposed Trump Tower project in Moscow."
        },
        {
            "id": 19,
            "text": "BuzzFeed also said Mueller learned about the directive to lie from “interviews with multiple witnesses from the Trump Organization and internal company emails, text messages, and a cache of other documents.”"
        },
        {
            "id": 20,
            "text": "Mueller’s denial, according to people familiar with the matter, aims to make clear that none of those statements in the story are accurate."
        },
        {
            "id": 21,
            "text": "Cohen is due to testify before a House committee in early February."
        },
        {
            "id": 22,
            "text": "He pleaded guilty in November to lying under oath to Congress about the Moscow project negotiations, and court documents filed in connection with that plea indicated he did so to align his statements with the political messaging of Trump and his aides on the question of Russian contacts."
        },
        {
            "id": 23,
            "text": "As part of that plea, Cohen admitted he had falsely told Congress that Trump’s effort to build an apartment tower in Moscow ended in January 2016, when in fact it had continued until June of that year."
        },
        {
            "id": 24,
            "text": "In court documents, Cohen admitted that he briefed Trump on his ongoing negotiations with Russian officials about the proposed deal and said that he had consulted with Trump’s team before his false testimony before Congress."
        },
        {
            "id": 25,
            "text": "But those documents did not indicate that Trump played a direct role in his false testimony."
        },
        {
            "id": 26,
            "text": "In December, Cohen was sentenced to three years in prison for those lies and unrelated financial crimes."
        },
        {
            "id": 27,
            "text": "Cohen and his representatives did not immediately respond to messages Friday night."
        },
        {
            "id": 28,
            "text": "Earlier in the day, Lanny J. Davis, a legal and communications adviser to Cohen, said of the BuzzFeed story: “Out of respect for Mr. Mueller’s and the Office of Special Counsel’s investigation, Mr. Cohen declined to respond to the questions asked by the reporters and so do I.”"
        },
        {
            "id": 29,
            "text": "The BuzzFeed report was incendiary in large part because it cast Cohen’s lies to Congress in a far more nefarious light — that he had done so at the specific instruction of the president."
        },
        {
            "id": 30,
            "text": "The president’s attorney, Rudolph W. Giuliani, challenged the Justice Department to “reveal the leakers” behind BuzzFeed’s reporting and chided Democrats who, he suggested, should refrain from investigating the president until Mueller concludes his investigation."
        },
        {
            "id": 31,
            "text": "“There may be nothing to legitimately investigate,” he said on Twitter."
        },
        {
            "id": 32,
            "text": "“I commend Bob Mueller’s office for correcting the BuzzFeed false story that President Trump encouraged Cohen to lie,” Giuliani wrote in a separate tweet."
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": "“I ask the press to take heed that their hysterical desire to destroy this President has gone too far."
        },
        {
            "id": 35,
            "text": "They pursued this without critical analysis all day. #FAKENEWS”"
        },
        {
            "id": 36,
            "text": ""
        },
        {
            "id": 37,
            "text": "The claims in the news report had prompted Democrats, who control the House, to ratchet up their investigation of Russian interference in the 2016 election, including allegations that the Trump campaign cooperated with Russian operatives and that Trump has since sought to obstruct an ongoing probe by Mueller."
        },
        {
            "id": 38,
            "text": "“If the @BuzzFeed story is true, President Trump must resign or be impeached,” Rep. Joaquin Castro (D-Tex.), a member of the House Intelligence Committee, tweeted after the story was published."
        },
        {
            "id": 39,
            "text": "“We know that the President has engaged in a long pattern of obstruction,” Rep. Jerrold Nadler (D-N.Y.), chairman of the House Judiciary Committee, wrote in a tweet Friday promising to “get to the bottom” of the allegations in BuzzFeed’s report."
        }
    ]
}