{
    "title": "Joe Biden's 'you ain't black' comment: The scourge of the left's identity politics",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The left’s construct of identity politics is a scourge, not just because it’s insulting and shortsighted, but also because the impact of conditioning people into identifying through one sliver of who they are strips away the power of the individual."
        },
        {
            "id": 2,
            "text": "Ultimately, it destroys lives."
        },
        {
            "id": 3,
            "text": "By design, that allows politicians to more easily control and manipulate the targets populating their own base: women, people of color and gays."
        },
        {
            "id": 4,
            "text": "There are examples of this throughout the last century highlighting how racial and sexual minorities are shamed, denigrated and even their very identities are threatened if they don’t do as they’re told politically or refuse to conform to the liberal worldview."
        },
        {
            "id": 5,
            "text": "The most recent illustration comes courtesy of the former vice president and 2020 Democratic presidential candidate, Joe Biden."
        },
        {
            "id": 6,
            "text": "As Mr. Biden is apt to do, he said something without thinking and for the left, that’s dangerous."
        },
        {
            "id": 7,
            "text": "In an interview with a very popular radio host, Charlamagne tha God, he revealed the ugly truth about the Democratic strategy and attitude toward black Americans."
        },
        {
            "id": 8,
            "text": "At one point after a series of questions, Charlamagne said: “It’s a long way until November, we got more questions.”"
        },
        {
            "id": 9,
            "text": "Mr. Biden responded, “You got more questions"
        },
        {
            "id": 10,
            "text": "but I tell you what, if you have a problem figuring out whether you’re for me or Trump, then you ain’t black.”"
        },
        {
            "id": 11,
            "text": "Stunned, Charlamagne responded, “It don’t have nothing to do with Trump, it has to do with the fact I want something for my community. …”"
        },
        {
            "id": 12,
            "text": "That exchange, in a nutshell, illustrates the worst nightmare of the Democrats."
        },
        {
            "id": 13,
            "text": "Here you have an African-American man talking about policy for his community, the issues and the VP pick."
        },
        {
            "id": 14,
            "text": "He wasn’t fawning over the candidate, which is what compelled Mr. Biden’s excited utterance revealing the ugly truth of the Democratic strategy: If you don’t conform, if you don’t vote as we tell you, you “ain’t black.”"
        },
        {
            "id": 15,
            "text": "This desperate claim was not aimed at Charlamagne per se, but at his listeners."
        },
        {
            "id": 16,
            "text": "It is voter intimidation of the highest order."
        },
        {
            "id": 17,
            "text": "It is also an attempt to recondition any strays into feeling that their actual identities will be destroyed if they do not toe the line and comply."
        },
        {
            "id": 18,
            "text": "Within a few hours of this debacle for the Democrats, Mr. Biden made a weak attempt at walking back the remark."
        },
        {
            "id": 19,
            "text": "He noted he was being “too cavalier,” and a “wiseguy.”"
        },
        {
            "id": 20,
            "text": "In other words, the mistake was not masking the attempt at control and intimidation well enough."
        },
        {
            "id": 21,
            "text": "Revealing even more of the contempt with which he holds African-Americans, during an interview with CNN’s Dana Bash, Mr. Biden even went so far as to blame Charlamagne for starting the problem."
        },
        {
            "id": 22,
            "text": "She questioned him about the exchange and Mr. Biden noted “Well, first of all you know, it was a mistake number one."
        },
        {
            "id": 23,
            "text": "And I was smiling when he asked me the question, I was you know, I shouldn’t have been such a wise guy."
        },
        {
            "id": 24,
            "text": "He was being a wise guy, and I responded."
        },
        {
            "id": 25,
            "text": "It was a mistake.”"
        },
        {
            "id": 26,
            "text": "So Charlamagne, who also happens to be a black man, provoked Mr. Biden into the comment?"
        },
        {
            "id": 27,
            "text": "As though the host was being … uppity?"
        },
        {
            "id": 28,
            "text": "In other words, if the host had known his place, then Mr. Biden wouldn’t have said what he said."
        },
        {
            "id": 29,
            "text": "Got it."
        },
        {
            "id": 30,
            "text": "My experience with this strategy came in the early days of my being president of the National Organization for Women."
        },
        {
            "id": 31,
            "text": "My politics are based on the fact that all doors should be unlocked for women so they can make choices that best suit them."
        },
        {
            "id": 32,
            "text": "It does not matter what your politics, your lifestyle or what your American dream looks like."
        },
        {
            "id": 33,
            "text": "All women, all Americans, should be able to pursue that dream without hindrance."
        },
        {
            "id": 34,
            "text": "Very quickly I had the first of many experiences which made it clear the left, and the feminist movement in particular, were about elevating only certain types of people and were using identity politics as a way to intimidate and control people."
        },
        {
            "id": 35,
            "text": "In 1993, Kay Bailey Hutchison, then the state treasurer for Texas, ran for the U.S. Senate."
        },
        {
            "id": 36,
            "text": "If she won (which she did), she would be the first female senator from Texas."
        },
        {
            "id": 37,
            "text": "Despite political differences, I considered her success an inspiration for all women."
        },
        {
            "id": 38,
            "text": "Feminist “icon” Gloria Steinem thought differently."
        },
        {
            "id": 39,
            "text": "Why?"
        },
        {
            "id": 40,
            "text": "The Dallas Morning News reported at the time, “Ms. Steinem, the founder of Ms. Magazine, attacked Ms. Hutchison’s stands on abortion and family leave policies."
        },
        {
            "id": 41,
            "text": "… Ms. Steinem then called Ms. Hutchison a female impersonator.”"
        },
        {
            "id": 42,
            "text": "Politifact reported on a 1993 opinion column in the Orange County Register revealing more of Ms. Steinem’s context, that Ms. Hutchison was “a female impersonator …"
        },
        {
            "id": 43,
            "text": "someone who looks like us but thinks like them.”"
        },
        {
            "id": 44,
            "text": "Almost 30 years prior to the Biden remark, this mentality was defining the liberal and feminist movements."
        },
        {
            "id": 45,
            "text": "It is a cynical and demeaning approach meant to divide and conquer people by politicizing our immutable characteristics."
        },
        {
            "id": 46,
            "text": "As more and more people in this country realize that their futures are linked with the health and well-being of their neighbors and of the country in general, the cancer of identity politics should be rejected quickly."
        },
        {
            "id": 47,
            "text": "Already black Americans are looking to political alternatives as we all know the power of not being taken for granted."
        },
        {
            "id": 48,
            "text": "That, however, will make even more Democratic “leaders” strike out."
        },
        {
            "id": 49,
            "text": ""
        },
        {
            "id": 50,
            "text": ""
        },
        {
            "id": 51,
            "text": ""
        },
        {
            "id": 52,
            "text": ""
        },
        {
            "id": 53,
            "text": ""
        }
    ]
}