{
    "title": "Gaffe-Prone Vice President Steps in it Again",
    "text": [
        {
            "id": 0,
            "text": "The politically incorrect and offensive word the vice president used this time was “Shylocks.”"
        },
        {
            "id": 1,
            "text": "During a recent speech, he was trying to describe the dishonest and greedy bankers his son warned him about, while deployed in Iraq, who knowingly took advantage of American soldiers."
        },
        {
            "id": 2,
            "text": "It’s unclear whether he was reading from prepared remarks, or speaking off-the-cuff, but the characterization has at least one Jewish group wondering what in the world he was thinking (via Yahoo News’ Olivier Knox and Hot Air’s Ed Morrissey):\n\n“Shylock represents the medieval stereotype about Jews and remains an offensive characterization to this day."
        },
        {
            "id": 3,
            "text": "The Vice President should have been more careful,” Anti-Defamation League National Director Abraham Foxman said."
        },
        {
            "id": 4,
            "text": "Shylock, the villain in Shakespeare’s “The Merchant of Venice,” is a Jewish moneylender who mercilessly demands a “pound of flesh” from the merchant who defaults on a loan."
        },
        {
            "id": 5,
            "text": "Whether the 16th-century play is anti-Semitic or reflects the anti-Semitism of the time is a subject of frequent, bitter debate, but the term Shylock is offensive enough that Florida stripped it from state law back in 2009."
        },
        {
            "id": 6,
            "text": "(Not everyone has gotten that memo)."
        },
        {
            "id": 7,
            "text": "… Biden’s slip came in a speech to the Legal Services Corporation, which provides lawyers to Americans who could not afford them otherwise."
        },
        {
            "id": 8,
            "text": "In his remarks, the vice president described the experience of his son, Delaware Attorney General Beau Biden, who was deployed for one year in Iraq."
        },
        {
            "id": 9,
            "text": "Incidentally, Buzz Feed released a video several weeks ago highlighting the commonly-used pejoratives still in circulation today."
        },
        {
            "id": 10,
            "text": "I found the video instructive, in part, because I didn’t even know some of those words and phrases were offensive."
        },
        {
            "id": 11,
            "text": "Is it possible, then, that Biden used the term “Shylocks” in his own speech to emphasize a point -- not understanding its hidden meaning and its implications?"
        },
        {
            "id": 12,
            "text": "For the life of me, I can’t imagine he would use the word willingly or knowingly in public, let alone in a speech, if he knew it would offend Jewish Americans."
        },
        {
            "id": 13,
            "text": "The Anti-Defamation League National Director, for his part, seemed to admit as much."
        },
        {
            "id": 14,
            "text": "He told Olivier that “[w]hen someone as friendly to the Jewish community and open and tolerant an individual as is Vice President Joe Biden, uses the term 'Shylocked’ to describe unscrupulous moneylenders dealing with service men and women, we see once again how deeply embedded this stereotype about Jews is in society.”"
        },
        {
            "id": 15,
            "text": "In other words, Biden almost certainly didn't use the term maliciously."
        },
        {
            "id": 16,
            "text": "And that, in turn, is one of many reasons why I suspect he will soon be forgiven."
        },
        {
            "id": 17,
            "text": ""
        }
    ]
}