{
    "title": "Donald Trump Gets Rock Star Greeting in Iowa",
    "text": [
        {
            "id": 0,
            "text": "AMES, Iowa — It probably made sense on paper: invite presidential candidates to visit the Iowa Republican Party’s tent in the parking lot before the big Iowa vs. Iowa State football game on Saturday."
        },
        {
            "id": 1,
            "text": "What planners did not anticipate was the portable mob scene that characterizes the candidacy of Donald J. Trump."
        },
        {
            "id": 2,
            "text": "Arriving more than an hour late, Mr. Trump offered a speech of less than a minute on the state party’s stage."
        },
        {
            "id": 3,
            "text": "But that was beside the point, as star-struck supporters greeted him like a stadium rocker during a sprawling tailgate party before kickoff."
        },
        {
            "id": 4,
            "text": "“Donald, you rock!”"
        },
        {
            "id": 5,
            "text": "a young man shouted as Mr. Trump, encircled by a security team, walked through a parking lot."
        },
        {
            "id": 6,
            "text": "Another man fought his way into the mob and said, “Donald, I’m wearing your hat!”"
        },
        {
            "id": 7,
            "text": "“Shook his hand."
        },
        {
            "id": 8,
            "text": "I shook his hand!”"
        },
        {
            "id": 9,
            "text": "a burly student shouted to two friends, sounding faint with excitement."
        },
        {
            "id": 10,
            "text": "Three other Republican candidates not named Trump also glad-handed and posed for selfies among the tailgating football fans before the game."
        },
        {
            "id": 11,
            "text": "But their receptions were of a different order."
        },
        {
            "id": 12,
            "text": "Rarely has the contrast between a conventional politician and the celebrity candidacy of Mr. Trump seemed clearer."
        },
        {
            "id": 13,
            "text": "History suggests that each party’s eventual nominee will emerge from 2015 in one of the top two or three positions, as measured by endorsements, fund-raising and polling."
        },
        {
            "id": 14,
            "text": "Many Iowa Republicans expected Mr. Trump’s lead in the primary race to be fleeting."
        },
        {
            "id": 15,
            "text": "On Friday night, a seasoned party activist compared him to “the bad boy you date over the summer before returning to college.”"
        },
        {
            "id": 16,
            "text": "Instead, Mr. Trump continues to dominate Iowa polls as summer turns to fall."
        },
        {
            "id": 17,
            "text": "A Quinnipiac University poll of Iowa last week showed he is the first choice of all age groups of Republicans, including young people, who predominated outside Jack Trice Stadium, where the Iowa State Cyclones hosted the Iowa Hawkeyes."
        },
        {
            "id": 18,
            "text": "“We’re killing everybody in the polls,” Mr. Trump said in brief remarks from the stage."
        },
        {
            "id": 19,
            "text": "He wore a new “Make America Great Again” hat, this one in camouflage."
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": "He wished people luck with whichever team they supported, stepped down and began the walk back to his S.U.V., a knot of students and others pressing close."
        },
        {
            "id": 23,
            "text": "Though he said nothing about the issues of the day, the audience seemed satisfied."
        },
        {
            "id": 24,
            "text": "“It was pretty cool; we got to see him,” said Braiden Loreno, a sophomore."
        },
        {
            "id": 25,
            "text": "“I’m definitely voting for him.”"
        },
        {
            "id": 26,
            "text": "The crowd of several hundred had waited more than an hour for Mr. Trump."
        },
        {
            "id": 27,
            "text": "They had chanted “Don-ald!"
        },
        {
            "id": 28,
            "text": "Don-ald!”"
        },
        {
            "id": 29,
            "text": "Cheers went up several times over false sightings."
        },
        {
            "id": 30,
            "text": "A sign read: “The Trump Will Set You Free.”"
        },
        {
            "id": 31,
            "text": "(It was countered by a protester’s sign: “Mr. Hate, Leave My State.”)"
        },
        {
            "id": 32,
            "text": "At 2:30, the appointed hour for Mr. Trump to speak, a candidate appeared and the crowd parted to reveal. ..."
        },
        {
            "id": 33,
            "text": "Gov. Scott Walker of Wisconsin, running late."
        },
        {
            "id": 34,
            "text": "There was no applause for Mr. Walker, who for months had led in the polls in Iowa, but whose popularity in the Quinnipiac poll was measured at 3 percent."
        },
        {
            "id": 35,
            "text": "In brief remarks, Mr. Walker promised to “wreak havoc on Washington,” as he had in Wisconsin when he faced down thousands of pro-union protesters."
        },
        {
            "id": 36,
            "text": "Mr. Walker’s abbreviated version of his stump speech also included a veiled swipe at Mr. Trump."
        },
        {
            "id": 37,
            "text": "“It takes more than just talk,” he said."
        },
        {
            "id": 38,
            "text": "“It takes action."
        },
        {
            "id": 39,
            "text": "Actions speak louder than words.”"
        },
        {
            "id": 40,
            "text": "Earlier, Senators Marco Rubio of Florida and Rand Paul of Kentucky worked the tailgaters, not all of whom were thrilled to have a presidential candidate and his entourage interfering with their meat grilling, beer drinking and game playing."
        },
        {
            "id": 41,
            "text": "“Come on, bro, this is a tailgate,” Dionne Harden, an Iowa State fan, protested as Mr. Rubio walked in front of him just as he was about to toss a bean bag."
        },
        {
            "id": 42,
            "text": "In a tent sponsored by the Iowa Corn Growers Association, Mr. Rubio faced a different kind of challenge when he was pressed on whether he supported federal support for ethanol."
        },
        {
            "id": 43,
            "text": "“As I’ve said before, I understand if people made an investment in something, you’re not going to just take it away from them,” Mr. Rubio told a group of farmers."
        },
        {
            "id": 44,
            "text": "“But eventually I do believe these energy resources have to be self-sustaining.”"
        },
        {
            "id": 45,
            "text": "Jerry Mohr, a farmer who is chairman of the growers association, called Mr. Rubio’s position disappointing."
        },
        {
            "id": 46,
            "text": "Mr. Rubio made a better impression on Evan Monson, an Iowa State junior, who praised him for hanging out at the Sigma Pi fraternity tailgate party."
        },
        {
            "id": 47,
            "text": "“Rubio was pretty cool,” he said."
        },
        {
            "id": 48,
            "text": "Mr. Paul had also spoken free-market truth to the corn industry in Iowa."
        },
        {
            "id": 49,
            "text": "He visited the growers’ tent and strolled the parking lots with a more manageable level of attention than Mr. Trump."
        },
        {
            "id": 50,
            "text": "Offered a beer, Mr. Paul pleaded that he had to fly to St. Louis later to present a Homemakers Award to his mother at a gathering of the Eagle Forum, the conservative group founded by Phyllis Schlafly."
        },
        {
            "id": 51,
            "text": "Scott Scheidel, an insurance broker, called out to Mr. Paul."
        },
        {
            "id": 52,
            "text": "“You’re my man."
        },
        {
            "id": 53,
            "text": "Come over to my tailgate, I’ll give you the microphone,” he said."
        },
        {
            "id": 54,
            "text": "Mr. Paul greeted him but moved on."
        },
        {
            "id": 55,
            "text": "Another fan, Keven Malec, who had driven from Illinois to visit a daughter at Iowa State, offered Mr. Paul a choice of two sandwiches he was grilling."
        },
        {
            "id": 56,
            "text": "“We’ve got a Cyclone and we’ve got a Hawkeye,” he said."
        },
        {
            "id": 57,
            "text": "“I don’t want to take sides, but the Hawkeye tastes like chicken.”"
        },
        {
            "id": 58,
            "text": "But it was Mr. Trump who dominated the show."
        },
        {
            "id": 59,
            "text": "At a rally earlier in the day, Mr. Trump had criticized Ben Carson, the retired surgeon who has surged in Iowa polls to claim second place, for being too mild-mannered to occupy the Oval Office."
        },
        {
            "id": 60,
            "text": "“I don’t think Ben has the energy,” Mr. Trump said."
        },
        {
            "id": 61,
            "text": "“Ben is a nice man, but when you’re negotiating against China and you’re negotiating against these Japanese guys that are going to come against you in waves, and they think we’re all a bunch of jerks because our leaders are so stupid and so incompetent and so inept, we need people that are really smart, that have tremendous deal-making skills and that have great, great energy.”"
        },
        {
            "id": 62,
            "text": "His visit to the Ames tailgate scene, though short, was memorable."
        },
        {
            "id": 63,
            "text": "After his remarks, he made his way through the parking lot, then climbed into a waiting black Suburban."
        },
        {
            "id": 64,
            "text": "He rolled down his window, and as he shot out his arm to wave goodbye, a diamond cuff link sparkled in the sun."
        }
    ]
}