{
    "title": "Deal reached on background checks in Senate",
    "text": [
        {
            "id": 0,
            "text": "Sens. Joe Manchin, D-West Virginia, and Patrick J. Toomey, R-Pennsylvania, plan to announce a bipartisan deal on background checks for gun shows and Internet sales at an 11 a.m. press conference today, CNN's Dana Bash has learned."
        },
        {
            "id": 1,
            "text": "A Democratic leadership source says the compromise will likely be the first amendment to gun legislation being considered, after the Senate votes to begin the gun debate Thursday."
        },
        {
            "id": 2,
            "text": "The breakthrough background check agreement is a key part of gun legislation."
        },
        {
            "id": 3,
            "text": "Because it has been struck by two senators with strong support from the NRA, they hope to find the 60 votes that will be needed to overcome opposition to pass their amendment"
        },
        {
            "id": 4,
            "text": "The senate is expected to debate gun legislation for at least two weeks."
        },
        {
            "id": 5,
            "text": "Democrats believe as many as a dozen GOP senators will vote with them, making up for the handful of pro-gun Democrats who might vote against beginning debate on the bill."
        },
        {
            "id": 6,
            "text": "Fourteen Republicans promise to filibuster taking up the measure."
        },
        {
            "id": 7,
            "text": "Several Republican senators told CNN Tuesday they would only vote to begin debate on the bill if they were assured by Democrats they would be allowed to offer amendments to the legislation."
        },
        {
            "id": 8,
            "text": "Democratic leaders want to give senators from both parties ample opportunities to amend the bill and are prepared to debate it beyond a scheduled recess the first week in May, if doing so will increase the chances of passage."
        },
        {
            "id": 9,
            "text": "“The way you put together a coalition to pass the bill is to allow as many amendment votes as you can."
        },
        {
            "id": 10,
            "text": "We are willing to take the time to do that and have that process,” the aide said."
        },
        {
            "id": 11,
            "text": "Those negotiators will now have more time to find common ground on language, since the gun debate is expected to be lengthy."
        },
        {
            "id": 12,
            "text": "Democratic leaders also argue any bill they put on the floor will represent a substantial improvement in gun safety."
        },
        {
            "id": 13,
            "text": "Many of those additional votes could be politically difficult for centrist Democrats, especially those up for re-election in red states, as Republicans are expected to craft amendments designed to put those senators on the spot."
        },
        {
            "id": 14,
            "text": "Nevertheless, Democratic leaders have determined it’s a risk they need to take if they want to pass substantive legislation to respond to the mass shootings that have plagued the nation in recent years."
        },
        {
            "id": 15,
            "text": "“Once we’re on it we want to have an open process where there are a lot of votes and we really work through that,” the aide said."
        }
    ]
}