{
    "title": "Tim Pawlenty cites John McCain, Mitt Romney in predicting Jeb Bush can win GOP nomination ",
    "text": [
        {
            "id": 0,
            "text": "Former Minnesota Gov. Tim Pawlenty said Wednesday he believes former Florida Gov. Jeb Bush can win the Republican presidential nomination in 2016, dismissing the notion that conservatives wouldn’t elect an “establishment” candidate by pointing to the party’s standard bearer the past two presidential cycles."
        },
        {
            "id": 1,
            "text": "“See John McCain; see Mitt Romney,” Mr. Pawlenty, who ended his 2012 presidential campaign in the summer of 2011, said on MSNBC’s “Morning Joe.”"
        },
        {
            "id": 2,
            "text": "“In McCain’s case, a very compelling personal story and a gritty performance; in Mitt Romney’s case, obviously a man of great talent but also someone with a tremendous amount of campaign resources and infrastructure.”\n\n“Jeb can do that,” Mr. Pawlenty continued."
        },
        {
            "id": 3,
            "text": "“But it’s not going to be uncontested, assuming he runs, and there’s a bunch of people who are going to get in the race [who will] have something to say about it.”"
        },
        {
            "id": 4,
            "text": "Mr. Pawlenty went on to say the party has “shifted” and that it’s not so much a manifestation of the tea party as it is a Libertarian wing on the right represented by people like Sen. Rand Paul of Kentucky."
        },
        {
            "id": 5,
            "text": "“You wouldn’t have predicted McCain or Romney won last time — they did,” he said."
        },
        {
            "id": 6,
            "text": "Mr. Bush’s last name could present a problem for him if he chooses to run, said a new NBC News/Wall Street Journal poll."
        },
        {
            "id": 7,
            "text": "Sixty-nine percent agree with former first lady Barbara Bush’s statement that “there are more than two or three families who should run for high office in America.”"
        },
        {
            "id": 8,
            "text": "Ten percent of people who agreed said it applied more to Mr. Bush, 7 percent who agreed said it applied more to former Secretary of State Hillary Rodham Clinton, and 50 percent who agreed said it applied equally to both."
        },
        {
            "id": 9,
            "text": "Compared to about a year ago, Americans also view Mr. Bush less favorably."
        },
        {
            "id": 10,
            "text": "Twenty-one percent view him positively and 32 percent have a negative view."
        },
        {
            "id": 11,
            "text": "Eleven months ago, 26 percent had a positive view of him, and 23 percent had a negative view."
        },
        {
            "id": 12,
            "text": "The poll of 1,000 adults taken from April 23-27 has a margin of error of plus or minus 3.1 percentage points."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        }
    ]
}