{
    "title": "What You Need To Know About The Injunction Stopping Obama's Amnesty",
    "text": [
        {
            "id": 0,
            "text": "At 10:22 pm Monday night, the United States District Court for the Southern Division of Texas issued a temporary injunction enjoining the Department of Homeland Security from implementing \"any and all aspects of or phases of the Deferred Action for Parents of Americans or Lawful Permanent Residents (DAPA) program\" that President Obama announced on November 20, 2014."
        },
        {
            "id": 1,
            "text": "Here is what you need to know:\n\nWhat did the court do?"
        },
        {
            "id": 2,
            "text": "U.S. District Court Judge Andrew Hanen entered an Order of Temporary Injunction enjoining DHS from implementing any aspect of Obama's \"DAPA Memorandum\" which includes an expansion of Obama's June 2012 Deferred Action for Childhood Arrivals program."
        },
        {
            "id": 3,
            "text": "This means that the United States Citizenship and Immigration Services office may not begin accepting new DACA applications as it was scheduled to do this week, and if the order holds, may not begin accepting DAPA applications as it was scheduled to this May."
        },
        {
            "id": 4,
            "text": "As a result, an estimated four million illegal immigrants will not be given work permits, drivers licenses, or Social Security numbers as Obama originally envisioned."
        },
        {
            "id": 5,
            "text": "What didn't the court do?"
        },
        {
            "id": 6,
            "text": "This is only a temporary injunction that preserves the status quo until a more thorough court proceeding can rule on the merits of the case."
        },
        {
            "id": 7,
            "text": "That said, in order to secure a temporary injunction, one of the requirements a plaintiff must show is that they are \"likely to succeed on the merits.\""
        },
        {
            "id": 8,
            "text": "Judge Hanen found that the plaintiffs are likely to succeed on the merits of their claim that Obama's DAPA Memorandum violated the Administrative Procedures Act."
        },
        {
            "id": 9,
            "text": "The court also left in place Obama's June 2012 DACA program."
        },
        {
            "id": 10,
            "text": "Only the DACA expansion outlined in the November 20 DAPA Memorandum, and the larger DAPA program, have been enjoined."
        },
        {
            "id": 11,
            "text": "What happens next?"
        },
        {
            "id": 12,
            "text": "The White House issued a statement early Tuesday morning indicating that the Department of Justice \"will appeal\" Judge Hanen's order."
        },
        {
            "id": 13,
            "text": "That appeal will be heard a three-judge panel of the 5th Circuit who could issue a decision around July or August of this year."
        },
        {
            "id": 14,
            "text": "If the Obama administration lost that ruling, it could then appeal for an en banc ruling from the 5th Circuit before then appealing to the Supreme Court."
        },
        {
            "id": 15,
            "text": "But the earliest the Supreme Court might here the case is March of 2016 and the earliest they could issue a decision would be June 2016, which is a huge problem for Obama since USCIS was expected to begin accepting DAPA application fees to pay for their new Crystal City office in May 2015."
        },
        {
            "id": 16,
            "text": "How does these effect the DHS funding debate in Congress?"
        },
        {
            "id": 17,
            "text": "Nobody knows."
        },
        {
            "id": 18,
            "text": "Speaker John Boehner issued a statement Tuesday urging \"Senate Democrats who claim to oppose this executive overreach\" to now \"let the Senate begin debate on a bill to fund the Homeland Security department."
        },
        {
            "id": 19,
            "text": "\" The statement is a direct shot at Sens. Joe Donnelly"
        },
        {
            "id": 20,
            "text": "(D-IN),"
        },
        {
            "id": 21,
            "text": "Al Franken"
        },
        {
            "id": 22,
            "text": "(D-MN), Heidi Heitkamp (D-ND),"
        },
        {
            "id": 23,
            "text": "Angus King"
        },
        {
            "id": 24,
            "text": "(I-ME), Joe Manchin (D-WV), and Claire McCaskill (D-MO) all of whom have questioned the legality of Obama's amnesty but have voted to prevent any debate on the House Department of Homeland Security bill that defunds Obama's amnesty programs."
        },
        {
            "id": 25,
            "text": "Since the order leaves the existing DACA program in place, while preventing the new DAPA program from being implemented, it is possible a compromise could be reached by both parties where the DHS bill would continue to defund the DAPA program, but Democratic Senators could offer amendments preserving DACA program."
        },
        {
            "id": 26,
            "text": "Moderate Sen. Susan Collins (R-ME) has floated exactly such a compromise."
        },
        {
            "id": 27,
            "text": ""
        }
    ]
}