{
    "title": "Medicare Advantage Plans May Face Cuts",
    "text": [
        {
            "id": 0,
            "text": "Cuts are on the table next year for Medicare Advantage plans, the Obama administration said, setting off an election-year fight over a politically dicey move affecting a private insurance alternative highly popular with senior citizens."
        },
        {
            "id": 1,
            "text": "The announcement gave new ammunition to Republican critics of President Barack Obama's healthcare law, while disappointing some Democratic senators who had called on the administration to hold rates steady."
        },
        {
            "id": 2,
            "text": "Insurers are still hoping to whittle back the cuts or dodge them altogether."
        },
        {
            "id": 3,
            "text": "Late Friday after financial markets closed, Medicare issued a 148-page assessment of cost factors for the private plans next year."
        },
        {
            "id": 4,
            "text": "It included multiple variables, some moving in different directions, but analyst Matthew Eyles of Avalere Health estimated it would translate to a cut of 1.9 percent for 2015, a figure also cited by congressional staffers briefed on the proposal."
        },
        {
            "id": 5,
            "text": "\"There's nothing to like here if you're one of the plans,\" said Eyles."
        },
        {
            "id": 6,
            "text": "Administration officials say the plans don't need to be paid as much to turn a profit, because the growth of healthcare spending has slowed dramatically."
        },
        {
            "id": 7,
            "text": "They see the cuts as a dividend for taxpayers."
        },
        {
            "id": 8,
            "text": "But the political clout of the plans is growing as seniors flock to them seeking better healthcare value."
        },
        {
            "id": 9,
            "text": "Medicare Advantage plans now serve nearly 16 million people, or about 30 percent of Medicare beneficiaries."
        },
        {
            "id": 10,
            "text": "They can offer lower out-of-pocket costs and broader benefits than traditional Medicare, but often restrict choice."
        },
        {
            "id": 11,
            "text": "Insurers say they will be forced to pass on higher costs to seniors or cut benefits if their rates are reduced, and some plans may drop out altogether."
        },
        {
            "id": 12,
            "text": "The impact could vary significantly around the country."
        },
        {
            "id": 13,
            "text": "The industry says the cuts come as Medicare Advantage reductions programmed under the healthcare law are ramping up."
        },
        {
            "id": 14,
            "text": "The law sought to compensate for prior years in which the plans were overpaid."
        },
        {
            "id": 15,
            "text": "But it also includes a new tax on insurers, so industry officials fear the combined impact will be much higher."
        },
        {
            "id": 16,
            "text": "The largest insurer trade group, America's Health Insurance Plans, is sparing no effort to head off cuts, with an extensive advertising and lobbying campaign."
        },
        {
            "id": 17,
            "text": "It has won the support of 40 senators from both parties who, in a Feb. 14 letter, called on the administration to essentially hold Medicare Advantage rates steady."
        },
        {
            "id": 18,
            "text": "Among the signers were six Democratic senators in contested races whose outcome will determine whether Obama faces a Congress next year that's completely controlled by Republicans."
        },
        {
            "id": 19,
            "text": "Final rates won't be released until April 7, so the lobbying will get even more intense."
        },
        {
            "id": 20,
            "text": "In prior years, Medicare has sometimes pulled back from proposed cuts."
        },
        {
            "id": 21,
            "text": "Friday's announcement will help the government decide basic rates for the Medicare Advantage plans."
        },
        {
            "id": 22,
            "text": "But the actual change individual plans and customers eventually see will vary, depending on factors like a plan's quality rating or where the plan is located."
        },
        {
            "id": 23,
            "text": "The plans have become a key source of revenue growth for insurers who sell and administer the subsidized coverage."
        },
        {
            "id": 24,
            "text": "They offer basic Medicare coverage topped with extras like vision or dental coverage or premiums lower than standard Medicare rates."
        },
        {
            "id": 25,
            "text": "There are hundreds of different plans around the country, each with its own set of variables like different deductibles, premiums and co-insurance."
        },
        {
            "id": 26,
            "text": "UnitedHealth Group Inc. and Humana Inc. are the two largest Medicare Advantage providers."
        },
        {
            "id": 27,
            "text": "Health insurance stocks that soared in 2013 slipped at the start of this year after Humana Inc., the second-largest in the market, said rate cuts could be deeper than expected."
        }
    ]
}