{
    "title": "Senate Dems Can Bypass GOP Filibuster on Two More Bills, Parliamentarian Rules",
    "text": [
        {
            "id": 0,
            "text": "Senate Minority Leader Chuck Schumer addresses a news conference about the coronavirus response on Capitol Hill, May 5, 2020."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "The Senate parliamentarian has ruled that Democrats can pass two more pieces of legislation via budget reconciliation procedures, bypassing a potential filibuster by Republicans."
        },
        {
            "id": 3,
            "text": "The ruling allows Democrats to pass two bills with a simple majority instead of the usual 60-vote threshold required in the Senate."
        },
        {
            "id": 4,
            "text": "Democrats plan to use the budget reconciliation process to approve the Biden administration’s infrastructure plan, which is split into two bills."
        },
        {
            "id": 5,
            "text": "The process was previously used to pass Democrats’ coronavirus relief bill."
        },
        {
            "id": 6,
            "text": "Advertisement\n\nAdvertisement"
        },
        {
            "id": 7,
            "text": "A spokesman for Senate Majority Leader Chuck Schumer (D., N.Y.) announced the parliamentarian’s decision on Monday evening."
        },
        {
            "id": 8,
            "text": "“The Parliamentarian has advised that a revised budget resolution may contain budget reconciliation instructions,” the spokesman said in a statement."
        },
        {
            "id": 9,
            "text": "“This confirms the Leader’s interpretation of the Budget Act and allows Democrats additional tools to improve the lives of Americans if Republican obstruction continues.”"
        },
        {
            "id": 10,
            "text": "The Senate is divided 50-50 between Democrats and Republicans, with Vice President Kamala Harris giving Democrats a slim majority in the chamber."
        },
        {
            "id": 11,
            "text": "Minority Leader Mitch McConnell (R., Ky.) told reporters on Thursday that Republicans will not support the infrastructure plan, which is projected to cost over $2 trillion and seeks to raise taxes."
        },
        {
            "id": 12,
            "text": "“My view of infrastructure is that we ought to build that which we can afford and not either whack the economy with major tax increases or run up the national debt even more,” McConnell told reporters."
        },
        {
            "id": 13,
            "text": "Advertisement\n\nSenator Joe Manchin of West Virginia, a moderate Democrat, said on Monday that he would not support the plan as written."
        },
        {
            "id": 14,
            "text": "“As the bill exists today, it needs to be changed,” Manchin told West Virginia’s Metro News."
        },
        {
            "id": 15,
            "text": "While the current bill envisions raising the corporate tax rate to 28 percent, Manchin said he would not support a tax rate above 25 percent."
        },
        {
            "id": 16,
            "text": "Send a tip to the news team at NR."
        }
    ]
}