{
    "title": "House passes VA reform compromise",
    "text": [
        {
            "id": 0,
            "text": "House lawmakers voted overwhelmingly Wednesday to overhaul the VA health care system, hoping a $16 billion infusion of cash can help gain a handle on the wait times and poor care issues for veterans that have plagued the department."
        },
        {
            "id": 1,
            "text": "But it was unclear whether the money is sufficient and properly tailored to fix the problems, given the systematic data manipulation within the Veterans Affairs health care system that has made the department’s own numbers suspect."
        },
        {
            "id": 2,
            "text": "Indeed, it was unclear how far the $16 billion would go in setting up a key program that would let veterans seek care from private doctors at taxpayers’ expense if they have been waiting more than 30 days for a VA appointment or live too far from a VA facility."
        },
        {
            "id": 3,
            "text": "Still, all sides said the House bill marked at least a down payment on fixing the system."
        },
        {
            "id": 4,
            "text": "“There’s no doubt that the Department of Veterans Affairs, as we know it today, is in crisis and our veterans are suffering,” said House Veterans’ Affairs Committee Chairman Jeff Miller, Florida Republican and a co-author of the bill."
        },
        {
            "id": 5,
            "text": "“The conference committee report we’re considering today is the first step.”"
        },
        {
            "id": 6,
            "text": "The 420-5 vote in favor of the deal signaled that the eagerness to care for veterans outweighed the price, $10 billion of which would be tacked onto the deficit, according to a Congressional Budget Office estimate."
        },
        {
            "id": 7,
            "text": "Senators are slated to vote Thursday on the agreement and send it to President Obama, who is expected to sign it."
        },
        {
            "id": 8,
            "text": "It is the culmination of months of negotiations that began after a whistleblower revealed that veterans were dying while waiting for care on secret lists at a Phoenix VA facility."
        },
        {
            "id": 9,
            "text": "Since then, investigations have found whistleblower retaliation, poor care and wait-time data manipulation across the system."
        },
        {
            "id": 10,
            "text": "The bipartisan deal would let veterans who have been waiting more than 30 days for appointments or who live more than 40 miles away from VA facilities to be reimbursed for private-sector care outside the system."
        },
        {
            "id": 11,
            "text": "That program would last until the $10 billion is expended."
        },
        {
            "id": 12,
            "text": "At that point, Congress would have to decide whether to continue paying for the program."
        },
        {
            "id": 13,
            "text": "The legislation also would give VA Secretary Robert McDonald — who was officially sworn in Wednesday — more power to fire poor-performing senior executives and would let the VA enter into 27 leases for major medical facilities in 18 states and Puerto Rico, something the VA requested in its fiscal 2014 budget request."
        },
        {
            "id": 14,
            "text": "However, the VA has admitted to Congress that its data have been manipulated to the point that they are unreliable, making it uncertain whether the department has an accurate picture of where facilities are needed or how much they will cost to build."
        },
        {
            "id": 15,
            "text": "For lawmakers, the symbolism of the vote was more important, said Steve Billet, director of the legislative affairs program at George Washington University."
        },
        {
            "id": 16,
            "text": "“I don’t think anyone knows as a practical matter, and frankly I don’t think anybody cares, if it’s 27 or 35 [leases] in 18 states or nine states,” he said."
        },
        {
            "id": 17,
            "text": "“I think what’s going on here, frankly, is Congress is doing something that’s political expedient and necessary.”"
        },
        {
            "id": 18,
            "text": "Mr. Miller said the compromise bill will require independent assessments to make sure VA’s spending plans, including the 27 leases, are needed."
        },
        {
            "id": 19,
            "text": "He also warned the department that permission can be revoked or changed based on those assessments."
        },
        {
            "id": 20,
            "text": "“The validity of VA’s numbers was a concern from the start."
        },
        {
            "id": 21,
            "text": "That’s why the House initially wanted to craft a bill that focused solely on increasing accountability at the department and providing veterans with options to obtain non-VA medical care,” Mr. Miller said."
        },
        {
            "id": 22,
            "text": "“But in order to reach a deal with the Senate, we had to make some concessions.”"
        },
        {
            "id": 23,
            "text": "Emphasizing the bipartisan support of the bill, House Minority Leader Nancy Pelosi, California Democrat, said “no veteran should be forced to wait for the health care or benefits they have earned.”"
        },
        {
            "id": 24,
            "text": "All five votes in opposition were from Republicans."
        },
        {
            "id": 25,
            "text": "“I have and will continue to fight to ensure that our men and women in uniform receive the physical and mental care that they deserve,” said Rep. Walter B. Jones, North Carolina Republican."
        },
        {
            "id": 26,
            "text": "“Unfortunately, this bill does the opposite by allowing the current broken system to remain in place and increasing federal spending at a time that our national debt has already reached $17 trillion.”"
        },
        {
            "id": 27,
            "text": "Mr. Billet said it may be more fiscally responsible to wait for the results of a full audit, but it’s not the most politically beneficial for lawmakers who cringed at the thought of facing constituents during the upcoming August vacation without finishing a deal."
        },
        {
            "id": 28,
            "text": "“Politics trumps policy in every instance in this town and this is a great example,” he said."
        },
        {
            "id": 29,
            "text": "“It also says Congress can overcome its gridlock and its polarization when it needs to or when it thinks it needs to for political reasons.”"
        },
        {
            "id": 30,
            "text": "The reports of veteran deaths galvanized veterans groups into action and forced personnel changes at the VA, where a handful of top officials, including Secretary Eric K. Shinseki, were forced from office."
        },
        {
            "id": 31,
            "text": "The pressure also helped push negotiators from the Republican-led House and Democratic majority in the Senate to bridge deep policy and cost differences between their proposals."
        },
        {
            "id": 32,
            "text": ""
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}