{
    "title": "House Rejects Trump's Defense Bill Veto In Highly Unusual Vote",
    "text": [
        {
            "id": 0,
            "text": "House Rejects Trump's Defense Bill Veto In Highly Unusual Vote"
        },
        {
            "id": 1,
            "text": "The House voted on Monday to overturn President Trump's veto of the gargantuan annual defense authorization bill."
        },
        {
            "id": 2,
            "text": "The vote, 322-87, was a highly unusual response to a highly unusual move by a president in rejecting the legislation, which sets policies and establishes other priorities every year for the military services."
        },
        {
            "id": 3,
            "text": "The Senate's next moves on the matter are still uncertain, but senators were set to return to Washington on Tuesday."
        },
        {
            "id": 4,
            "text": "The political popularity of the military typically means the National Defense Authorization Act has a high likelihood of passage and becomes one of the last vehicles of the year for compromise and enactment."
        },
        {
            "id": 5,
            "text": "Trump, however, opposes aspects of the bill that would rename military bases named for Confederate figures, and he also was angry that Democrats in Congress didn't agree to a bargain in which they'd lift some legal protections for tech companies."
        },
        {
            "id": 6,
            "text": "Trump says U.S. military facilities should continue to carry the names of men such as Confederate Gens. Robert E. Lee and Braxton Bragg."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "Separately, the president and some supporters claim Big Tech platforms such as Facebook and Twitter are biased against conservatives."
        },
        {
            "id": 9,
            "text": "A few Republicans in Congress have joined with Trump, but many leaders said they intended to support the override of his veto."
        },
        {
            "id": 10,
            "text": "House Speaker Nancy Pelosi, D-Calif., meanwhile, had called Trump's veto \"an act of staggering recklessness.\""
        },
        {
            "id": 11,
            "text": "House Armed Services Committee Chairman Adam Smith, D-Wash., called on his colleagues to vote in favor of the legislation again in debate Monday afternoon."
        },
        {
            "id": 12,
            "text": "\"It is enormously important we pass this bill."
        },
        {
            "id": 13,
            "text": "We did it once."
        },
        {
            "id": 14,
            "text": "Let's just do it one more time, and then we can all go home for the year,\" he said."
        },
        {
            "id": 15,
            "text": "Smith concluded his remarks by noting that the Armed Services Committee \"is the most bipartisan committee in Congress.\""
        },
        {
            "id": 16,
            "text": "\"That's not an easy thing to achieve."
        },
        {
            "id": 17,
            "text": "We have a lot of things we passionately disagree about in this body, and we should."
        },
        {
            "id": 18,
            "text": "But on the armed services bill, we manage to come together."
        },
        {
            "id": 19,
            "text": "It's not always easy, but we get it done."
        },
        {
            "id": 20,
            "text": "I think it is enormously important we let the country know that that process hasn't died.\""
        }
    ]
}