{
    "title": "Congressional Leaders Criticize Maxine Waters For Urging Confrontation",
    "text": [
        {
            "id": 0,
            "text": "Congressional Leaders Criticize Maxine Waters For Urging Confrontation\n\nEnlarge this image toggle caption Denis Poroy/AP Denis Poroy/AP"
        },
        {
            "id": 1,
            "text": "Updated 4:15 p.m. ET"
        },
        {
            "id": 2,
            "text": "A senior California Democratic lawmaker added some fresh fuel to the raging debate over civility in politics with a call for public confrontations with Trump administration officials."
        },
        {
            "id": 3,
            "text": "\"If you think we're rallying now you ain't seen nothing yet,\" Rep. Maxine Waters, D-Calif, told supporters at a rally in Los Angeles over the weekend."
        },
        {
            "id": 4,
            "text": "\"If you see anybody from that (Trump) Cabinet in a restaurant, in a department store, at a gasoline station, you get out and you create a crowd and you push back on them, and you tell them they're not welcome anymore, anywhere."
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "\"A video of her remarks was posted on Twitter on Sunday."
        },
        {
            "id": 7,
            "text": "Her remarks drew a response from President Trump, who called her \"an extraordinarily low IQ person\" in a tweet on Monday, and warned, \"Be careful what you wish for Max!\""
        },
        {
            "id": 8,
            "text": "Waters' comments come as at least three Trump administration officials — Homeland Security Secretary Kirstjen Nielsen, adviser Stephen Miller and spokeswoman Sarah Sanders — have been forced out, heckled or denied service in restaurants."
        },
        {
            "id": 9,
            "text": "Protesters have also targeted Nielsen at home in recent days over the Trump administration's immigration policies."
        },
        {
            "id": 10,
            "text": "Without naming Waters"
        },
        {
            "id": 11,
            "text": "directly, Minority Leader Nancy Pelosi, D-Calif., tweeted a CNN story about the controversy and said that President Trump's own incivility has \"provoked responses that are predictable but unacceptable.\""
        },
        {
            "id": 12,
            "text": "In a Monday morning appearance on Fox News, Majority Leader Kevin McCarthy, R-Calif., called on Waters to apologize."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "\"The people who claim tolerance seem to be the most intolerant in this process,\" McCarthy said."
        },
        {
            "id": 15,
            "text": "\"I have friends on the other side of the aisle where we philosophically disagree."
        },
        {
            "id": 16,
            "text": "We have debates about our philosophy difference, but we'll sit down and have dinner together, have a cup of coffee together.\""
        },
        {
            "id": 17,
            "text": "Senate Minority Leader Chuck Schumer, D-N.Y., weighed in Monday afternoon from the Senate floor."
        },
        {
            "id": 18,
            "text": "Like Pelosi, he did not mention Waters by name."
        },
        {
            "id": 19,
            "text": "\"I strongly disagree with those who advocate harassing folks if they don't agree with you,\" Schumer said, \"No one should call for the harassment of political opponents."
        },
        {
            "id": 20,
            "text": "That's not right."
        },
        {
            "id": 21,
            "text": "That's not American.\""
        },
        {
            "id": 22,
            "text": "Schumer criticized Trump as \"a man who habitually engages in bullying, name-calling, slander, and nastiness for its own sake\" and that he understands the instinct among Democrats who \"think we have to fight fire with fire.\""
        },
        {
            "id": 23,
            "text": "However, Schumer said the battle should be waged at the ballot box."
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": "\"The president's tactics and behavior should never be emulated, it should be repudiated,\" he said, \"The best solution is to win elections, that is a far more productive way to channel the legitimate frustrations with this president's policies than harassing members of his administration.\""
        },
        {
            "id": 26,
            "text": "Sanders began her White House briefing Monday by mentioning the restaurant incident."
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": "\"Healthy debate on ideas and political philosophy is important,\" she said, \"but the calls for harassment and push for any Trump supporter to avoid the public is unacceptable.\""
        },
        {
            "id": 29,
            "text": "Waters, 79, is a veteran lawmaker, a prominent member of the Congressional Black Caucus and the top Democrat on the House Financial Services Committee."
        },
        {
            "id": 30,
            "text": "She has found a new wave of popularity and viral fame within Democratic circles in the Trump era for her often provocative and combative rhetoric toward this administration in public and in cable news appearances."
        },
        {
            "id": 31,
            "text": "Waters was the subject of a viral 2017 meme in which she engaged in verbal combat with Treasury Secretary Stephen Mnuchin, repeatedly saying \"reclaiming my time\" to cut off the secretary when he did not respond directly to her questions."
        },
        {
            "id": 32,
            "text": "Earlier this year, she publicly argued that the president should be impeached."
        },
        {
            "id": 33,
            "text": "Waters' office did not immediately respond to a request for comment on congressional leaders' reaction to her statement."
        }
    ]
}