{
    "title": "Virginia Removes Its Robert E. Lee Statue From U.S. Capitol",
    "text": [
        {
            "id": 0,
            "text": "Virginia Removes Its Robert E. Lee Statue From U.S. Capitol"
        },
        {
            "id": 1,
            "text": "For more than 100 years, two statues representing Virginia have stood at the U.S. Capitol: one of George Washington and another of Confederate Gen. Robert E. Lee."
        },
        {
            "id": 2,
            "text": "But early Monday, the Lee statue was removed from the National Statuary Hall's collection."
        },
        {
            "id": 3,
            "text": "It's expected to be replaced by a statue honoring civil rights activist Barbara Johns."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "\"This is a historic and long-overdue moment for our Commonwealth,\" U.S. Reps. Donald McEachin and Jennifer Wexton, both Democrats from Virginia, said in a statement."
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "\"The Robert E. Lee statue honors a legacy of division, oppression, and racism — a dark period in the history of our Commonwealth and our country.\""
        },
        {
            "id": 8,
            "text": "\"We are proud to have led the effort in the House of Representatives to replace Lee's statue,\" they added."
        },
        {
            "id": 9,
            "text": "A commission established by the Virginia General Assembly recently selected Johns to replace Lee."
        },
        {
            "id": 10,
            "text": "The state's General Assembly is expected to vote on the pick during the legislative session next year."
        },
        {
            "id": 11,
            "text": "Many statues of controversial historical figures have recently been taken down across the U.S., as the country grapples with its long history of racial injustice."
        },
        {
            "id": 12,
            "text": "The Statuary Hall collection is made up of two statues from each state, displayed throughout the Capitol."
        },
        {
            "id": 13,
            "text": "Virginia contributed the Washington and Lee statues in 1909 – some 44 years after the end of the Civil War, as Virginia Gov. Ralph Northam noted."
        },
        {
            "id": 14,
            "text": "\"The Confederacy is a symbol of Virginia's racist and divisive history, and it is past time we tell our story with images of perseverance, diversity, and inclusion,\" Northam said in a statement."
        },
        {
            "id": 15,
            "text": "Johns was an important figure fighting school segregation."
        },
        {
            "id": 16,
            "text": "In 1951, when she was 16, she led a walk-out protesting inferior conditions at Robert Russa Moton High School, an all-Black school in Farmville, Va."
        },
        {
            "id": 17,
            "text": "\"Before the sit-ins in Greensboro, before the Montgomery bus boycott, there was the student strike here in 1951, led by Barbara Johns,\" Cameron Patterson, who heads a museum on the grounds of the former school, recently told NPR."
        },
        {
            "id": 18,
            "text": "\"When the students saw what was being provided to white students in this community at Farmville High School, there was certainly a recognition that our community was not meeting the needs of the students here.\""
        },
        {
            "id": 19,
            "text": "The strike caught the attention of the NAACP, which sued in a case that was later part of the landmark anti-segregation Supreme Court case, Brown v. Board of Education."
        },
        {
            "id": 20,
            "text": "The Lee statue will be moved to the Virginia Museum of History and Culture in Richmond, according to the governor's office."
        }
    ]
}