{
    "title": "Pressure intensifies for GOP to raise taxes on rich",
    "text": [
        {
            "id": 0,
            "text": "As President Obama and Capitol Hill leaders continue negotiations to avoid the looming “fiscal cliff,” top Democrats on Sunday ramped up pressure on their Republican counterparts to accept tax increases on the wealthy as part of a broader agreement."
        },
        {
            "id": 1,
            "text": "House Minority Leader Nancy Pelosi, California Democrat, flatly said “no” when asked if she’d accept a deal that didn’t include such provisions."
        },
        {
            "id": 2,
            "text": "Republicans continue to reject those outright tax increases, but remain open to modifying the tax code and possibly eliminating some deductions, particularly those that benefit the rich."
        },
        {
            "id": 3,
            "text": "Mr. Obama has also softened his rhetoric in recent days, putting less emphasis on raising tax rates on the wealthy as long as more revenue comes from that income group by closing loopholes or through other means."
        },
        {
            "id": 4,
            "text": "Finding a palatable middle ground — one that allows Mr. Obama to claim he’s fulfilling campaign promises and allows Republicans to remain true to their no-tax-increases pledge — is key to getting a deal done before the end of the year."
        },
        {
            "id": 5,
            "text": "Democrats see openness from Republicans to adjust or eliminate deductions and loopholes as a window of opportunity, and the ongoing discussion between the two sides represents the best chance for a meaningful agreement, said Sen. Richard J. Durbin, Illinois Democrat."
        },
        {
            "id": 6,
            "text": "“It’s an invitation for our side. …"
        },
        {
            "id": 7,
            "text": "You have to be careful."
        },
        {
            "id": 8,
            "text": "If you talk about taxes, [Republicans] run for the hills."
        },
        {
            "id": 9,
            "text": "But if you talk about revenue and tax reform, they sit still for that conversation,” he said on CNN’s “State of the Union.”"
        },
        {
            "id": 10,
            "text": "But congressional Republicans are also under pressure to push for deeper, more permanent changes to the way the federal government does business."
        },
        {
            "id": 11,
            "text": "Young leaders in the party, such as new Republican Governors Association Chairman Gov. Bobby Jindal of Louisiana, urged his party to tackle the root causes of the nation’s fiscal peril."
        },
        {
            "id": 12,
            "text": "“I guarantee, if they just put a Band-Aid on this, we’ll be in another fiscal cliff in a few months."
        },
        {
            "id": 13,
            "text": "We need structural changes, and that could be a balanced-budget amendment to the Constitution … a limit on the growth in government spending so it can’t grow faster than the economy or population growth, limiting government spending as a percentage of GDP,” he said on “Fox News Sunday.”"
        },
        {
            "id": 14,
            "text": "“Without those structural changes, we’re not getting anywhere."
        },
        {
            "id": 15,
            "text": "This is just kicking the can down the road,” he said."
        },
        {
            "id": 16,
            "text": "Sunday’s back-and-forth came just two days after a meeting of Mr. Obama and leaders from both sides at the White House, including House Speaker John A. Boehner, Ohio Republican; Mrs. Pelosi; Senate Majority Leader Harry Reid, Nevada Democrat; Senate Minority Leader Mitch McConnell, Kentucky Republican; Vice President Joseph R. Biden; and other members of the administration."
        },
        {
            "id": 17,
            "text": "The president said the public expects “tough compromises” to be made in order to make an agreement, with tax cuts set to expire for all taxpayers on Jan. 1 and automatic spending cuts due to hit most government agencies in the new year."
        },
        {
            "id": 18,
            "text": "“Our challenge is to make sure that we are able to cooperate together, work together, find some common ground, make some tough compromises, build some consensus to do the people’s business,” Mr. Obama said on Friday."
        },
        {
            "id": 19,
            "text": "“What folks are looking for, and I think all of us agree on this, is action."
        },
        {
            "id": 20,
            "text": "They want to see that we are focused on them, not focused on our politics here in Washington.”"
        },
        {
            "id": 21,
            "text": "Mr. Obama has been calling for any deal to include tax increases on families earning more than $250,000 per year, while insisting that tax cuts be preserved for families below that income level."
        },
        {
            "id": 22,
            "text": "In the days following Mr. Obama’s re-election victory over Republican Mitt Romney, Mr. Boehner offered something of an olive branch to the White House, signaling that some form of revenue increases would be on the table during negotiations."
        },
        {
            "id": 23,
            "text": "But several Republicans on Sunday reiterated that they’re much more interested in pursuing deep spending cuts rather than focusing on the revenue side."
        },
        {
            "id": 24,
            "text": "“Because what happens in Washington, D.C., is … we do an increase in taxes today, and we promise that there’s going to be spending cuts 10 years from now."
        },
        {
            "id": 25,
            "text": "And it never happens,” said Rep. Raul Labrador, Idaho Republican, speaking on NBC’s “"
        },
        {
            "id": 26,
            "text": "Meet the Press.”"
        },
        {
            "id": 27,
            "text": "Rep. Tom Price, Georgia Republican, said the GOP simply isn’t convinced that tax increases will have any real impact on deficit-reduction efforts."
        },
        {
            "id": 28,
            "text": "“It doesn’t solve the problem,” he said on “State of the Union.”"
        },
        {
            "id": 29,
            "text": "But Democrats are using similar arguments to attack the Republican-backed plan of tax reform and the closing of loopholes."
        },
        {
            "id": 30,
            "text": "“Just to close loopholes is far too little money,” Ms. Pelosi said on ABC’s “This Week.”"
        },
        {
            "id": 31,
            "text": "“If it’s going to bring in [the necessary] revenue, the president has been very clear that the higher-income people have to pay their fair share,” she added."
        }
    ]
}