{
    "title": "Obama On Loretta Lynch: 'You Don't Hold Attorney General Nominees Hostage'",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- President Barack Obama chastised Senate Republicans on Friday for refusing to confirm his attorney general nominee, saying it's inexcusable to hold Loretta Lynch \"hostage\" as a bargaining chip for separate legislation."
        },
        {
            "id": 1,
            "text": "\"You don't hold attorney general nominees hostage for other issues,\" Obama told The Huffington Post's Sam Stein in a sit-down interview."
        },
        {
            "id": 2,
            "text": "\"This is our top law enforcement office."
        },
        {
            "id": 3,
            "text": "Nobody denies that she's well-qualified."
        },
        {
            "id": 4,
            "text": "We need to go ahead and get her done.\""
        },
        {
            "id": 5,
            "text": "Lynch's nomination has been languishing for more than 130 days."
        },
        {
            "id": 6,
            "text": "This week, Senate Majority Leader Mitch McConnell (R-Ky.) threw up another roadblock, warning that she wouldn't get a vote until his chamber passes human trafficking legislation."
        },
        {
            "id": 7,
            "text": "Democrats object to anti-abortion language in the bill."
        },
        {
            "id": 8,
            "text": "The president's comments were essentially a call to arms to Senate Democrats to stand firm rather than surrender to the hostage-takers, i.e., Senate Republicans, on the trafficking bill."
        },
        {
            "id": 9,
            "text": "On Wednesday, Sen. Dick Durbin (D-Ill.) went after his GOP colleagues for the delay in voting on Lynch, suggesting that they were treating her differently because of her race."
        },
        {
            "id": 10,
            "text": "\"Loretta Lynch, the first African-American woman nominated to be attorney general, is asked to sit in the back of the bus when it comes to the Senate calendar,\" said Durbin."
        },
        {
            "id": 11,
            "text": "\"That is unfair."
        },
        {
            "id": 12,
            "text": "It's unjust."
        },
        {
            "id": 13,
            "text": "It is beneath the decorum and dignity of the U.S. Senate.\""
        },
        {
            "id": 14,
            "text": "\"I think race certainly can be considered a major factor in the delay,\" said Rep. G.K. Butterfield (D-N.C.), chair of the Congressional Black Caucus, on Tuesday."
        },
        {
            "id": 15,
            "text": "Obama, however, was less convinced about Republican motivations."
        },
        {
            "id": 16,
            "text": "\"I don't know about that,\" the president said on Friday, referring to the role that race may have played in delaying Lynch's confirmation."
        },
        {
            "id": 17,
            "text": "Instead, he pointed to \"Senate dysfunction\" and \"stubbornness on the part of Republicans to move nominees, period.\""
        },
        {
            "id": 18,
            "text": "\"What I do know is that she is eminently qualified."
        },
        {
            "id": 19,
            "text": "Nobody denies it,\" Obama said."
        },
        {
            "id": 20,
            "text": "\"Even the Republicans acknowledge she's been a great prosecutor."
        },
        {
            "id": 21,
            "text": "She has prosecuted terrorists in New York, she has gone after organized crime, she's gone after public corruption."
        },
        {
            "id": 22,
            "text": "Her integrity is unimpeachable."
        },
        {
            "id": 23,
            "text": "By all accounts, she's a great manager, and the fact that she has now been lingering in this limbo for longer than the five previous attorney general nominees combined makes no sense."
        },
        {
            "id": 24,
            "text": "We need to go ahead and get this done.\""
        },
        {
            "id": 25,
            "text": "Attorney General Eric Holder also dismissed the idea of race playing into the holdup during an MSNBC interview Friday."
        },
        {
            "id": 26,
            "text": "\"My guess is that there is probably not a huge racial component to this, that this is really just D.C. politics, Washington at its worst,\" he said."
        },
        {
            "id": 27,
            "text": "\"A battle about something that is not connected to this nominee, holding up this nominee."
        },
        {
            "id": 28,
            "text": "I think that's the main driver here.\""
        },
        {
            "id": 29,
            "text": "Lynch, currently the U.S. attorney for the Eastern District of New York, received a bipartisan boost Friday, when former New York City Mayor Rudy Giuliani (R) called on Republicans to stop stalling her confirmation."
        },
        {
            "id": 30,
            "text": "The president confirmed Friday that Holder, who has long been the target of GOP lawmakers' ire, has agreed to stay on as attorney general until his replacement is set."
        },
        {
            "id": 31,
            "text": "\"The irony is, of course, that the Republicans really dislike Mr. Holder,\" said Obama."
        },
        {
            "id": 32,
            "text": "\"If they really want to get rid of him, the best way to do it is to go ahead and get Loretta Lynch confirmed.\""
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": ""
        }
    ]
}