{
    "title": "Trump signs executive order on immigration, but says 'zero tolerance' will continue",
    "text": [
        {
            "id": 0,
            "text": "Kevin Johnson, David Jackson, Jessica Estepa\n\nUSA TODAY\n\nPresident Donald Trump, bowing to a deepening humanitarian crisis along the southwest border, signed an executive order Wednesday that promises to halt family separation while insisting that the administration's \"zero tolerance\" policy to prosecute all illegal immigrants would continue."
        },
        {
            "id": 1,
            "text": "“We’re going to have strong, very strong borders, but we’re going to keep the families together,\" Trump said."
        },
        {
            "id": 2,
            "text": "\"I didn’t like the sight or the feeling of families being separated.\""
        },
        {
            "id": 3,
            "text": "Vice President Mike Pence and Department of Homeland Security Secretary Kirstjen Nielsen stood by his side when he signed the order in the Oval Office."
        },
        {
            "id": 4,
            "text": "\"Thank you for your leadership, sir,\" said Nielsen, who has become the public face of the administration's policy that led to separation of children from adult immigrants charged with illegal entry."
        },
        {
            "id": 5,
            "text": "The order's title, \"Affording Congress an Opportunity to Address Family Separation,\" puts the onus on lawmakers to provide a long-term fix with legislative action."
        },
        {
            "id": 6,
            "text": "It authorizes DHS to keep families together when they are detained at the border, unless officials determine that the child's welfare is at \"risk.\""
        },
        {
            "id": 7,
            "text": "It also authorizes the Defense Department to provide facilities for housing those families."
        },
        {
            "id": 8,
            "text": "Also under the order, the Justice Department was directed to prioritize the prosecution of cases involving families."
        },
        {
            "id": 9,
            "text": "Justice officials had been working since early Wednesday on a draft of the order aimed at reversing politically-charged policy that has resulted in the separation of more than 2,000 children of adult illegal immigrants in the past month, an official familiar with the matter said Wednesday."
        },
        {
            "id": 10,
            "text": "The scope of the order, however, did not address how the already-separated children would be re-united with their parents."
        },
        {
            "id": 11,
            "text": "The text of the document appeared only to apply to families of future illegal immigrants, while fates of the existing detainees — children and adults — are likely to be left to Congress to resolve."
        },
        {
            "id": 12,
            "text": "The first signs that Trump was preparing to act emerged early Wednesday, as Nielsen huddled with the White House to discuss possible options, including an executive order, while Attorney General Jeff Sessions worked with Justice officials on the mechanics and language that would ultimately preserve the administration's promise to prosecute all those accused of illegal entry."
        },
        {
            "id": 13,
            "text": "More:Trump to sign executive order to end immigrant family separations: What we know now\n\nMore:Why are immigrant children being separated from parents?"
        },
        {
            "id": 14,
            "text": "All your questions answered\n\nMore:Fact check: What's really going on with immigrant children being detained at the border?"
        },
        {
            "id": 15,
            "text": "Hours later, Trump announced that he would take action to end family separation."
        },
        {
            "id": 16,
            "text": "“I’ll be signing something in a little while that’s going to do that,\" Trump said after he was asked about stopping the separation of families at the border."
        },
        {
            "id": 17,
            "text": "\"I’ll be doing something that’s somewhat preemptive and ultimately will be matched by legislation, I’m sure.”"
        },
        {
            "id": 18,
            "text": "The controversial zero tolerance policy was first announced more than a month ago by Sessions."
        },
        {
            "id": 19,
            "text": "“If you cross this border unlawfully, then we will prosecute you,” Sessions said in the shadow of California's busiest border crossing in San Diego."
        },
        {
            "id": 20,
            "text": "\"If you are smuggling a child, then we will prosecute you and that child will be separated from you as required by law.”"
        },
        {
            "id": 21,
            "text": "Some of the most intense public pressure to reverse course, had been applied to Nielsen, the public face of the strategy, and Sessions, the architect of the zero tolerance policy."
        },
        {
            "id": 22,
            "text": "Late Tuesday, protesters heckled Nielsen as she ate dinner at a downtown Washington, D.C., Mexican restaurant."
        },
        {
            "id": 23,
            "text": "And for his part, Sessions was rebuked by separate coalitions of state attorneys general and former federal prosecutors who called on the attorney general to halt the practice of separating children from their parents."
        },
        {
            "id": 24,
            "text": "Sessions also was the target of public condemnation from United Methodist clergy and lay members who suggested that that actions taken by the administration and the attorney general were akin to child abuse."
        },
        {
            "id": 25,
            "text": "Still, prior to his announcement, Trump again blamed Democrats for the problems, asserting that Republicans wanted security."
        },
        {
            "id": 26,
            "text": "\"I am working on something - it never ends!\""
        },
        {
            "id": 27,
            "text": "he tweeted."
        }
    ]
}