{
    "title": "In U.K., Christie advocates for ‘balance’ in vaccination debate",
    "text": [
        {
            "id": 0,
            "text": "New Jersey Gov. Chris Christie, on an overseas trip to the United Kingdom, said there needs to be a balance in considering parental concerns over vaccinations as the U.S. deals with a recent spread of measles."
        },
        {
            "id": 1,
            "text": "Asked if he would urge Americans to vaccinate their children, Mr. Christie said that “we vaccinate ours, and so, you know that’s the best expression I can give you of my opinion.”"
        },
        {
            "id": 2,
            "text": "“You know it’s much more important what you think as a parent than what you think as a public official,” he said, according to NBC News."
        },
        {
            "id": 3,
            "text": "“And that’s what we do."
        },
        {
            "id": 4,
            "text": "But I also understand that parents need to have some measure of choice in things as well, so that’s the balance that the government has to decide.”"
        },
        {
            "id": 5,
            "text": "Asked if he thinks some vaccines are dangerous, Mr. Christie said he didn’t say that."
        },
        {
            "id": 6,
            "text": "“I said different disease types can be more lethal so that the concern would be measuring whatever the perceived danger is by vaccine and we’ve had plenty of that over a period of time versus what the risk to public health is and you have to have that balance and that’s exactly what I mean by what I said,” he said."
        },
        {
            "id": 7,
            "text": "His office later sent out a clarification on the remarks, saying that Mr. Christie believes vaccines are an important public health protection and with a disease like measles there is “no question” kids should be vaccinated."
        },
        {
            "id": 8,
            "text": "At the same time, his office said, different states have different requirements on vaccinations, which is why he called for a balance in which ones should be mandated by the government."
        },
        {
            "id": 9,
            "text": "In an interview with NBC’s Savannah Guthrie, President Obama advised parents to get their kids vaccinated, saying that measles is “preventable” and that the science is “pretty indisputable.”"
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}