{
    "title": "Senate Leaders Announce Deal On Human Trafficking Bill, Clearing Path For Loretta Lynch Vote",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- Senate leaders announced Tuesday that they've resolved a weeks-long standoff over a sex trafficking bill containing controversial anti-abortion language, clearing the way, at last, for U.S. attorney general nominee Loretta Lynch to get her confirmation vote."
        },
        {
            "id": 1,
            "text": "Lynch has been waiting for more than five months for a confirmation vote."
        },
        {
            "id": 2,
            "text": "Most recently, Republican leaders tied the vote to passage of the trafficking bill."
        },
        {
            "id": 3,
            "text": "That bill has nothing to do with Lynch, but as long as it wasn't moving, neither was Lynch's confirmation."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "Aides to Sens. Patty Murray (D-Wash.) and John Cornyn (R-Texas) have been working for weeks to break the impasse."
        },
        {
            "id": 6,
            "text": "As introduced, the bill would have collected fees from sex traffickers and put them into a new victims fund that would be subject to the Hyde Amendment, the federal provision that bars the use of federal funds for abortions except in cases of rape and incest."
        },
        {
            "id": 7,
            "text": "Democrats objected to the abortion language in general, but more so because the bill expanded the Hyde Amendment to include private funds."
        },
        {
            "id": 8,
            "text": "Under the deal announced Tuesday, the bill will create two funding streams."
        },
        {
            "id": 9,
            "text": "The first one flows from fines collected from sex traffickers, and would be used for survivor services excluding health care."
        },
        {
            "id": 10,
            "text": "This stream would not include Hyde Amendment restrictions."
        },
        {
            "id": 11,
            "text": "The second one would come from community health center funds that are already subject to the abortion limits."
        },
        {
            "id": 12,
            "text": "The deal lets both parties walk away with a solid talking point: Democrats can celebrate that they prevented an expansion of Hyde, while Republicans can say they didn't cave on restricting abortion funds."
        },
        {
            "id": 13,
            "text": "\"I’m pleased that we were able to reach a deal that gets this done in a way that does not expand restrictions on women’s health to non-taxpayer dollars or to new programs, and provides survivors with real dedicated funds for the support and services they need,\" Murray said on the Senate floor."
        },
        {
            "id": 14,
            "text": "\"No compromise is perfect,\" she added."
        },
        {
            "id": 15,
            "text": "\"I’m sure Senator Cornyn would say the same thing.\""
        },
        {
            "id": 16,
            "text": "Cornyn said he was \"thrilled\" that they've reached a deal on the bill, which has broad bipartisan support."
        },
        {
            "id": 17,
            "text": "A spokesman for Senate Majority Leader Mitch McConnell (R-Ky.) said he expects the Senate to pass the sex trafficking bill on Wednesday."
        },
        {
            "id": 18,
            "text": "From there, the Senate will move to Lynch's confirmation vote."
        },
        {
            "id": 19,
            "text": "McConnell said the attorney general nominee should get a vote \"in the next day or so.\""
        },
        {
            "id": 20,
            "text": "Last week, President Barack Obama fumed that Republicans have made Lynch wait for so long, saying the delay is just \"embarrassing.\""
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}