{
    "title": "Purported terrorist recruitment video includes Donald Trump clip",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "A recruitment video purportedly released by a major al-Qaeda-affiliated terrorist group and aimed at American Muslims includes a clip of Republican presidential candidate Donald Trump's call for a ban on Muslims entering the U.S., the SITE Intelligence Group reported Saturday."
        },
        {
            "id": 2,
            "text": "The video weaves together Trump's remarks, delivered at a campaign appearance Dec. 7 in South Carolina, with archival video of now-dead top al-Qaeda recruiter Anwar al-Awlaki calling on Muslims in the West to either leave or \"stay and fight.\""
        },
        {
            "id": 3,
            "text": "In the archival clip, the American-born al-Awlaki, who was killed in a 2011 drone strike in Yemen, calls on Muslims in the West to \"learn from the lessons of history.\""
        },
        {
            "id": 4,
            "text": "\"There are storm clouds gathering on your horizon,\" al-Awlaki says, noting America's history with slavery and the Ku Klux Klan. \""
        },
        {
            "id": 5,
            "text": "Tomorrow it will be a land of religious discrimination and concentration camps.\""
        },
        {
            "id": 6,
            "text": "The video shows Trump saying: \"Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the [expletive] is going on.\""
        },
        {
            "id": 7,
            "text": "The group bleeps out his use of the word \"hell.\""
        },
        {
            "id": 8,
            "text": "The clips are part of a 51-minute propaganda video released by al-Shabab, al-Qaeda's Somalia-based affiliate."
        },
        {
            "id": 9,
            "text": "It is the second in a series of two al-Shabab recruitment videos highlighting American-born jihadis fighting for the group in Somalia, according to SITE, a U.S.-based organization that monitors extremist activity online."
        },
        {
            "id": 10,
            "text": "The video was distributed Friday on Twitter by the al-Kataib Media Foundation, an Islamist militant organization, SITE reported, according to Reuters."
        },
        {
            "id": 11,
            "text": "The video comes two weeks after a heated exchange between the Trump camp and the campaign of Democratic presidential candidate Hillary Clinton, who said during a Democratic candidates' debate last month that Trump's remarks about Muslim immigrants made him the \"best recruiter\" for the Islamic State, a terror group not affiliated with al-Shabab."
        },
        {
            "id": 12,
            "text": "She suggested the extremist group was using Trump in its recruiting videos."
        },
        {
            "id": 13,
            "text": "The statement was strongly rejected by Trump, who said on ABC's This Week on Dec. 20: \"Knowing the Clintons and knowing Hillary, she made it up.\""
        },
        {
            "id": 14,
            "text": "He also demanded an apology from the Clinton campaign, which replied: \"Hell, no!\""
        },
        {
            "id": 15,
            "text": "The Clinton camp, however, clarified her comments by saying she was not referring to a specific video but that the sharp remarks by Trump about Muslims were being used on social media in the Middle East to recruit new radical followers."
        },
        {
            "id": 16,
            "text": "\"She’s not referring to a specific video, but he is being used in social media by ISIS as propaganda,” Clinton communications director Jen Palmieri said, using an acronym for the terror group."
        }
    ]
}