{
    "title": "Tulsi Gabbard Votes ‘Present’ on Impeachment Articles",
    "text": [
        {
            "id": 0,
            "text": "Representative Tulsi Gabbard, a Hawaii Democrat and 2020 presidential candidate, broke with most members of her party on Wednesday and voted “present” on the two articles of impeachment charging President Trump with abuse of power and obstruction of Congress."
        },
        {
            "id": 1,
            "text": "Ms. Gabbard, the only presidential candidate who had a vote on impeachment, criticized the proceedings as “a partisan process, fueled by tribal animosities,” and said she had introduced a resolution to censure Mr. Trump, rather than remove him from office."
        },
        {
            "id": 2,
            "text": "“I came to the conclusion that I could not in good conscience vote either yes or no,” Ms. Gabbard said in a statement."
        },
        {
            "id": 3,
            "text": "“I am standing in the center and have decided to vote present.”"
        },
        {
            "id": 4,
            "text": "Ms. Gabbard was not the only Democrat to break from the mostly party-line vote."
        },
        {
            "id": 5,
            "text": "Representatives Collin C. Peterson of Minnesota and Jeff Van Drew of New Jersey voted against both articles of impeachment, while Representative Jared Golden of Maine opposed only the article accusing the president of obstruction of Congress."
        },
        {
            "id": 6,
            "text": "Ms. Gabbard, 38, has a history of defying party leaders."
        },
        {
            "id": 7,
            "text": "She resigned as the Democratic National Committee vice chair to endorse Senator Bernie Sanders of Vermont over Hillary Clinton during the 2016 presidential election."
        },
        {
            "id": 8,
            "text": "In October, she and Mrs. Clinton sparred after Mrs. Clinton suggested that Russia was backing Ms. Gabbard for president and that Republicans were “grooming” her for a third-party run."
        },
        {
            "id": 9,
            "text": "Ms. Gabbard responded on Twitter, calling Mrs. Clinton “the queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party for so long.”"
        },
        {
            "id": 10,
            "text": "On Wednesday, Ms. Gabbard explained her present votes by saying she could not in good conscience vote against impeachment “because I believe President Trump is guilty of wrongdoing.”"
        },
        {
            "id": 11,
            "text": "“I also could not in good conscience vote for impeachment because removal of a sitting president must not be the culmination of a partisan process, fueled by tribal animosities that have so gravely divided our country,” she said."
        },
        {
            "id": 12,
            "text": "Ms. Gabbard, a popular guest on conservative media outlets, has attracted some support on the right."
        },
        {
            "id": 13,
            "text": "Her unorthodox policy agenda mixes opposition to foreign military interventions with liberal social views and libertarian leanings on issues like drug decriminalization."
        },
        {
            "id": 14,
            "text": "Ms. Gabbard said she introduced a measure to censure Mr. Trump on Wednesday."
        },
        {
            "id": 15,
            "text": "The censure resolution, she said, “will send a strong message to this president and future presidents that their abuses of power will not go unchecked, while leaving the question of removing Trump from office to the voters to decide.”"
        },
        {
            "id": 16,
            "text": "Ms. Gabbard said that when she voted to support the impeachment inquiry nearly three months ago, she stated that for the process to maintain integrity, “it must not be a partisan endeavor.”"
        },
        {
            "id": 17,
            "text": "“Tragically, that’s what it has been,” she said."
        }
    ]
}