{
    "title": "House votes for delays on Obamacare; some Democrats give support to GOP move",
    "text": [
        {
            "id": 0,
            "text": "The House voted Wednesday to delay mandates in the federal health care law requiring individuals and large employers to have coverage, with dozens of Democrats joining Republicans in poking a symbolic hole in the president’s signature achievement."
        },
        {
            "id": 1,
            "text": "Both votes left Democratic leaders struggling to grapple with the health care law, which they powered through in 2010 but now are struggling to keep on track amid complaints from businesses that they are having a tough time understanding it, and fears that individuals won’t sign up."
        },
        {
            "id": 2,
            "text": "Boxed in by what they said were Republican tricks, 35 Democrats joined with Republicans to give large businesses a one-year reprieve on following the law, helping pass that provision on a 264-161 vote."
        },
        {
            "id": 3,
            "text": "Moments later, the House voted 251-174 to give individuals the same one-year break."
        },
        {
            "id": 4,
            "text": "In that vote, 22 Democrats joined Republicans."
        },
        {
            "id": 5,
            "text": "“This law is imploding, this law is unnecessary,” said Rep. Paul Ryan, Wisconsin Republican and former vice presidential candidate."
        },
        {
            "id": 6,
            "text": "Senate Republicans said the bipartisan nature of the House votes should push Senate Democrats to bring up the bills for votes in their chamber, too."
        },
        {
            "id": 7,
            "text": "But that is unlikely, and Mr. Obama has said he will veto both bills if they reach his desk."
        },
        {
            "id": 8,
            "text": "He said the bill to enshrine his one-year delay for businesses is unnecessary, and that the delay on the individual mandate would hurt the insurance exchanges set up to offer markets for individuals who don’t have coverage."
        },
        {
            "id": 9,
            "text": "Democrats said the votes amounted to a political sideshow."
        },
        {
            "id": 10,
            "text": "“This bill and the other bill are not real."
        },
        {
            "id": 11,
            "text": "They are purely partisan politics,” said House Minority Whip Steny H. Hoyer, Maryland Democrat."
        },
        {
            "id": 12,
            "text": "Democrats said Republicans are inflating the impact of delaying the employer mandate, since 95 percent of companies with more than 50 full-time workers already offer insurance."
        },
        {
            "id": 13,
            "text": "Without the individual mandate, Democrats said, healthier Americans may shirk coverage and leave only the sickest patients in the risk pool, dooming the insurance market."
        },
        {
            "id": 14,
            "text": "Mr. Obama created the conundrum for his party earlier this month when he announced that he would delay the employer mandate, which requires businesses with 50 or more workers to offer health care coverage or else pay fines."
        },
        {
            "id": 15,
            "text": "The administration said it was trying to give businesses more time to comply."
        },
        {
            "id": 16,
            "text": "Some Democrats and Republicans have questioned whether he had the legal authority to implement a delay on his own, and Republicans saw a political opportunity, putting two bills on the floor: one to enshrine the president’s move into law, which would make Democrats have to either agree or disagree with Mr. Obama, and the other to extend the delay to average Americans, too."
        },
        {
            "id": 17,
            "text": "Rep. Kyrsten Sinema, an Arizona Democrat who voted for both delays, said she doesn’t want to repeal the law but that a one-year break is worthwhile to let businesses and families figure out what they need to do."
        },
        {
            "id": 18,
            "text": "“Arizona’s hardworking families and businesses need transparency and certainty about this health care law and its implementation,” she said."
        },
        {
            "id": 19,
            "text": "“A one-year delay will ensure that Arizonans get that certainty.”"
        },
        {
            "id": 20,
            "text": "Mr. Obama is scheduled to give a speech Thursday touting the benefits Americans are already seeing from the law, including news from New York, where officials this week said individuals buying insurance on the state-based health care exchange in 2014 will see their premiums drop by an average of 50 percent compared with last year’s direct-pay individual rates."
        },
        {
            "id": 21,
            "text": "Those figures do not account for government subsidies that will drive down costs further."
        },
        {
            "id": 22,
            "text": "Supporters of the law said reduced rates in the Empire State and several others are proof that Mr. Obama’s reforms are increasing competition and benefiting consumers."
        },
        {
            "id": 23,
            "text": "The Treasury and White House used a pair of blog posts July 2 to announce the delay of the employer mandate."
        },
        {
            "id": 24,
            "text": "They said business leaders were concerned about the mandate’s complex reporting requirements, and that it was more important to implement the law correctly than quickly."
        },
        {
            "id": 25,
            "text": "“Some of this stuff is a little bit complicated,” Rep. Ron Kind, Wisconsin Democrat, said Wednesday at a hearing on the delay."
        },
        {
            "id": 26,
            "text": "But Republican leaders seized on the announcement as proof that the law is flawed — and that the president knows it."
        },
        {
            "id": 27,
            "text": "They applauded the delay, while criticizing the administration for “unilaterally” deciding to put off a provision written into law."
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": ""
        }
    ]
}