{
    "title": "Federal judge blocks Trump's new asylum rules: 'He may not rewrite the immigration laws'",
    "text": [
        {
            "id": 0,
            "text": "A federal judge in San Francisco blocked new rules put into place by President Donald Trump that limit the ability of immigrants to request asylum, a legal blow to the administration’s efforts to curb legal immigration that opens the door for more members of the immigrant caravan to request asylum in the USA."
        },
        {
            "id": 1,
            "text": "U.S. District Judge Jon Tigar ruled late Monday that the administration's new policy of cutting off asylum to immigrants who enter the country illegally appears to run afoul of U.S. law that specifically allows them to do so."
        },
        {
            "id": 2,
            "text": "The 1965 Immigration and Nationality Act states that any foreigner who arrives in the USA, \"whether or not at a designated port of arrival,\" may apply for asylum."
        },
        {
            "id": 3,
            "text": "On Nov. 9, Trump tried to overrule that law, signing a presidential proclamation ending the ability of immigrants to request asylum if they enter the country illegally."
        },
        {
            "id": 4,
            "text": "“The rule barring asylum for immigrants who enter the country outside a port of entry irreconcilably conflicts with the INA and the expressed intent of Congress,\" wrote Tigar, who was appointed by President Barack Obama."
        },
        {
            "id": 5,
            "text": "\"Whatever the scope of the President’s authority, he may not rewrite the immigration laws to impose a condition that Congress has expressly forbidden.”"
        },
        {
            "id": 6,
            "text": "More:Immigrants' makeshift shelter in Tijuana nears capacity\n\nMore:Job fair kicks off for stranded immigrants facing long wait times in Tijuana"
        },
        {
            "id": 7,
            "text": "Tigar issued a temporary restraining order, meaning the administration is forbidden from enforcing the new rules until the court case proceeds Dec. 19."
        },
        {
            "id": 8,
            "text": "In a joint statement Tuesday, the Departments of Homeland Security and Justice said it was “absurd” that a collection of advocacy groups were able to sue the federal government to stop the asylum policy."
        },
        {
            "id": 9,
            "text": "The lawsuit was filed by the American Civil Liberties Union on behalf of four groups that help immigrants."
        },
        {
            "id": 10,
            "text": "The statement did not announce an appeal, but it made clear that the administration will fight Tigar’s ruling in court."
        },
        {
            "id": 11,
            "text": "\"We look forward to continuing to defend the Executive Branch's legitimate and well-reasoned exercise of its authority to address the crisis at our southern border,\" wrote Homeland Security spokeswoman Katie Waldman and Justice spokesman Steven Stafford."
        },
        {
            "id": 12,
            "text": "The White House later issued a statement saying the “decision will open the floodgates, inviting countless illegal aliens to pour into our country on the American taxpayer’s dime.”"
        },
        {
            "id": 13,
            "text": "“This temporary injunction is yet another example of activist judges imposing their open borders policy preferences, which are rejected by the overwhelming majority of the American people, and interfering with the executive branch’s authority to administer the immigration system in a manner that ensures the Nation’s safety, security, and the rule of law,” the statement said."
        },
        {
            "id": 14,
            "text": "As that legal process moves along, the ruling could have an immediate impact on members of the immigrant caravan of mostly Central Americans who are gathering in Tijuana to try to enter the USA."
        },
        {
            "id": 15,
            "text": "Asylum is a form of protection granted to people who fear persecution in their home countries based on their race, religion, nationality, membership in a particular social group or their political opinion."
        },
        {
            "id": 16,
            "text": "From 2000 to 2016, the United States granted asylum to an average of 26,651 foreigners a year, according to Department of Homeland Security data."
        },
        {
            "id": 17,
            "text": "The number of asylum applications has skyrocketed in recent years, from 5,000 in 2008 to 97,000 in 2018, mostly fueled by Central Americans fleeing violence and poverty in their home countries."
        },
        {
            "id": 18,
            "text": "Trump signed his directive after a monthlong attack against the immigrant caravan."
        },
        {
            "id": 19,
            "text": "He took to the campaign trail to warn about a looming \"invasion\" from caravan members who were criminals, gang members and \"Middle Easterners.\""
        },
        {
            "id": 20,
            "text": "To justify the move, he relied on a law that allows a president to suspend entry of foreigners if he signs a proclamation declaring them \"detrimental to the interests of the United States."
        },
        {
            "id": 21,
            "text": "\" That's the same rationale he used to implement his controversial travel ban targeting majority-Muslim countries."
        },
        {
            "id": 22,
            "text": "The first two versions of the travel ban were shot down in court, but the third was upheld by the Supreme Court."
        },
        {
            "id": 23,
            "text": "Department of Justice lawyers cited the travel ban decision in the asylum lawsuit."
        },
        {
            "id": 24,
            "text": "\"Consistent with this explanation, the proclamation imposes limited measures to ameliorate the crisis along the southern border,\" the lawyers wrote."
        },
        {
            "id": 25,
            "text": "The ACLU argued that the president's powers over immigration are not absolute and do not allow him to unilaterally cut off asylum for entire groups of people."
        },
        {
            "id": 26,
            "text": "“The Court’s ruling makes clear that the President cannot override Congress, and will save lives,\" said Lee Gelernt, the ACLU attorney who brought the suit."
        },
        {
            "id": 27,
            "text": "In court filings, the ACLU argued that the asylum restrictions were a direct challenge to the clear intention of Congress when it passed the 1965 Immigration and Nationality Act."
        },
        {
            "id": 28,
            "text": "The group cited a 1951 United Nations treaty signed by the United States that says \"refugees should not be penalized for their illegal entry\" because extreme situations sometimes \"require refugees to breach immigration rules.\""
        },
        {
            "id": 29,
            "text": "The ACLU used the example of the immigrant caravan, which is massing by the thousands in Tijuana, Mexico."
        },
        {
            "id": 30,
            "text": "Many members have said they want to present themselves at ports of entry to make their asylum request, but the majority cannot do so because U.S. officials at the San Ysidro Port of Entry can process only about 100 requests a day."
        },
        {
            "id": 31,
            "text": "That has left caravan members stranded in Tijuana, a \"life-threatening\" situation that leaves them vulnerable to criminals who seek to take advantage of them, the ACLU attorneys wrote."
        },
        {
            "id": 32,
            "text": "\"Asylum seekers turned back from a port of entry have been raped, beaten, and kidnapped and held for ransom by cartel members waiting outside,\" they wrote."
        },
        {
            "id": 33,
            "text": "\"Asylum seekers who need to reach safety as quickly as possible thus often feel compelled to enter the United States along the border, outside of a port of entry, in order to escape their persecutors and the violence on Mexico’s side of the border.\""
        },
        {
            "id": 34,
            "text": "A separate lawsuit filed in Washington challenges another move by the Trump administration to limit asylum claims."
        },
        {
            "id": 35,
            "text": "In that case, the ACLU and other groups say the administration overstepped its legal limits when it issued rules barring immigrants from qualifying for asylum based on domestic abuse or gang violence."
        },
        {
            "id": 36,
            "text": "Lawyers argued that case Monday, and the judge could issue a ruling any day."
        }
    ]
}