{
    "title": "Biden expected to tap Antony Blinken to be secretary of state",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON —"
        },
        {
            "id": 1,
            "text": "Presumptive President-elect Joseph R. Biden is expected to nominate Antony Blinken as secretary of state, according to multiple people familiar with the Biden team’s planning."
        },
        {
            "id": 2,
            "text": "Blinken, 58, served as deputy secretary of state and deputy national security adviser during the Obama administration and has close ties with Biden."
        },
        {
            "id": 3,
            "text": "If nominated and confirmed, he would be a leading force in the incoming administration’s bid to reframe the U.S. relationship with the rest of the world after four years in which President Donald Trump questioned longtime alliances."
        },
        {
            "id": 4,
            "text": "In nominating Blinken, Biden would sidestep potentially thorny issues that could have affected Senate confirmation for two other candidates on his short list to be America’s top diplomat: Susan Rice and Sen. Chris Coons."
        },
        {
            "id": 5,
            "text": "Rice would have faced significant GOP opposition and likely rejection in the Senate."
        },
        {
            "id": 6,
            "text": "She has long been a target of Republicans, including for statements she made after the deadly 2012 attacks on Americans in Benghazi, Libya.\n\nCoons’ departure from the Senate would have come as other Democratic senators are being considered for administrative posts and the party is hoping to win back the Senate."
        },
        {
            "id": 7,
            "text": "Control hangs on the result of two runoff elections in Georgia in January."
        },
        {
            "id": 8,
            "text": "Biden is likely to name his Cabinet picks in tranches, with groups of nominees focused on a specific top area, like the economy, national security or public health, being announced at once."
        },
        {
            "id": 9,
            "text": "Advisers to the president-elect’s transition have said they’ll make their first Cabinet announcements on Tuesday."
        },
        {
            "id": 10,
            "text": "If Biden focuses on national security that day, Michele Flournoy, a veteran of Pentagon policy jobs, is a top choice to lead the Defense Department."
        },
        {
            "id": 11,
            "text": "Jake Sullivan, a longtime adviser to Biden and Hillary Clinton, is also in the mix for a top job, including White House national security adviser."
        },
        {
            "id": 12,
            "text": "For his part, Blinken recently participated in a national security briefing with Biden and Vice President-elect Kamala Harris and has weighed in publicly on notable foreign policy issues in Egypt and Ethiopia."
        },
        {
            "id": 13,
            "text": "Biden’s secretary of state would inherit a deeply demoralized and depleted career workforce at the State Department."
        },
        {
            "id": 14,
            "text": "Trump’s two secretaries of state, Rex Tillerson and Mike Pompeo, offered weak resistance to the administration’s attempts to gut the agency, which were thwarted only by congressional intervention."
        },
        {
            "id": 15,
            "text": "Although the department escaped massive proposed cuts of more than 30% in its budget for three consecutive years, it has seen a significant number of departures from its senior and rising mid-level ranks, from which many diplomats have opted to retire or leave the foreign service given limited prospects for advancements under an administration that they believe does not value their expertise."
        },
        {
            "id": 16,
            "text": "A graduate of Harvard University and Columbia Law School and a longtime Democratic foreign policy presence, Blinken has aligned himself with numerous former senior national security officials who have called for a major reinvestment in American diplomacy and renewed emphasis on global engagement."
        },
        {
            "id": 17,
            "text": "“Democracy is in retreat around the world, and unfortunately it’s also in retreat at home because of the president taking a two-by-four to its institutions, its values and its people every day,” Blinken told The Associated Press in September."
        },
        {
            "id": 18,
            "text": "“Our friends know that Joe Biden knows who they are."
        },
        {
            "id": 19,
            "text": "So do our adversaries."
        },
        {
            "id": 20,
            "text": "That difference would be felt on day one.”"
        },
        {
            "id": 21,
            "text": "Blinken served on the National Security Council during the Clinton administration before becoming staff director for the Senate Foreign Relations Committee when Biden was chair of the panel."
        },
        {
            "id": 22,
            "text": "In the early years of the Obama administration, Blinken returned to the NSC and was then-Vice President Biden’s national security adviser before he moved to the State Department to serve as deputy to Secretary of State John Kerry."
        },
        {
            "id": 23,
            "text": "Biden has pledged to build the most diverse government in modern history, and he and his team often speak about their desire for his administration to reflect America."
        },
        {
            "id": 24,
            "text": "He is being watched to see whether he will make history by nominating the first woman to lead the Pentagon, the Treasury Department or the Department of Veterans Affairs, or the first African American at the top of the Defense Department, the Interior Department or the Treasury Department."
        },
        {
            "id": 25,
            "text": "Ron Klain, Biden’s incoming chief of staff, said Sunday the Trump administration’s refusal to clear the way for Biden’s team to have access to key information about agencies and federal dollars for the transition is taking its toll on planning, including the Cabinet selection process."
        },
        {
            "id": 26,
            "text": "Trump’s General Services Administration has yet to acknowledge that Biden won the election – a determination that would remove those roadblocks."
        },
        {
            "id": 27,
            "text": "“We’re not in a position to get background checks on Cabinet nominees."
        },
        {
            "id": 28,
            "text": "And so there are definite impacts."
        },
        {
            "id": 29,
            "text": "Those impacts escalate every day,” Klain told ABC’s “This Week.”"
        },
        {
            "id": 30,
            "text": "Even some Republicans have broken with Trump in recent days and called on him to begin the transition."
        },
        {
            "id": 31,
            "text": "Joining the growing list were Sens. Kevin Cramer of North Dakota, Lamar Alexander of Tennessee, Pat Toomey of Pennsylvania and Lisa Murkowski of Alaska."
        },
        {
            "id": 32,
            "text": "Former Republican Gov. Chris Christie of New Jersey, a longtime Trump supporter, told ABC that it was time for the president to stop contesting the outcome and called Trump’s legal team seeking to overturn the election a “national embarrassment.”"
        },
        {
            "id": 33,
            "text": "Meanwhile, planning was underway for a pandemic-modified inauguration Jan. 20."
        },
        {
            "id": 34,
            "text": "Klain said the Biden team was consulting with Democratic leadership in the House and Senate over their plans."
        },
        {
            "id": 35,
            "text": "“They’re going to try to have an inauguration that honors the importance and the symbolic meaning of the moment, but also does not result in the spread of the disease."
        },
        {
            "id": 36,
            "text": "That’s our goal,” Klain said."
        },
        {
            "id": 37,
            "text": ""
        },
        {
            "id": 38,
            "text": ""
        },
        {
            "id": 39,
            "text": ""
        }
    ]
}