{
    "title": "Former Obama White House Counsel Greg Craig Goes On Trial Over Ukraine Work",
    "text": [
        {
            "id": 0,
            "text": "Former Obama White House Counsel Greg Craig Goes On Trial Over Ukraine Work"
        },
        {
            "id": 1,
            "text": "Former Obama White House counsel Greg Craig goes on trial Monday, accused of making false statements connected to work he did on behalf of powerful interests in Ukraine."
        },
        {
            "id": 2,
            "text": "Craig, a top attorney in Democratic political circles who worked for two Democratic presidents, was indicted in April on two counts of providing false statements to the Justice Department related to his Ukraine work."
        },
        {
            "id": 3,
            "text": "The judge presiding over the case threw out one of those counts last week, but Craig will still go to trial on the single remaining count."
        },
        {
            "id": 4,
            "text": "The case against Craig, who has pleaded not guilty, was born out of former special counsel Robert Mueller's Russia probe."
        },
        {
            "id": 5,
            "text": "During its investigation, Mueller's team uncovered evidence of alleged wrongdoing by Craig, but referred the material to the U.S. Attorney's Office for the District of Columbia for prosecution."
        },
        {
            "id": 6,
            "text": "It is one of several cases to emerge from the Mueller inquiry that allege violations of the Foreign Agents Registration Act."
        },
        {
            "id": 7,
            "text": "The law, known as FARA, requires that people doing political or public relations work in the U.S. on behalf of a foreign entity disclose that fact."
        },
        {
            "id": 8,
            "text": "It is illegal to willfully not register or to provide false or misleading statements to the Justice Department's FARA unit."
        },
        {
            "id": 9,
            "text": "Politics Lobbyists See The Indictment Of Powerful Lawyer Gregory Craig"
        },
        {
            "id": 10,
            "text": "As A Warning Lobbyists See The Indictment Of Powerful Lawyer Gregory Craig"
        },
        {
            "id": 11,
            "text": "As A Warning Listen · 2:48 2:48"
        },
        {
            "id": 12,
            "text": "In Craig's case, prosecutors say he did just that in connection with his work for the Ukrainian government."
        },
        {
            "id": 13,
            "text": "The indictment alleges that Craig withheld information that he knew he should have provided to the department and provided other information that he knew was incorrect."
        },
        {
            "id": 14,
            "text": "Craig's lawyers, William W. Taylor III and William J. Murphy of the law firm Zuckerman Spaeder, have denied that Craig broke the law."
        },
        {
            "id": 15,
            "text": "In a statement at the time of the indictment, they called the government's prosecution \"a misguided abuse of prosecutorial discretion.\""
        },
        {
            "id": 16,
            "text": "The case against Craig dates back to work he and his law firm — Skadden, Arps, Slate, Meagher & Flom — did for Ukraine's pro-Russian government in 2012."
        },
        {
            "id": 17,
            "text": "Paul Manafort, who was advising the government in Kiev at the time, helped hire Craig and Skadden to draw up a report on the government's prosecution of former Prime Minister Yulia Tymoshenko."
        },
        {
            "id": 18,
            "text": "Manafort, of course, later became Trump's campaign chairman in 2016 before quitting the post amid questions about his Ukraine work."
        },
        {
            "id": 19,
            "text": "He was later convicted in a bank and tax fraud trial in Virginia brought by Mueller's team."
        },
        {
            "id": 20,
            "text": "Internationally, the case against Tymoshenko was viewed as a politically motivated sham pushed by her rival, then-President Viktor Yanukovych."
        },
        {
            "id": 21,
            "text": "After it was brought on board, Skadden drew up a report that validated the Tymoshenko prosecution."
        },
        {
            "id": 22,
            "text": "Craig then allegedly briefed journalists to shape early international coverage of the report."
        },
        {
            "id": 23,
            "text": "Craig and Skadden, however, did not register their activities with the Justice Department."
        },
        {
            "id": 24,
            "text": "Prosecutors say Craig did not register his work with the Justice Department in order to avoid disclosing that Craig and Skadden had been paid $4 million for the work."
        },
        {
            "id": 25,
            "text": "Publicizing that fact would have undermined the perceived independence and credibility of the report, prosecutors say."
        },
        {
            "id": 26,
            "text": "Early this year, Skadden reached a settlement of its own with the Justice Department that allowed it to avoid prosecution."
        },
        {
            "id": 27,
            "text": "It agreed to register under FARA and pay about $4.6 million."
        },
        {
            "id": 28,
            "text": "Craig's trial opens Monday with jury selection."
        },
        {
            "id": 29,
            "text": "The trial is expected to last 2 1/2 weeks."
        }
    ]
}