{
    "title": "Trump attacks Robert Mueller's 'hit squad' in row over 'wiped' phones",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump called Robert Mueller’s investigators a “hit squad” on Saturday, joining rightwing outcry over Department of Justice documents that indicated members of the Russia investigation wiped information from at least 15 phones."
        },
        {
            "id": 1,
            "text": "“So now we find out that the entire Mueller ‘hit squad’ illegally wiped their phones clean just prior to the investigation of them,” the president wrote on Twitter."
        },
        {
            "id": 2,
            "text": "The DoJ records say the phones were wiped due to damage, hardware problems and missing passwords."
        },
        {
            "id": 3,
            "text": "On Friday, a Republican senator, Ron Johnson of Wisconsin, demanded a new investigation by DoJ watchdog Michael Horowitz – who has already investigated the FBI investigation that ultimately led to Mueller’s appointment as special counsel."
        },
        {
            "id": 4,
            "text": "Among Mueller team members mentioned in the DoJ documents is Peter Strzok, who was fired for text messages critical of Trump."
        },
        {
            "id": 5,
            "text": "Having become a bête noire for the president and his supporters, Strzok has now written a book in which he calls Trump a threat to national security."
        },
        {
            "id": 6,
            "text": "Another Mueller team member named in the DoJ documents, Andrew Weissmann, has also written a memoir."
        },
        {
            "id": 7,
            "text": "On Saturday, Trump revisited a favourite campaign theme from 2016, likening the news to “Crooked Hillary smashing her phones with a hammer, & DELETING HER EMAILS!”"
        },
        {
            "id": 8,
            "text": "Aides to Clinton did report breaking phones used by the former secretary of state but she is not known to have done so herself, with or without a hammer."
        },
        {
            "id": 9,
            "text": "Clinton’s use of private email for official business – reportedly replicated by Trump’s wife and daughter – was investigated by the FBI in 2016, to Trump’s political advantage."
        },
        {
            "id": 10,
            "text": "Clinton was chastised by then FBI director James Comey, but not accused of wrongdoing."
        },
        {
            "id": 11,
            "text": "On Saturday, Trump also claimed “it has now been determined that the Mueller Scam should never have been set up in the first place, there were no grounds”."
        },
        {
            "id": 12,
            "text": "To the contrary, though Mueller did not find a conspiracy between the president and Russia he did lay out extensive evidence of Russian interference and hand down 37 indictments and produce seven guilty pleas, including close Trump aides, all while detailing extensive instances of possible obstruction of justice by Trump himself."
        },
        {
            "id": 13,
            "text": "“It was all an illegitimate Witch Hunt,” Trump insisted, “and a big price must be paid.”"
        },
        {
            "id": 14,
            "text": "Mueller completed his work a year and a half ago but the Russia investigation is a key political battleground as November’s election approaches."
        },
        {
            "id": 15,
            "text": "Trump’s tweets came before he travelled to Nevada and Arizona for campaign events."
        },
        {
            "id": 16,
            "text": "On Friday, a federal prosecutor working on another investigation into the origins of the Russia investigation resigned from the justice department."
        },
        {
            "id": 17,
            "text": "Nora Dannehy was a top prosecutor under Connecticut US attorney John Durham, who was appointed last year to investigate how the FBI and other agencies investigated Russian interference."
        },
        {
            "id": 18,
            "text": "The move by Attorney General William Barr was made public soon after the release of Mueller’s report."
        },
        {
            "id": 19,
            "text": "Durham has questioned officials including former CIA director John Brennan."
        },
        {
            "id": 20,
            "text": "Trump has indicated that he wants results, this week calling Durham a “very, very respected man” who would produce a “report, or maybe it’s much more than that”."
        },
        {
            "id": 21,
            "text": "DoJ policy frowns on investigative steps that could affect an election."
        },
        {
            "id": 22,
            "text": "But Barr has said that policy does not apply, since Democratic nominee Joe Biden is not a target."
        },
        {
            "id": 23,
            "text": "Durham has produced one criminal charge, against a former FBI lawyer accused of altering an email related to surveillance of a Trump aide."
        },
        {
            "id": 24,
            "text": "In other developments related to the Russia investigation, lawyers connected to the case of former national security adviser Michael Flynn submitted arguments on Friday about how the prosecution should proceed."
        },
        {
            "id": 25,
            "text": "Last week, an appeals court ruled that US district judge Emmet Sullivan did not have to dismiss the case just because the DoJ wanted him to do so."
        },
        {
            "id": 26,
            "text": "The ruling opened the door for Sullivan to scrutinize the basis for that unusual request."
        },
        {
            "id": 27,
            "text": "Flynn twice pleaded guilty to lying to the FBI about conversations with the Russian ambassador."
        },
        {
            "id": 28,
            "text": "John Gleeson, a retired federal judge appointed by Sullivan to argue against the department’s position, called the motion to dismiss “plainly a corrupt political errand for the president”."
        }
    ]
}