{
    "title": "Justice Dept. Rejects Andrew McCabe’s Bid to Avoid Charges",
    "text": [
        {
            "id": 0,
            "text": "The Justice Department rejected a last-ditch appeal from defense lawyers for the former F.B.I. deputy director Andrew G. McCabe, people familiar with the matter said on Thursday, as prosecutors have appeared close to charging him in a criminal case."
        },
        {
            "id": 1,
            "text": "Lawyers for Mr. McCabe, who is being investigated over whether he lied to internal investigators about dealings with the news media, had argued that prosecutors lacked evidence to charge him."
        },
        {
            "id": 2,
            "text": "The lawyers detailed their position to top officials including Jeffrey A. Rosen, the deputy attorney general, who ultimately rejected their view."
        },
        {
            "id": 3,
            "text": "His deputy, Edward O’Callaghan, who was also present during the discussion, notified Mr. McCabe’s lawyers of the decision, one of the people said."
        },
        {
            "id": 4,
            "text": "The case is politically fraught for the Justice Department because of President Trump’s repeated attacks on Mr. McCabe, who was the acting director of the F.B.I. when investigators opened the inquiry into whether the president obstructed justice."
        },
        {
            "id": 5,
            "text": "Charging Mr. McCabe would undoubtedly please Mr. Trump, but passing on charges could provoke his public displeasure."
        },
        {
            "id": 6,
            "text": "The rejection of Mr. McCabe’s appeal would typically foreshadow an impending indictment, but that has apparently not yet happened."
        },
        {
            "id": 7,
            "text": "The grand jury hearing the case was recalled this week after going months without meeting but left without revealing any public signs of an indictment, The Washington Post reported."
        },
        {
            "id": 8,
            "text": "Grand jury proceedings are secret."
        },
        {
            "id": 9,
            "text": "It is also not clear when Mr. Rosen decided to reject the defense lawyers’ appeal."
        },
        {
            "id": 10,
            "text": "Mr. McCabe’s lawyers have vigorously denied that he intentionally lied and believe prosecutors singled him out."
        },
        {
            "id": 11,
            "text": "False statements made during internal inquiries at federal law enforcement agencies are typically punished administratively, not by criminal prosecution."
        },
        {
            "id": 12,
            "text": "The case centers on Mr. McCabe’s interactions with investigators for the Justice Department inspector general, Michael E. Horowitz."
        },
        {
            "id": 13,
            "text": "He faulted Mr. McCabe last year for misleading investigators when asked about the disclosure of information in 2016 to a Wall Street Journal reporter about an F.B.I. investigation into the Clinton Foundation."
        },
        {
            "id": 14,
            "text": "The inspector general referred Mr. McCabe’s case to prosecutors."
        },
        {
            "id": 15,
            "text": "Hints of the case’s weakness have since emerged."
        },
        {
            "id": 16,
            "text": "The investigation was referred about 18 months ago, which is an unusually long stretch for an inquiry with a limited set of facts and witnesses."
        },
        {
            "id": 17,
            "text": "It dragged on for so long that the first grand jury examining the evidence expired before apparently being called back this week."
        },
        {
            "id": 18,
            "text": "One prosecutor assigned to the case recently left, an unusual step so close to an indictment."
        },
        {
            "id": 19,
            "text": "Another departed for a private law firm and has expressed reservations about the merits of the case."
        },
        {
            "id": 20,
            "text": "And one key witness testified that Mr. McCabe had no motive to lie because he was authorized as the F.B.I.’s deputy director to speak to the media, so he would not have had to hide any discussions with reporters."
        },
        {
            "id": 21,
            "text": "Another important witness testified he could not immediately remember how the leak unfolded."
        },
        {
            "id": 22,
            "text": "Both would have been crucial to any prosecution."
        },
        {
            "id": 23,
            "text": "If a grand jury declined to indict — an embarrassment for prosecutors — they could ask for a different grand jury to present evidence and try to secure an indictment."
        },
        {
            "id": 24,
            "text": "Federal grand juries are made up of about 16 to 23 people, and at least 12 must concur with prosecutors to issue an indictment, according to Justice Department guidelines."
        },
        {
            "id": 25,
            "text": "A grand jury needs only to determine probable cause to indict, a lower standard than establishing guilt at a criminal trial."
        },
        {
            "id": 26,
            "text": "Prosecutors could also charge Mr. McCabe with lying in a criminal complaint and would then have 30 days to seek an indictment."
        },
        {
            "id": 27,
            "text": "The defense lawyers met multiple times with the prosecutors on the case to try to get them to drop charges, then appealed both to the United States attorney for the District of Columbia, Jessie K. Liu, and to Mr. Rosen."
        },
        {
            "id": 28,
            "text": "The prosecutors and Ms. Liu have all recommended charges, one of the people familiar with the matter said."
        },
        {
            "id": 29,
            "text": "Ms. Liu, a Trump appointee, had made a bid for the No. 3 job at the Justice Department but withdrew after senators objected to her nomination."
        },
        {
            "id": 30,
            "text": "The Justice Department could also be taking into account the case that prosecutors lost against Gregory B. Craig, one of Washington’s most prominent Democratic lawyers."
        },
        {
            "id": 31,
            "text": "He was acquitted this month of a felony charge of lying to federal authorities about work he did years ago for the Ukrainian government."
        },
        {
            "id": 32,
            "text": "Prosecutors from the same United States attorney’s office are handling the McCabe investigation."
        },
        {
            "id": 33,
            "text": "Mr. McCabe has been a consistent foil for Mr. Trump, who repeatedly attacked his wife, Jill, over her failed 2015 campaign for the Virginia Senate, which received hundreds of thousands of dollars in donations from a political committee run by a longtime ally of the Clintons."
        },
        {
            "id": 34,
            "text": "Mr. Trump seized on her campaign as proof that Mr. McCabe wanted to take him down while protecting Hillary Clinton, whom the F.B.I. had investigated for her use of a private email server."
        },
        {
            "id": 35,
            "text": "But ethics officials cleared Mr. McCabe of any conflict, and he did not take oversight of the Clinton case until after his wife lost her race."
        },
        {
            "id": 36,
            "text": "The Justice Department fired Mr. McCabe, a 21-year F.B.I. veteran, last year after the inspector general determined that he demonstrated a lack of candor with his investigators."
        },
        {
            "id": 37,
            "text": "Mr. McCabe was dismissed days before he was eligible for retirement benefits, and he has accused law enforcement officials of singling him out to undermine his standing as a witness in the Russia investigation."
        }
    ]
}