{
    "title": "U.S. cyberattack strikes Iran's military computers",
    "text": [
        {
            "id": 0,
            "text": "The U.S. launched a sweeping cyberattack against the Iranian military last week in direct response to Iran’s downing of an American surveillance drone, U.S. officials told the Associated Press over the weekend, confirming that President Trump personally approved the retaliatory measures."
        },
        {
            "id": 1,
            "text": "The response was aimed at Iran’s Islamic Revolutionary Guard Corps, a branch of the nation’s military that the White House officially labeled a terrorist organization earlier this year."
        },
        {
            "id": 2,
            "text": "The cyberattack targeted computer systems that control the Corps’ rocket and missile launchers, administration officials said."
        },
        {
            "id": 3,
            "text": "Yahoo News first reported the strike over the weekend."
        },
        {
            "id": 4,
            "text": "The cyberattack was presented to the president as one of several options following last week’s incident in which Iran shot down a U.S. drone over the Strait of Hormuz."
        },
        {
            "id": 5,
            "text": "While no Americans were abroad the aircraft, the shoot-down still added more fuel to growing military tensions between the two sides and brought Mr. Trump to the brink of ordering airstrikes against Iranian targets."
        },
        {
            "id": 6,
            "text": "The president said he called off those air strikes after learning 150 people would be killed, but he reiterated over the weekend that the White House will keep the pressure on Tehran."
        },
        {
            "id": 7,
            "text": "He stressed that the U.S. will not allow Iran to ever acquire nuclear weapons."
        },
        {
            "id": 8,
            "text": "“Iran cannot have Nuclear Weapons!"
        },
        {
            "id": 9,
            "text": "Under the terrible Obama plan, they would have been on their way to Nuclear in a short number of years, and existing verification is not acceptable,” the president tweeted Saturday."
        },
        {
            "id": 10,
            "text": "“We are putting major additional Sanctions on Iran on Monday."
        },
        {
            "id": 11,
            "text": "I look forward to the day that … Sanctions come off Iran, and they become a productive and prosperous nation again — The sooner the better!”"
        },
        {
            "id": 12,
            "text": "Mr. Trump last year withdrew the U.S. from a multinational deal to limit Iran’s nuclear program, arguing the pact was too lax."
        },
        {
            "id": 13,
            "text": "The administration then quickly imposed a crushing set of economic sanctions, and earlier this year put in place a global embargo on imports of Iranian oil."
        },
        {
            "id": 14,
            "text": "As for last week’s cyberattack on Iran, details remained murky on Sunday."
        },
        {
            "id": 15,
            "text": "Military and intelligence officials did not immediately comment on the attack, though officials in recent days have said that the U.S. will fight back against increasing Iranian aggression in cyberspace."
        },
        {
            "id": 16,
            "text": "“In these times of heightened tensions, it is appropriate for everyone to be alert to signs of Iranian aggression in cyberspace and ensure appropriate defenses are in place,” the National Security Agency told the AP in a statement on Friday."
        },
        {
            "id": 17,
            "text": "While the extent of the cyberattack isn’t clear, it certainly isn’t the first time the U.S. has targeted Iranian infrastructure through a cyber assault."
        },
        {
            "id": 18,
            "text": "Late last decade, the Stuxnet computer virus — which most observers believe was a joint US-Israeli project — targeted Iranian centrifuges as part of a broader effort to slow the nation’s nuclear program."
        },
        {
            "id": 19,
            "text": "Iranian officials over the weekend did not address the cyberattack but threatened to shoot down more aircraft that violate its airspace."
        },
        {
            "id": 20,
            "text": "Iran claims the U.S. drone entered its airspace, but administrations deny that claim."
        },
        {
            "id": 21,
            "text": "“Our response to anything trespassing Iranian territory is like this, and if such acts of aggression are repeated, our response will also be the same,” said Revolutionary Guard Aerospace Force Brigadier General Amir Ali Hajizadeh, as quoted by Iran’s Fars News Agency."
        },
        {
            "id": 22,
            "text": "In addition to the drone shoot-down, Iran also allegedly has carried out a string of limpet mine attacks on oil tankers in the region."
        },
        {
            "id": 23,
            "text": "Iranian leaders also have said they’ll begin disregarding the terms of the Obama-era nuclear agreement and will dramatically increase their stockpiles of uranium."
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        }
    ]
}