{
    "title": "Trump retreats from public view as government shutdown continues over border wall fight",
    "text": [
        {
            "id": 0,
            "text": "President Trump remained out of public view Friday as the ­partial government shutdown reached the one-week mark, content to issue threats via Twitter amid a continuing standoff with Democrats over border wall funding."
        },
        {
            "id": 1,
            "text": "In the evening, Trump left the White House for a short ride to Vice President Pence’s residence to join him, acting chief of staff Mick Mulvaney and senior White House adviser Jared Kushner for a private dinner."
        },
        {
            "id": 2,
            "text": "At a time when most of Congress has left town for the holidays despite the budget impasse, Trump has emphasized his decision to cancel a planned vacation at his Mar-a-Lago resort in Florida and remain in Washington."
        },
        {
            "id": 3,
            "text": "But he has chosen not to use this time to engage in substantive negotiations over the budget or seize the public stage and make his case for funding the border wall."
        },
        {
            "id": 4,
            "text": "Instead, he has filled the silence with a rash of tweets that have blamed Democrats for the shutdown and cast illegal immigration as a threat to the country."
        },
        {
            "id": 5,
            "text": "The president’s relatively low profile coincides with Republicans and Democrats digging in for an extended fight, with no breakthrough in sight."
        },
        {
            "id": 6,
            "text": "Trump’s allies on Capitol Hill said the president remained in touch with GOP leaders, but they said the only tangible talks Friday were between rank-and-file members of the two parties."
        },
        {
            "id": 7,
            "text": "Congressional leaders have stayed mostly silent in recent days."
        },
        {
            "id": 8,
            "text": "Senate Majority Leader Mitch McConnell (R-Ky.) and Senate Minority Leader Charles E. Schumer (D-N.Y.) returned to their home states."
        },
        {
            "id": 9,
            "text": "Aides for House Speaker Paul D. Ryan (R-Wis.) and House Minority Leader Nancy Pelosi (D-Calif.) declined to reveal their whereabouts."
        },
        {
            "id": 10,
            "text": "There was an emerging consensus Friday that there would be no deal before Democrats take control of the House on Wednesday, with Pelosi expected to become speaker, altering the balance of power in Washington for the first time in Trump’s presidency."
        },
        {
            "id": 11,
            "text": "The president initially demanded $5 billion for the wall, but the White House offered a deal for about half of that amount."
        },
        {
            "id": 12,
            "text": "Democrats rejected it, refusing to go above $1.3 billion in border security funding that would not include a wall."
        },
        {
            "id": 13,
            "text": "“I do not see progress being made that would indicate Ms. Pelosi is going to compromise before Jan. 3,” Rep. Mark Meadows (R-N.C.), a close Trump ally, said in a text message to The Washington Post."
        },
        {
            "id": 14,
            "text": "About 25 percent of the federal government has been shut down since Dec. 21, with roughly 800,000 workers affected, including an estimated 350,000 who are on furlough at home."
        },
        {
            "id": 15,
            "text": "The closure of federal agencies marks the third partial government shutdown this year and the longest since workers were furloughed for 16 days in 2013 during a budget impasse when House Republicans sought to cut off funding for the Affordable Care Act."
        },
        {
            "id": 16,
            "text": "Trump declared three weeks ago during a White House meeting with Pelosi and Schumer that he would be “proud” to take responsibility for shutting down the government over funding for a border wall."
        },
        {
            "id": 17,
            "text": "Since then, he has sought to blame Democrats, though he has spent little time during the past week trying to win over public sentiment."
        },
        {
            "id": 18,
            "text": "A Reuters/Ipsos poll found 47 percent of Americans hold Trump responsible for the shutdown, compared with 33 percent who blame congressional Democrats."
        },
        {
            "id": 19,
            "text": "Trump spoke about the wall funding fight during his visit to U.S. troops in Iraq on Wednesday, but he has not made a public statement about it since he returned, other than on Twitter."
        },
        {
            "id": 20,
            "text": "He has announced no plans to leave Washington to highlight his push for more wall funding."
        },
        {
            "id": 21,
            "text": "Trump visited San Diego in March to review border wall prototypes commissioned by the Department of Homeland Security, but he has not visited a Border Patrol station or U.S. port of entry."
        },
        {
            "id": 22,
            "text": "On Friday, Homeland Security Secretary Kirstjen Nielsen embarked on a two-day tour of border stations in El Paso and Yuma, Ariz., in the wake of the deaths of two migrant children who were detained by DHS after traveling from Guatemala."
        },
        {
            "id": 23,
            "text": "One of the children, Felipe Gomez Alonzo, 8, died on Christmas Eve."
        },
        {
            "id": 24,
            "text": "DHS officials did not permit reporters to accompany Nielsen on her visits."
        },
        {
            "id": 25,
            "text": "Trump began his day Friday by renewing a pair of vague threats he has made previously to seal the U.S. border with Mexico to trade and tourism and cut off U.S. foreign aid money to Central American nations."
        },
        {
            "id": 26,
            "text": "“Either we build (finish) the Wall or we close the Border,” Trump tweeted."
        },
        {
            "id": 27,
            "text": "Yet the warnings were inconsistent with his administration’s stance."
        },
        {
            "id": 28,
            "text": "Aides have said closing the border would cause an economic catastrophe, and the State Department last week announced plans to direct $10.6 billion to Mexico and Central America to help reduce the flow of unauthorized immigrants to the United States."
        },
        {
            "id": 29,
            "text": "Some White House allies said the president was passing up a chance to set the terms of the debate at a time when his Democratic rivals have ceded the megaphone to him."
        },
        {
            "id": 30,
            "text": "“One way for the White House to effectively refocus the debate would be to adopt more of a ‘show, not tweet’ approach,” said RJ Hauman, government relations director for the Federation for American Immigration Reform, which supports the border wall."
        },
        {
            "id": 31,
            "text": "“Go down to the border and let the brave men and women on the front lines personally tell the American people and Congress how effective border barriers are.”"
        },
        {
            "id": 32,
            "text": "During the 2013 government shutdown, President Barack Obama employed several messaging strategies to blame Republicans and defend the health-care law, including releasing a public letter to federal employees, holding a news conference at the White House, meeting with small-business owners and conducting interviews with regional television stations."
        },
        {
            "id": 33,
            "text": "“This shutdown was completely preventable."
        },
        {
            "id": 34,
            "text": "It should not have happened,” Obama wrote in his letter."
        },
        {
            "id": 35,
            "text": "He thanked the federal workers for their service and added that the Republican-led House should not have tried to “attach highly controversial and partisan measures” to the government funding bill."
        },
        {
            "id": 36,
            "text": "The House eventually caved and passed a bill without the measures to strip health-care funding, after polls showed a majority of Americans blamed the GOP for the shutdown."
        },
        {
            "id": 37,
            "text": "On Thursday, in a bid to ratchet up pressure on Democrats, Trump wrote on Twitter of the furloughed federal workers that “most of the people not getting paid are Democrats,” without offering evidence."
        },
        {
            "id": 38,
            "text": "Some Trump allies said he has clearly articulated his case on border security and that it was Democrats who will have to defend their position once they take over the House."
        },
        {
            "id": 39,
            "text": "“People need to be persuaded by the left in Congress, not by Trump,” said Lars Larson, a conservative radio host based in Portland, Ore."
        },
        {
            "id": 40,
            "text": "“They said, ‘We will not negotiate.’"
        },
        {
            "id": 41,
            "text": "How do Americans, not just those in politics, view someone who says, ‘I am not negotiating?’ ”\n\nSeung Min Kim, Felicia Sonmez and Erica Werner contributed to this report."
        }
    ]
}