{
    "title": "Trump administration holds off on new Russia sanctions, despite law",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The Trump administration said on Monday it would not immediately impose additional sanctions on Russia, despite a new law designed to punish Moscow’s alleged meddling in the 2016 U.S. election, insisting the measure was already hitting Russian companies."
        },
        {
            "id": 2,
            "text": "Russian President Vladimir Putin, Defence Minister Sergei Shoigu and Deputy Defence Minister Yuri Borisov visit the Gorbunov Aviation factory in Kazan, Russia January 25, 2018."
        },
        {
            "id": 3,
            "text": "“Today, we have informed Congress that this legislation and its implementation are deterring Russian defense sales,” State Department spokeswoman Heather Nauert said in a statement."
        },
        {
            "id": 4,
            "text": "“Since the enactment of the ... legislation, we estimate that foreign governments have abandoned planned or announced purchases of several billion dollars in Russian defense acquisitions.”"
        },
        {
            "id": 5,
            "text": "Seeking to press President Donald Trump to clamp down on Russia, the U.S. Congress voted nearly unanimously last year to pass a law setting sweeping new sanctions on Moscow."
        },
        {
            "id": 6,
            "text": "Trump, who wanted warmer ties with Moscow and had opposed the legislation as it worked its way through Congress, signed it reluctantly in August, just six months into his presidency."
        },
        {
            "id": 7,
            "text": "Under the measure, the administration faced a deadline on Monday to impose sanctions on anyone determined to conduct significant business with Russian defense and intelligence sectors, already sanctioned for their alleged role in the election."
        },
        {
            "id": 8,
            "text": "But citing long time frames associated with major defense deals, Nauert said it was better to wait to impose those sanctions."
        },
        {
            "id": 9,
            "text": "“From that perspective, if the law is working, sanctions on specific entities or individuals will not need to be imposed because the legislation is, in fact, serving as a deterrent,” she said in a statement."
        },
        {
            "id": 10,
            "text": "The measure, known as the “Countering America’s Adversaries Through Sanctions Act,” or CAATSA, required the administration to list “oligarchs” close to President Vladimir Putin’s government and issue a report detailing possible consequences of penalizing Russia’s sovereign debt."
        },
        {
            "id": 11,
            "text": "WOULD TRUMP CLAMP DOWN ON RUSSIA?"
        },
        {
            "id": 12,
            "text": "Monday’s deadline to release those reports was seen as a test of Trump’s willingness to clamp down on Russia."
        },
        {
            "id": 13,
            "text": "Critics blasted him for failing to announce any sanctions."
        },
        {
            "id": 14,
            "text": "“The State Department claims that the mere threat of sanctions will deter Russia’s aggressive behavior."
        },
        {
            "id": 15,
            "text": "How do you deter an attack that happened two years ago, and another that’s already underway?"
        },
        {
            "id": 16,
            "text": "It just doesn’t make sense,” said Representative Eliot Engel, the top Democrat on the U.S. House of Representatives Foreign Affairs Committee."
        },
        {
            "id": 17,
            "text": "“I’m fed up waiting for this Administration to protect our country and our elections,” he said in a statement."
        },
        {
            "id": 18,
            "text": "Members of Congress, including Democrats and some of Trump’s fellow Republicans, have been clamoring for his administration to use sanctions to punish Moscow for past election interference and prevent future meddling in U.S. polls."
        },
        {
            "id": 19,
            "text": "Shortly before midnight (0500 GMT) on Monday, the Treasury Department released an unclassified “oligarchs” list, including 114 senior Russian political figures and 96 business people."
        },
        {
            "id": 20,
            "text": "Those named on the list will not immediately face any immediate penalties like asset freezes or visa bans."
        },
        {
            "id": 21,
            "text": "But the law mandated that the U.S. Treasury and State Departments, and intelligence agencies, compile a list of political figures and business people close to Putin’s government and network, for potential future sanctions."
        },
        {
            "id": 22,
            "text": "Several U.S. congressional committees, as well as Special Counsel Robert Mueller, are investigating whether Russia tried to tilt last November’s election in Trump’s favor, using means such as hacking into the emails of senior Democrats and promoting divisive social and political messages online."
        },
        {
            "id": 23,
            "text": "Trump and the Kremlin have separately denied any collusion."
        },
        {
            "id": 24,
            "text": "Senator Bob Corker, the Republican chairman of the Senate Foreign Relations Committee, one of the main congressional architects of the sanctions law, said he was not concerned that the administration did not announce sanctions by Monday’s deadline."
        },
        {
            "id": 25,
            "text": "“This is when sanctions season begins, and so they’ll be rolling them out,” he told reporters."
        },
        {
            "id": 26,
            "text": "“We feel pretty good about the process,” Corker said."
        },
        {
            "id": 27,
            "text": "“They’re rushing the information over to us today, and by the close of business, they’re going to have two of the three, as I understand it."
        },
        {
            "id": 28,
            "text": "So they’re taking it very seriously.”"
        }
    ]
}