{
    "title": "Robert E. Lee statue removed from Capitol",
    "text": [
        {
            "id": 0,
            "text": "In 1951, as a 16-year-old student at Robert Russa Moton High School in Farmville, Va., Barbara Johns led 450 of her classmates in a two-week-long strike against unequal school conditions and educational resources for Black students."
        },
        {
            "id": 1,
            "text": "The NAACP Legal Defense Fund ultimately filed suit on behalf of the students, demanding integration of the local school system."
        },
        {
            "id": 2,
            "text": "That litigation became one of five cases that combined three years later to form Brown v. Board of Education, and it was the only one of those cases that originated from student protest."
        },
        {
            "id": 3,
            "text": "In a joint statement Monday, McEachin and Wexton said the removal of Lee’s statue was a “historic and long-overdue moment for our Commonwealth.”"
        },
        {
            "id": 4,
            "text": "“The Robert E. Lee statue honors a legacy of division, oppression, and racism — a dark period in the history of our Commonwealth and our country,” they said."
        },
        {
            "id": 5,
            "text": "“There is no reason his statue should be one of the two representing Virginia in the U.S. Capitol.”"
        },
        {
            "id": 6,
            "text": "House Speaker Nancy Pelosi pauses while speaking during her weekly news conference on Capitol Hill."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "In June, amid nationwide protests against racial injustice and police brutality, House Speaker Nancy Pelosi called for the removal of 11 statues depicting Confederate leaders that were located in the Capitol’s Statuary Hall."
        },
        {
            "id": 9,
            "text": "Pelosi’s demand was part of a broader effort to remove Confederate imagery from public spaces, despite resistance from some Republicans and President Donald Trump — who has expressed support for people’s right to fly the Confederate flag and has described Lee as a “great general.”"
        },
        {
            "id": 10,
            "text": "In her own statement Monday, Pelosi argued that “the statues within the Capitol should embody our highest ideals as Americans.”"
        },
        {
            "id": 11,
            "text": "“The Congress will continue our work to rid the Capitol of homages to hate, as we fight to end the scourge of racism in our country,” she said."
        },
        {
            "id": 12,
            "text": "“There is no room for celebrating the bigotry of the Confederacy in the Capitol or any other place of honor in our country.”"
        }
    ]
}