{
    "title": "New Hampshire Just Abolished the Death Penalty",
    "text": [
        {
            "id": 0,
            "text": "New Hampshire has just repealed capital punishment, the last of the New England states to do so."
        },
        {
            "id": 1,
            "text": "Today the state Senate voted to override Gov. Chris Sununu's veto of an anti–death penalty bill."
        },
        {
            "id": 2,
            "text": "The state House did the same last week, so the legislation will now become law."
        },
        {
            "id": 3,
            "text": "Sununu belongs to the GOP, but this effort to end the death penalty was bipartisan."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "\"Ending New Hampshire's death penalty would not have been possible without significant Republican support,\" says Hannah Cox, national manager of Conservatives Concerned About the Death Penalty."
        },
        {
            "id": 6,
            "text": "\"Increasing numbers of GOP state lawmakers believe capital punishment does not align with their conservative values of limited government, fiscal responsibility, and valuing life.\""
        },
        {
            "id": 7,
            "text": "\"I believe more states across the nation, inspired by what New Hampshire accomplished, will recognize that the death penalty cannot exist in a society that aspires to true justice,\" adds Shari Silberstein, executive director of Equal Justice USA."
        },
        {
            "id": 8,
            "text": "At least two of the bill's backers have experienced the murder of a loved one."
        },
        {
            "id": 9,
            "text": "State Rep. Renny Cushing (D–Rockingham) lost both his father and brother-in-law to criminals, but he calls the death penalty \"ritual killing by government employees\" that does nothing beyond filling \"another coffin and widen[ing] the pain.\""
        },
        {
            "id": 10,
            "text": "State Sen. Ruth Ward (R–Stoddard) lost her father to a murderer when she was very young."
        },
        {
            "id": 11,
            "text": "She recounted her own experience just before voting for the legislation, saying: \"My mother forgave whoever it was, and I will vote in favor of this bill.\""
        }
    ]
}