{
    "title": "Trump to Supporters: ‘Leave It to Law Enforcement’",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump told Fox News’ Laura Ingraham that he wants his supporters to “leave it to law enforcement” when it comes to confronting violent left-wing activists."
        },
        {
            "id": 1,
            "text": "Ingraham asked Trump to respond to his rival, former Vice President Joe Biden, who called Trump supporters “an armed militia in this country.”"
        },
        {
            "id": 2,
            "text": "Trump defended his supporters and said Biden was “weak,” noting that Democrats had lost control of violent left-wing mobs in the cities that they governed."
        },
        {
            "id": 3,
            "text": "Ingraham then asked: “But do you want your supporters to confront the left-wing protesters, or do you want to leave it to law enforcement?”"
        },
        {
            "id": 4,
            "text": "Trump responded: “No, no, no, I don’t want them — I want them to leave it to law enforcement.”"
        },
        {
            "id": 5,
            "text": "The problem, Trump explained, was the lack of political support for law enforcement, and Democrats’ refusal in some cases to accept help from the National Guard and federal law enforcement agencies when they could not control left-wing riots."
        },
        {
            "id": 6,
            "text": "Earlier in the evening, Biden had falsely accused Trump of failing to denounce violence at a White House press briefing."
        },
        {
            "id": 7,
            "text": "In fact, Trump said that “violence has no place in American political discourse.”"
        },
        {
            "id": 8,
            "text": "Biden’s running mate, Sen. Kamala Harris (D-CA), encouraged her supporters to contribute toward bailing out arrestees in Minneapolis, Minnesota during riots earlier this year."
        },
        {
            "id": 9,
            "text": "Those who were bailed out included several people who had been arrested on charges of violent criminal behavior, including murder and attempted murder."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}