{
    "title": "GOP canvassers again oppose certifying Detroit-area votes",
    "text": [
        {
            "id": 0,
            "text": "Officials said, however, that certification of the Detroit-area vote will stand."
        },
        {
            "id": 1,
            "text": "“There is no legal mechanism for them to rescind their vote."
        },
        {
            "id": 2,
            "text": "Their job is done and the next step in the process is for the Board of State Canvassers to meet and certify,” said secretary of state spokeswoman Tracy Wimmer."
        },
        {
            "id": 3,
            "text": "The four-member state board is expected to meet Monday and also is split with two Democrats and two Republicans."
        },
        {
            "id": 4,
            "text": "President Donald Trump's campaign believes the latest about-face by Monica Palmer and William Hartmann is legitimate: It withdrew a federal lawsuit challenging the Detroit-area results, citing the pair's statement."
        },
        {
            "id": 5,
            "text": "Palmer and Hartmann initially voted against certification Tuesday, leaving the Wayne County Board of Canvassers deadlocked at 2-2 along party lines."
        },
        {
            "id": 6,
            "text": "Palmer complained that certain Detroit precincts were out of balance, meaning that absentee ballot books did not match the number of ballots cast."
        },
        {
            "id": 7,
            "text": "The GOP move drew an immediate rebuke from the public and injected partisan politics into the business of an unsung panel that is supposed to confirm the will of the voters."
        },
        {
            "id": 8,
            "text": "A person familiar with the matter told The Associated Press that Trump reached out to Palmer and Hartmann on Tuesday evening after the revised vote to express gratitude for their support."
        },
        {
            "id": 9,
            "text": "Biden crushed Trump in Wayne County by a more than 2-1 margin on his way to winning Michigan by 146,000 votes, according to unofficial results."
        },
        {
            "id": 10,
            "text": "His victory reversed Trump’s 2016 gains in the industrial Midwest and put the Democrat on the path to achieving the 270 Electoral College votes needed to win the White House."
        },
        {
            "id": 11,
            "text": "The county canvassers later voted again and certified the results, 4-0."
        },
        {
            "id": 12,
            "text": "Then, on Wednesday, Palmer and Hartmann signed affidavits saying they believe the county vote “should not be certified.”"
        },
        {
            "id": 13,
            "text": "They said in their statement that they've reported threats against them to law enforcement."
        },
        {
            "id": 14,
            "text": "Jonathan Kinloch, a Democratic canvasser, said he heard passion — not threats — during the stormy Tuesday night meeting when the audience on Zoom was allowed to speak after the 2-2 tie and before the unanimous vote."
        },
        {
            "id": 15,
            "text": "“I heard people basically being very assertive in demonstrating their outrage, but it happens all the time,” Kinloch said."
        },
        {
            "id": 16,
            "text": "“This was a very important meeting to the city, the county, and it impacted a lot of folks.”"
        },
        {
            "id": 17,
            "text": "There has been no evidence of widespread voting fraud in Michigan or any other state."
        },
        {
            "id": 18,
            "text": "Federal and state officials from both parties have declared the 2020 election safe and secure."
        },
        {
            "id": 19,
            "text": "But Trump and his allies have spent two weeks raising false claims of fraud and refusing to concede to Biden."
        }
    ]
}