{
    "title": "Supreme Court rules 151-year-old Indian treaty grants hunting rights",
    "text": [
        {
            "id": 0,
            "text": "Wyoming can’t abrogate an 1868 treaty with the Crow Tribe just because it was signed before Wyoming officially became a state, the Supreme Court ruled Monday in a case breathing new life into American Indian-U.S. relations."
        },
        {
            "id": 1,
            "text": "The ruling contradicts a century-old high court precedent and could guarantee American Indians’ hunting rights on some federal lands."
        },
        {
            "id": 2,
            "text": "The case was brought by Clayvin Herrera, a member of the Crow Tribe, whom Wyoming charged with offseason hunting in 2014 after state officials discovered him and other tribe members hunting bull elk on the Big Horn National Forest, discarding the bodies and taking the heads for trophies."
        },
        {
            "id": 3,
            "text": "Mr. Herrera argued he was permitted to hunt on the land, citing the treaty that guaranteed American Indians “the right to hunt on unoccupied lands of the United States so long as game may be found thereon.”"
        },
        {
            "id": 4,
            "text": "Crow leaders signed the treaty in 1868, handing over roughly 30 million acres to settlers while retaining about 8 million acres."
        },
        {
            "id": 5,
            "text": "Wyoming argued the treaty expired when it gained statehood in 1890."
        },
        {
            "id": 6,
            "text": "Lower courts agreed, but the justices, in a 5-4 ruling, sided with Mr. Herrera on Monday, saying the treaty is good law."
        },
        {
            "id": 7,
            "text": "Justice Neil M. Gorsuch, President Trump’s replacement for the late Justice Antonin Scalia, sided with the court’s four Democratic appointed justices."
        },
        {
            "id": 8,
            "text": "“There simply is no evidence that Congress intended to abrogate the 1868 treaty right through the Wyoming Statehood Act,” Justice Sonia Sotomayor wrote in the court’s 22-page opinion."
        },
        {
            "id": 9,
            "text": "“Nor is there any evidence in the treaty itself that Congress intended the hunting right to expire at statehood, or that the Crow Tribe would have understood it to do so.”"
        },
        {
            "id": 10,
            "text": "Advocates for Mr. Herrera said the ruling was significant because other tribes have similar treaties with the U.S., and the decision gives them broader access to national forests."
        },
        {
            "id": 11,
            "text": "Forrest Tahdooahnippah, a lawyer who specializes in tribal issues, said the decision gives “life” to the rights of American Indians by overruling the prior precedent."
        },
        {
            "id": 12,
            "text": "“Gorsuch, Trump’s appointee to fill the late Justice Scalia’s seat, has marked himself as a friend and ally of American Indian tribes, a label that would unlikely have been applied to his predecessor,” Mr. Tahdooahnippah said."
        },
        {
            "id": 13,
            "text": "One major issue for the justices was the language of the treaty, which said it applied to “unoccupied lands.”"
        },
        {
            "id": 14,
            "text": "Wyoming argued that once it became a state, all of the lands were deemed occupied."
        },
        {
            "id": 15,
            "text": "And even if statehood wasn’t a critical element, the state argues that when the government designated the Big Horn National Forest, that meant the land was occupied, so American Indians’ hunting rights could be regulated."
        },
        {
            "id": 16,
            "text": "The high court rejected both arguments — though it did leave room for some regulations within the forest, including where Wyoming decides it has an interest in conservation."
        },
        {
            "id": 17,
            "text": "The four dissenting justices said the majority was ignoring a clear precedent — a similar case in 1895 involving the same treaty language and the Shoshone-Bannock Tribes."
        },
        {
            "id": 18,
            "text": "That time, the justices ruled that the tribes’ right to hunt was terminated when Wyoming gained statehood."
        },
        {
            "id": 19,
            "text": "The court then said if the tribe’s rights didn’t end, the state would lack the power to regulate the killing of game."
        },
        {
            "id": 20,
            "text": "Justice Samuel A. Alito called Monday’s majority opinion “wasted ink.”"
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        }
    ]
}