{
    "title": "Trump hails US military in 4th of July address",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump has hailed the \"brave men and women\" of the US military during a speech at a controversial Independence Day event."
        },
        {
            "id": 1,
            "text": "\"We celebrate our history, our people, and the heroes who proudly defend our flag,\" he told a crowd at a rain-soaked Lincoln Memorial in Washington DC."
        },
        {
            "id": 2,
            "text": "The \"Salute to America\" event featured military flyovers and fireworks."
        },
        {
            "id": 3,
            "text": "Opponents accused Mr Trump of wasting money and politicising the holiday ahead of his re-election campaign."
        },
        {
            "id": 4,
            "text": "The Pentagon has not revealed the cost of the extravaganza, which many believe was inspired by Mr Trump's visit to a Bastille Day parade hosted by French President Emmanuel Macron in 2017."
        },
        {
            "id": 5,
            "text": "Some reports say the National Park Service diverted nearly $2.5m (£2m) to cover the cost."
        },
        {
            "id": 6,
            "text": "Addressing a crowd that had braved torrential rain and high temperatures, Mr Trump paid homage to the military before introducing separate flyovers for each branch."
        },
        {
            "id": 7,
            "text": "He spoke about America's battle for independence and praised the \"extraordinary heritage\" of the country."
        },
        {
            "id": 8,
            "text": "\"Together we are part of one of the greatest stories ever told, the story of America,\" Mr Trump said at the event."
        },
        {
            "id": 9,
            "text": "Chants of \"USA, USA\" broke out sporadically as he spoke."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "\"It is the chronicle of brave citizens who never give up on the dream of a better and brighter future,\" he continued."
        },
        {
            "id": 12,
            "text": "\"As long as we never stop fighting for a better future... there will be nothing that America cannot do.\""
        },
        {
            "id": 13,
            "text": "But Mr Trump also had a historical error in his speech, when, referring to the year 1775, he said: \"Our army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do\"."
        },
        {
            "id": 14,
            "text": "Critics were quick to point out that there were no airports in 1775 – the first powered flight is widely accredited to the Wright brothers in 1903."
        },
        {
            "id": 15,
            "text": "The error was attributed by some US media outlets to difficulty reading the teleprompter."
        },
        {
            "id": 16,
            "text": "The stage at the Lincoln Memorial was draped in flags and there were military vehicles on display nearby."
        },
        {
            "id": 17,
            "text": "Two 70-tonne Abrams tanks had to stay on a side road as they were too heavy for the memorial's surrounding areas."
        },
        {
            "id": 18,
            "text": "The event was open to the public free of charge, apart from a ticketed area for VIPs in front of the memorial."
        },
        {
            "id": 19,
            "text": "The musical playlist included the Star Wars theme, Hail to the Chief and God bless the USA."
        },
        {
            "id": 20,
            "text": "It went ahead largely without incident, although there were minor scuffles outside the White House earlier on Thursday after a flag-burning protest."
        },
        {
            "id": 21,
            "text": "Following Mr Trump's speech, many people headed to a scheduled concert on the lawn of the Capitol Building where a fireworks display went ahead despite the rainy conditions."
        },
        {
            "id": 22,
            "text": "\"Who doesn't love America's birthday?\""
        },
        {
            "id": 23,
            "text": "Andrea Stanford [second from right] beams."
        },
        {
            "id": 24,
            "text": "The 58-year-old is one of the \"Women 4 Trump\" group who travelled for 15 hours from Florida with her friends."
        },
        {
            "id": 25,
            "text": "All of whom, she revealed, are wearing red, white and blue underwear."
        },
        {
            "id": 26,
            "text": "Why?"
        },
        {
            "id": 27,
            "text": "\"Donald Trump is redefining the presidency and the commitment to freedom and liberty,\" she says."
        },
        {
            "id": 28,
            "text": "\"He's the first president who's kept his promises - economically and militarily,\" she added, referring to the recent meeting at the DMZ with North Korean leader Kim Jong-un."
        },
        {
            "id": 29,
            "text": "Alongside the reflecting pool, where rain drops have been crashing down all afternoon, people from states across this country have filed in."
        },
        {
            "id": 30,
            "text": "Utah, Indiana and Washington state are all represented, many of them wanting to catch a glimpse of the president."
        },
        {
            "id": 31,
            "text": "One African American man from Maryland wore a President Obama hat and said he simply wanted to celebrate the national holiday with his fellow Americans."
        },
        {
            "id": 32,
            "text": "Mr Trump was joined by a Pentagon delegation that was led by the highest-ranking US military officer, Chairman of the Joint Chiefs of Staff General Joseph Dunford."
        },
        {
            "id": 33,
            "text": "But the service chiefs of the Army, Navy, Air Force and Marine Corps did not attend."
        },
        {
            "id": 34,
            "text": "The defence department said in a statement it had received 5,000 tickets from the White House."
        },
        {
            "id": 35,
            "text": "The White House also distributed VIP tickets to major donors and political appointees, amid reported concerns that empty seats might be visible."
        },
        {
            "id": 36,
            "text": "Mr Trump's re-election campaign sent out an email this week encouraging supporters to attend the event."
        },
        {
            "id": 37,
            "text": "But the Democratic National Committee has been given no tickets."
        },
        {
            "id": 38,
            "text": "Mr Trump said in a tweet ahead of the event that the expense \"will be very little compared to what it is worth\"."
        },
        {
            "id": 39,
            "text": "Military flyovers alone cost tens of thousands of dollars per hour."
        },
        {
            "id": 40,
            "text": "Mr Trump's plans for a military display on Veterans Day in November last year were dropped after defence officials said it would cost about $92m - more than three times the original estimate."
        },
        {
            "id": 41,
            "text": "They see the event as an inappropriately partisan display and a misuse of public funds."
        },
        {
            "id": 42,
            "text": "US presidential contender Joe Biden and two other Democratic candidates marched instead in Iowa, which kicks off the nomination race in seven months' time."
        },
        {
            "id": 43,
            "text": "Senator Bernie Sanders wrote on Twitter: \"This is what authoritarians do: Donald Trump is taking $2.5 million away from our National Park Service to glorify himself with a spectacle of military tanks rolling through Washington.\""
        },
        {
            "id": 44,
            "text": "Protesters brought along an inflatable balloon depicting Mr Trump as a baby and were denied permission to use helium to make it airborne."
        },
        {
            "id": 45,
            "text": "Harry Truman was the last president to speak before a large crowd on the Washington Monument - in 1951."
        }
    ]
}