{
    "title": "Bernie Sanders Wins Indiana Democratic Primary",
    "text": [
        {
            "id": 0,
            "text": "Bernie Sanders’ victory in Indiana’s Democratic primary Tuesday demonstrates his popularity with voters hasn’t faded, even as his path to the presidential nomination has narrowed."
        },
        {
            "id": 1,
            "text": "Sanders led front-runner Hillary Clinton by 6 points, with 68 percent of precincts reporting, when networks declared him the winner."
        },
        {
            "id": 2,
            "text": "Exit polls had Sanders winning by 12 points, but they were based solely on interviews with voters on Election Day."
        },
        {
            "id": 3,
            "text": "Clinton narrowed the gap somewhat by dominating among people who voted early."
        },
        {
            "id": 4,
            "text": "Indiana’s primary was favorable to Sanders in a number of ways."
        },
        {
            "id": 5,
            "text": "The state holds an open primary, which means voters unaffiliated with either party could participate."
        },
        {
            "id": 6,
            "text": "Sanders has struggled in closed primaries, where only registered Democrats could cast a ballot."
        },
        {
            "id": 7,
            "text": "Indiana is also a predominately white state, which may have helped Sanders, since Clinton has dominated with nonwhite voters in previous contests."
        },
        {
            "id": 8,
            "text": "Indiana sends 83 pledged delegates and nine superdelegates to the Democratic convention this summer."
        },
        {
            "id": 9,
            "text": "The pledged delegates will be awarded to the candidates proportionally."
        },
        {
            "id": 10,
            "text": "The handful of polls conducted in Indiana last month suggested Clinton had a small lead."
        },
        {
            "id": 11,
            "text": "Sanders said in a statement after the race was called that he expects more victories in the weeks ahead, though he understands that he has \"an uphill climb to victory.\""
        },
        {
            "id": 12,
            "text": "\"The Clinton campaign thinks this campaign is over,\" he said."
        },
        {
            "id": 13,
            "text": "\"They’re wrong."
        },
        {
            "id": 14,
            "text": "Maybe it’s over for the insiders and the party establishment, but the voters in Indiana had a different idea."
        },
        {
            "id": 15,
            "text": "The campaign wasn’t over for them."
        },
        {
            "id": 16,
            "text": "It isn’t over for the voters in West Virginia."
        },
        {
            "id": 17,
            "text": "It isn’t over for Democrats in Oregon, New Jersey and Kentucky."
        },
        {
            "id": 18,
            "text": "It isn’t over for voters in California and all the other states with contests still to come.\""
        },
        {
            "id": 19,
            "text": "Sanders spent nearly $2 million on advertisements in Indiana, compared with nothing by Clinton, in the hopes of regaining some of the momentum he lost with last week's defeats in Pennsylvania, Connecticut, Maryland and Delaware."
        },
        {
            "id": 20,
            "text": "(He won Rhode Island.)"
        },
        {
            "id": 21,
            "text": "Sanders’ fundraising has dropped substantially:"
        },
        {
            "id": 22,
            "text": "His campaign took in $26 million in April, compared to more than $40 million in both February and March."
        },
        {
            "id": 23,
            "text": "Both Democratic candidates visited the state repeatedly."
        },
        {
            "id": 24,
            "text": "Clinton toured factories to promote her proposals to revitalize American manufacturing."
        },
        {
            "id": 25,
            "text": "Her husband, former President Bill Clinton, and her daughter, Chelsea Clinton, also campaigned in state."
        },
        {
            "id": 26,
            "text": "Sanders emphasized trade issues during rallies and town halls."
        },
        {
            "id": 27,
            "text": "For instance, he spoke at a union rally outside the state legislature, where workers were protesting United Technologies' plans to relocate two Indiana factories that employ over 2,000 workers to Mexico."
        },
        {
            "id": 28,
            "text": "Sanders also visited student-heavy areas to drive turnout among younger voters, with whom he has dominated."
        },
        {
            "id": 29,
            "text": "While Clinton leads Sanders by more than 300 pledged delegates, he has suggested that he could still prevail at the convention by convincing superdelegates to switch their allegiances with the argument that he’d do better than Clinton in the general election."
        },
        {
            "id": 30,
            "text": "“We are behind today,” Sanders told supporters at a rally at Purdue University in West Lafayette last month."
        },
        {
            "id": 31,
            "text": "“But you know what?"
        },
        {
            "id": 32,
            "text": "Unusual things happen in politics."
        },
        {
            "id": 33,
            "text": "With your help, superdelegates may reach the conclusion that Bernie Sanders will be the strongest candidate against Donald Trump or any other candidate.”"
        },
        {
            "id": 34,
            "text": "Sanders was scheduled to hold two rallies in Kentucky on Tuesday afternoon, as he looks ahead to the rest of this month’s contests."
        },
        {
            "id": 35,
            "text": "While the remaining primary contests, including upcoming Oregon and West Virginia, are favorable to him, he faces a steep climb to catch Clinton with delegates."
        },
        {
            "id": 36,
            "text": "Clinton, for her part, is speaking much more about Republican front-runner Donald Trump than Sanders to project an aura of inevitability."
        },
        {
            "id": 37,
            "text": ""
        },
        {
            "id": 38,
            "text": ""
        }
    ]
}