{
    "title": "Trump seems to make light of reports that Baltimore home of Cummings was burglarized",
    "text": [
        {
            "id": 0,
            "text": "President Trump on Friday denied he had made light of reports that the Baltimore home of Rep. Elijah E. Cummings (D-Md.) had been recently burglarized, telling reporters his comments earlier in the day were not meant to be “wise guy.”"
        },
        {
            "id": 1,
            "text": "“Really bad news!"
        },
        {
            "id": 2,
            "text": "The Baltimore house of Elijah Cummings was robbed."
        },
        {
            "id": 3,
            "text": "Too bad!”"
        },
        {
            "id": 4,
            "text": "Trump tweeted to his more than 62 million followers."
        },
        {
            "id": 5,
            "text": "Trump was responding to news reports, including one broadcast on Fox News in the previous hour, that the residence of Cummings and his wife in West Baltimore’s Druid Heights neighborhood was burglarized early Saturday, just hours before Trump started attacking the House Oversight Committee chairman on Twitter."
        },
        {
            "id": 6,
            "text": "Nikky Haley, whom Trump praised as “a fantastic person” on the day in October that she announced her plans to resign, was among a cascade of people, including some Republicans, to criticize Trump’s latest tweet directed at Cummings and the city he represents."
        },
        {
            "id": 7,
            "text": "“This is so unnecessary,” Haley wrote in a tweet that included an emoji with rolling eyes."
        },
        {
            "id": 8,
            "text": "Haley, a former South Carolina governor, served in Trump’s administration for its first two years."
        },
        {
            "id": 9,
            "text": "Years before Trump’s attacks, Freddie Gray’s death sparked a huge effort to heal Baltimore."
        },
        {
            "id": 10,
            "text": "It wasn’t enough."
        },
        {
            "id": 11,
            "text": "White House counselor Kellyanne Conway responded to Haley’s tweet with one of her own, writing: “THIS is so unnecessary.”"
        },
        {
            "id": 12,
            "text": "“Trump-PENCE2020,” Conway added, highlighting Vice President Pence’s role on the Republican ticket at a time when there has been speculation about the political futures of both Pence and Haley."
        },
        {
            "id": 13,
            "text": "Other Republicans weighing in Friday included Rep. Adam Kinzinger (R-Ill.), who called Trump’s tweet was “so beneath the office you hold.”"
        },
        {
            "id": 14,
            "text": "“It’s childish, and yet it’s getting really old,” Kinzinger said on Twitter."
        },
        {
            "id": 15,
            "text": "Kinzinger has also criticized Trump on other occasions."
        },
        {
            "id": 16,
            "text": "Echoing other Democrats, House Majority Leader Steny H. Hoyer (Md.) said that he was concerned by Trump’s “racist & dangerous rhetoric, which divides our communities and could lead to someone getting hurt.”"
        },
        {
            "id": 17,
            "text": "“Words have consequences,” Hoyer cautioned on Twitter."
        },
        {
            "id": 18,
            "text": "In a statement issued by his office Friday morning, Cummings confirmed the reports of a break-in at his rowhouse."
        },
        {
            "id": 19,
            "text": "“An individual attempted to gain entry into my residence at approximately 3:40 AM on Saturday, July 27,” he said."
        },
        {
            "id": 20,
            "text": "“I was notified of the intrusion by my security system, and I scared the intruder away by yelling before the person gained entry into the residential portion of the house."
        },
        {
            "id": 21,
            "text": "I thank the Baltimore Police Department for their response and ask that all further inquiries be directed to them.”"
        },
        {
            "id": 22,
            "text": "Cummings’s office did not comment on Trump’s tweet."
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": "On Friday morning, Baltimore police released the incident report detailing the break-in."
        },
        {
            "id": 25,
            "text": "The report said officers responded to Cummings’s home at 8:52 a.m. on July 27 for a residential burglary that reportedly occurred hours earlier."
        },
        {
            "id": 26,
            "text": "A woman in the home, whose name was redacted from the report but is presumably Cummings’s wife, said that someone tried to enter the apartment building at around 3:40 a.m."
        },
        {
            "id": 27,
            "text": "She described the man as wearing khaki shorts, a dark short sleeved T-shirt, dark tennis shoes and a black fitted hat with a “Red Upside Down ‘U’ Shape.”"
        },
        {
            "id": 28,
            "text": "The woman said a security system motion alert flagged that someone had entered through the front door of the building, according to the report."
        },
        {
            "id": 29,
            "text": "The woman’s husband, whose name was also redacted but is presumably Cummings, told police that a man then opened a second door that leads into a hallway toward the front door of their home when Cummings “confronted the suspect and yelled.”"
        },
        {
            "id": 30,
            "text": "The woman then came down stairs and spotted a man with a dark-colored bike in the foyer of the building leaving."
        },
        {
            "id": 31,
            "text": "She said she took pictures of the man as he closed the front door before the man fled on his bike."
        },
        {
            "id": 32,
            "text": "The report notes no property was reported stolen."
        },
        {
            "id": 33,
            "text": "The woman said she didn’t call 911 but reached out to a sergeant in the criminal intelligence division of the police department later in the day."
        },
        {
            "id": 34,
            "text": "Crime lab technicians went to the home and dusted for fingerprints."
        },
        {
            "id": 35,
            "text": "Investigators couldn’t locate signs that the front door had been forced open because there was previous damage from an unrelated visit by the fire department."
        },
        {
            "id": 36,
            "text": "Trump lashes out anew at Rep. Cummings and the ‘corrupt’ city he represents, says Baltimore residents have thanked him"
        },
        {
            "id": 37,
            "text": "Trump has taken repeated aim at Cummings on Twitter and public statements since last weekend."
        },
        {
            "id": 38,
            "text": "On Saturday morning, he called Cummings a “brutal bully” and claimed that conditions in his congressional district were far worse than those at the U.S.-Mexico border."
        },
        {
            "id": 39,
            "text": "Trump also attacked Baltimore as a “disgusting, rat and rodent infested mess.”"
        },
        {
            "id": 40,
            "text": "The tweet regarding Cummings’s home prompted immediate outrage from Democrats and other critics of the president."
        },
        {
            "id": 41,
            "text": "“Applauding a political opponent’s house getting robbed is impeachable, right?”"
        },
        {
            "id": 42,
            "text": "tweeted Zac Petkanas, a Democratic strategist and former senior adviser to Hillary Clinton’s campaign in 2016."
        },
        {
            "id": 43,
            "text": "“Or at least worthy of the 25th amendment?”"
        },
        {
            "id": 44,
            "text": "he added, referring to the constitutional provision that outlines procedures for the Cabinet to remove a president from office if deemed incapacitated or unfit."
        },
        {
            "id": 45,
            "text": "In a tweet, the conservative writer David Frum noted that the reported break-in at the home owned by Cummings occurred “before Trump’s ‘rat-infested’ attack upon him.”"
        },
        {
            "id": 46,
            "text": "“But the gloating afterward remains dangerous incitement,” Frum said."
        },
        {
            "id": 47,
            "text": ""
        },
        {
            "id": 48,
            "text": "“Instead of all of this back and forth about who everyone thinks is racist and whose not, the President just offered to help the people of Baltimore,” she wrote."
        },
        {
            "id": 49,
            "text": "“They should take him up on it."
        },
        {
            "id": 50,
            "text": "Let’s put the same energy into where it will make a difference.”"
        },
        {
            "id": 51,
            "text": "During an appearance Friday on Fox News, White House spokesman Hogan Gidley dismissed those who have criticized Trump for his attacks on Baltimore and Cummings."
        },
        {
            "id": 52,
            "text": "“For so long, people of Baltimore and around the region have said, ‘I wish someone would draw attention to the poverty, to the crime, the infestation of rodents in that town,” Gidley said."
        },
        {
            "id": 53,
            "text": "“And finally this president does, and they’re saying, ‘No, that’s not right.’”"
        },
        {
            "id": 54,
            "text": "Asked if Trump plans to visit the city, Gidley declined to say."
        },
        {
            "id": 55,
            "text": ""
        }
    ]
}