{
    "title": "Senate gun control bill passes first test",
    "text": [
        {
            "id": 0,
            "text": "The Senate on Thursday ended a GOP filibuster on a new gun control bill, clearing the way for debate to begin on a hugely emotional issue that has dominated headlines since the tragic December shooting in Newtown, Conn."
        },
        {
            "id": 1,
            "text": "The vote was 68-31."
        },
        {
            "id": 2,
            "text": "It’s a big win for Democrats in that 16 Republicans crossed the aisle to even consider the gun legislation, but the vote is only the opening move in what could be a drawn-out floor fight that will center on a deal unveiled Wednesday by Sens. Pat Toomey (R-Pa.), Mark Kirk (R-Ill.) and Joe Manchin (D-W.Va.)"
        },
        {
            "id": 3,
            "text": "that would require background checks on all commercial gun sales and end the so-called “gun show loophole.”"
        },
        {
            "id": 4,
            "text": "Two Democrats, Sens. Mark Pryor of Arkansas and Mark Begich of Alaska, sided with the Republicans and voted to continue the filibuster."
        },
        {
            "id": 5,
            "text": "Sixty votes were needed to end the GOP filibuster and start debate on the gun bill."
        },
        {
            "id": 6,
            "text": "Parents and family members of the victims of the Sandy Hook Elementary School Shooting watched from the gallery as the roll call vote was held."
        },
        {
            "id": 7,
            "text": "President Barack Obama spoke by phone with family members after the vote, the White House said."
        },
        {
            "id": 8,
            "text": "“The president congratulated the families on this important step forward, noting that the bipartisan progress would not have been be possible without their efforts,” said White House press secretary Jay Carney."
        },
        {
            "id": 9,
            "text": "“He reiterated that much work remains and pledged to continue fighting for the votes they deserved.”"
        },
        {
            "id": 10,
            "text": "In the Senate, opening debate is not nearly the same as winning final passage on a bill."
        },
        {
            "id": 11,
            "text": "Republicans are expected to offer dozens — if not hundreds — of amendments and string out debate over the next few weeks."
        },
        {
            "id": 12,
            "text": "Technically, the Senate still must vote on motion to allow formal debate to begin."
        },
        {
            "id": 13,
            "text": "That vote is set for Friday at this point, but Democrats are hoping that Thursday’s big bipartisan vote will show that second vote to be a futile effort for delay."
        },
        {
            "id": 14,
            "text": "Senate Majority Leader Harry Reid (D-Nev.) will offer a consent agreement to begin debate immediately, but any single Republican can object, forcing another temporary delay."
        },
        {
            "id": 15,
            "text": "Republicans who backed Reid and the Democrats in ending the filibuster did so for a variety of reasons."
        },
        {
            "id": 16,
            "text": "It was also clear that Minority Leader Mitch McConnell (R-Ky.) — who backed the filibuster effort led by Sens. Mike Lee (R-Utah),"
        },
        {
            "id": 17,
            "text": "Rand Paul (R-Ky.), Ted Cruz (R-Texas) and Marco Rubio (R-Fla.) — did not try to enforce party discipline on the filibuster, leaving his rank-and-file members to go their own way."
        },
        {
            "id": 18,
            "text": "Sen. Susan Collins (Maine), one of the few remaining Republican moderates, has her own bipartisan bill with Judiciary Committee Chairman Patrick Leahy (D-Vt.) to stiffen penalties for gun trafficking."
        },
        {
            "id": 19,
            "text": "Other Republicans such as Sens. John McCain (Ariz.), Lindsey Graham (S.C.), and Kelly Ayotte (N.H.) also opposed the GOP filibuster because they believe the party must be willing to take on such tough issues in order to get back to majority status."
        },
        {
            "id": 20,
            "text": "“It’s a huge mistake for Republicans to try and block [debate], especially in light of the massacres that have taken place in Tucson, Arizona, as well as Newtown and other places,” McCain said after the vote."
        },
        {
            "id": 21,
            "text": "Collins sounded a similar note to reporters."
        },
        {
            "id": 22,
            "text": "“Voting to proceed to it attracted the support of both Democrats and Republicans, but is not in any way a predictor of the vote on final passage or the vote on the specific amendments,” she said."
        },
        {
            "id": 23,
            "text": "McCain said he was “favorably disposed” to support the Manchin-Toomey proposal but was not ready to definitely support it."
        },
        {
            "id": 24,
            "text": "Graham is pushing a bill with Begich, Pryor and Flake that would make it more difficult for the mentally ill to get guns."
        },
        {
            "id": 25,
            "text": "Democratic aides predicted that the bill would likely get a Senate vote."
        },
        {
            "id": 26,
            "text": "Toomey, who has come under heavy criticism from the right for cutting a deal with Manchin on background checks, said his proposal “doesn’t undermine law-abiding citizens Second Amendment rights” and predicted “support will grow” for the legislation."
        },
        {
            "id": 27,
            "text": "Sen. Tom Coburn (Okla.), a hard-core conservative in good standing with the NRA, negotiated with Manchin and Sen. Chuck Schumer (D-N.Y.) for weeks on a background checks proposal, but the trio failed to reach an agreement."
        },
        {
            "id": 28,
            "text": "Although he opposes the Manchin-Toomey compromise, and has floated his own alternative bill on background checks, Coburn felt the issue should be debated upon by the Senate."
        },
        {
            "id": 29,
            "text": "For Obama and the Democrats, emotion - and public opinion polls - are clearly on their side, although they are still a long way from passing anything."
        },
        {
            "id": 30,
            "text": "There are also serious questions about what, if anything, House Speaker John Boehner (R-Ohio) will do on the issue\n\n“The United States Senate must be ready to act,” said Sen. Richard Blumenthal (D-Conn.) in calling for an end to the Republican filibuster."
        },
        {
            "id": 31,
            "text": "“There are powerful feelings about each of these proposals – both strong support and strong opposition,” Reid added."
        },
        {
            "id": 32,
            "text": "“But whichever side you are on, we ought to be able to agree to engage in a thoughtful debate about these measures."
        },
        {
            "id": 33,
            "text": "We ought to be able to agree to a careful examination of the culture of violence that has grown in this nation."
        },
        {
            "id": 34,
            "text": "I am pleased that a number of reasonable Republicans have joined Democrats in welcoming this debate.”"
        },
        {
            "id": 35,
            "text": "But Sen. Mike Lee (R-Utah), one of the leaders of the filibuster, claimed that Democrats were obscuring their true intentions on pushing new gun-control legislation."
        },
        {
            "id": 36,
            "text": "“Proponents say that the people deserve a vote, but don’t they deserve to know what they’re voting on?”"
        },
        {
            "id": 37,
            "text": "Lee asked."
        },
        {
            "id": 38,
            "text": "Begich, a red state Democrat up for reelection in 2014, said in a statement that he has “long believed we don’t need more laws restricting the Second Amendment rights of Americans, we need to better enforce those on the books."
        },
        {
            "id": 39,
            "text": "So I’ll continue to fight against any new laws which infringe on our rights.”"
        }
    ]
}