{
    "title": "Dick's Sporting Goods pulls assault-style rifles as Florida students return",
    "text": [
        {
            "id": 0,
            "text": "Two major US retailers have announced new restrictions on gun sales following the shooting at a Florida school where 17 people died."
        },
        {
            "id": 1,
            "text": "Dick's Sporting Goods, which has more than 600 shops, said it would no longer sell assault-style rifles, and backed \"common sense gun reform\"."
        },
        {
            "id": 2,
            "text": "Walmart later said it was raising the minimum age for anyone buying guns or ammunition to 21 years."
        },
        {
            "id": 3,
            "text": "It came as Marjory Stoneman Douglas High School pupils returned to classes."
        },
        {
            "id": 4,
            "text": "Grief counsellors were on hand as students and teachers arrived at the campus, two weeks after 17 of their peers were shot dead by an expelled former student with an AR-15 rifle."
        },
        {
            "id": 5,
            "text": "In the aftermath of the 14 February shooting, pressure has mounted on US politicians to act on gun control and for corporations to cut ties with the powerful National Rifle Association (NRA)."
        },
        {
            "id": 6,
            "text": "Firms including Hertz car rental, United airlines and Delta airlines have ended discounts to NRA members."
        },
        {
            "id": 7,
            "text": "Walmart, the largest seller of guns in the US, said it would remove items from its website that resembled assault-style rifles."
        },
        {
            "id": 8,
            "text": "The retailer stopped selling high-powered rifles in its shops in 2015, citing low demand."
        },
        {
            "id": 9,
            "text": "In a statement, Walmart said: \"We take seriously our obligation to be a responsible seller of firearms.\""
        },
        {
            "id": 10,
            "text": "In Washington, President Donald Trump urged a group of lawmakers with diverse views to come up with a comprehensive bipartisan solution in a televised meeting."
        },
        {
            "id": 11,
            "text": "Republican leaders in Congress have rejected raising the minimum legal age to buy rifles from 18 to 21, but Mr Trump said he \"would give pretty serious thought to it\", despite opposition from the NRA, which supported him as a candidate."
        },
        {
            "id": 12,
            "text": "He told the lawmakers: \"Some of you people are petrified of the NRA, you can't be petrified.\""
        },
        {
            "id": 13,
            "text": "Also on Wednesday, a teacher in the state of Georgia was arrested after barricading himself in a classroom and firing a handgun."
        },
        {
            "id": 14,
            "text": "No-one was injured."
        },
        {
            "id": 15,
            "text": "In announcing its policy change, Dick's Sporting Goods said in a statement that it had \"tremendous respect and admiration for the students organising and making their voices heard regarding gun violence in schools and elsewhere in our country\"."
        },
        {
            "id": 16,
            "text": "It added: \"We have heard you."
        },
        {
            "id": 17,
            "text": "The nation has heard you.\""
        },
        {
            "id": 18,
            "text": "The retailer said it was committing itself to:"
        },
        {
            "id": 19,
            "text": "It said that while it supported the Second Amendment to the US constitution, which protects the right to keep and bear arms, \"gun violence is an epidemic that's taking the lives of too many people\"."
        },
        {
            "id": 20,
            "text": "Dick's CEO Edward Stack told CNN he expected a backlash from some customers, saying \"the hunt business is an important part of the business, no doubt about it\"."
        },
        {
            "id": 21,
            "text": "The Parkland shooting suspect, 19-year-old Nikolas Cruz, bought a gun at Dick's but not the weapon he is alleged to have used in the attack, Mr Stack said."
        },
        {
            "id": 22,
            "text": "\"We did everything by the book, and we did everything that the law required, and he was still able to buy a gun,\" he told ABC."
        },
        {
            "id": 23,
            "text": "At Marjory Stoneman Douglas High School, a line of police officers, school staff and community members bearing flowers greeted some 3,000 students who returned to classes on Wednesday morning."
        },
        {
            "id": 24,
            "text": "There were also many reporters, shouting questions to the teenagers about how they felt."
        },
        {
            "id": 25,
            "text": "Lyliah Skinner, a 16-year-old student, told the BBC before she left home: \"We're not going to really be learning much today - it's all about healing.\""
        },
        {
            "id": 26,
            "text": "She also said she was feeling nervous \"because I'm scared it's gonna happen again\"."
        },
        {
            "id": 27,
            "text": "Lyliah listed people she knew who would not be returning, including Joaquin Oliver, who sat just in front of her in a class they shared."
        },
        {
            "id": 28,
            "text": "David Hogg, a senior student and now leading activist, was also feeling trepidation."
        },
        {
            "id": 29,
            "text": "It was \"really hard to think about\" what occurred two weeks ago, he said."
        },
        {
            "id": 30,
            "text": "\"Imagine getting in a plane crash and having to get back on the same plane again and again and again and being expected to learn and act like nothing's wrong,\" he told NBC News."
        },
        {
            "id": 31,
            "text": "The handling of the shooting by authorities sparked criticism after it emerged that the FBI and local police had failed to follow up on multiple tips about Mr Cruz, and that an armed deputy at the school had stayed outside the school building while the attack took place."
        },
        {
            "id": 32,
            "text": "The school's Building 12, the site of the shootings, will remain closed and cordoned off indefinitely."
        },
        {
            "id": 33,
            "text": "Members of Florida's State House and Senate will soon begin reviewing proposed bills related to firearms, which need their approval and also that of Governor Rick Scott."
        },
        {
            "id": 34,
            "text": "Among other restrictions, they would raise the legal age to buy rifles from 18 to 21 and giving police more control to seize weapons from mentally ill people."
        },
        {
            "id": 35,
            "text": "A controversial $67m voluntary programme to arm school staff, including teachers, would ensure they were trained by law enforcement and allowed to carry concealed weapons on campus, according to the New York Times."
        }
    ]
}