{
    "title": "‘Perplexing’: Granholm slams Senate Republicans’ infrastructure position",
    "text": [
        {
            "id": 0,
            "text": "Granholm specifically cited investments in the transmission grid, expanding nuclear energy initiatives and addressing the loss of fossil fuel jobs as areas where the GOP could move closer toward the White House’s infrastructure proposal."
        },
        {
            "id": 1,
            "text": "“It’s just curious why there isn’t more coming together,” she said."
        },
        {
            "id": 2,
            "text": "Granholm’s remarks come after Biden last Friday rejected the latest GOP counteroffer from Sen. Shelley Moore Capito (R-W.Va.), which increased Senate Republicans’ previous proposal of $257 billion in new spending by roughly $50 billion, according to the White House."
        },
        {
            "id": 3,
            "text": "In an earlier meeting last Wednesday, Biden had pushed Capito to support $1 trillion in new spending, after decreasing his roughly $2.3 trillion initial demand to $1.7 trillion."
        },
        {
            "id": 4,
            "text": "Biden and Capito are scheduled to speak again on Monday."
        },
        {
            "id": 5,
            "text": "Sen. Joe Manchin (D-W.Va.), a key vote on any potential package, said on Sunday that he was confident a bipartisan deal could be reached."
        },
        {
            "id": 6,
            "text": "Progressives, however, have urged Biden to pursue the so-called reconciliation process, which would allow Democrats to pass the legislation without Republican votes in the Senate."
        },
        {
            "id": 7,
            "text": "Meanwhile, the House Transportation and Infrastructure Committee is set to begin work marking up its own infrastructure bill on Wednesday."
        },
        {
            "id": 8,
            "text": "“The president still has hope."
        },
        {
            "id": 9,
            "text": "Joe Manchin still has hope."
        },
        {
            "id": 10,
            "text": "We all have hope that it can happen."
        },
        {
            "id": 11,
            "text": "They’ll be talking on Monday."
        },
        {
            "id": 12,
            "text": "But I can tell you the House will start their markup on Wednesday,” Granholm said on Sunday."
        },
        {
            "id": 13,
            "text": "“It is frustrating that there’s not more coming together on this,” she added."
        },
        {
            "id": 14,
            "text": "“But the president’s red line, as you have heard, is that inaction is his red line."
        },
        {
            "id": 15,
            "text": "So there will be action."
        },
        {
            "id": 16,
            "text": "We’re just hopeful that we can see it in a bipartisan way that would be good for the country.”"
        },
        {
            "id": 17,
            "text": "Transportation Secretary Pete Buttigieg offered a gentler assessment of the negotiations Sunday but acknowledged there was “still lots of daylight, honestly, between us and our Republican friends” on the price and scope of the infrastructure package."
        },
        {
            "id": 18,
            "text": "He also nodded to the possibility of passing the White House’s proposal through reconciliation, telling CBS’s “Face the Nation” that “as our Democratic friends remind us, there is another way."
        },
        {
            "id": 19,
            "text": "But our strong preference is to do this on a bipartisan basis.”"
        },
        {
            "id": 20,
            "text": "But even if Biden ultimately decides to forge ahead on legislation without Republican support, “there are 50 Democratic senators who think for themselves,” Buttigieg said, and “you can’t simply assume that all of them are going to come on board with something unless we work through it together.”"
        },
        {
            "id": 21,
            "text": "Commerce Secretary Gina Raimondo predicted on Sunday that those Senate Democrats, particularly Manchin and fellow moderate Sen. Kyrsten Sinema (D-Ariz.), would end up backing Biden’s proposal should bipartisan talks collapse."
        },
        {
            "id": 22,
            "text": "“I think they will."
        },
        {
            "id": 23,
            "text": "They are very engaged, both of them."
        },
        {
            "id": 24,
            "text": "They want to do what’s right,” she told ABC’s “This Week.”"
        },
        {
            "id": 25,
            "text": "Unlike Granholm, Raimondo also sought to deemphasize the urgency of the coming days’ negotiations, arguing that this week “is not [a] do-or-die” timeframe for a potential compromise between Biden and Senate Republicans."
        },
        {
            "id": 26,
            "text": "“The practice of legislating is much more art than science,” she said, and “there is no hardwired deadline” for the infrastructure talks."
        },
        {
            "id": 27,
            "text": "“We won’t do this forever,” Raimondo added."
        },
        {
            "id": 28,
            "text": "“But right now, there are good faith efforts on both sides, and we’re going to continue the work of doing our job and trying to get a bipartisan agreement.”"
        }
    ]
}