{
    "title": "Trump says ex-lawyer Cohen's crimes are 'unrelated to me'",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON  - U.S. President Donald Trump offered up a handful of legal arguments in a series of tweets on Thursday distancing himself from former personal attorney Michael Cohen, who was sentenced to prison on Wednesday for arranging 2016 hush-money payments to women who say they had affairs with the married president."
        },
        {
            "id": 1,
            "text": "Cohen admitted his actions were aimed at influencing the election in violation of campaign finance laws and said they were directed by Trump."
        },
        {
            "id": 2,
            "text": "But the president said in his tweets he never told Cohen to break the law and that the payments were unrelated to the campaign."
        },
        {
            "id": 3,
            "text": "The early-morning tweets came as the legal pressure on Trump intensified."
        },
        {
            "id": 4,
            "text": "Also on Wednesday, federal prosecutors in New York announced they had reached a cooperation deal with National Enquirer publisher American Media Inc, which admitted making a hush payment to a former Playboy model to prevent her from going public with Trump affair allegations before the 2016 election."
        },
        {
            "id": 5,
            "text": "Trump has offered a shifting defense on the payments, first saying in April he did not know about them."
        },
        {
            "id": 6,
            "text": "Later, he seemed to acknowledge the payments were made, but said they were unrelated to campaign finances, as he said again in the latest tweets."
        },
        {
            "id": 7,
            "text": "Cohen, who once said he would “take a bullet for Trump,” was sentenced in New York to three years in prison for orchestrating the payments in violation of campaign finance laws before the 2016 U.S. presidential election."
        },
        {
            "id": 8,
            "text": "He called the payments part of the “dirty deeds” he did at Trump’s behest."
        },
        {
            "id": 9,
            "text": "Federal prosecutors said Trump ordered the payouts to protect his campaign from the allegations of sexual affairs."
        },
        {
            "id": 10,
            "text": "Trump wrote on Twitter: “I never directed Michael Cohen to break the law."
        },
        {
            "id": 11,
            "text": "He was a lawyer and he is supposed to know the law."
        },
        {
            "id": 12,
            "text": "It is called ‘advice of counsel.’ ..."
        },
        {
            "id": 13,
            "text": "This was not campaign finance.”"
        },
        {
            "id": 14,
            "text": "FILE PHOTO:"
        },
        {
            "id": 15,
            "text": "U.S. President Donald Trump sits for an exclusive interview with Reuters journalists in the Oval Office at the White House in Washington, U.S. December 11, 2018."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "The president continued: “Cohen was guilty on many charges unrelated to me.”"
        },
        {
            "id": 18,
            "text": "The main defense Trump and his lawyers have put forth in recent weeks is that the payments were not subject to campaign finance laws because they were aimed at protecting his personal reputation and would have been made even if he had not been a candidate for president."
        },
        {
            "id": 19,
            "text": "His claim on Twitter to have relied on advice of counsel was new though, but legal experts expressed skepticism it would work."
        },
        {
            "id": 20,
            "text": "Jessica Levinson, a professor of election law at Loyola Law School in Los Angeles, explained that the defense, often invoked by corporations in complex transactions, depends on a party relying on lawyers in good faith."
        },
        {
            "id": 21,
            "text": "But, if Trump had wanted legal advice on this issue, he would have sought out specialized campaign finance lawyers rather than Cohen, Levinson said."
        },
        {
            "id": 22,
            "text": "Trump’s campaign did have such specialized counsel, a team of election lawyers from Jones Day led by Don McGahn, who would go on to serve as White House counsel."
        },
        {
            "id": 23,
            "text": "Justice Department policy is not to indict a sitting president, but some legal experts have said Trump could be charged after leaving office."
        },
        {
            "id": 24,
            "text": "Democrats and other critics also have raised the issue of impeachment by Congress."
        },
        {
            "id": 25,
            "text": "Trump has denied the affairs."
        },
        {
            "id": 26,
            "text": "He has also denied the main focus of the investigation by Special Counsel Robert Mueller: whether his campaign colluded with Moscow in its meddling in the 2016 campaign."
        },
        {
            "id": 27,
            "text": "The Kremlin has denied that any meddling occurred."
        },
        {
            "id": 28,
            "text": "Trump has routinely blasted the Mueller investigation as a “witch hunt.”"
        },
        {
            "id": 29,
            "text": "Mueller referred the Cohen prosecution to federal prosecutors in New York earlier this year."
        },
        {
            "id": 30,
            "text": "Prosecutors on Wednesday also said the publisher of the National Enquirer tabloid had struck a deal to avoid charges over its role in one of the payments made “in concert” with Trump’s presidential campaign."
        },
        {
            "id": 31,
            "text": "Cohen, who also pleaded to tax evasion and lying to Congress about a proposed Trump Organization building in Moscow, in court on Wednesday said his “blind loyalty” led him to cover up for Trump."
        },
        {
            "id": 32,
            "text": "Cohen is the latest Trump associate to be swept up in Mueller’s investigation following Trump’s campaign chairman Paul Manafort, former deputy campaign chairman Rick Gates and former national security adviser Michael Flynn, among others."
        },
        {
            "id": 33,
            "text": "In an interview with Reuters this week, Trump slammed Cohen for cooperating with prosecutors and said he was unconcerned about possible impeachment."
        },
        {
            "id": 34,
            "text": "He also called any of his potential business dealings with Russia “peanut stuff.”"
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}