{
    "title": "Jackson Statue Near White House Still Standing After Protesters Try To Topple It",
    "text": [
        {
            "id": 0,
            "text": "Police fired chemical agents to clear Lafayette Square in Washington, D.C., on Monday night after protesters attempted — and failed — to pull down a huge statue of Andrew Jackson located there."
        },
        {
            "id": 1,
            "text": "The famous statue of the seventh president on a rearing horse sits opposite the North Portico of the White House."
        },
        {
            "id": 2,
            "text": "The park has been the scene of anti-racist protests since the police killing of George Floyd in Minneapolis last month."
        },
        {
            "id": 3,
            "text": "Protesters removed a chain-link fence that had recently been placed around the statue and climbed its base to tie ropes around the neck of Jackson and his horse, according to The Associated Press."
        },
        {
            "id": 4,
            "text": "Efforts to pull the statue off its pedestal were unsuccessful."
        },
        {
            "id": 5,
            "text": "Jackson's likeness is the latest statue of a historic figure associated with racism to be targeted by protesters."
        },
        {
            "id": 6,
            "text": "President Jackson, who was a Tennessee slaveholder, signed into law the Indian Removal Act in 1830, which led to the expulsion of Native Americans east of the Mississippi River."
        },
        {
            "id": 7,
            "text": "The Cherokees' forced march to Oklahoma, during which thousands died, became known as the Trail of Tears."
        },
        {
            "id": 8,
            "text": "Jackson, known as a populist and the first president who did not come from the nation's East Coast elite, is a favorite of President Trump, who has Jackson's portrait in the Oval Office."
        },
        {
            "id": 9,
            "text": "In a tweet, the president called attempts to pull down the statue \"disgraceful vandalism\" and said \"numerous\" arrests had been made."
        },
        {
            "id": 10,
            "text": "According to the AP, the incident began around dusk as scores of protesters, many wearing masks because of the coronavirus, surrounded the statue."
        },
        {
            "id": 11,
            "text": "\"Killer scum\" was spray-painted on the monument's pedestal."
        },
        {
            "id": 12,
            "text": "Videos posted on social media showed protesters attempting to pull the statue off its pedestal with ropes and police pushing protesters out of Lafayette Square."
        },
        {
            "id": 13,
            "text": "Dozens of officers, led by U.S. Park Police, cleared the square swinging batons and firing chemical agents, according to the AP."
        },
        {
            "id": 14,
            "text": "NPR's Tim Mak reports from the scene that officers pushed protesters back to H Street NW, close to St. John's Church to the north of Lafayette Square."
        },
        {
            "id": 15,
            "text": "Mak described the crowd as peaceful and jubilant, with pop music playing into the night."
        },
        {
            "id": 16,
            "text": "Last week, protesters toppled the statue of Confederate Gen. Albert Pike, the only public statue of a Confederate figure in Washington, D.C."
        },
        {
            "id": 17,
            "text": "There are a dozen statues of Confederate figures inside the U.S. Capitol, placed there by Southern states."
        },
        {
            "id": 18,
            "text": "House Speaker Nancy Pelosi has called for their removal."
        }
    ]
}