{
    "title": "Major spending cut proposed for Medicare Advantage",
    "text": [
        {
            "id": 0,
            "text": "Medicare Advantage enrollment grew nearly 9 percent from 2013 to 2014."
        },
        {
            "id": 1,
            "text": "Medicare Advantage cuts proposed"
        },
        {
            "id": 2,
            "text": "The Obama administration is proposing a major cut in 2015 payments to Medicare Advantage, in a move that is sure to set off a ferocious campaign by the insurance industry to reverse the decision and likely will further complicate the health care politics of the midterm elections."
        },
        {
            "id": 3,
            "text": "An annual notice released Friday after the markets closed would reduce Medicare Advantage spending by 3.55 percent."
        },
        {
            "id": 4,
            "text": "The figure is based on trends in health care spending, which has grown at a historically low pace in recent years."
        },
        {
            "id": 5,
            "text": "The annual rate adjustment — which is only one of the payment changes — is calculated through a complicated set of formulas, and analysts were still sorting out the 148-page proposal that CMS released late in the afternoon to assess the total impact on the increasingly popular program for seniors."
        },
        {
            "id": 6,
            "text": "Lambert van der Walde, a former CMS official under President George W. Bush who now advises investment firms, said the cut is bigger than the industry expected, given estimates the government provided in December."
        },
        {
            "id": 7,
            "text": "“It looks worse,” van der Walde said, while adding that it’s too soon to determine what the final level will be."
        },
        {
            "id": 8,
            "text": "Republican and Democratic strategists say any cuts to Medicare Advantage, which now covers a third of all Medicare beneficiaries, will give the GOP ammunition to attack Democrats."
        },
        {
            "id": 9,
            "text": "Some Democrats have already asked the administration to leave the program alone."
        },
        {
            "id": 10,
            "text": "Forty senators, including vulnerable Democrats Kay Hagan of North Carolina, Mary Landrieu of Louisiana, Mark Pryor of Arkansas and Mark Udall of Colorado, as well as Sen. Chuck Schumer (D-N.Y.) and a host of Republicans, sent a letter Tuesday asking the administration to “prioritize beneficiaries’ experience and minimize disruption to payment levels for 2015.”"
        },
        {
            "id": 11,
            "text": "Friday afternoon, a memo from House Majority Leader Eric Cantor highlighted plans for Republicans to focus on “the negative impact on seniors from the Medicare Advantage cuts.”"
        },
        {
            "id": 12,
            "text": "Insurers recently launched a pre-emptive, seven-figure campaign to pressure the Obama administration to turn the various payment dials in order to offset a variety of cuts to the program, including reductions under the Affordable Care Act to bring payments to the private plans in line with the traditional Medicare program."
        },
        {
            "id": 13,
            "text": "In a statement Friday evening, the industry trade group America’s Health Insurance Plans predicted that the proposed cuts would result in seniors losing benefits and choices and urged that payment rates be kept flat."
        },
        {
            "id": 14,
            "text": "“Another round of payment cuts would be devastating,” said AHIP President and CEO Karen Ignagni."
        },
        {
            "id": 15,
            "text": "AHIP has pledged to continue that campaign of advertising and aggressive lobbying on Capitol Hill while leveraging a coalition of 1.5 million seniors to hammer Congress with constituent complaints."
        },
        {
            "id": 16,
            "text": "It’s an approach that has worked in the past."
        },
        {
            "id": 17,
            "text": "Last year, the administration proposed 2.2 percent in cuts for Medicare Advantage plans."
        },
        {
            "id": 18,
            "text": "After a six-week campaign that included paid advertising inside the Beltway and beyond, and letters from at least 160 supportive lawmakers from both parties, CMS reversed a key assumption that had long been built into its estimates and instead put forward a 3.3 percent growth rate."
        },
        {
            "id": 19,
            "text": "Even so, because of a variety of other moves and cuts, the industry estimated that Medicare Advantage plans suffered a cumulative 6.5 percent drop in payments."
        },
        {
            "id": 20,
            "text": "That drew warnings of substantial benefit reductions for seniors."
        },
        {
            "id": 21,
            "text": "For the most part, those did not materialize."
        },
        {
            "id": 22,
            "text": "Indeed, Avalere Health reported Friday that Medicare Advantage enrollment grew nearly 9 percent from 2013 to 2014."
        },
        {
            "id": 23,
            "text": "The program now covers almost 16 million people."
        },
        {
            "id": 24,
            "text": "Friday’s announcement contains several other payment policies in addition to the growth rate that would also affect the total payments."
        },
        {
            "id": 25,
            "text": "Those policies, including for risk adjustment, “coding intensity” and a quality bonus program, were still being reviewed by industry stakeholders."
        },
        {
            "id": 26,
            "text": "Some policy experts noted that the rate announcement is an annual adjustment the administration makes, not a new policy."
        },
        {
            "id": 27,
            "text": "And the Medicare Advantage cuts are no surprise, they said; most were already included in the ACA and other steps Congress has taken."
        },
        {
            "id": 28,
            "text": "“There don’t appear to be any new cuts that weren’t payment changes and adjustments already required under current law, despite the recent claims to the contrary,” Edwin Park, of the Center on Budget and Policy Priorities, noted via email."
        },
        {
            "id": 29,
            "text": "But one important detail was immediately evident: A quality bonus demonstration project that effectively shielded plans from some Obamacare cuts over the past three years is being allowed to sunset as scheduled at the end of 2014 under the proposed payment policy."
        },
        {
            "id": 30,
            "text": "How much flexibility the administration has to revise the payment plans before they are finalized in April is not clear, van der Walde said."
        },
        {
            "id": 31,
            "text": "“Unlike last year, there’s no obvious assumption change that can easily be made and we have the additional backdrop of a challenging ACA implementation and midterm elections,” he said."
        }
    ]
}