{
    "title": "Surprise: Clinton Foundation Will Keep Receiving Donations From Foreign Governments",
    "text": [
        {
            "id": 0,
            "text": "Do we want a president who is bought and paid for by foreign governments?"
        },
        {
            "id": 1,
            "text": "That's the question Americans should be asking themselves."
        },
        {
            "id": 2,
            "text": "It was announced late yesterday that Bill and Hillary Clinton's Clinton Foundation, which has received more than $100 million in foreign government donations, will continue to receive foreign donations as she runs for president."
        },
        {
            "id": 3,
            "text": "The good news is they're limiting the countries to six allies and none of them are state sponsors of terrorism or proponents of Shariah law."
        },
        {
            "id": 4,
            "text": "More from WSJ:\n\nThe board of the Bill, Hillary and Chelsea Clinton Foundation has decided to continue accepting donations from foreign governments, primarily from six countries, even though Hillary Clinton is running for president, a summary of the new policy to be released Thursday shows."
        },
        {
            "id": 5,
            "text": "The rules would permit donations from Australia, Canada, Germany, the Netherlands, Norway and the U.K.—countries that support or have supported Clinton Foundation programs on health, poverty and climate change, according to the summary."
        },
        {
            "id": 6,
            "text": "That means other nations would be prohibited from making large donations to the foundation."
        },
        {
            "id": 7,
            "text": "But those governments would be allowed to participate in the Clinton Global Initiative, a subsidiary of the foundation where companies, nonprofit groups and government officials work on solutions to global problems."
        },
        {
            "id": 8,
            "text": "Regardless of which foreign governments are still allowed to donate to the Clinton Foundation, the point still stands."
        },
        {
            "id": 9,
            "text": "If Hillary is elected president, will she put the best interests of the United States first?"
        },
        {
            "id": 10,
            "text": "Or will she put the interests of the Clinton Foundation ahead of everything else?"
        },
        {
            "id": 11,
            "text": "Based on her latest email scandal, it's a fair question."
        },
        {
            "id": 12,
            "text": "During her time as Secretary of State Clinton put her own interest of evading congressional oversight above the national security of the U.S. by using personal email on an unsecured, personal server to conduct all of her official State Department business."
        },
        {
            "id": 13,
            "text": "On a separate note, despite being a so-called advocate and champion for women around the world, Hillary Clinton has gladly accepted millions in donations to her Foundation from countries like Saudi Arabia, where women have practically zero human rights."
        }
    ]
}