{
    "title": "At 2016 Iowa summit, some fresh GOP faces — finally",
    "text": [
        {
            "id": 0,
            "text": "ANALYSIS/OPINION:\n\nANALYSIS/OPINION:"
        },
        {
            "id": 1,
            "text": "For all the talk of a deep Republican bench for 2016, a lot of the faces in the early game are the same."
        },
        {
            "id": 2,
            "text": "Mitt Romney?"
        },
        {
            "id": 3,
            "text": "Really?"
        },
        {
            "id": 4,
            "text": "He ran and lost in 2012 — badly."
        },
        {
            "id": 5,
            "text": "Rick Santorum?"
        },
        {
            "id": 6,
            "text": "Mike Huckabee?"
        },
        {
            "id": 7,
            "text": "Rick Perry?"
        },
        {
            "id": 8,
            "text": "They all ran and lost to the guy who won the nomination — and then lost — badly."
        },
        {
            "id": 9,
            "text": "Sarah Palin?"
        },
        {
            "id": 10,
            "text": "She lost so badly in 2008 she didn’t even make an effort in 2012."
        },
        {
            "id": 11,
            "text": "The list of has-beens goes on and on."
        },
        {
            "id": 12,
            "text": "But there are a few new faces — and thank God, because the 2016 nominee is going to have to be a whole new breed of Republican."
        },
        {
            "id": 13,
            "text": "After back-to-back shellackings — first against a nearly unknown first-term U.S. senator, then to a highly unpopular president — the party has no choice but to go in a new direction, and that path does not lead back into the wilderness."
        },
        {
            "id": 14,
            "text": "The New Breed were on hand Saturday at the Iowa Freedom Summit, the first showcase for those who hope to move into the White House on Jan. 20, 2017."
        },
        {
            "id": 15,
            "text": "None was more highly anticipated than Wisconsin Gov. Scott Walker, who with his tax-slashing, union-bashing swagger has quickly become the new darling of conservatives."
        },
        {
            "id": 16,
            "text": "In a 20-minute, stage-pacing speech, Mr. Walker wowed the heartland crowd."
        },
        {
            "id": 17,
            "text": "In what was mostly an introduction to voters who’ve never heard of him, the governor opened with his travails during a statewide recall vote, when his family faced threats and one anonymous opponent vowed to “gut my wife like a deer.”"
        },
        {
            "id": 18,
            "text": "“Since I was elected governor, we’ve cut taxes in Wisconsin, we’ve reduced spending, we balanced the budget, we took the power away from the big-government special interests and we put it firmly in the hands of the hard-working taxpayers."
        },
        {
            "id": 19,
            "text": "That’s what we need more of in this great country."
        },
        {
            "id": 20,
            "text": "And you know what, the liberals don’t much like that,” he said to loud applause."
        },
        {
            "id": 21,
            "text": "Mr. Walker, who looked less than polished, at one point talking over the applauding audience, told folksy stories about working at McDonald’s as a kid, shopping at Kohl’s."
        },
        {
            "id": 22,
            "text": "But his bootstrap message resonated with attendees, who heartily cheered when he said: “The measure of success in government is how many people are no longer dependent on the government.”"
        },
        {
            "id": 23,
            "text": "Another new face on big stage belonged to Ben Carson, who famously spanked President Obama over his health care overhaul during the 2013 National Prayer Breakfast."
        },
        {
            "id": 24,
            "text": "He, too, sought to introduce himself to voters, referring often to his hard-working mom who took no guff from her rambunctious boys."
        },
        {
            "id": 25,
            "text": "The world-famous surgeon also talked God, a big topic in Iowa: “You don’t have to have a PhD to talk to Him, you just have to have faith.”"
        },
        {
            "id": 26,
            "text": "He vowed that as president, he would have a secure southern border within one year, and pledged to reduce the size of government so “they don’t have time to stick their big noses in everybody’s business.”"
        },
        {
            "id": 27,
            "text": "The crowd whooped at that line."
        },
        {
            "id": 28,
            "text": "Carly Fiorina, the former CEO of Hewlett-Packard, also debuted, and delivered several spectacular lines, none better than this aimed at a certain Democratic former secretary of state: “Like Hillary Clinton, I too have traveled hundreds of thousands of miles around the globe."
        },
        {
            "id": 29,
            "text": "But unlike her, I’ve actually accomplished something.”"
        },
        {
            "id": 30,
            "text": "She said she felt “a deep disquiet” in the nation and blamed both parties for the growth of government."
        },
        {
            "id": 31,
            "text": "On that topic, she said: “Politics can no longer tinker on the edges. …"
        },
        {
            "id": 32,
            "text": "The potential of America is being crushed by the weight of government.”"
        },
        {
            "id": 33,
            "text": "And her appearance made for a stark contrast, as Mrs. Palin followed her on the stage, delivering a 35-minute rambling stream-of-consciousness mess of a speech."
        },
        {
            "id": 34,
            "text": "Sen. Ted Cruz of Texas sought to paint himself as an outsider (he said he’d spent all week in D.C., so “it’s good to be back in America again” … ba da bing)."
        },
        {
            "id": 35,
            "text": "And he strived to win the Most Like Reagan award every one of these forums should feature (“We will together bring back that shining city on the hill that is the United States of America”)."
        },
        {
            "id": 36,
            "text": "“All candidates will say they’re the most conservative."
        },
        {
            "id": 37,
            "text": "‘Gosh darn it, hoodiddly, I’m conservative.’"
        },
        {
            "id": 38,
            "text": "Well, you know what, talk is cheap,” he said before quoting the Bible."
        },
        {
            "id": 39,
            "text": "Mr. Cruz clearly knows what plays in Iowa."
        },
        {
            "id": 40,
            "text": "And so does the other big star of the confab, New Jersey Gov. Chris Christie."
        },
        {
            "id": 41,
            "text": "Heckled right out of the gate, Mr. Christie asked: “If I was too blunt, too direct, too loud and too New Jersey for Iowa, why do you people keep inviting me back?”"
        },
        {
            "id": 42,
            "text": "Unlike the other stage pacers, Mr. Christie stood at the podium reading his speech from papers as he acknowledged that he faces an uphill road with conservatives."
        },
        {
            "id": 43,
            "text": "But he warned: “If you want a candidate who agrees with you 100 percent of the time, I’ll give you one suggestion — go home and look in the mirror: You are the only person you agree with 100 percent of the time."
        },
        {
            "id": 44,
            "text": "… If that’s the standard we hold each other to as a party, we will never win another national election — ever,” he said."
        },
        {
            "id": 45,
            "text": "And last but not least, another new face was Donald Trump, who really does appear as if he’s serious about running for president."
        },
        {
            "id": 46,
            "text": "He called Obamacare a “filthy” lie, vowed to fix Social Security and Medicare, but he won the biggest cheers when he talked about who voters shouldn’t pick in 2016."
        },
        {
            "id": 47,
            "text": "“It can’t be Mitt because Mitt ran and failed,” The Donald said to loud applause."
        },
        {
            "id": 48,
            "text": "“And you can’t have Bush,” he said about a summit no-show, Jeb Bush."
        },
        {
            "id": 49,
            "text": "“The last thing we need is another Bush,” he said, drawing even louder cheers."
        },
        {
            "id": 50,
            "text": "Say what you want about The Donald, but he’s a fresh voice in a party that sorely needs a change."
        },
        {
            "id": 51,
            "text": "No doubt the other newcomers to this presidential race took note of the supportive response he received."
        }
    ]
}