{
    "title": "Reduction of Nuclear Arsenal Has Slowed Under Obama, Report Finds",
    "text": [
        {
            "id": 0,
            "text": "A new census of the American nuclear arsenal shows that the Obama administration last year dismantled its smallest number of warheads since taking office."
        },
        {
            "id": 1,
            "text": "The new figures, released by the Pentagon, also highlight a trend — that the current administration has reduced the nuclear stockpile less than any other post-Cold War presidency."
        },
        {
            "id": 2,
            "text": "On Thursday, the Federation of American Scientists, a private group in Washington that strongly supports arms control, issued an analysis of the new figures on its Strategic Security blog."
        },
        {
            "id": 3,
            "text": "The annual Pentagon release did not appear to be linked to President Obama’s visit Friday to Hiroshima, Japan, which was destroyed by an American atomic bomb almost 71 years ago."
        },
        {
            "id": 4,
            "text": "Still, the new figures and private analysis underscored the striking gap between Mr. Obama’s soaring vision of a world without nuclear arms, which he laid out during the first months of his presidency, and the tough geopolitical and bureaucratic realities of actually getting rid of those weapons."
        },
        {
            "id": 5,
            "text": "The lack of recent progress in both arms control and warhead dismantlement also seems to coincide with the administration’s push for sweeping nuclear modernizations that include improved weapons, bombers, missiles and submarines."
        },
        {
            "id": 6,
            "text": "Those upgrades are estimated to cost up to $1 trillion over the next three decades."
        },
        {
            "id": 7,
            "text": "The new census is an annual public release that the Pentagon has done in recent years detailing how many weapons remain in the nation’s nuclear arsenal and how many retired weapons have been disassembled."
        },
        {
            "id": 8,
            "text": "The census, which updates the numbers to include 2015, was posted this month on the Department of Defense’s open government website under the heading “Declassification of Formerly Restricted Data.”"
        },
        {
            "id": 9,
            "text": "The site noted that the figures were current through Sept. 30, 2015, the end of the government’s fiscal year."
        },
        {
            "id": 10,
            "text": "Supporters of Mr. Obama say the slowdowns are understandable given the rising level of hostility and intransigence of the Russian president, Vladimir V. Putin, as well as the inherent difficulties involved in arms control and complex technical projects."
        },
        {
            "id": 11,
            "text": "The new figures show that in 2015 the Obama administration dismantled 109 warheads, the fewest of his presidency and down from a peak of 356 in 2009, his first year in office."
        },
        {
            "id": 12,
            "text": "The slowdown came despite Secretary of State John Kerry’s telling global arms controllers in April 2015 that “President Obama has decided that the United States will seek to accelerate the dismantlement of retired nuclear warheads by 20 percent.”"
        },
        {
            "id": 13,
            "text": "In March, in its annual report to Congress, the National Nuclear Security Administration, which oversees the nation’s nuclear arsenal, laid responsibility for the slowdown to “safety reviews, unusually high lightning events, and a worker strike at Pantex,” a sprawling dismantlement plant in Texas."
        },
        {
            "id": 14,
            "text": "Lightning strikes at the plant can set off the high explosives used in destroying nuclear arms."
        },
        {
            "id": 15,
            "text": "On Thursday, Hans M. Kristensen, director of the Nuclear Information Project at the federation, questioned the administration’s logic."
        },
        {
            "id": 16,
            "text": "“Although 2015 was unusually low,” he wrote on his blog of the annual disassembly figure, “the Obama administration’s dismantlement record clearly shows a trendline of fewer and fewer warheads dismantled.”"
        },
        {
            "id": 17,
            "text": "At the Obama administration’s low rate, Mr. Kristensen added, the nation’s backlog in nuclear arms dismantlement will persist “at least until 2024.”"
        },
        {
            "id": 18,
            "text": "On Thursday, the federation’s blog also updated a nuclear issue that Mr. Kristensen first raised in 2014 — that Mr. Obama has reduced the size of the nation’s nuclear stockpile at a far slower rate than did any of his three immediate predecessors, including George Bush and George W. Bush."
        },
        {
            "id": 19,
            "text": "The new Pentagon census shows that the nation’s nuclear arsenal in 2015 stood at 4,571 warheads — down from 5,273 warheads in 2008, the last nuclear census of the administration of George W. Bush."
        },
        {
            "id": 20,
            "text": "The total reduction of 702 warheads, or 13.3 percent, Mr. Kristensen noted, “is no small number,” but nonetheless represented “the smallest reduction of the stockpile achieved by any previous post-Cold War administration.”"
        },
        {
            "id": 21,
            "text": "To be fair, he added, the modest pace is not all Mr. Obama’s fault."
        },
        {
            "id": 22,
            "text": "“His vision of significant reductions and putting an end to Cold War thinking has been undercut by opposition ranging from Congress to the Kremlin,” Mr. Kristensen wrote."
        },
        {
            "id": 23,
            "text": "“An entrenched and almost ideologically-opposed Congress has fought his arms reduction vision every step of the way.”"
        },
        {
            "id": 24,
            "text": "Moscow, he added, has rejected cuts beyond modest ones it agreed to in the New Start treaty, which was signed in 2010 and observed beginning in 2011."
        },
        {
            "id": 25,
            "text": "Mr. Obama’s visit to Hiroshima takes place in the shadow of his nuclear weapons legacy, Mr. Kristensen argued."
        },
        {
            "id": 26,
            "text": "His modest gains upset arms controllers, he wrote, not least because his modernization plans are “anything but modest.”"
        }
    ]
}