{
    "title": "Trump’s Plan To Stop Family Separations Is To Detain Families Together",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump’s plan to stop his administration’s policy of separating immigrant children from their families seems simple:"
        },
        {
            "id": 1,
            "text": "Lock up immigrant parents and their children together, indefinitely."
        },
        {
            "id": 2,
            "text": "But there’s no evidence that Trump has the legal authority to make his wish reality."
        },
        {
            "id": 3,
            "text": "His plan, issued in an executive order on Wednesday, conflicts with a 2015 court ruling that required the government to release child migrants from detention after 20 days."
        },
        {
            "id": 4,
            "text": "Trump can’t dismiss federal judges’ rulings by decree."
        },
        {
            "id": 5,
            "text": "So his executive order will trigger a massive showdown between his administration and human rights activists in court."
        },
        {
            "id": 6,
            "text": "“These are protections for kids."
        },
        {
            "id": 7,
            "text": "That’s the doctrine here,” said Muzaffar Chishti, director of the nonpartisan Migration Policy Institute’s office at the NYU School of Law."
        },
        {
            "id": 8,
            "text": "“And if anything goes against the protection of kids, it will be challenged.”"
        },
        {
            "id": 9,
            "text": "Trump administration officials have insisted that they enacted the family separation policy in part because of a 2015 court order over a 1997 court settlement called the Flores agreement."
        },
        {
            "id": 10,
            "text": "The Flores agreement and the ensuing 2015 ruling limit the length of time that children can be detained, including with their parents."
        },
        {
            "id": 11,
            "text": "Most detained immigrant children must be released within about 20 days to continue their deportation proceedings outside of detention."
        },
        {
            "id": 12,
            "text": "In the past, the federal government has generally released the children’s mothers from family detention along with them rather than splitting them up."
        },
        {
            "id": 13,
            "text": "The Trump administration has said this policy effectively creates “catch and release” for families, and proposed changing it through legislation."
        },
        {
            "id": 14,
            "text": "But getting immigration policy through Congress is an uphill battle."
        },
        {
            "id": 15,
            "text": "Yuri Gripas / Reuters President Donald Trump unveiled an executive order on Wednesday to address his administration's policy of separating immigration children from their families."
        },
        {
            "id": 16,
            "text": "But the plan conflicts with a 2015 court ruling that required the government to release child migrants from detention after 20 days."
        },
        {
            "id": 17,
            "text": "Trump said when he signed the order that a zero tolerance policy for illegal entry would continue, meaning the administration will still aggressively pursue prosecution of parents."
        },
        {
            "id": 18,
            "text": "Now, according to his order, parents being prosecuted will be locked up with their kids in most circumstances while criminal proceedings go forward ― and even after, while they pursue immigration cases."
        },
        {
            "id": 19,
            "text": "Those proceedings can take years."
        },
        {
            "id": 20,
            "text": "The order conscripts the entirety of the federal government into mass immigrant family detention."
        },
        {
            "id": 21,
            "text": "It instructs heads of government agencies to make facilities available for family detention, to the extent permissible by law."
        },
        {
            "id": 22,
            "text": "The Department of Defense is instructed to also “construct such facilities if necessary.”"
        },
        {
            "id": 23,
            "text": "The order says the Department of Homeland Security will reimburse these other agencies for the expense."
        },
        {
            "id": 24,
            "text": "The policy isn’t a reversal of his border crackdown; it’s a continuation of it."
        },
        {
            "id": 25,
            "text": "“I think the word compassion comes into it,” Trump said at the White House."
        },
        {
            "id": 26,
            "text": "“But it’s still equally as tough, if not tougher.”"
        },
        {
            "id": 27,
            "text": "Now, as the backlash against family separation at the border grows, Republicans in Congress are floating measures to spike the Flores agreement and its accompanying court orders, freeing up the Trump administration to keep families together by locking them up indefinitely in family detention centers."
        },
        {
            "id": 28,
            "text": "One proposal would reportedly divert some of the $7 billion originally marked for border security infrastructure to expand upon the three family detention centers that Immigration and Customs Enforcement currently runs."
        },
        {
            "id": 29,
            "text": "If that legislation were to pass, it wouldn’t have an immediate impact, according to Peter Schey, one of lawyers who represents children in the ongoing class action lawsuit over the Flores Agreement."
        },
        {
            "id": 30,
            "text": "Instead, the government would have to go to court to ask the judge to terminate the agreement, he said."
        },
        {
            "id": 31,
            "text": "If that happens, Schey and his team of lawyers will oppose."
        },
        {
            "id": 32,
            "text": "If they lose after a lengthy appeal process, they’ll turn around and file a similar lawsuit that could put the federal government in the exact same situation it was in before trying to kill the settlement through legislation."
        },
        {
            "id": 33,
            "text": "“Even if they succeed in getting some legislation that’s onerous and inhumane, I wouldn’t be surprised if a year or two later we can get it set aside,” Schey said."
        },
        {
            "id": 34,
            "text": "It’s hard to predict how the courts might rule."
        },
        {
            "id": 35,
            "text": "But the basic elements of the settlement ― that child migrants should be treated humanely and freed from detention if they don’t present a danger to the community or a flight risk ― are already part of U.S. immigration law."
        },
        {
            "id": 36,
            "text": "And U.S. District Judge Dolly Gee, who presides over the case, repeatedly hammered the Obama administration with harshly worded rulings in the years that it tried to expand family detention to deal with an influx of Central Americans seeking asylum."
        },
        {
            "id": 37,
            "text": "Congress has wide latitude to change immigration laws, which could make a legal challenge more difficult, Chishti said."
        },
        {
            "id": 38,
            "text": "But Congress cannot pass laws that violate the Constitution, and there are concerns that long-term family detention could violate the rights of those detained."
        },
        {
            "id": 39,
            "text": "A policy change made by Trump alone would be even more susceptible to litigation, Chishti said."
        },
        {
            "id": 40,
            "text": "Trump has already run into problems with his administrative actions on immigration, including his travel bans, attempt to eliminate the Deferred Action for Childhood Arrivals program for undocumented young people and efforts to punish so-called “sanctuary cities” for not fully cooperating with deportation efforts."
        },
        {
            "id": 41,
            "text": "Advertisement\n\nTrump said Wednesday that he thinks Congress would follow up his executive order with legislation, but that’s not a guarantee ―"
        },
        {
            "id": 42,
            "text": "it’s unclear whether any of the legislative proposals put forward so far, some of which are vague, have enough support to pass."
        },
        {
            "id": 43,
            "text": "Immigrant rights advocates argue that Trump and Congress should pursue alternatives to family detention, which would allow kids and parents to be together and monitored by immigration officials during their removal proceedings, just not locked up."
        },
        {
            "id": 44,
            "text": "“The two cornerstones of the settlement don’t seem to be very controversial,” Schey said."
        },
        {
            "id": 45,
            "text": "“It’s been hard to see how Congress might say, ‘No ― we want to treat these children inhumanely.’"
        },
        {
            "id": 46,
            "text": "Or ‘No, we want to detain these kids even if they have a viable sponsor"
        },
        {
            "id": 47,
            "text": "and they’re not a threat to others.’"
        },
        {
            "id": 48,
            "text": "If that’s not true, what’s the justification for insisting on their detention?”"
        },
        {
            "id": 49,
            "text": "Rep. Zoe Lofgren (D-Calif.), the top Democrat on the House immigration subcommittee, predicted on Wednesday that if Trump tried to violate the Flores agreement, the action would wind up blocked by a judge."
        },
        {
            "id": 50,
            "text": "“The Flores settlement is in place for a reason, which is that indefinite incarceration of children in prisons is not a good thing for them and not necessary, whether it’s by themselves or with their parents,” she told HuffPost."
        },
        {
            "id": 51,
            "text": "“To repeal that is not consistent with American values.”"
        }
    ]
}