{
    "title": "Drug Agency Lowers Age for Next-Day Birth Control",
    "text": [
        {
            "id": 0,
            "text": "The Food and Drug Administration said Tuesday that it would make the most widely known morning-after pill available without a prescription to girls and women ages 15 and older, and also make the pill available on drugstore shelves, instead of keeping it locked up behind pharmacy counters."
        },
        {
            "id": 1,
            "text": "Until this decision the pill, Plan B One-Step, which is used after sexual intercourse to help prevent pregnancy, was available without a prescription only for ages 17 and older."
        },
        {
            "id": 2,
            "text": "The decision did not address a federal judge’s ruling in early April that gave the drug agency 30 days to make the pill available for all ages without a prescription."
        },
        {
            "id": 3,
            "text": "In a scathing opinion handed down three weeks ago, Judge Edward R. Korman in the Eastern District of New York said the Obama administration had put politics before science in restricting access to the drug."
        },
        {
            "id": 4,
            "text": "The F.D.A. and the White House said Tuesday that the Department of Justice was still deciding whether to appeal the ruling, something it can do independently of the drug agency’s decision on Tuesday."
        },
        {
            "id": 5,
            "text": "That decision, which takes effect immediately, represents a compromise on the politically charged issue of access to emergency contraception, which has pitted conservative and anti-abortion groups against advocates for women’s health and reproductive rights."
        },
        {
            "id": 6,
            "text": "The Justice Department is most likely weighing not only the substance of the judge’s ruling, but also the precedent the ruling would set in countermanding an order by a White House cabinet member, Kathleen Sebelius, the secretary of health and human services."
        },
        {
            "id": 7,
            "text": "In 2011, she decided the pill would be available without prescription only to those 17 and older, despite the F.D.A.’s finding that it was safe and effective and should be available without any age restrictions."
        },
        {
            "id": 8,
            "text": "She said the pill had not been studied for safety in girls as young as 11."
        },
        {
            "id": 9,
            "text": "It was the first time the F.D.A. had been publicly overruled by a cabinet secretary."
        },
        {
            "id": 10,
            "text": "After her order, the pill’s manufacturer submitted an amended application seeking access for 15-year-olds."
        },
        {
            "id": 11,
            "text": "On Tuesday, a Health and Human Services Department official said that Ms. Sebelius was comfortable with the F.D.A.’s decision to approve that application."
        },
        {
            "id": 12,
            "text": "Besides lowering the age restriction, the new rule addresses concerns of women who were unable to get the pill if their drugstore’s pharmacy counter happened to be closed."
        },
        {
            "id": 13,
            "text": "Now, Plan B One-Step will be available in drugstore aisles where family planning or women’s health products are displayed."
        },
        {
            "id": 14,
            "text": "The packaging will include a product code that, when scanned by a cashier, will indicate that the customer’s proof of age is required."
        },
        {
            "id": 15,
            "text": "To try to prevent theft, the manufacturer, Teva Pharmaceuticals, has arranged for each box to have a security tag, the drug agency said."
        },
        {
            "id": 16,
            "text": "Margaret A. Hamburg, the F.D.A. commissioner, said in a statement that data proved that 15-year-olds “were able to understand how Plan B One-Step works, how to use it properly, and that it does not prevent the transmission of a sexually transmitted disease.”"
        },
        {
            "id": 17,
            "text": "The agency’s decision applies only to Plan B One-Step, which is a one-pill dose, not to the two-pill generic versions, because there is not enough data to show the two-dose versions can be used responsibly by younger teenagers without the intervention of a health provider, said an F.D.A. spokeswoman, Erica Jefferson."
        },
        {
            "id": 18,
            "text": "Marty Berndt, a vice president and general manager for Teva, called the agency’s decision “a significant milestone for women.”"
        },
        {
            "id": 19,
            "text": "But it did not completely satisfy either side of the emergency contraception debate."
        },
        {
            "id": 20,
            "text": "Anna Higgins, the director of the Center for Human Dignity at the Family Research Council, accused the administration of trying to “placate both sides,” adding that “allowing this to young teens will be something that we will remain very concerned about.”"
        },
        {
            "id": 21,
            "text": "Cecile Richards, president of Planned Parenthood, called the decision “an important step forward” because it “will eliminate some of the biggest barriers and hurdles that women face in getting emergency contraception.”"
        },
        {
            "id": 22,
            "text": "But Nancy Northup, president of the Center for Reproductive Rights, which filed the lawsuit that Judge Korman ruled on, said the decision on Tuesday was unsatisfactory."
        },
        {
            "id": 23,
            "text": "“We will continue our battle in court to remove these arbitrary restrictions on emergency contraception for all women,” she said."
        }
    ]
}