{
    "title": "Why punishing Democrats for their gun-control sit-in is dicey territory for Paul Ryan",
    "text": [
        {
            "id": 0,
            "text": "For now, it seems, the one lasting impact of House Democrats' 26-hour sit-in on gun control this summer is Republicans' desire to punish them for it."
        },
        {
            "id": 1,
            "text": "House Speaker Paul D. Ryan"
        },
        {
            "id": 2,
            "text": "(R-Wis.) has every incentive to make sure the minority party doesn't ever again seize the floor."
        },
        {
            "id": 3,
            "text": "There's no such thing as a filibuster in the House of Representatives; what happens on the House floor is supposed to be unilaterally within his team's control, and for 26 hours in June, it wasn't."
        },
        {
            "id": 4,
            "text": "7 big moments from House Democrats' overnight sit-in"
        },
        {
            "id": 5,
            "text": "But any punitive measures Ryan takes could play into Democrats' hands."
        },
        {
            "id": 6,
            "text": "Democrats have struggled to turn their sit-in into any meaningful action."
        },
        {
            "id": 7,
            "text": "No post-Orlando gun control legislation passed Congress this year."
        },
        {
            "id": 8,
            "text": "Democrats didn't win big at the ballot box, either: They only gained six seats in the House despite expectations of up to 20 pickups, and Republicans kept their majorities in Congress and historically large majorities in state governments, too."
        },
        {
            "id": 9,
            "text": "Despite historic efforts by Democrats, gun control has largely faded from the national conversation."
        },
        {
            "id": 10,
            "text": "Until now."
        },
        {
            "id": 11,
            "text": "Democrats are practically begging Ryan to do something."
        },
        {
            "id": 12,
            "text": "No punishment had been doled out Tuesday, and already some Democrats were acting as if they had been punished."
        },
        {
            "id": 13,
            "text": "No surprise, then, that Ryan has decided to go a more roundabout way that doesn't directly lay the blame on any lawmaker."
        },
        {
            "id": 14,
            "text": "We learned Tuesday that one of the first things on his to-do list in January is to pass a rule authorizing the House's top cop to levy a fine, up to $2,500, on any lawmaker who shoots video or takes photos on the House floor."
        },
        {
            "id": 15,
            "text": "This rule would apply to future breaches of action and enforce already existing rules about having phones on the House floor (you're not supposed to)."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "\"These changes will help ensure that order and decorum are preserved in the House of Representatives so lawmakers can do the people’s work,\" said his spokesperson, AshLee Strong."
        },
        {
            "id": 18,
            "text": "But here, too, Ryan finds himself potentially backing into a corner: Democrats could actually claim this more mundane procedural move is unconstitutional."
        },
        {
            "id": 19,
            "text": "House Minority Leader Nancy Pelosi's (D-Calif.) office told Politico's Rachael Bade they are looking into whether such a rule passes muster under the Constitution."
        },
        {
            "id": 20,
            "text": "Bade spoke with several constitutional experts who said that giving a House officer the power to punish lawmakers could be cause for concern."
        },
        {
            "id": 21,
            "text": "(A long-accepted interpretation of the Constitution is that only the full House, via a vote, has the authority to punish a lawmaker.)"
        },
        {
            "id": 22,
            "text": "Ryan isn't singling out any one lawmaker for martyrdom, but the tweets and releases from Democrats and gun control advocates write themselves: “Republicans are trying to unconstitutionally punish us for their efforts to keep guns out of the hands of criminals!”"
        },
        {
            "id": 23,
            "text": "We should reiterate that you're already not supposed to take pictures or shoot video on the House floor."
        },
        {
            "id": 24,
            "text": "In fact, you're not even supposed to have your phone out on the House floor (though lawmakers frequently break that rule on an average day)."
        },
        {
            "id": 25,
            "text": "Live streaming became House Democrats' only option to broadcast their sit-in, since the C-SPAN cameras cut off shortly after their protest began."
        },
        {
            "id": 26,
            "text": "(And no, Republicans didn't directly cut the cord; the cameras are turned off as a matter of procedure when the House isn't in session, and Democrats essentially forced the House out of session by seizing the floor.)"
        },
        {
            "id": 27,
            "text": "The decision ended up being a great PR move for House Democrats."
        },
        {
            "id": 28,
            "text": "The shaky, grainy Periscope feed coming from lawmakers' phones only heightened national interest in the sit-in."
        },
        {
            "id": 29,
            "text": "As the sit-in headed into prime-time TV hours, the live stream was airing on nearly every major cable news channel."
        },
        {
            "id": 30,
            "text": "Ryan tried and failed several times to shut it down, with thousands on the Internet watching."
        },
        {
            "id": 31,
            "text": "More than six months later, that chaotic moment feels like a distant memory."
        },
        {
            "id": 32,
            "text": "(Exit polling on how gun control factored into Americans' vote is scant, but it's notable the highest-ranking pro-gun-control candidate, Hillary Clinton, didn't win.)"
        },
        {
            "id": 33,
            "text": "Except here we are talking about it again."
        },
        {
            "id": 34,
            "text": "Ryan has every reason to want to punish lawmakers who seized the floor."
        },
        {
            "id": 35,
            "text": "But in trying to put an end to what happened, Ryan also risks reviving it again."
        }
    ]
}