{
    "title": "Why the Border Crisis Is a Myth",
    "text": [
        {
            "id": 0,
            "text": "EL PASO — TO hear the national news media tell the story, you would think my city, El Paso, and others along the Texas-Mexico border were being overrun by children — tens of thousands of them, some with their mothers, arriving from Central America in recent months, exploiting an immigration loophole to avoid deportation and putting a fatal strain on border state resources."
        },
        {
            "id": 1,
            "text": "There’s no denying the impact of this latest immigration wave or the need for more resources."
        },
        {
            "id": 2,
            "text": "But there’s no crisis."
        },
        {
            "id": 3,
            "text": "Local communities like mine have done an amazing job of assisting these migrants."
        },
        {
            "id": 4,
            "text": "Rather, the myth of a “crisis” is being used by politicians to justify ever-tighter restrictions on immigration, play to anti-immigrant voters in the fall elections and ignore the reasons so many children are coming here in the first place."
        },
        {
            "id": 5,
            "text": "In the last month, about 2,500 refugees have been brought to El Paso after crossing the border elsewhere."
        },
        {
            "id": 6,
            "text": "The community quickly came together to support the women and children and Annunciation House, the organization coordinating the effort."
        },
        {
            "id": 7,
            "text": "Contrary to the heated pronouncements, this is nothing we haven’t seen before."
        },
        {
            "id": 8,
            "text": "Groups of refugees arrive by plane and are processed by Immigration and Customs Enforcement."
        },
        {
            "id": 9,
            "text": "When they are released, Annunciation House takes them to a shelter where they get a shower, a place to sleep, meals and even health care — all provided by volunteers and private donations."
        },
        {
            "id": 10,
            "text": "The families of the refugees also help, often paying for travel costs and taking them into their homes."
        },
        {
            "id": 11,
            "text": "The refugees then move on, to Florida, Georgia, New York or elsewhere."
        },
        {
            "id": 12,
            "text": "While the numbers of refugees arriving in El Paso are a fraction of the number arriving in McAllen, in southern Texas, the chain of events is generally the same."
        },
        {
            "id": 13,
            "text": "Like El Paso, South Texas is not the permanent destination for these refugees."
        },
        {
            "id": 14,
            "text": "And the response from McAllen’s citizens has been generous, too."
        },
        {
            "id": 15,
            "text": "The same can’t be said of our politicians."
        },
        {
            "id": 16,
            "text": "What we are hearing from Austin and Washington is an almost Pavlovian response to immigration concerns."
        },
        {
            "id": 17,
            "text": "My governor, Rick Perry, a Republican, announced this week that he was sending 1,000 National Guard soldiers, at a cost of $12 million a month, to bolster the border."
        },
        {
            "id": 18,
            "text": "And despite President Obama’s efforts to work with Central American leaders to address the root causes of the migration, his recently announced request for $3.7 billion, supposedly to deal with these new migrants, contains yet more border security measures: Almost $40 million would go to drone surveillance, and nearly 30 percent of it is for transportation and detention."
        },
        {
            "id": 19,
            "text": "In Texas, state legislators and the Department of Public Safety are planning to spend an additional $30 million over six months to create a “surge” of state law enforcement resources, an expenditure that some in our state’s Capitol would like to see made permanent."
        },
        {
            "id": 20,
            "text": "The costs are significant."
        },
        {
            "id": 21,
            "text": "Every day we detain an undocumented child immigrant, it costs Immigration and Customs Enforcement — i.e., the taxpayer — $259 per person, significantly more than we spend to educate a child in a middle-class school district."
        },
        {
            "id": 22,
            "text": "The irony is that this cash-intensive strategy comes from leaders who consistently underfund health care, transportation and education."
        },
        {
            "id": 23,
            "text": "And they ignore the crucial fact that children crossing our borders aren’t trying to sneak around law enforcement: They are running to law enforcement."
        },
        {
            "id": 24,
            "text": "What is most alarming, however, is the attempt to erode rights and protections created by intelligent, humane legislation."
        },
        {
            "id": 25,
            "text": "The debate is centered on the Trafficking Victims Protection Reauthorization Act, a law signed by President George W. Bush to provide legal and humanitarian protections to unaccompanied migrant children from countries other than Mexico or Canada."
        },
        {
            "id": 26,
            "text": "The act passed with bipartisan support, yet the “crisis” is now being cited by some of the same legislators who supported the law as a reason to repeal or change it."
        },
        {
            "id": 27,
            "text": "This effort to take away rights that were granted when there was significantly less anti-immigrant fervor isn’t just shortsighted and expensive, it’s un-American."
        },
        {
            "id": 28,
            "text": "We can debate the wisdom of providing greater protection to Central American children than to Mexican children, but there can be no doubt that giving safe haven to a child facing violence in a country that cannot protect its most vulnerable citizens is what a civilized country, with the resources we possess, should do."
        },
        {
            "id": 29,
            "text": "Our border communities understand this."
        },
        {
            "id": 30,
            "text": "I hope the rest of the country, including our leaders in Austin and Washington, can follow our lead."
        }
    ]
}