{
    "title": "Trump finds fault with latest spending bill: Where's the border wall funding?",
    "text": [
        {
            "id": 0,
            "text": "President Trump called the latest spending bill “ridiculous” while complaining about border wall funding Thursday morning and demanded Republicans “finally get tough.”"
        },
        {
            "id": 1,
            "text": "Mr. Trump demanded to know why border wall and security funds were left out of the newest bill, and how Congress planned on paying for it after the midterms."
        },
        {
            "id": 2,
            "text": "He also accused Democrats of “obstructing law enforcement and border security.”"
        },
        {
            "id": 3,
            "text": "I want to know, where is the money for Border Security and the WALL in this ridiculous Spending Bill, and where will it come from after the Midterms?"
        },
        {
            "id": 4,
            "text": "Dems are obstructing Law Enforcement and Border Security."
        },
        {
            "id": 5,
            "text": "REPUBLICANS MUST FINALLY GET TOUGH!"
        },
        {
            "id": 6,
            "text": "— Donald J. Trump (@realDonaldTrump) September 20, 2018"
        },
        {
            "id": 7,
            "text": "On Wednesday, the Senate passed a $850 billion spending package."
        },
        {
            "id": 8,
            "text": "A majority of the money — $647 billion — went to the Pentagon, which would include funds for a pay raise for troops."
        },
        {
            "id": 9,
            "text": "Three other federal departments were funded by the bill."
        },
        {
            "id": 10,
            "text": "The Department of Health and Human Services received $90 billion of funding, the Education Department was given approximately $71 billion, and the Department of Labor got around $12 billion."
        },
        {
            "id": 11,
            "text": "Congress funded Mr. Trump’s border wall and security measures with their July bill, including $5 billion in funding from the House."
        },
        {
            "id": 12,
            "text": "At the beginning of September, Mr. Trump once again floated threats of shutting down the government if Democrats worked to prevent Congress from spending more on border security."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        }
    ]
}