{
    "title": "Fury as Trump compares impeachment inquiry to 'lynching'",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump referred to impeachment proceedings against him as a “lynching” in a Tuesday morning tweet, sparking condemnation for using such a racially charged word to describe his political predicament."
        },
        {
            "id": 1,
            "text": "“So some day,” the president wrote, “if a Democrat becomes president and the Republicans win the House, even by a tiny margin, they can impeach the president, without due process or fairness or any legal rights."
        },
        {
            "id": 2,
            "text": "All Republicans must remember what they are witnessing here – a lynching."
        },
        {
            "id": 3,
            "text": "But we will WIN!”"
        },
        {
            "id": 4,
            "text": "The tweet fit with Trump’s history of racist remarks and his strategic use of cruelty, and some saw in it a political strategy."
        },
        {
            "id": 5,
            "text": "The tweet drew a chorus of outrage."
        },
        {
            "id": 6,
            "text": "“That is one word that no president ought to apply to himself,” the South Carolina representative James Clyburn, the House majority whip, said on CNN."
        },
        {
            "id": 7,
            "text": "“I’m not just a politician … I’m a product of the south."
        },
        {
            "id": 8,
            "text": "I know the history of that word.”"
        },
        {
            "id": 9,
            "text": "The California representative Karen Bass, chairwoman of the Congressional Black Caucus, told CNN Trump’s “lynching” tweet was consistent with his pattern of throwing out “racial bombs” to give “red meat” to his base when his back is against the wall."
        },
        {
            "id": 10,
            "text": "Lynching is a reprehensible stain on this nation's history, as is this President."
        },
        {
            "id": 11,
            "text": "We'll never erase the pain and trauma of lynching, and to invoke that torture to whitewash your own corruption is disgraceful."
        },
        {
            "id": 12,
            "text": "“You think this impeachment is a LYNCHING?”"
        },
        {
            "id": 13,
            "text": "tweeted the Illinois representative Bobby Rush."
        },
        {
            "id": 14,
            "text": "“What the hell is wrong with you?"
        },
        {
            "id": 15,
            "text": "Do you know how many people who look like me have been lynched, since the inception of this country, by people who look like you."
        },
        {
            "id": 16,
            "text": "Delete this tweet.”"
        },
        {
            "id": 17,
            "text": "“Lynching is a reprehensible stain on this nation’s history, as is this president,” wrote presidential candidate and California senator Kamala Harris."
        },
        {
            "id": 18,
            "text": "“We’ll never erase the pain and trauma of lynching, and to invoke that torture to whitewash your own corruption is disgraceful.”"
        },
        {
            "id": 19,
            "text": "The New Jersey senator and 2020 hopeful Cory Booker tweeted: “Lynching is an act of terror used to uphold white supremacy. Try again.”"
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "Even Senate majority leader Mitch McConnell, a stalwart Trump ally, said the president had spoken poorly."
        },
        {
            "id": 22,
            "text": "“Given the history in our country I would not compare this to a lynching,” McConnell told reporters on Capitol Hill."
        },
        {
            "id": 23,
            "text": "“That was an unfortunate choice of words.”"
        },
        {
            "id": 24,
            "text": "Some elected officials defended Trump."
        },
        {
            "id": 25,
            "text": "Senator Tim Scott, the sole African American Republican in Congress apart from one retiring representative, is from South Carolina."
        },
        {
            "id": 26,
            "text": "According to a report by the Equal Justice Initiative, between 1877 and 1950, 184 African Americans were lynched there."
        },
        {
            "id": 27,
            "text": "“There’s no question that the impeachment process is the closest thing to a political death row trial, so I get his absolute rejection of the process,” Scott said."
        },
        {
            "id": 28,
            "text": "“I wouldn’t use the word lynching.”"
        },
        {
            "id": 29,
            "text": "The White House claimed Trump had used the word innocently."
        },
        {
            "id": 30,
            "text": "“The president has used many words, all types of language, to talk about the way the media has treated him,” said deputy press secretary Hogan Gidley."
        },
        {
            "id": 31,
            "text": "“The president wasn’t trying to compare himself to the horrific history in this country at all.”"
        },
        {
            "id": 32,
            "text": "But others saw a clear and familiar political play."
        },
        {
            "id": 33,
            "text": "“When the polls get tough, Potus turns to race,” tweeted Julian Zelizer, a historian at Princeton University."
        },
        {
            "id": 34,
            "text": "“Lynching?!”"
        },
        {
            "id": 35,
            "text": "tweeted the New York Time columnist Charles Blow."
        },
        {
            "id": 36,
            "text": "“Sir, don’t you DARE invoke the darkness of America’s viciousness toward black people to defend your corruption.How dare you?!…”"
        },
        {
            "id": 37,
            "text": ""
        },
        {
            "id": 38,
            "text": ""
        },
        {
            "id": 39,
            "text": "This is a lynching in every sense Lindsey Graham"
        },
        {
            "id": 40,
            "text": "According to the National Association for the Advancement of Colored People (NAACP), from 1882 to 1968, “4,743 lynchings” – that is, extrajudicial murders – “occurred in the United States."
        },
        {
            "id": 41,
            "text": "Of these people that were lynched 3,446 were black.”"
        },
        {
            "id": 42,
            "text": "“These numbers seem large, but it is known that not all of the lynchings were ever recorded.”"
        },
        {
            "id": 43,
            "text": "“I’ve studied lynching for decades,” wrote Sherrilyn Ifill, president of the NAACP legal defense and educational fund."
        },
        {
            "id": 44,
            "text": "“Read hundreds of lynching accounts."
        },
        {
            "id": 45,
            "text": "Viewed almost scores of photographs."
        },
        {
            "id": 46,
            "text": "Wrote a book about lynching."
        },
        {
            "id": 47,
            "text": "Mr Trump’s actions & words are consistent w/those who incited lynching, not its victims."
        },
        {
            "id": 48,
            "text": "And that fact makes this tweet particularly grotesque.”"
        },
        {
            "id": 49,
            "text": "Carol Anderson, a professor of African American studies at Emory University, confronted Trump with a tweet evoking the horrifying torture enacted on lynching victims."
        },
        {
            "id": 50,
            "text": "“You weren’t castrated & forced to eat your genitalia like Claude Neal,” Anderson wrote."
        },
        {
            "id": 51,
            "text": "“You weren’t dragged behind a car, doused w/gasoline & set on fire like Cleo Wright. You weren’t blow torched until your eyes popped out of your head like John Jones. That’s lynching...”"
        },
        {
            "id": 52,
            "text": ""
        },
        {
            "id": 53,
            "text": "America’s first lynching memorial and museum was opened in Montgomery, Alabama, last year."
        },
        {
            "id": 54,
            "text": ""
        },
        {
            "id": 55,
            "text": "The impeachment inquiry being run by Democrats who control the House centres on Trump’s attempts to get Ukraine to investigate his political rivals."
        },
        {
            "id": 56,
            "text": "Article I of the US constitution grants the House “the sole power of impeachment” and Article II states that the president “shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors”."
        },
        {
            "id": 57,
            "text": "Lindsey Graham, the other South Carolina senator, said the process of impeachment against Trump “is a lynching in every sense”."
        },
        {
            "id": 58,
            "text": "Steve Vladeck, a law professor at the University of Texas, answered with “a non-exhaustive list of key senses in which impeachment is not a lynching”."
        },
        {
            "id": 59,
            "text": "“1) It is not racially motivated."
        },
        {
            "id": 60,
            "text": "2) It is a legal process expressly set forth in the text of the constitution."
        },
        {
            "id": 61,
            "text": ""
        },
        {
            "id": 62,
            "text": "3) It doesn’t result in death of person being lynched.”"
        },
        {
            "id": 63,
            "text": ""
        }
    ]
}