{
    "title": "John Boehner Faces Conservative Fury For Booting Members From Key Committees",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON --"
        },
        {
            "id": 1,
            "text": "Conservative groups are furious with GOP leadership for stripping several lawmakers of spots on powerful committees after it was deemed that they were not toeing the party line."
        },
        {
            "id": 2,
            "text": "On Monday, the Republican Steering Committee, which is chaired by House Speaker John Boehner (R-Ohio), voted to remove Reps. Justin Amash (R-Mich.) and Tim Huelskamp (R-Kansas) from the House Budget Commtitee."
        },
        {
            "id": 3,
            "text": "Reps. David Schweikert (R-Ariz.) and Walter Jones (R-N.C.) lost their positions on the Financial Services Committee."
        },
        {
            "id": 4,
            "text": "The four members are known for occasionally bucking leadership and voting against Boehner's wishes."
        },
        {
            "id": 5,
            "text": "Amash, Huelskamp and Schweikert are popular with the conservative movement, while Jones has made a name for himself by speaking out against U.S. involvement in Afghanistan."
        },
        {
            "id": 6,
            "text": "Huelskamp and Amash were also the only GOP votes against Rep. Paul Ryan's (R-Wis.) budget plan this year, arguing that it didn't cut spending enough."
        },
        {
            "id": 7,
            "text": "The Steering Committee recently recommended that Ryan stay on as Budget Committee chairman."
        },
        {
            "id": 8,
            "text": "When asked for comment on the changes, Boehner spokesman Michael Steel replied, \"The Steering Committee makes decisions based on a range of factors.\""
        },
        {
            "id": 9,
            "text": "Reuters notes that removing Amash and Huelskamp from the Budget Committee \"could make it easier for the panel to advance a deal with Democrats to cut fiscal deficits\" -- which is exactly what many conservative groups are afraid of."
        },
        {
            "id": 10,
            "text": "In an email blast on Tuesday, the Tea Party group FreedomWorks told its members to call Boehner's office and tell him to \"stop purging fiscal conservatives,\" highlighting the ouster of Amash, Huelskamp and Schweikert."
        },
        {
            "id": 11,
            "text": "Conservative activist Brent Bozell warned Republican lawmakers not to accept any deal on the so-called fiscal cliff, saying in a statement, \"It would be impossible to count the times and ways Boehner, [Rep. Eric] Cantor, [Rep. Kevin] McCarthy and so many others have told America that tax hikes would kill jobs and cripple the economy."
        },
        {
            "id": 12,
            "text": "Lo and behold, that’s just what they've proposed, $800 billion of them.\""
        },
        {
            "id": 13,
            "text": "Bozell was referring to the GOP leadership's fiscal cliff offer that would raise $800 billion in tax revenue to help close the deficit without raising rates."
        },
        {
            "id": 14,
            "text": "The Club for Growth called the lawmakers' reassignments \"a consequence of their principled stands on behalf of pro-growth policies, often bringing them in conflict with the leadership of their own party.\""
        },
        {
            "id": 15,
            "text": "The members who lost their committee spots loudly voiced their displeasure."
        },
        {
            "id": 16,
            "text": "Huelskamp unloaded on GOP leadership Tuesday at a Heritage Foundation event in Washington, saying, \"We were not notified about what might occur but it confirms in my mind the deepest suspicions that most Americans have about Washington D.C: it’s petty, it’s vindictive, and if you have conservative principles you will be punished.”"
        },
        {
            "id": 17,
            "text": "Amash told reporters that he never received any sort of notification from the GOP leadership about his removal from the Budget Committee."
        },
        {
            "id": 18,
            "text": "\"It's a slap in the face to all young people who are thinking about being Republicans, want to be a part of this party, and are being told, 'Well, if you disagree with leadership just a couple times we’re going to send you home … you don’t get to participate,'\" he said."
        },
        {
            "id": 19,
            "text": "Schweikert spokeswoman Rachel Semmel said the congressman is \"going to continue to fight for the same principles he's fought for on the committee.\""
        },
        {
            "id": 20,
            "text": "Jones told reporters he was disappointed and \"somewhat\" surprised -- but not angry -- that he had lost his spot on the Financial Services Committee, chalking it up to the times he's voted against Boehner."
        },
        {
            "id": 21,
            "text": "According to a Washington Post database, Jones has gone against his party 31 percent of the time."
        },
        {
            "id": 22,
            "text": "\"When you have these kind of purges, even though this is a small number, it's the wrong way to go when you're trying to build support,\" he said, adding, \"I'm not going to sacrifice my integrity for anyone or any party."
        },
        {
            "id": 23,
            "text": "My integrity is what will get me into heaven.\""
        },
        {
            "id": 24,
            "text": "Jones said he hasn't yet spoken to Boehner."
        },
        {
            "id": 25,
            "text": "In fact, he only found out he lost his spot on the committee when his staff read about it on the Internet."
        }
    ]
}