{
    "title": "Why Mitch McConnell relented on his demands about preserving the filibuster",
    "text": [
        {
            "id": 0,
            "text": "Senate Minority Leader Mitch McConnell is no longer holding up the Senate organizing resolution — after two Democrats confirmed that they won’t be blowing up the legislative filibuster any time soon."
        },
        {
            "id": 1,
            "text": "In the past few weeks, Senate Majority Leader Chuck Schumer and McConnell have been working to negotiate the organizing resolution — which governs committee membership and funding allocation — in the 50-50 Senate."
        },
        {
            "id": 2,
            "text": "The leaders had previously been at an impasse because McConnell had demanded that Democrats commit to keeping the legislative filibuster intact as part of the resolution — something Schumer was unwilling to do, since it would reduce the party’s leverage in negotiations over future legislation."
        },
        {
            "id": 3,
            "text": "Since the organizing resolution could be filibustered — and would need 60 votes to pass — McConnell’s opposition effectively allowed him to block the measure from advancing."
        },
        {
            "id": 4,
            "text": "And while he didn’t get the changes to the organizing resolution he wanted, McConnell’s approach still worked, in a way: Amid the impasse over the agreement, two Senate Democrats — Joe Manchin (D-WV) and Kyrsten Sinema (D-AZ) — publicly restated that they would not vote to eliminate the filibuster."
        },
        {
            "id": 5,
            "text": "Without their backing, Democrats simply won’t have the numbers to do a rules change: All 50 members of the caucus would need to get behind a change to the filibuster for it to happen."
        },
        {
            "id": 6,
            "text": "(This position is consistent with stances both lawmakers have vocalized before.)"
        },
        {
            "id": 7,
            "text": "Due to Sinema and Manchin’s statements, McConnell now says he’s satisfied and willing to move forward with the organizing measure, after causing some annoying delays."
        },
        {
            "id": 8,
            "text": "Without this resolution, Democrats have been unable to formally take over committee chair positions, and new members have yet to be seated in committees."
        },
        {
            "id": 9,
            "text": "Republicans also retained the ability to oversee consideration of nominees and other policy priorities."
        },
        {
            "id": 10,
            "text": "“Today two Democratic Senators publicly confirmed they will not vote to end the legislative filibuster,” McConnell said in a statement Monday night."
        },
        {
            "id": 11,
            "text": "“With these assurances, I look forward to moving ahead with a power-sharing agreement modeled on that precedent.”"
        },
        {
            "id": 12,
            "text": "McConnell’s statement came as pressure from Democrats was growing for him to relent — and as his refusal to compromise was beginning to threaten Senate business."
        },
        {
            "id": 13,
            "text": "“We’re glad Senator McConnell threw in the towel and gave up on his ridiculous demand."
        },
        {
            "id": 14,
            "text": "We look forward to organizing the Senate under Democratic control and start getting big, bold things done for the American people,” said Justin Goodman, a Schumer spokesperson."
        },
        {
            "id": 15,
            "text": "McConnell secured a commitment from some Democrats, though that could still change\n\nWhile McConnell is not getting the pledge he wanted from Schumer about preserving the legislative filibuster, he effectively got one from Manchin and Sinema — whose votes would be vital to approve a rules change."
        },
        {
            "id": 16,
            "text": "Both lawmakers have issued strong statements expressing their opposition to blowing up the legislative filibuster, which requires most bills to meet a 60-vote threshold to pass."
        },
        {
            "id": 17,
            "text": "“She is not open to changing her mind about eliminating the filibuster,” a Sinema spokesperson told the Washington Post on Monday."
        },
        {
            "id": 18,
            "text": "Manchin echoed this stance in an interview with Politico: “If I haven’t said it very plain, maybe Sen. McConnell hasn’t understood, I want to basically say it for you."
        },
        {
            "id": 19,
            "text": "That I will not vote in this Congress, that’s two years, right?”"
        },
        {
            "id": 20,
            "text": "Armed with these assurances, McConnell signaled that he’d be comfortable advancing the organizing resolution, since his focus had been keeping the filibuster around to preserve the minority’s ability to block legislation that it disagrees with."
        },
        {
            "id": 21,
            "text": "Lawmakers’ positions on the filibuster could, of course, still change, despite the statements they’ve issued."
        },
        {
            "id": 22,
            "text": "Ultimately, keeping the filibuster is likely to make passing any sweeping legislation difficult, since Democrats would need every member of their caucus plus 10 Republicans to do so."
        },
        {
            "id": 23,
            "text": "For this reason, many of the more progressive members of the caucus, like Sens. Elizabeth Warren (D-MA) and Ed Markey (D-MA), have called for the filibuster to be abolished."
        },
        {
            "id": 24,
            "text": "And some other Democrats, including those who have been hesitant to change the rules, have acknowledged this difficulty as well."
        },
        {
            "id": 25,
            "text": "A statement that Sen. Jon Tester (D-MT) gave to the New York Times sums up how some Democrats currently unwilling to end the filibuster are thinking about the issue."
        },
        {
            "id": 26,
            "text": "They may be in favor of keeping it now, but are open to considering more drastic action if McConnell maintains obstruction to Biden’s agenda."
        },
        {
            "id": 27,
            "text": "“If all that happens is filibuster after filibuster, roadblock after roadblock, then my opinion may change,” said Tester, who is currently in favor of keeping the filibuster."
        },
        {
            "id": 28,
            "text": "Manchin and Sinema have said they don’t expect their positions to shift."
        },
        {
            "id": 29,
            "text": "Whether they maintain this stance in the face of ongoing Republican opposition, however, remains to be seen."
        }
    ]
}