{
    "title": "William Barr appoints U.S. attorney to investigate Russia probe origins",
    "text": [
        {
            "id": 0,
            "text": "Attorney General William P. Barr has tapped the U.S. attorney in Connecticut to examine the origins of the Russian election-interference probe, according to reports late Monday."
        },
        {
            "id": 1,
            "text": "John H. Durham, the top federal prosecutor in Connecticut, has been asked to get the bottom of the Justice Department’s investigation into members of the Trump presidential campaign."
        },
        {
            "id": 2,
            "text": "Mr. Durham’s probe will focus on whether the Justice Department lawfully collected intelligence on Trump campaign associates, according to both The New York Times and Associated Press, each citing sources familiar with the matter."
        },
        {
            "id": 3,
            "text": "It is not clear what investigative powers Mr. Durham will have or whether Mr. Barr will authorize a team or budget."
        },
        {
            "id": 4,
            "text": "Special counsel Robert Mueller had a squad of roughly 20 people to conduct his investigation."
        },
        {
            "id": 5,
            "text": "Justice Department spokeswoman Kerri Kupec did not immediately return a request for comment."
        },
        {
            "id": 6,
            "text": "Thomas Carson, a spokesman for Mr. Durham, declined to comment."
        },
        {
            "id": 7,
            "text": "President Trump has long demanded the Justice Department look into whether the FBI spied on his campaign at the behest of the Obama administration."
        },
        {
            "id": 8,
            "text": "His calls have increased since Mr. Mueller concluded there was no evidence that the president or members of his campaign colluded with Russia."
        },
        {
            "id": 9,
            "text": "Mr. Durham’s probe is the third known investigation into FBI and Justice Department decisions surrounding the 2016 election."
        },
        {
            "id": 10,
            "text": "Justice Department Inspector General Michael Horowitz is evaluating the Justice Department’s wiretaps on former campaign associate Carter Page."
        },
        {
            "id": 11,
            "text": "And John Huber, the U.S. attorney in Utah, is also reviewing a surveillance warrant obtained by the FBI to spy on Mr. Page."
        },
        {
            "id": 12,
            "text": "Mr. Horowitz’s findings are expected to be released this month or next while the progress of Mr. Huber’s probe has remained shrouded in mystery."
        },
        {
            "id": 13,
            "text": "In addition, Senate Judiciary Chairman Lindsey Graham, South Carolina Republican, has also pledged an aggressive committee investigation into the FBI and Justice Department’s actions in 2016."
        },
        {
            "id": 14,
            "text": "He said the probe will target how the department was “so in the tank for [Hillary] Clinton and hated Trump’s guts.”"
        },
        {
            "id": 15,
            "text": "The Durham probe is not a surprise as Mr. Barr signaled earlier this month that he had “people in the department” helping him examine intelligence actions related to the Trump campaign."
        },
        {
            "id": 16,
            "text": "Mr. Barr’s disclosure came during a Senate Judiciary Committee hearing."
        },
        {
            "id": 17,
            "text": "He said it “was a little early” to update Congress on his findings, but he envisioned “some kind of reporting at the end of this.”"
        },
        {
            "id": 18,
            "text": "He has also been steadfast in his claim that the FBI spied on Trump campaign associates, but wasn’t sure whether it was legal or justified."
        },
        {
            "id": 19,
            "text": "“I think spying did occur,” he said."
        },
        {
            "id": 20,
            "text": "“The question is whether it was adequately predicated."
        },
        {
            "id": 21,
            "text": "And I’m not suggesting it wasn’t adequately predicated."
        },
        {
            "id": 22,
            "text": "But I need to explore that.”"
        },
        {
            "id": 23,
            "text": "Last week, FBI Director Christopher A. Wray broke from Mr. Barr’s use of the word “spying” to describe the bureau’s activities related to the Trump campaign."
        },
        {
            "id": 24,
            "text": "“Well, it’s not the term I would use,” he said during a hearing before the House Appropriations Committee."
        },
        {
            "id": 25,
            "text": "“Lots of people have different colloquial phrases."
        },
        {
            "id": 26,
            "text": "I believe the FBI is engaged in investigative activity and part of investigative activity includes surveillance.”"
        },
        {
            "id": 27,
            "text": "Mr. Durham, who was sworn in as U.S. attorney on Feb. 22, has worked at the Justice Department since 1982 and has plenty of experience conducting high-level special investigations."
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": "Attorney General Janet Reno in 1999 asked him to investigate whether two FBI informants, James “Whitey” Bulger and Stephen Fleming, had corrupted their handlers at the bureau."
        },
        {
            "id": 30,
            "text": "In 2008, then-Attorney General Michael Mukasey appointed Mr. Durham to investigate the destruction of CIA videotapes showing the torture of terrorism suspects during interrogations."
        },
        {
            "id": 31,
            "text": "The probe closed in November 2010 without any criminal charges being filed."
        },
        {
            "id": 32,
            "text": "The next year, President Barack Obama’s Attorney General Eric H. Holder Jr. assigned him to head a Justice Department investigation into the CIA’s interrogation techniques."
        },
        {
            "id": 33,
            "text": ""
        },
        {
            "id": 34,
            "text": ""
        },
        {
            "id": 35,
            "text": ""
        },
        {
            "id": 36,
            "text": ""
        }
    ]
}