{
    "title": "Speaker Ryan Looking To Punish Lawmakers Who Live-Stream On The House Floor",
    "text": [
        {
            "id": 0,
            "text": "In response to Democrat’s gun control protest in June, Speaker Paul Ryan has introduced a rules package that would fine any lawmaker who live-streams or records video while on the House floor."
        },
        {
            "id": 1,
            "text": "The proposed rule changes include a $500 fine for first time offenses, and $2,500 fines for any subsequent offense."
        },
        {
            "id": 2,
            "text": "The fine would be taken out of lawmakers' paychecks."
        },
        {
            "id": 3,
            "text": "Over the summer, Democratic congressmen staged what Speaker Ryan had referred to as a publicity stunt."
        },
        {
            "id": 4,
            "text": "Liberals took to the House floor to protest a lack of gun reform."
        },
        {
            "id": 5,
            "text": "They wanted more background checks for gun users."
        },
        {
            "id": 6,
            "text": "When the House turned off its cameras during the sit-in, Democrats took to their phones to live-stream the event in order to keep up publicity."
        },
        {
            "id": 7,
            "text": "Ryan noted at the time Democrats were sending fundraising emails during the protest."
        },
        {
            "id": 8,
            "text": "“These changes will help ensure that order and decorum are preserved in the House of Representatives so lawmakers can do the people’s work,” Ryan spokesperson AshLee Strong stated."
        },
        {
            "id": 9,
            "text": "Speaker Ryan and other Republican leaders had been discussing for some time possible punishment for those who took part in the event."
        },
        {
            "id": 10,
            "text": "The package is expected to be voted on January 3."
        },
        {
            "id": 11,
            "text": "If passed, the new rules can also lead to members being referred to the House Ethics Committee to face further reprimand for actions violating House decorum."
        }
    ]
}