{
    "title": "Official Who Heard Trump's Ukraine Call to Testify He Reported His Concerns",
    "text": [
        {
            "id": 0,
            "text": "An Army officer at the National Security Council who twice raised concerns over the Trump administration's push to have Ukraine investigate Democrats and Joe Biden, arrived in military uniform Tuesday on Capitol Hill and is testifying behind closed doors in the impeachment inquiry."
        },
        {
            "id": 1,
            "text": "Alexander Vindman, a lieutenant colonel who served in Iraq and later as a diplomat, was prepared to tell House investigators that he listened to President Donald Trump's July 25 call with new Ukraine President Volodymyr Zelenskiy and reported his concerns to the NSC's lead counsel, according to an advance copy of his testimony."
        },
        {
            "id": 2,
            "text": "His arrival in military blue, with medals, created a striking image as he entered the Capitol and made his way to the secure briefing room."
        },
        {
            "id": 3,
            "text": "\"I was concerned by the call,\" Vindman was saying, according to the testimony obtained Monday night by The Associated Press."
        },
        {
            "id": 4,
            "text": "\"I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications for the U.S. government's support of Ukraine.\""
        },
        {
            "id": 5,
            "text": "Vindman, a 20-year military officer, is the first official who listened in on that phone call to testify as the impeachment inquiry reaches deeper into the Trump administration and Democrats prepare for the next, public phase of the probe."
        },
        {
            "id": 6,
            "text": "He's also the first current White House official to appear before the impeachment panels."
        },
        {
            "id": 7,
            "text": "The inquiry is looking into Trump's call, in which he asked Zelenskiy for a \"favor\" — to investigate Democrats — that Democrats say was a quid pro quo for military aid that could be an impeachable offense."
        },
        {
            "id": 8,
            "text": "Trump took to Twitter Tuesday to denounce the probe as a \"sham,\" adding: \"Why are people that I never even heard of testifying about the call."
        },
        {
            "id": 9,
            "text": "Just READ THE CALL TRANSCRIPT AND THE IMPEACHMENT HOAX IS OVER!\""
        },
        {
            "id": 10,
            "text": "Vindman, who arrived in the United States as a 3-year-old from the former Soviet Union, wrote that it was his \"sacred duty\" to defend the United States."
        },
        {
            "id": 11,
            "text": "Some Trump allies, looking for ways to discredit Vindman, questioning the colonel's loyalties because he was born in the region."
        },
        {
            "id": 12,
            "text": "But the line of attack was rejected by some Republicans, including Rep. Liz Cheney, who said it was \"shameful\" to criticize his patriotism."
        },
        {
            "id": 13,
            "text": "His appearance came a day after Speaker Nancy Pelosi announced the House will vote on a resolution to affirm the impeachment investigation, set rules for public hearings and outline the potential process for writing articles of impeachment against Trump."
        },
        {
            "id": 14,
            "text": "The vote is expected Thursday."
        },
        {
            "id": 15,
            "text": "Vindman was testifying that he first reported his concerns after an earlier meeting July 10 in which U.S. Ambassador to the European Union Gordon Sondland stressed the importance of having Ukraine investigate the 2016 election as well as Burisma, a company linked to the family of Biden, a 2020 Democratic presidential candidate."
        },
        {
            "id": 16,
            "text": "Vindman says he told Sondland that \"his statements were inappropriate, that the request to investigate Biden and his son had nothing to do with national security, and that such investigations were not something the NSC was going to get involved in or push.\""
        },
        {
            "id": 17,
            "text": "That account differs from Sondland's, a wealthy businessman who donated $1 million to Trump inauguration and testified before the impeachment investigators that no one from the NSC \"ever expressed any concerns.\""
        },
        {
            "id": 18,
            "text": "He also testified that he did not realize any connection between Biden and Burisma."
        },
        {
            "id": 19,
            "text": "For the call between Trump and Zelenskiy, Vindman said he listened in the Situation Room with colleagues from the NSC and Vice President Mike Pence's office and was concerned."
        },
        {
            "id": 20,
            "text": "He said he again reported his concerns to the NSC's lead counsel."
        },
        {
            "id": 21,
            "text": "He wrote, \"I realized that if Ukraine pursued an investigation into the Bidens and Burisma, it would likely be interpreted as a partisan play which would undoubtedly result in Ukraine losing the bipartisan support it has thus far maintained."
        },
        {
            "id": 22,
            "text": "This would all undermine U.S. national security.\""
        },
        {
            "id": 23,
            "text": "Vindman served in various military and diplomatic posts before joining the NSC."
        },
        {
            "id": 24,
            "text": "He was the director for European affairs and a Ukraine expert under Fiona Hill, a former official who testified earlier in the impeachment probe."
        },
        {
            "id": 25,
            "text": "Hill worked for former national security adviser John Bolton."
        },
        {
            "id": 26,
            "text": "Vindman will be a key witness."
        },
        {
            "id": 27,
            "text": "He attended Zelenskiy's inauguration with a delegation led by Energy Secretary Rick Perry, and he and Hill were both part of a Ukraine briefing with Sondland that others have testified irritated Bolton at the White House."
        },
        {
            "id": 28,
            "text": "He said he is not the whistleblower, the still unnamed government official who filed the initial complaint over Trump's conversation with the Ukraine president that sparked the House impeachment inquiry."
        },
        {
            "id": 29,
            "text": "He said he does not know who the whistleblower is."
        },
        {
            "id": 30,
            "text": "\"I am a patriot, and it is my sacred duty and honor to advance and defend OUR country, irrespective of party or politics,\" wrote Vindman, who was wounded in Iraq and awarded a Purple Heart."
        },
        {
            "id": 31,
            "text": ""
        },
        {
            "id": 32,
            "text": "\"For over twenty years as an active duty United States military officer and diplomat, I have served this country in a nonpartisan manner, and have done so with the utmost respect and professionalism for both Republican and Democratic administrations,\" he wrote."
        },
        {
            "id": 33,
            "text": "Thursday's expected formal House vote would be the first on the impeachment inquiry and aims to nullify complaints from Trump and his allies that the process is illegitimate and unfair."
        },
        {
            "id": 34,
            "text": "Democrats insist they aren't yielding to Republican pressure."
        },
        {
            "id": 35,
            "text": "Pelosi dismissed the Republican argument that impeachment can't begin without formal approval from the House and brushed off their complaints about the closed-door process."
        },
        {
            "id": 36,
            "text": "\"I do not care."
        },
        {
            "id": 37,
            "text": "I do not care."
        },
        {
            "id": 38,
            "text": "This is a false thing with them,\" Pelosi said."
        },
        {
            "id": 39,
            "text": "\"Understand, it has nothing to do with them."
        },
        {
            "id": 40,
            "text": "It has to do with how we proceed.\""
        },
        {
            "id": 41,
            "text": "Pelosi's announcement Monday came just hours after a former White House national security official defied a House subpoena for closed-door testimony, escalating the standoff between Congress and the White House over who will testify."
        },
        {
            "id": 42,
            "text": "Charles Kupperman, who was a deputy to Bolton, failed to show up for the scheduled deposition after filing a lawsuit asking a federal court in Washington to rule on whether he was legally required to appear."
        }
    ]
}