{
    "title": "FBI’s near-brush with suspect in Florida school shooting draws scrutiny",
    "text": [
        {
            "id": 0,
            "text": "A tipster alerted the FBI in September to a disturbing comment that had been left beneath an online video."
        },
        {
            "id": 1,
            "text": "“Im going to be a professional school shooter,” read the comment, posted by YouTube user “nikolas cruz.”"
        },
        {
            "id": 2,
            "text": "Five months later, police say, Nikolas Cruz, 19, walked into the Florida high school from which he had been expelled and opened fire, killing 17 people in one of the nation’s deadliest school shootings."
        },
        {
            "id": 3,
            "text": "On Thursday, horrific images from the previous day’s attack at Marjory Stoneman Douglas High — students huddled in classrooms and parents tearfully waiting to hear from their children — intensified a now-familiar national debate about gun laws and the safety of young people at school."
        },
        {
            "id": 4,
            "text": "Speaking at the White House, President Trump pledged that his administration would help “tackle the difficult issue of mental health” but made no mention of gun control."
        },
        {
            "id": 5,
            "text": "In court papers, authorities said Cruz admitted to carrying out the Valentine’s Day rampage."
        },
        {
            "id": 6,
            "text": "FBI said it failed to act on a tip warning of the suspected Florida school shooter’s potential for violence"
        },
        {
            "id": 7,
            "text": "And the FBI faced questions about its near-brush months earlier with the alleged gunman after law enforcement officials, speaking on the condition of anonymity to discuss the ongoing probe, said they believe the 19-year-old from Florida was the author of the troubling remark on YouTube."
        },
        {
            "id": 8,
            "text": "“Did they do enough in this case?"
        },
        {
            "id": 9,
            "text": "Quite clearly, if you see what happened yesterday, presumably tied to this killer, the easy answer to that is no,” said Ron Hosko, a former FBI assistant director."
        },
        {
            "id": 10,
            "text": "Hosko, however, said that the bureau receives a torrent of tips and must make difficult decisions about which to pursue."
        },
        {
            "id": 11,
            "text": "Law enforcement officials noted that nothing about the YouTube comment pointed to a Florida resident, and the comment did not include the kind of specificity — indications of when or where an attack might occur — that tends to raise greater alarms."
        },
        {
            "id": 12,
            "text": "In a tweet Thursday morning, Trump seemed to suggest that those who knew Cruz could have helped prevent the shooting rampage by reporting their concerns."
        },
        {
            "id": 13,
            "text": "“Must always report such instances to authorities, again and again!”"
        },
        {
            "id": 14,
            "text": "Trump wrote."
        },
        {
            "id": 15,
            "text": "But many people — not only Bennight but also neighbors and school officials — had made their concerns about Cruz known."
        },
        {
            "id": 16,
            "text": "Cruz seemed to leave warning signs wherever he went."
        },
        {
            "id": 17,
            "text": "Everybody saw something."
        },
        {
            "id": 18,
            "text": "Everybody said something."
        },
        {
            "id": 19,
            "text": "It was not enough."
        },
        {
            "id": 20,
            "text": "“The kid was definitely a problem,” said Malcolm Roxburgh, who lives three doors down from the home in Parkland, Fla., where Cruz lived with his mother until last year."
        },
        {
            "id": 21,
            "text": "Roxburgh said Cruz threw coconuts into his back yard, slammed a book bag into the back door of his daughter’s car and threw eggs at another neighborhood resident."
        },
        {
            "id": 22,
            "text": "“He was always getting into trouble.”"
        },
        {
            "id": 23,
            "text": "Jevon Cange, 21, grew up near Cruz and recalled that he exhibited strange behavior from the time they were little boys."
        },
        {
            "id": 24,
            "text": "He was prone to angry outbursts — he once threw a large rock at a neighborhood kid while they were fighting — and through high school he was morose, often expressing antagonism toward classmates."
        },
        {
            "id": 25,
            "text": "“He would always say how much he hates everyone,” said Cange."
        },
        {
            "id": 26,
            "text": "In a school where cliques were common, Cruz never seemed to find his crowd."
        },
        {
            "id": 27,
            "text": "Math teacher Jim Gard said that administrators had warned staff via email not to allow Cruz to carry a backpack on campus."
        },
        {
            "id": 28,
            "text": "Cruz was later expelled for unspecified discipline problems, according to local law enforcement officials."
        },
        {
            "id": 29,
            "text": "Florida shooting suspect Nikolas Cruz:"
        },
        {
            "id": 30,
            "text": "Guns, depression and a life in trouble"
        },
        {
            "id": 31,
            "text": "Neighbors said Cruz had been spotted shooting at backyard chickens and trying to kill a squirrel to feed to his dog."
        },
        {
            "id": 32,
            "text": "Police visited the teenager’s home frequently, they said."
        },
        {
            "id": 33,
            "text": "And an Instagram account that appeared to belong to Cruz featured photographs of firearms, including one showing a gun’s laser sight pointed at a neighborhood street."
        },
        {
            "id": 34,
            "text": "Another showed at least a half-dozen weapons laid out on a bed with the caption “arsenal.”"
        },
        {
            "id": 35,
            "text": "A third appeared to show a dead frog’s bloodied body."
        },
        {
            "id": 36,
            "text": "But the YouTube threat about becoming a “professional school shooter” appears to have offered the clearest sign that Cruz was contemplating violence against people."
        },
        {
            "id": 37,
            "text": "Bennight, 36, who posts videos online about his bail bond business in D’Iberville, Miss., noticed the comment in late September."
        },
        {
            "id": 38,
            "text": "The father of seven school-age children, he found it disturbing enough that it didn’t feel sufficient to simply flag it as inappropriate."
        },
        {
            "id": 39,
            "text": "First, he tried to email an image to the FBI."
        },
        {
            "id": 40,
            "text": "When that bounced back, he called the local FBI field office."
        },
        {
            "id": 41,
            "text": "“He said he wanted to be a school shooter, you know?”"
        },
        {
            "id": 42,
            "text": "Bennight said in an interview with The Washington Post."
        },
        {
            "id": 43,
            "text": "“Anything you can do to prevent that, you do.”"
        },
        {
            "id": 44,
            "text": "The lives lost in the Parkland shooting\n\nThe FBI responded immediately, sending two agents to meet with Bennight the next day."
        },
        {
            "id": 45,
            "text": "They wanted to know whether he’d had dealings with this user before."
        },
        {
            "id": 46,
            "text": "Bennight told them he had not, he said, and that in fact he had no idea how the user got to his page."
        },
        {
            "id": 47,
            "text": "“They said, ‘We’ll look into it,’ and they left,” Bennight said."
        },
        {
            "id": 48,
            "text": "Robert F. Lasky, special agent in charge of the FBI’s Miami Division, said agents were unable to determine who had left the comment."
        },
        {
            "id": 49,
            "text": "“No other information was included with that comment, which would include a time, location or the true identity of the person who made the comment,” Lasky said."
        },
        {
            "id": 50,
            "text": "“The FBI conducted database reviews, checks, but was unable to further identify the person who actually made the comment.”"
        },
        {
            "id": 51,
            "text": "FBI officials declined to say what precise searches were used to try to identify the owner of the account or to possibly link it with other social media profiles."
        },
        {
            "id": 52,
            "text": "Cruz had two Instagram accounts that also contain his name: cruz_nikolas and nikolascruzmakarov."
        },
        {
            "id": 53,
            "text": "A law enforcement official said the FBI will review the steps it took in responding to the tip to determine whether anything could have been done differently or if practices should be changed for the future."
        },
        {
            "id": 54,
            "text": "A search of the public records database Nexis for people with the name “Nikolas Cruz” returns 22 results, three of which use different spellings."
        },
        {
            "id": 55,
            "text": "It was not immediately clear if the FBI attempted to contact any of those people."
        },
        {
            "id": 56,
            "text": "Without more to go on, officials felt there wasn’t enough legal justification to issue a subpoena to YouTube for the underlying information about the “nikolas cruz” who had threatened a school shooting, a law enforcement official said."
        },
        {
            "id": 57,
            "text": "Google, which owns YouTube, has a policy of not turning over user information to the government without a subpoena, search warrant or other court order forcing it to do so."
        },
        {
            "id": 58,
            "text": "Google representatives did not return messages seeking comment."
        },
        {
            "id": 59,
            "text": "Hosko, the former FBI assistant director, said the FBI gets more than 100 threat reports each day, in addition to other reports of mental health and other issues."
        },
        {
            "id": 60,
            "text": "That leaves supervisors in the difficult position of deciding how many resources should be devoted to each case and for how long."
        },
        {
            "id": 61,
            "text": "Even in terrorism cases, Hosko said, the bureau sometimes has to leave suspects unmonitored because the FBI lacks personnel to follow each of them all the time."
        },
        {
            "id": 62,
            "text": "“The FBI has terrorism subjects that they’re looking at — they’re not all under 24-7 surveillance, and if they prioritize that wrong, yes, something bad can happen,” Hosko said."
        },
        {
            "id": 63,
            "text": "“These are the hard resource-allocation decisions you’re making if you don’t have unlimited resources.”"
        },
        {
            "id": 64,
            "text": "Hosko said in most cases of possible threats, an early question supervisors ask is, “At the end of the day, would we even have a federal crime if we proved a person sent this or posted this?”"
        },
        {
            "id": 65,
            "text": "And in Cruz’s case — where the comment is a not a specific threat — the answer was probably no, he said."
        },
        {
            "id": 66,
            "text": "Bennight said that after agents interviewed him about the comment in September, he didn’t hear anything more from the FBI — until Wednesday."
        },
        {
            "id": 67,
            "text": "Agents called him to say that there had been an incident and that they wanted to follow up on his earlier complaint."
        },
        {
            "id": 68,
            "text": "Bennight said he did not know how it was connected to the shooting in Florida until agents informed him that the comment he’d flagged had been posted under a username matching the name of suspected shooter Nikolas Cruz."
        },
        {
            "id": 69,
            "text": "Two agents then paid him a visit."
        },
        {
            "id": 70,
            "text": "They asked to review the images he previously had provided, and they asked whether he had interacted with the commenter before or since."
        },
        {
            "id": 71,
            "text": "Bennight said he had little to share with the investigators."
        },
        {
            "id": 72,
            "text": "He said he is still shocked by his apparent online encounter with the suspect in such a horrific crime."
        },
        {
            "id": 73,
            "text": "“It’s very overwhelming and odd,” he said."
        },
        {
            "id": 74,
            "text": "“My thoughts go out to the people that were affected.”"
        },
        {
            "id": 75,
            "text": ""
        }
    ]
}