{
    "title": "Bob Menendez and the fine line between campaign contribution and bribery",
    "text": [
        {
            "id": 0,
            "text": "Reports that Sen. Bob Menendez (D-N.J.) is likely to face federal corruption charges based on his interactions with a key donor invariably raise a key question: Where is the line drawn?"
        },
        {
            "id": 1,
            "text": "What's the difference between what Menendez is alleged to have done and what the public often sees as the standard D.C. practice of legislators voting in ways that their donors would appreciate?"
        },
        {
            "id": 2,
            "text": "To answer that question, we spoke with Richard Briffault, a professor at Columbia Law School who works in the area of public corruption."
        },
        {
            "id": 3,
            "text": "Briffault summarized the question at stake: \"Is there a connection between the donation and some relatively specific thing that the officeholder is expected to do, or says he will do?\""
        },
        {
            "id": 4,
            "text": "As in all legal cases, the element of burden of proof weighs in."
        },
        {
            "id": 5,
            "text": "Can the government prove beyond a reasonable doubt, through whatever evidence it can present, that Menendez was \"influenced to commit a specific use of his office\" on behalf of the likely donor at the center of the case, Florida ophthalmologist Salomon Melgen?"
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "\"The phrase is quid pro quo."
        },
        {
            "id": 8,
            "text": "The question on this one is the pro,\" Briffault said."
        },
        {
            "id": 9,
            "text": "\"Was [Menendez] doing things on behalf of Dr. Melgen because he was receiving campaign contributions, or was he doing it because he likes Dr. Melgen, which is not criminal."
        },
        {
            "id": 10,
            "text": "\" One issue that's likely to be included was Menendez's advocacy for Melgen's contract providing port security systems in the Dominican Republic."
        },
        {
            "id": 11,
            "text": "If Menendez believed that Melgen and his partners were best suited to manage that security -- even if it's because of the relationship fostered through Melgen's generosity -- that's not necessarily criminal."
        },
        {
            "id": 12,
            "text": "We don't know what specific charges are going to be brought, and on what alleged actions."
        },
        {
            "id": 13,
            "text": "Briffault outlined two possibilities."
        },
        {
            "id": 14,
            "text": "One is the scenario above, in which Menendez agreed to do something in exchange for campaign donations or gifts."
        },
        {
            "id": 15,
            "text": "The other is what's known as an \"illegal gratuity\" -- if Melgen provided gifts to Menendez because of specific actions Menendez had undertaken or was going to undertake."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "The common perception that lawmakers act on behalf of donors -- a perception that is itself probably overblown -- clouds the issue here."
        },
        {
            "id": 18,
            "text": "The legal question of bribery operates under much stricter constraints."
        },
        {
            "id": 19,
            "text": "\"The crime is that you're using your public power because of a private benefit you're receiving,\" Briffault said."
        },
        {
            "id": 20,
            "text": "Contributions \"generally are given because the donor is supporting the reelection of a candidate which may be because the candidate has generally been favorable to the donor in the past or because they hope they will be generally favorable to the donor in the future,\" Briffault explained."
        },
        {
            "id": 21,
            "text": "\"If it's tied to a specific request for a response in a very clear way, that's a bribe.\""
        },
        {
            "id": 22,
            "text": "In case it's not already clear, proving the quid pro quo is tricky."
        },
        {
            "id": 23,
            "text": "There are times when there is a smoking gun, such as when legislators took bribes on tape during Abscam."
        },
        {
            "id": 24,
            "text": "Often, though, the evidence is more circumstantial."
        },
        {
            "id": 25,
            "text": "The case of former Virginia governor Bob McDonnell, for example, was proven through \"overwhelming evidence\" -- though not a smoking gun."
        },
        {
            "id": 26,
            "text": "As Briffault put it: \"It's not just that they both received benefits and provided benefits, the government has to show that there's a linkage.\""
        },
        {
            "id": 27,
            "text": "There's an added level of trickiness when it comes to members of Congress."
        },
        {
            "id": 28,
            "text": "In the wake of Friday's announcement, speculation arose that the charges were a response from the White House to Menendez's opposition to a deal with Iran."
        },
        {
            "id": 29,
            "text": "The Constitution's \"speech and debate clause\" is meant to shield legislators from criminal actions undertaken by the executive branch by making their actions in performance of their duties immune to prosecution."
        },
        {
            "id": 30,
            "text": "It covers floor speeches (you can't sue a senator who slanders you from the Senate floor, for example) and has been interpreted to cover things like votes and statements made in committee hearings as well -- which may come into play here, given that Menendez advocated for Melgen's security company indirectly during a committee hearing."
        },
        {
            "id": 31,
            "text": "\"He will argue that the government cannot use his statements in that committee because it is part of his 'speech or debate,'\" Briffault said."
        },
        {
            "id": 32,
            "text": "And he'll have a point."
        },
        {
            "id": 33,
            "text": "Despite all of these hurdles, convictions do happen."
        },
        {
            "id": 34,
            "text": "The Department of Justice clearly feels as though it has the evidence it needs to move a jury past reasonable doubt, and we, at this point, aren't privy to what that evidence might be."
        },
        {
            "id": 35,
            "text": "But as Briffault makes clear, it's not necessarily an easy case to make."
        },
        {
            "id": 36,
            "text": "* This is a fine line that the original formulation didn't capture well."
        },
        {
            "id": 37,
            "text": "If a gift is intended to curry favor with the elected official so that he or she \"will be better disposed to performing official acts favorable to the donor in the future\" (as articulated here) and if the elected official is aware of that intent, it's an illegal gratuity."
        },
        {
            "id": 38,
            "text": ""
        }
    ]
}