{
    "title": "Trump is returning to social media in a few months with his own platform, spokesman says",
    "text": [
        {
            "id": 0,
            "text": "New York"
        },
        {
            "id": 1,
            "text": "Former President Donald Trump is coming back to social media -- but this time with his own network, a Trump spokesperson told Fox News on Sunday."
        },
        {
            "id": 2,
            "text": "Jason Miller, a long-time adviser and spokesperson for Trump's 2020 campaign told Howard Kurtz on Fox's \"MediaBuzz\" that Trump will be \"returning to social media in probably about two or three months.\""
        },
        {
            "id": 3,
            "text": "He added Trump's return will be with \"his own platform\" that will attract \"tens of millions\" of new users and \"completely redefine the game.\""
        },
        {
            "id": 4,
            "text": ".@JasonMillerinDC said President Trump will be \"returning to social media in two or three months\" with \"his own platform\" that will \"completely redefine the game\" and attract \"tens of millions\" of new users."
        },
        {
            "id": 5,
            "text": "#MediaBuzz — #MediaBuzz (@MediaBuzzFNC) March 21, 2021\n\n\"This is something that I think will be the hottest ticket in social media,\" Miller told Kurtz."
        },
        {
            "id": 6,
            "text": "\"It's going to completely redefine the game, and everybody is going to be waiting and watching to see what President Trump does, but it will be his own platform.\""
        },
        {
            "id": 7,
            "text": "Miller said during his appearance on Fox News that the former president has been approached by numerous companies and is in talks with teams about the new platform."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "\"This new platform is going to be big,\" Miller said on Sunday."
        },
        {
            "id": 10,
            "text": "\"Everyone wants him and he's going to bring millions and millions -- tens of millions -- to this platform.\""
        }
    ]
}