{
    "title": "Donald Trump: FDA Move to Toughen Coronavirus Vaccine Approval Standards ‘a Political Move’",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump reacted to the news that the Food and Drug Administration (FDA) is considering updating the standards for a coronavirus vaccine."
        },
        {
            "id": 1,
            "text": "“That sounds like a political move,” Trump said during the White House press briefing on Wednesday, noting that their updated guidance would only lengthen the time that a coronavirus vaccine could be released to the public."
        },
        {
            "id": 2,
            "text": "Reports on Tuesday revealed that the FDA was considering updating the guidance to companies for delivering a vaccine that would meet approval, a move that would delay the approval process by weeks."
        },
        {
            "id": 3,
            "text": "Trump said that the White House would ultimately have to approve any additional guidelines, but he was critical of the process."
        },
        {
            "id": 4,
            "text": "“I have tremendous trust in these massive companies that are so brilliantly organized in terms of what they’ve been doing with the tests,” he said."
        },
        {
            "id": 5,
            "text": "President Trump has repeatedly said that a vaccine could be developed before the election, prompting Democrats like former Vice President Joe Biden to question the safety and effectiveness of the vaccine."
        },
        {
            "id": 6,
            "text": "But Trump indicated that he was confident that the vaccine would be effective."
        },
        {
            "id": 7,
            "text": "“When they come back and they say that we have something that works and absolutely works … I don’t see why it should be delayed further,” he said, and he added, “That’s a lot of lives that you’re talking about.”"
        }
    ]
}