{
    "title": "California Voters Remove Aaron Persky, the Judge Who Gave a 6-Month Sentence for Sexual Assault",
    "text": [
        {
            "id": 0,
            "text": "Aaron Persky, the California judge who drew national attention in 2016 when he sentenced a Stanford student to just six months in jail for sexually assaulting an unconscious woman, was recalled on Tuesday, according to The Associated Press."
        },
        {
            "id": 1,
            "text": "He is the first judge recalled in California in more than 80 years."
        },
        {
            "id": 2,
            "text": "With nearly all precincts reporting on Wednesday, just under 60 percent of voters were in favor of removing Judge Persky from the Santa Clara County Superior Court, where he had served since 2003."
        },
        {
            "id": 3,
            "text": "Cindy Hendrickson, a prosecutor, was elected to replace him."
        },
        {
            "id": 4,
            "text": "The recall stemmed from the case of Brock Turner, who sexually assaulted a woman near a dumpster in 2015 after she had blacked out from drinking."
        },
        {
            "id": 5,
            "text": "In March 2016, a jury found Mr. Turner, then 20, guilty on all three felony charges against him: sexual penetration with a foreign object of an intoxicated person, sexual penetration with a foreign object of an unconscious person, and intent to commit rape."
        },
        {
            "id": 6,
            "text": "The maximum sentence in Mr. Turner’s case was 14 years, and Judge Persky had sentenced him to six months."
        },
        {
            "id": 7,
            "text": "Mr. Turner served only three months before being released in September 2016."
        },
        {
            "id": 8,
            "text": "(He also received three years of probation and was required to register as a sex offender, and Stanford forced him to withdraw and barred him from campus.)"
        },
        {
            "id": 9,
            "text": "“The voters of Santa Clara County are the winners of this election,” Michele Dauber, a law professor at Stanford who led the recall campaign, said in a statement."
        },
        {
            "id": 10,
            "text": "“We voted that sexual violence, including campus sexual violence, must be taken seriously by our elected officials, and by the justice system.”"
        },
        {
            "id": 11,
            "text": "LaDoris Cordell, a retired judge and a spokeswoman for Judge Persky, called the recall an attack on judicial independence and said it had “encouraged people to think of judges as no more than politicians.”"
        },
        {
            "id": 12,
            "text": "The judge said he thought Mr. Turner would “not be a danger to others” and expressed concern that “a prison sentence would have a severe impact” on him."
        },
        {
            "id": 13,
            "text": "He did not mention the impact of the assault on the victim, known publicly only as Emily Doe, who described her suffering in a more than 7,000-word statement that went viral soon after it was published by BuzzFeed."
        },
        {
            "id": 14,
            "text": "The CNN host Ashleigh Banfield devoted more than 20 minutes of airtime to reading it almost in its entirety."
        },
        {
            "id": 15,
            "text": "Judge Persky was cleared of any official misconduct, but talk of a recall campaign began almost as soon as he handed down his sentence."
        },
        {
            "id": 16,
            "text": "Early this year, the Santa Clara County registrar announced that supporters of a recall — led by Ms. Dauber, whose daughter is friends with Emily Doe — had collected enough signatures to put the question on Tuesday’s ballot."
        },
        {
            "id": 17,
            "text": "Among the effort’s most prominent backers were Anita Hill and Senator Kirsten Gillibrand of New York."
        },
        {
            "id": 18,
            "text": "In a statement filed with the county registrar in response to the effort, Judge Persky said he had a legal and professional responsibility to consider alternatives to imprisonment for first-time offenders."
        },
        {
            "id": 19,
            "text": "“As a judge, my role is to consider both sides,” he said in the statement."
        },
        {
            "id": 20,
            "text": "“It’s not always popular, but it’s the law, and I took an oath to follow it without regard to public opinion or my opinions as a former prosecutor.”"
        },
        {
            "id": 21,
            "text": "Ms. Dauber said Tuesday’s result “demonstrated that violence against women is a voting issue,” and that “if candidates want the votes of progressive Democratic women, they will have to take this issue seriously.”"
        },
        {
            "id": 22,
            "text": "Opponents of the recall, including some who disagreed with Judge Persky’s decision in Mr. Turner’s case, argued that this electoral punishment would make other judges reluctant to be lenient in cases where leniency might be appropriate."
        },
        {
            "id": 23,
            "text": "“They had a very emotional appeal: You say ‘rape, dumpster, six months,’ everyone goes ‘ahhh’ without looking at the facts,” Ms. Cordell said, arguing that Judge Persky had been unfairly targeted by people whose real complaint was with California law at the time of Mr. Turner’s sentencing."
        },
        {
            "id": 24,
            "text": "In fact, the sentence, and the backlash to it, prompted California lawmakers to change the law."
        },
        {
            "id": 25,
            "text": "Within four months, they enacted mandatory minimum sentences in sexual assault cases and closed a loophole in which penetrative sexual assault could be punished less harshly if the victim was too intoxicated to physically resist."
        }
    ]
}