{
    "title": "John Boehner To Bring Up Clean Debt-Ceiling Vote",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- Republican leaders decided Tuesday that the United States must pay its bills and raise its debt limit with no strings attached, but will leave the politically unpopular step mostly to Democrats."
        },
        {
            "id": 1,
            "text": "Republicans since 2010 have tied raising the borrowing cap, which currently stands at $17 trillion, to certain cuts, setting off a series of standoffs resulting in a sequestration deal in 2011 and last year's government shutdown."
        },
        {
            "id": 2,
            "text": "The debt ceiling is the maximum amount the Treasury Department may borrow to pay for spending programs that Congress has already authorized."
        },
        {
            "id": 3,
            "text": "Up until the last several years, the majority party in each chamber had taken the responsibility of raising it."
        },
        {
            "id": 4,
            "text": "Speaking to reporters on Capitol Hill, House Speaker John Boehner (R-Ohio) said his members would not shoulder that burden, but he hoped to find 18 of them to join 200 Democrats to get the job done."
        },
        {
            "id": 5,
            "text": "\"The fact is, we'll let the Democrats put the votes up,\" Boehner said."
        },
        {
            "id": 6,
            "text": "\"We'll put a minimum amount of votes up to get it passed.\""
        },
        {
            "id": 7,
            "text": "Boehner added it was a \"disappointing moment,\" because President Barack Obama is unwilling to negotiate over spending reforms in exchange for raising the debt limit. \""
        },
        {
            "id": 8,
            "text": "Let his party give him the debt ceiling increase that he wants,\" Boehner said."
        },
        {
            "id": 9,
            "text": "House Minority Leader Nancy Pelosi (D-Calif.) told Boehner she'll deliver the votes, he said."
        },
        {
            "id": 10,
            "text": "Obama and congressional Democrats have been adamant that any debt-ceiling hike be \"clean.\""
        },
        {
            "id": 11,
            "text": "In recent weeks, GOP leaders tried to tie the debt ceiling to various provisions, including a repeal of the Obamacare risk corridors provision and the Keystone XL pipeline, but abandoned those efforts amid wavering support."
        },
        {
            "id": 12,
            "text": "There also was not enough support among Republicans to use the debt bill to repeal recent cuts to military retirement benefits, which were adjusted in December's bipartisan budget deal."
        },
        {
            "id": 13,
            "text": "Republican leaders were set to pursue that repeal as recently as Monday, but Boehner acknowledged it had been difficult getting GOP members to coalesce around a plan."
        },
        {
            "id": 14,
            "text": "\"If you don't have 218 [votes], you don't have anything,\" he said, referring to the amount needed to guarantee a measure passes in the 435-member body."
        },
        {
            "id": 15,
            "text": "A source who was in the room at the time, told The Huffington Post that Boehner informed his members Tuesday morning that they had run out of options."
        },
        {
            "id": 16,
            "text": "The House will pursue the retirement-benefits repeal separately, Boehner's office said."
        },
        {
            "id": 17,
            "text": "The Democratic-led Senate is expected to pass a similar measure."
        },
        {
            "id": 18,
            "text": "House Majority Leader Eric Cantor"
        },
        {
            "id": 19,
            "text": "(R-Va.) has scheduled a vote on debt-ceiling legislation for Tuesday evening."
        },
        {
            "id": 20,
            "text": "It remained unclear whether there would be enough Republican votes."
        },
        {
            "id": 21,
            "text": "\"We're going to have to find them,\" Boehner said."
        },
        {
            "id": 22,
            "text": "\"I'll be one of them.\""
        },
        {
            "id": 23,
            "text": "A Democratic aide told HuffPost that Boehner could count on about 180 Democrats, which means his party would need to provide close to 40 votes."
        },
        {
            "id": 24,
            "text": "The conservative organization Club For Growth called on House members on Tuesday to vote against it and said that the vote would be included on its congressional scorecard."
        },
        {
            "id": 25,
            "text": "The debt ceiling was reached on Feb. 7, prompting the Treasury to use extraordinary measures to continue paying the nation's obligations."
        },
        {
            "id": 26,
            "text": "Those tools are set to run out on Feb. 27."
        },
        {
            "id": 27,
            "text": "Democrats hailed the GOP's decision."
        },
        {
            "id": 28,
            "text": "“When this measure passes, Congress will state unequivocally that the full faith and credit of the United States is not in doubt,\" said Pelosi in a statement."
        },
        {
            "id": 29,
            "text": "\"I thank my Democratic colleagues for never wavering from this position and for standing firm on behalf of all Americans.”"
        },
        {
            "id": 30,
            "text": "Advertisement\n\nOthers said the last four years had taught both sides some painful lessons."
        },
        {
            "id": 31,
            "text": "\"It was a long and tortuous process to get here,\" said Rep. Peter Welch (D-Vt.)."
        },
        {
            "id": 32,
            "text": "\"The Democrats did make the initial mistake in negotiating on the debt limit, which is how we got the sequester in 2011."
        },
        {
            "id": 33,
            "text": "And then the Republicans learned their lesson in the shutdown.\""
        },
        {
            "id": 34,
            "text": "Welch predicted Republicans would find sufficient members to vote for the debt limit hike."
        },
        {
            "id": 35,
            "text": "\"When you have private conversations on the Republican side, they know it's not an option [to not pay the bills],\" Welch said."
        },
        {
            "id": 36,
            "text": "\"They're just having to deal with the anxiety of getting out of the corner they painted themselves into.\""
        }
    ]
}