{
    "title": "GOP Slams Obama on Obamacare Veto: 'This Law Will Collapse' ",
    "text": [
        {
            "id": 0,
            "text": "Republicans slammed President Barack Obama Friday for vetoing legislation that would repeal Obamacare and strip funding for Planned Parenthood, with House Speaker Paul Ryan vowing to take \"this process all the way to the end under the Constitution.\""
        },
        {
            "id": 1,
            "text": "\"It's no surprise that someone named Obama vetoed a bill repealing Obamacare,\" the Wisconsin representative said."
        },
        {
            "id": 2,
            "text": "\"But we will hold a vote to override this veto."
        },
        {
            "id": 3,
            "text": "\"The idea that Obamacare is the law of the land for good is a myth."
        },
        {
            "id": 4,
            "text": "This law will collapse under its own weight, or it will be repealed,\" Ryan said."
        },
        {
            "id": 5,
            "text": "\"It's just a matter of time.\""
        },
        {
            "id": 6,
            "text": "Rep. Tom Price, the Georgia chairman of the House Budget Committee, said that Obama's veto had \"single-handedly denied the American people the relief they seek from a law that is driving up the cost of health care, while driving down the quality."
        },
        {
            "id": 7,
            "text": "\"The president has shown he is willing to pull more money out of the pockets of hard-working Americans, limit access to care, tax innovation, burden job creators and undermine the doctor-patient relationship in order to protect his legacy.\""
        },
        {
            "id": 8,
            "text": "In his veto, President Obama said that repealing his signature domestic legislation \"would reverse the significant progress we have made in improving health care in America.\""
        },
        {
            "id": 9,
            "text": "He said that the Affordable Care Act included fairer rules and stronger consumer protections \"that have made health care coverage more affordable, more attainable and more patient-centered."
        },
        {
            "id": 10,
            "text": "And it is working.\""
        },
        {
            "id": 11,
            "text": "Congress sent the repeal legislation to Obama's desk for his signature earlier this week, the first time Republicans have successfully been able to do so."
        },
        {
            "id": 12,
            "text": "They have long argued that the healthcare law is too costly and does not work."
        },
        {
            "id": 13,
            "text": "Obama's veto was expected."
        },
        {
            "id": 14,
            "text": "The legislation also would have stripped Planned Parenthood of its federal funding, following undercover videos by the Center for Medical Progress showing top officials discussing the sale of fetal body parts."
        },
        {
            "id": 15,
            "text": "Oklahoma GOP Sen. Jim Inhofe said that Obama's veto proved that \"he cares only about the legacy of this legislation and not the American people.\""
        },
        {
            "id": 16,
            "text": "He noted that 12 of the 23 healthcare co-ops established under Obamacare have failed, leaving more than 500,000 Americans scrambling to find health coverage."
        },
        {
            "id": 17,
            "text": "The co-ops received more than $1 billion in federal loans, Inhofe said."
        },
        {
            "id": 18,
            "text": "\"It is time that the president start to do what is right for the American people and let Congress craft real market-based healthcare reform that will actually lower costs and expand access by getting the federal government out of the healthcare business,\" the senator said."
        },
        {
            "id": 19,
            "text": "Jeanne Mancini, president of the March for Life Education and Defense Fund, blasted Obama's continued use of \"taxpayer money to fund the abortion industry through a stroke of his pen.\""
        },
        {
            "id": 20,
            "text": "\"This speaks directly to his administration's priorities on life and the unborn,\" Mancini said."
        },
        {
            "id": 21,
            "text": "\"By vetoing this bill, the president's choice for abortion is loud and clear, perhaps more than ever before.\""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        }
    ]
}