{
    "title": "A Fine Night For Romney, But No Game Change",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "It's been the political world's obsession for weeks leading into the Republican National Convention in Tampa."
        },
        {
            "id": 3,
            "text": "Would nominee Mitt Romney manage what would be miraculous for any candidate, and in a handful of days and one big speech wash away the problems of a modern candidacy?"
        },
        {
            "id": 4,
            "text": "Turns out Romney's moment Thursday night was a fine one, if not a great one."
        },
        {
            "id": 5,
            "text": "His speech continued the campaign's concerted effort to reach out to skeptical female voters, reminding the audience that his strong mother ran for Senate."
        },
        {
            "id": 6,
            "text": "It spoke to those disillusioned with President Obama, and criticized his record on the economy and lack of business experience, while stressing his own."
        },
        {
            "id": 7,
            "text": "And it had its genuinely moving interludes — the must-have humanizing moments the often stiff and always private candidate was advised to serve up to the likeability gods."
        },
        {
            "id": 8,
            "text": "Romney, who appeared a bit exhausted from the start, teared up when talking about his mother, and again when he expressed the heart-tugging longing he and his wife, Ann, experience for the days when their house was filled with their five sons and all their noise and rambunctiousness."
        },
        {
            "id": 9,
            "text": "But the speech, and its already familiar themes, seemed unlikely to light a fire under the small slice of America's electorate still deciding whom to vote for, or whether to even head to the polls."
        },
        {
            "id": 10,
            "text": "The night, however — with the exception of the awfully strange, quixotic appearance by Clint Eastwood speaking to an invisible Obama, who he pretended was sitting on a real chair onstage — was chock-a-block with powerful testimonials for the newly minted nominee."
        },
        {
            "id": 11,
            "text": "Mormon church members recalled his kindnesses when he led a congregation in Boston."
        },
        {
            "id": 12,
            "text": "Business partners talked about a successful, hands-on penny pincher."
        },
        {
            "id": 13,
            "text": "A Massachusetts official who worked for him while he was governor described him as \"authentic.\""
        },
        {
            "id": 14,
            "text": "And there was a truly charming biographical video, stressing family and hard work, with home movies featuring Romney's father, a Michigan governor and auto company executive, and captivating images of young Ann and Mitt Romney and their brood."
        },
        {
            "id": 15,
            "text": "The problem?"
        },
        {
            "id": 16,
            "text": "That personal, strong program was interrupted by the Eastwood \"interlude\" (that's how a clearly startled Romney campaign began describing the actor's unscripted performance), and a speech by rising GOP star Florida Sen. Marco Rubio, who started strong but flagged."
        },
        {
            "id": 17,
            "text": "A quote by the late Herb Brooks, who coached the U.S. Olympic hockey team to gold in 1980, which included a win over a powerful Soviet team, ended the Romney video: \"Great moments are born from great opportunity,\" it read."
        },
        {
            "id": 18,
            "text": "Romney had an effective night, if it didn't end up being a great night."
        },
        {
            "id": 19,
            "text": "That was enough for supporters like Janice Adkison, 52, of Florida, who said she has had to warm to Romney."
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "\"My husband and I both had reservations,\" she said, citing concerns about Romney's lack of magnetism. \""
        },
        {
            "id": 22,
            "text": "But the more we learned about his personal life, his family, his business, the more impressed we were,\" she said as she left the hall after the balloons and confetti had dropped."
        },
        {
            "id": 23,
            "text": "\"We don't need a celebrity; we need a leader.\""
        },
        {
            "id": 24,
            "text": "Enough for Adkison and supporters like her, and maybe more Americans — if they didn't switch channels when Eastwood was talking to his imaginary president."
        }
    ]
}