{
    "title": "Hillary Clinton used private e-mail for government business at State Dept.",
    "text": [
        {
            "id": 0,
            "text": "Hillary Clinton’s private e-mail address that she used while secretary of state reinforces everything people don’t like about her, argues The Post’s Chris Cillizza, and is very dangerous to her presidential ambitions."
        },
        {
            "id": 1,
            "text": "Hillary Clinton’s private e-mail address that she used while secretary of state reinforces everything people don’t like about her, argues The Post’s Chris Cillizza, and is very dangerous to her presidential ambitions."
        },
        {
            "id": 2,
            "text": "Hillary Rodham Clinton used a private e-mail account for her official government business when she was secretary of state and did not routinely preserve and turn over those e-mails for government records collection, the State Department said Monday."
        },
        {
            "id": 3,
            "text": "Clinton has turned over thousands of e-mails to the department from her private account, a step that was first reported by the New York Times late Monday."
        },
        {
            "id": 4,
            "text": "The private account came to light when the department sought records from Clinton and other former secretaries who have held the post during the e-mail age."
        },
        {
            "id": 5,
            "text": "Some 300 of Clinton’s recovered e-mails were then turned over to a congressional committee investigating the 2012 deaths of four Americans at U.S. facilities in Benghazi, Libya, State Department spokeswoman Jen Psaki said."
        },
        {
            "id": 6,
            "text": "“Last year, the Department sent a letter to representatives of former secretaries of state requesting they submit any records in their possession for proper preservation,” Psaki said in a statement."
        },
        {
            "id": 7,
            "text": "“In response to our request, Secretary Clinton provided the Department with e-mails spanning her time at the Department."
        },
        {
            "id": 8,
            "text": "After the State Department reviewed those e-mails, we produced about 300 e-mails responsive to recent requests from the Select Committee.”"
        },
        {
            "id": 9,
            "text": "Clinton spokesman Nick Merrill said in a statement Tuesday: “Like secretaries of state before her, she used her own email account when engaging with any Department officials."
        },
        {
            "id": 10,
            "text": "For government business, she emailed them on their Department accounts, with every expectation they would be retained.”"
        },
        {
            "id": 11,
            "text": "Clinton “immediately said yes” when the State Department asked former secretaries last year for help preserving e-mail records, he said."
        },
        {
            "id": 12,
            "text": "“Both the letter and spirit of the rules permitted State Department officials to use non-government email, as long as appropriate records were preserved,” Merrill said."
        },
        {
            "id": 13,
            "text": "It was not clear why Clinton, a potential 2016 presidential candidate, created the private account."
        },
        {
            "id": 14,
            "text": "But the practice appears to bolster long-standing criticism that Clinton and her husband, former president Bill Clinton, have not been transparent."
        },
        {
            "id": 15,
            "text": "“Hillary Clinton should release her e-mails,” said Kristy Campbell, a spokeswoman for former Florida governor Jeb Bush, who is also weighing a presidential bid."
        },
        {
            "id": 16,
            "text": "“Hopefully she hasn’t already destroyed them.”"
        },
        {
            "id": 17,
            "text": "Campbell noted that Bush ­created a Web site, at ­www.jebemails.com, providing public access to his electronic communications while in office."
        },
        {
            "id": 18,
            "text": "“Governor Bush believes transparency is a critical part of public service and of governing,” she said in a statement."
        },
        {
            "id": 19,
            "text": "Clinton’s aides reviewed tens of thousands of pages of her personal e-mails and decided which ones to turn over to the State Department, the Times reported."
        },
        {
            "id": 20,
            "text": "In total, 55,000 pages of e-mails were turned over, the newspaper reported."
        },
        {
            "id": 21,
            "text": "Clinton was not the first secretary of state to use a private account."
        },
        {
            "id": 22,
            "text": "The State Department said Clinton’s successor as top diplomat, John F. Kerry, is the first secretary to use a standard government e-mail address ending in “state.gov.”"
        },
        {
            "id": 23,
            "text": "Psaki played down the effect of Clinton’s use of a private account."
        },
        {
            "id": 24,
            "text": "“The State Department has long had access to a wide array of Secretary Clinton’s records — including emails between her and Department officials with state.gov accounts, as well as cables,” Psaki said in the statement."
        },
        {
            "id": 25,
            "text": "Clinton never had such an address and relied exclusively on the private account, the Times reported."
        },
        {
            "id": 26,
            "text": "The Times said Clinton’s aides took no action during her four years as secretary to ensure that the records would be preserved on department servers, as required by the Federal Records Act."
        },
        {
            "id": 27,
            "text": "It is not clear whether Clinton retained copies of all the e-mails from her four years at the department."
        },
        {
            "id": 28,
            "text": "“The department is in the process of updating our records preservation policies to bring them in line with recent 2013 National Archives and Records Administration guidance,” Psaki said."
        },
        {
            "id": 29,
            "text": "“These steps include regularly archiving all of Secretary Kerry’s emails to ensure that we are capturing all federal records.”"
        },
        {
            "id": 30,
            "text": ""
        }
    ]
}