{
    "title": "A Census Case That Goes to the Heart of American Democracy",
    "text": [
        {
            "id": 0,
            "text": "On Monday, the Supreme Court heard arguments on a question that goes to the heart of American democracy: Must the government count everyone living in the country, citizens or not, in the census totals that the House of Representatives uses to reallocate its 435 seats among the states?"
        },
        {
            "id": 1,
            "text": "For more than two centuries, the answer has been “yes.”"
        },
        {
            "id": 2,
            "text": "Both Article 1 of the Constitution and the 14th Amendment require that House seats be allotted according to “the whole number” of persons in each state."
        },
        {
            "id": 3,
            "text": "That phrase has long been read to include all the nation’s residents, whether American citizens, foreigners admitted here on visas or immigrants with no documents at all."
        },
        {
            "id": 4,
            "text": "But President Trump signaled in a memorandum this summer that he intended to exclude unauthorized immigrants from the 2020 census totals that he hoped to send to the House next year for use in reapportionment."
        },
        {
            "id": 5,
            "text": "Federal courts have ruled in three separate lawsuits that Mr. Trump lacks that authority, saying in one case that the question was not even close."
        },
        {
            "id": 6,
            "text": "But the Supreme Court will have the final say."
        },
        {
            "id": 7,
            "text": "Here’s a rundown of some of the basics behind the issue:\n\nFirst and foremost, the allocation of political power."
        },
        {
            "id": 8,
            "text": "No precise count of unauthorized immigrants exists."
        },
        {
            "id": 9,
            "text": "Mr. Trump has ordered the Census Bureau to come up with an estimate, but many experts put the number at about 11 million."
        },
        {
            "id": 10,
            "text": "Many are concentrated in states with large immigrant populations, such as New York and Texas, and in states like California and Florida where undocumented immigrants also are in demand for farm work."
        },
        {
            "id": 11,
            "text": "Some of those states and a few others could lose House seats if unauthorized immigrants were excluded from census totals."
        },
        {
            "id": 12,
            "text": "Conversely, some states with few unauthorized immigrants could pick up those seats."
        },
        {
            "id": 13,
            "text": "Alabama, for example, appears set to lose one of its seven House seats in the next reapportionment; the state is arguing in a separate lawsuit that undocumented immigrants are illegally depriving its citizens of fair representation."
        },
        {
            "id": 14,
            "text": "Many experts feel that restricting the count to citizens would tend to benefit states that are rural and Republican at the expense of ones that are urban and Democratic."
        },
        {
            "id": 15,
            "text": "But the Republican Party’s gains probably would be small, most say, given that big Republican states like Texas would be among those that could be affected by the change."
        },
        {
            "id": 16,
            "text": "The Justice Department argues that federal law gives the president discretion to make policy judgments about whom the census counts."
        },
        {
            "id": 17,
            "text": "That discretion includes setting the definition of an “inhabitant” or “usual resident” of the United States, two terms that have historically been used to describe people who qualify to be counted in a census."
        },
        {
            "id": 18,
            "text": "The president’s lawyers say federal law gives “virtually unfettered discretion” to the Commerce Department — the federal agency that oversees the Census Bureau — to decide what data is used in counting individual residents of states."
        },
        {
            "id": 19,
            "text": "Opponents of the president’s plan say 230 years of history are on their side."
        },
        {
            "id": 20,
            "text": "Noncitizens have been counted in every census — and used in every reapportionment of the House — since the very first census was conducted in 1790."
        },
        {
            "id": 21,
            "text": "In the nation’s early history, a substantial share of the population had migrated from other countries, and for many decades thereafter, some states actively recruited foreigners to provide labor and boost political representation."
        },
        {
            "id": 22,
            "text": "The framers of the Constitution elected to exclude some people from being counted — specifying “Indians not taxed” and, most notoriously, deciding to count someone who was enslaved as three-fifths of a person — but left noncitizens intact."
        },
        {
            "id": 23,
            "text": "The drafters of the 14th Amendment debated whether to count all immigrants for apportionment purposes, and elected in the end to do so."
        },
        {
            "id": 24,
            "text": "The opponents also say that the Constitution explicitly requires that the decennial census be used for reapportionment, and that Mr. Trump has no authority to deduct unauthorized immigrants from that census before sending population totals to the House."
        },
        {
            "id": 25,
            "text": "Three courts — in New York, Maryland and California — have ruled against the White House on varying grounds and in some cases barred the Commerce Department from sending a count of unauthorized immigrants to the White House."
        },
        {
            "id": 26,
            "text": "The California court ruled that excluding noncitizens violated both federal law and the Constitution."
        },
        {
            "id": 27,
            "text": "In New York, a panel of three judges, two appointed by President George W. Bush and one by President Barack Obama, said unanimously that “the merits of the parties’ dispute are not particularly close or complicated.”"
        },
        {
            "id": 28,
            "text": "The panel said federal law required the government to produce a single set of population figures for reapportionment, making Mr. Trump’s plan for a separate estimate of unauthorized immigrants moot."
        },
        {
            "id": 29,
            "text": "The judges also said that “so long as they reside in the United States, illegal aliens qualify as ‘persons’ in a ‘state’ as Congress used those words.”"
        },
        {
            "id": 30,
            "text": "Because of that, the judges said, there was no need to take up the question of whether the president’s plan also violated the Constitution."
        },
        {
            "id": 31,
            "text": "It would be extremely hard, if only because many of them are trying their best to avoid being seen for fear of deportation."
        },
        {
            "id": 32,
            "text": "The Trump administration had ordered the Census Bureau to add a citizenship question to the 2020 census in an attempt to come up with a tally, but the Supreme Court ruled in 2019 that the Commerce Department had failed to offer a plausible explanation of why the question was needed."
        },
        {
            "id": 33,
            "text": "On the president’s order, a Census Bureau task force is working to provide a count anyway, mostly by sifting through federal and state records that show conclusively who is a citizen — and by implication, who is not."
        },
        {
            "id": 34,
            "text": "A handful of records, such as compilations of people marked for deportation, do identify people who are in the county illegally, but those tallies are a small fraction of the entire population of unauthorized immigrants."
        },
        {
            "id": 35,
            "text": "It appears unlikely that the bureau will produce an estimate of unauthorized immigrants by the Dec. 31 statutory deadline for sending population totals to the White House."
        },
        {
            "id": 36,
            "text": "Indeed, Census Bureau officials told the Commerce Department this month that the 2020 census itself could not be completed until after Mr. Trump leaves office on Jan. 20."
        },
        {
            "id": 37,
            "text": "The bureau’s experts nevertheless are racing to complete a count of unauthorized immigrants for delivery to Mr. Trump in early or mid-January."
        }
    ]
}