{
    "title": "Obamacare 2015 open enrollment set to be delayed one month",
    "text": [
        {
            "id": 0,
            "text": "The Department of Health and Human Services is set to announce that it is changing the 2015 open enrollment period for the new federal health-care exchanges, according to an HHS official, the latest on-the-fly change for the embattled Affordable Care Act."
        },
        {
            "id": 1,
            "text": "The new change will, notably, push the open enrollment period until after the 2014 election, which will be held Nov. 4 -- a circumstance that has Republicans crying foul."
        },
        {
            "id": 2,
            "text": "The news was first reported by Bloomberg."
        },
        {
            "id": 3,
            "text": "The change is aimed at giving insurance companies who offer plans on the exchanges more time to review 2014 enrollments and set rates for the 2015 enrollment period, according to the official, who was granted anonymity to discuss a change that has yet to be finalized and made public."
        },
        {
            "id": 4,
            "text": "It would also give customers an extra week to review their options, extending the open-enrollment period by one week to two full months."
        },
        {
            "id": 5,
            "text": "Republicans were quick to pounce on the change, accusing the administration of a blatantly political effort to delay bad news that might result from the next round of open enrollment until after the election."
        },
        {
            "id": 6,
            "text": "The delay means Americans might not hear about potential rate increases until after the election, rather than in the weeks before."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "\"Clearly, President Obama does not want voters to see increased prices, more cancellations and decreased options under Obamacare before they go to the ballot box,\" House Majority Leader Eric Cantor (R-Va.) said in a statement."
        },
        {
            "id": 9,
            "text": "\"If Obamacare is so great, why are Democrats so scared of voters knowing its consequences?\"\n\nObamacare has been beset with problems since the exchanges and the HealthCare.gov Web site launched Oct. 1."
        },
        {
            "id": 10,
            "text": "The Obama administration previously changed course by saying it would allow people to keep their current insurance — a promise it and President Obama had made repeatedly — after many Americans who bought insurance on their own saw their plans canceled for not meeting the new law's requirements."
        },
        {
            "id": 11,
            "text": "Updated at 11:39 a.m."
        },
        {
            "id": 12,
            "text": ""
        }
    ]
}