{
    "title": "Suspect In YouTube Shooting Angry That Her Videos Had Been 'De-Monetized'",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "A woman with an apparent grudge against YouTube for what she claimed was censoring and de-monetizing her videos, opened fire at the video-sharing service's San Bruno, Calif., headquarters, wounding several people before fatally shooting herself, according to police."
        },
        {
            "id": 4,
            "text": "Police Chief Ed Barberini said the attack was carried out with a handgun and initially investigated the shooting as a possible domestic dispute."
        },
        {
            "id": 5,
            "text": "In a later statement, the San Bruno Police Department said it was still investigating a motive for the shooting and that \"at this time there is no evidence that the shooter knew the victims of this shooting or that individuals were specifically targeted.\""
        },
        {
            "id": 6,
            "text": "Later, law enforcement officials identified the suspect as Nasim Najafi Aghdam, 39; however The San Jose Mercury News listed her age as 38."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "The NBC affiliate in the Bay Area reports that Aghdam \"had a robust presence on YouTube\" and had posted in both English and Farsi, a language widely spoken in Iran."
        },
        {
            "id": 10,
            "text": "A spokesman at Zuckerberg San Francisco General Hospital said it received three patients from the incident."
        },
        {
            "id": 11,
            "text": "The spokesman, Chief Communication Officer Brent Andrew, said one man, 36, was in critical condition; a woman, 32, in serious condition; and another woman, 27, in fair condition."
        },
        {
            "id": 12,
            "text": "No other information was released about the identities of the wounded or details of their wounds."
        },
        {
            "id": 13,
            "text": "Barberini said that the police department received multiple reports of shots fired at 12:46 p.m. and officers arrived at the YouTube building just a couple of minutes later."
        },
        {
            "id": 14,
            "text": "The officers arrived to a chaotic scene as people were fleeing the building."
        },
        {
            "id": 15,
            "text": "Officers found one person wounded outside and just a few minutes later they found a second individual, deceased, with what appeared to be self-inflicted wounds."
        },
        {
            "id": 16,
            "text": "Barberini says they then found two more people wounded."
        },
        {
            "id": 17,
            "text": "Enlarge this image toggle caption"
        },
        {
            "id": 18,
            "text": "One eyewitness, Zachary Voorhies, a senior software engineer at YouTube, told All Things Considered that he was preparing for lunch when a fire alarm went off."
        },
        {
            "id": 19,
            "text": "He and his team had exited the building and he was on his electric skateboard near the building's courtyard when he heard a commotion."
        },
        {
            "id": 20,
            "text": "\"I heard a man yelling out, 'Do you want to shoot me?'"
        },
        {
            "id": 21,
            "text": "and about 25 feet away from him was somebody on the ground with an apparent gunshot wound in his stomach"
        },
        {
            "id": 22,
            "text": "and he was bleeding out of his shirt"
        },
        {
            "id": 23,
            "text": "and he wasn't moving,\" said Voorhies."
        },
        {
            "id": 24,
            "text": "\"When a police officer arrived on scene with an assault rifle, \"that's when I realized that that was not someplace I needed to be,\" he added."
        },
        {
            "id": 25,
            "text": "Another eyewitness, Jesse Pineda of San Bruno told the San Francisco Chronicle:\n\n\""
        },
        {
            "id": 26,
            "text": "[He] was getting a hamburger at Carl's Jr. across the street from the YouTube offices when he heard three shots in rapid succession."
        },
        {
            "id": 27,
            "text": "A young woman emerged from the office, shot in the left leg."
        },
        {
            "id": 28,
            "text": "He helped drag her into the restaurant before hearing more shots."
        },
        {
            "id": 29,
            "text": "He then ran back toward YouTube and looked through the doorway, where he saw a woman on the ground. '"
        },
        {
            "id": 30,
            "text": "She was dead, I'm sure of it,' Pineda said. '"
        },
        {
            "id": 31,
            "text": "Those 10 shots were rapid fire — it was no mercy."
        },
        {
            "id": 32,
            "text": "There were four more shots after that."
        },
        {
            "id": 33,
            "text": "I wish I had had a gun"
        },
        {
            "id": 34,
            "text": "but I didn't."
        },
        {
            "id": 35,
            "text": "I had to be smart and get out of there."
        },
        {
            "id": 36,
            "text": "I had to be fast.'\""
        },
        {
            "id": 37,
            "text": "In the immediate aftermath of the shooting, local TV news reports showed pictures of people leaving a building with their hands over their heads."
        },
        {
            "id": 38,
            "text": "Each person was being frisked by a police officer, apparently to make sure that no one posed a threat."
        },
        {
            "id": 39,
            "text": "Enlarge this image toggle caption Justin Sullivan/Getty Images Justin Sullivan/Getty Images"
        },
        {
            "id": 40,
            "text": "Later in the afternoon, Chief Barberini said that shooter was a woman who had died of self-inflicted wounds and had used a handgun."
        },
        {
            "id": 41,
            "text": "The chief also said the YouTube building was evacuated and detectives were making arrangements to talk to people who were witnesses to the incident."
        },
        {
            "id": 42,
            "text": "Investigators were searching the building floor by floor, room by room, for any clues to what happened."
        },
        {
            "id": 43,
            "text": "Google, the parent company of YouTube, tweeted an advisory to all of its employees in the San Francisco Bay Area to stay away from the area and that it had set up a helpline for employees."
        },
        {
            "id": 44,
            "text": "In the wake of shootings elsewhere, YouTube recently announced it would start enforcing restrictions on videos that show gun violence."
        },
        {
            "id": 45,
            "text": "According to NBC, in one video of the alleged shooter, Aghdam is superimposed over a background of what appears to be six-pointed Stars of David as she complains that her workout video has been age-restricted by YouTube."
        },
        {
            "id": 46,
            "text": ""
        },
        {
            "id": 47,
            "text": "\"Many singers like Nicki Minaj, Miley [Cyrus] and many others ... are so inappropriate for children to watch [but] don't get age-restricted ..."
        },
        {
            "id": 48,
            "text": "my videos, my workout video, gets age-restricted."
        },
        {
            "id": 49,
            "text": "This is what they are doing to vegan activists and many other people who try to promote healthy, humane and smart living.\""
        },
        {
            "id": 50,
            "text": "According to The San Jose Mercury News:\n\n\"The night before Nasim Aghdam opened fire in a courtyard at YouTube's headquarters Tuesday afternoon, Mountain View police found the San Diego woman sleeping in her car."
        },
        {
            "id": 51,
            "text": "She had been reported missing by her family in Southern California, and her father Ismail Aghdam told police she might be going to YouTube because she 'hated' the company."
        },
        {
            "id": 52,
            "text": "Police called the family at 2 a.m. Tuesday to say she'd been found and that everything was 'under control,' her father said.\""
        },
        {
            "id": 53,
            "text": "Mountain View, Calif., say they spotted a woman who went by the name Nasim Aghdam asleep in a car in a city parking lot early Tuesday morning and notified her family."
        },
        {
            "id": 54,
            "text": "\"Our officers made contact with the woman after the license plate of her vehicle matched that of a missing person out of Southern California,\" Katie Nelson, a spokeswoman for the department, said in an email received by the Mercury News."
        },
        {
            "id": 55,
            "text": "\"The woman confirmed her identity to us and answered subsequent questions.\""
        },
        {
            "id": 56,
            "text": "Ismail Aghdam said his daughter was a vegan activist and an animal lover, according to the newspaper."
        },
        {
            "id": 57,
            "text": ""
        },
        {
            "id": 58,
            "text": "\"She told her family that YouTube had stopped paying her for the content she posted to the site, Ismail Aghdam said."
        },
        {
            "id": 59,
            "text": "YouTubers can receive payment for advertisements accompanying their videos, but the company 'de-monetizes' some channels for various reasons, meaning ads don't run with them,\" the Mercury News writes."
        },
        {
            "id": 60,
            "text": "This is a breaking news story."
        },
        {
            "id": 61,
            "text": "As often happens in situations like these, some information reported earlier may turn out to be inaccurate."
        },
        {
            "id": 62,
            "text": "We'll move quickly to correct the record and we'll only point to the best information we have at the time."
        }
    ]
}