{
    "title": "Congress reacts, Dems talk sequester",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "With the Boston Marathon bombings less than 24 hours old, some on Capitol Hill are beginning to say the attack shows why Congress should’ve stopped automatic spending cuts from taking hold in March."
        },
        {
            "id": 2,
            "text": "House Minority Whip Steny Hoyer"
        },
        {
            "id": 3,
            "text": "(D-Md.), responding to a question at a Tuesday morning press conference, said the bombings are “clearly another place where it demonstrates why having the ability to address security concerns is important.”"
        },
        {
            "id": 4,
            "text": "Hoyer added: “I think there are multiple reasons for ensuring that we invest in our security both domestic and international security."
        },
        {
            "id": 5,
            "text": "That we invest in the education of our children, that we invest in growing jobs in America and don’t pursue any irrational policy of cutting the highest priorities and the lowest priorities by essentially the same percentage.”"
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "Rep. Xavier Becerra of California, the chairman of the House Democratic Caucus, said that the first responders working Monday aren’t sheltered from cuts."
        },
        {
            "id": 8,
            "text": "“We have to send you less money to help your first responders,” Becerra said."
        },
        {
            "id": 9,
            "text": "A White House official said the sequester cuts “will not hamper” the response to the bombing, but decried the long-term effect."
        },
        {
            "id": 10,
            "text": "“We are obviously concerned about the impact of the sequester on the short term operations and long term capabilities of federal agencies critical to the homeland security mission, and the impact these cuts will have on local governments,” the official said."
        },
        {
            "id": 11,
            "text": "“But over the past decade we have made significant investments to build response capabilities at the state and local level, as evidenced by the quick and coordinated response yesterday in Boston.”"
        },
        {
            "id": 12,
            "text": "Even before President Barack Obama and Speaker John Boehner called the explosions acts of terrorism, the policy debate began on Capitol Hill."
        },
        {
            "id": 13,
            "text": "It’s not exactly clear what Congress can do to stop attacks like this in the future."
        },
        {
            "id": 14,
            "text": "Rep. Peter King (R-N.Y.), a former Homeland Security chairman, suggested Congress should not cut funding for the Department of Homeland Security."
        },
        {
            "id": 15,
            "text": "Boehner also said money should not be an issue, telling reporters that federal and local law enforcement will have “have all the resources they need” to ensure the perpetrator is brought to justice."
        },
        {
            "id": 16,
            "text": "But the flow of information to Capitol Hill has been slow."
        },
        {
            "id": 17,
            "text": "Lawmakers hungry for information on the cause of the attack will have to wait."
        },
        {
            "id": 18,
            "text": "An FBI briefing with members of the House Intelligence Committee set for Tuesday has canceled, according to several sources."
        },
        {
            "id": 19,
            "text": "Lawmakers on the committee will read reports on the attack instead."
        },
        {
            "id": 20,
            "text": "But the chairmen and ranking members of the Senate and House intelligence committees — were briefed, according to several sources."
        },
        {
            "id": 21,
            "text": "Rep. Dutch Ruppersberger of Maryland, the top Democrat on that committee, said he wants the FBI “to focus on what they do best and that’s getting the information and finding out who did this and what type of bomb it was.”"
        },
        {
            "id": 22,
            "text": "FBI Director Robert Mueller and Homeland Security Secretary Janet Napolitano are scheduled to come to Capitol Hill at 4 p.m. to brief the entire House on cybersecurity."
        },
        {
            "id": 23,
            "text": "House Minority Whip Steny Hoyer (D-Md.) said he “would be surprised if that didn’t go off topic”"
        },
        {
            "id": 24,
            "text": "Boehner on Tuesday called the bombing at the Boston Marathon “a terrorist attack of some sort.”"
        },
        {
            "id": 25,
            "text": "It’s a “reminder of just how vulnerable we really are in this era of what I’ll call modern warfare,” Boehner told reporters."
        },
        {
            "id": 26,
            "text": "The speaker and President Barack Obama spoke Monday evening."
        },
        {
            "id": 27,
            "text": "It remains to be seen whether this attack will change Capitol Hill’s momentum on either immigration or gun control."
        },
        {
            "id": 28,
            "text": "The Senate’s “Gang of Eight” has postponed the scheduled rollout of immigration legislation that was set for Tuesday."
        },
        {
            "id": 29,
            "text": "Rep. Steve King (R-Iowa), long an opponent of granting more immigrants legal status in the U.S., said if the bombing was done by a foreign national, Washington needs to look at an immigration bill “in the big picture.”"
        },
        {
            "id": 30,
            "text": "Behind closed doors, the fear is real."
        },
        {
            "id": 31,
            "text": "House Majority Leader Eric Cantor of Virginia told Republicans in a closed meeting Tuesday at the Capitol Hill club that the attack “shook us,” according to two sources present."
        },
        {
            "id": 32,
            "text": "A former member of the House GOP caucus — ex-Rep. Jean Schmidt (R-Ohio), ran the race and was near the finish line when the explosion occurred."
        },
        {
            "id": 33,
            "text": "“I’ve never been so closed to death or witnessed it,” Schmidt told the Cincinnati Enquirer."
        },
        {
            "id": 34,
            "text": "She said she heard a “boom” and saw people “without limbs” taken to a medical tent."
        },
        {
            "id": 35,
            "text": "Schmidt’s twin sister was also running the race and was stopped at the 25.4 mile point."
        },
        {
            "id": 36,
            "text": "The somber feelings extend to the Senate floor."
        },
        {
            "id": 37,
            "text": "Senate Majority Leader Harry Reid (D-Nev.) and Minority Leader Mitch McConnell (R-Ky.) opened the day with floor statements on Boston."
        },
        {
            "id": 38,
            "text": "“We are still reeling from the senseless violence,” Reid said."
        },
        {
            "id": 39,
            "text": "“One thing, though, we are united and there’s sympathy for the victims of this senseless attack and the families who are suffering today.”"
        },
        {
            "id": 40,
            "text": "McConnell said that “complacency that prevailed prior to September 11th has returned.”"
        },
        {
            "id": 41,
            "text": "“And so we are newly reminded that serious threats to our way of life remain,” he said."
        },
        {
            "id": 42,
            "text": "“And today, again, we recommit ourselves to the fight against terrorism at home, and abroad.”"
        },
        {
            "id": 43,
            "text": "Lawmakers also returned to other duties Tuesday."
        },
        {
            "id": 44,
            "text": "The National Republican Congressional Committee briefed lawmakers on a special election in South Carolina."
        },
        {
            "id": 45,
            "text": "Rep. John Shimkus (R-Ill.) tweeted that he was going to make a speech on nuclear waste, one of his pet issues."
        },
        {
            "id": 46,
            "text": "”I will speak on the floor of the House this morning about the DOE budget and nuclear waste,” Shimkus wrote."
        },
        {
            "id": 47,
            "text": "“The Republic and its business must go on.”"
        },
        {
            "id": 48,
            "text": ""
        }
    ]
}