{
    "title": "Obama Vetoes Anti-Obamacare Bill, Obviously",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- President Barack Obama notified Congress on Friday that he has vetoed their legislation to repeal huge parts of the Affordable Care Act, because of course he did."
        },
        {
            "id": 1,
            "text": "Republicans celebrated this week after finally managing to push a repeal bill through the House and Senate for the first time, reveling in their impending failure to actually achieve anything."
        },
        {
            "id": 2,
            "text": "Obama just officially ended the party."
        },
        {
            "id": 3,
            "text": "\"Republicans in the Congress have attempted to repeal or undermine the Affordable Care Act over 50 times."
        },
        {
            "id": 4,
            "text": "Rather than refighting old political battles by once again voting to repeal basic protections that provide security for the middle class, Members of Congress should be working together to grow the economy, strengthen middle-class families, and create new jobs,\" Obama wrote in a message to Congress. \""
        },
        {
            "id": 5,
            "text": "Because of the harm this bill would cause to the health and financial security of millions of Americans, it has earned my veto.\""
        },
        {
            "id": 6,
            "text": "Congress intends to continue beating this dead horse anyway, House Speaker Paul Ryan (R-Wis.) made clear in a press release responding to the president."
        },
        {
            "id": 7,
            "text": "\"It’s no surprise that someone named Obama vetoed a bill repealing Obamacare,\" he said."
        },
        {
            "id": 8,
            "text": "\"But we will hold a vote to override this veto, taking this process all the way to the end under the Constitution.\""
        },
        {
            "id": 9,
            "text": "Americans may have hoped the latest of dozens of repeal votes would be the prelude to the GOP offering a health care reform platform of their own, but Republicans on Capitol Hill were quick to disabuse them of that notion, as this Politico report shows:\n\nSenior House Republican aides and lawmakers say they do not plan to hold votes on many of the agenda items the party plans to unveil -- such as a health care plan to replace Obamacare, or tax reform -- because of a tight legislative calendar over the next few months and the reality that none of the bills would be signed by the president, anyway."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        }
    ]
}