{
    "title": "Obama Asks for Prayer on Budget Deal",
    "text": [
        {
            "id": 0,
            "text": "BANGKOK, Thailand - Taking a break from deficit negotiations for a whirlwind tour of southeast Asia, President Obama joked this afternoon as he toured a sacred Buddhist temple that he could use some prayer to help reach a budget deal."
        },
        {
            "id": 1,
            "text": "\"We're working on this budget, we're going to need a lot of prayer for that,\" the president told a monk at the Wat Pho Royal Monastery."
        },
        {
            "id": 2,
            "text": "The president later explained the quip at a joint press conference with Prime Minister Yingluck Shinawatra."
        },
        {
            "id": 3,
            "text": "\"I always believe in prayer,\" he said."
        },
        {
            "id": 4,
            "text": "\"If a Buddhist monk is wishing me well, I'm going to take whatever good vibes he can give me to try to deal with some challenges back home.\""
        },
        {
            "id": 5,
            "text": "Shortly after arriving in Bangkok, Obama, accompanied by Secretary of State Hillary Clinton, toured the Viharn of the Reclining Buddha, one of the most famous sites in Thailand, and the Eastern Viharn Phra."
        },
        {
            "id": 6,
            "text": "Obama and Clinton talked softly with the robed monk as they walked, shoe-less, through the holy temple,\n\nContinuing their private tour through an ornate courtyard known as the Phra Maha Chedi Group Clinton remarked \"what a peaceful place\" it was."
        },
        {
            "id": 7,
            "text": "\"If you have 80,000 people here it's not so peaceful,\" the president noted."
        },
        {
            "id": 8,
            "text": "\"This is kind of a treat.\""
        },
        {
            "id": 9,
            "text": "The president also met and exchanged gifts with ailing King Bhumibol Adulyadej."
        },
        {
            "id": 10,
            "text": "The president greeted the 84-year-old king at the Siriraj hospital, where he has lived since 2009."
        },
        {
            "id": 11,
            "text": "\"It's a great honor to meet with you,\" Obama said."
        },
        {
            "id": 12,
            "text": "\"Thank you so much for taking the time to do this."
        },
        {
            "id": 13,
            "text": "We send greetings from all the people of the United States who are so grateful for the friendship of our two countries and are great admirers of yours - your wisdom and your leadership.\""
        },
        {
            "id": 14,
            "text": "The king gave Obama several gifts including one for the First Lady."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "\"Oh, thank you, Michelle, my wife [will] appreciate it,\" Obama said."
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "\"She'll look very good in that color, Mr. President,\" Clinton remarked."
        },
        {
            "id": 19,
            "text": "In return, the president gave the king a photo album with pictures of all the U.S. presidents and first ladies he has met, starting with Dwight Eisenhower and continuing through George W Bush."
        },
        {
            "id": 20,
            "text": "\"We left the last page blank,\" Obama said, so they could add a photo of themselves."
        }
    ]
}