{
    "title": "Romney calls on Reid to reveal source as fact-check sites challenge tax claim  ",
    "text": [
        {
            "id": 0,
            "text": "Mitt Romney called on Harry Reid Tuesday to reveal the source for his claim that the Republican presidential candidate has not paid taxes for 10 years, stepping up pressure as two major fact-check sites ruled Reid had no basis for the \"incendiary\" allegation."
        },
        {
            "id": 1,
            "text": "Romney, in an interview with Fox News, said he doesn't believe Reid has a credible source but urged the Senate Democratic leader to reveal who it is."
        },
        {
            "id": 2,
            "text": "\"I don't really believe that he's got any kind of a credible source,\" Romney said."
        },
        {
            "id": 3,
            "text": "\"I don't know who gave him this line of reasoning, whether it came from the White House or the DNC or a staffer, but he ought to say where it came from, and then we can find out whether that person has any credibility."
        },
        {
            "id": 4,
            "text": "I know they don't.\""
        },
        {
            "id": 5,
            "text": "He said Reid also has \"lost a lot of credibility.\""
        },
        {
            "id": 6,
            "text": "Romney's latest comments came as two major fact-check sites knocked down Reid's comments, which the senator amplified by repeating them last week on the Senate floor."
        },
        {
            "id": 7,
            "text": "Reid has said his source is an investor with Romney's former venture capital company Bain."
        },
        {
            "id": 8,
            "text": "But PolitiFact wrote that it is \"far-fetched\" to believe Romney paid no taxes for 10 years."
        },
        {
            "id": 9,
            "text": "Further, the article stated the obvious -- \"Reid has produced no evidence to back up his claim other than attribution to a shadowy anonymous source.\"\n\nPolitiFact concluded: \"Reid has made an extreme claim with nothing solid to back it up."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "\"They gave the accusation a \"Pants on Fire!\" rating."
        },
        {
            "id": 12,
            "text": "The Washington Post's fact-check column, too, gave Reid's remark the equivalent of a \"Pants on Fire!\" score."
        },
        {
            "id": 13,
            "text": "The Post gave it \"four Pinocchios,\" which is the newspaper's score for a claim they knock down."
        },
        {
            "id": 14,
            "text": "\"Without seeing Romney's taxes, we cannot definitively prove Reid incorrect."
        },
        {
            "id": 15,
            "text": "But tax experts say his claim is highly improbable."
        },
        {
            "id": 16,
            "text": "Reid also has made no effort to explain why his unnamed source would be credible."
        },
        {
            "id": 17,
            "text": "So, in the absence of more information, it appears he has no basis to make his incendiary claim,\" the Post wrote."
        },
        {
            "id": 18,
            "text": "The White House, meanwhile, has distanced itself from Reid's remark."
        },
        {
            "id": 19,
            "text": "Press Secretary Jay Carney said Monday the Senate Democratic leader \"speaks for himself.\""
        },
        {
            "id": 20,
            "text": "House Democratic Leader Nancy Pelosi, though, has defended Reid."
        },
        {
            "id": 21,
            "text": "She told The Huffington Post that Reid made a \"true\" statement."
        },
        {
            "id": 22,
            "text": "\"Somebody told him."
        },
        {
            "id": 23,
            "text": "It is a fact,\" she said."
        },
        {
            "id": 24,
            "text": "Like other Democratic officials, Pelosi said Romney can either prove or disprove the claim by releasing more tax returns."
        }
    ]
}