{
    "title": "Trump Vetoes Bill To End U.S. Support For Saudis In Yemen War",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump on Tuesday vetoed a resolution to end U.S. support of Saudi Arabia’s military campaign in Yemen, which has been blamed for tens of thousands of deaths in the region."
        },
        {
            "id": 1,
            "text": "“This resolution is an unnecessary, dangerous attempt to weaken my constitutional authorities, endangering the lives of American citizens and brave service members, both today and in the future,” Trump said in a statement accompanying his veto."
        },
        {
            "id": 2,
            "text": "The Senate passed the resolution by a slim majority in March, and the House did the same earlier this month."
        },
        {
            "id": 3,
            "text": "It was a rare use of the War Powers Resolution of 1973, which gives Congress the power to remove military forces from a conflict for which there’s been no formal declaration of war."
        },
        {
            "id": 4,
            "text": "The measure was passed by a bipartisan group of senators, including seven Republican senators who broke ranks with their party leaders."
        },
        {
            "id": 5,
            "text": "Senate Majority Leader Mitch McConnell (R-Ky.) had urged lawmakers to reject the resolution at the time, saying it was “inappropriate and counterproductive.”"
        },
        {
            "id": 6,
            "text": "The veto was Trump’s second of his administration."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "He issued his first last month, blocking Congress’ attempt to end a “national emergency” declaration meant to obtain funds to build a wall along the southern border."
        },
        {
            "id": 9,
            "text": "The move on Tuesday drew a quick backlash of rebukes, including from Sen. Bernie Sanders (I-Vt.), who has long been critical of the Yemeni conflict."
        },
        {
            "id": 10,
            "text": "“I am disappointed, but not surprised, that Trump has rejected the bi-partisan resolution to end U.S. involvement in the horrific war in Yemen,” Sanders, who is running for the Democratic nomination for president in 2020, said in a statement."
        },
        {
            "id": 11,
            "text": "“The people of Yemen desperately need humanitarian help, not more bombs.”"
        },
        {
            "id": 12,
            "text": "House Speaker Nancy Pelosi (D-Calif.) lambasted the president, saying he had “cynically chosen to contravene a bipartisan, bicameral vote of the Congress.”"
        },
        {
            "id": 13,
            "text": "This conflict must end, now."
        },
        {
            "id": 14,
            "text": "The House of Representatives calls on the President to put peace before politics, and work with us to advance an enduring solution to end this crisis and save lives."
        },
        {
            "id": 15,
            "text": "Sen. Chris Murphy (D-Conn.), who sits on the chamber’s Foreign Relations Committee, also condemned the move as a “huge mistake.”"
        },
        {
            "id": 16,
            "text": "“The civil war in Yemen is a humanitarian crisis, and we have no business still being a part of it,” he said in a statement."
        },
        {
            "id": 17,
            "text": "“I’ve been calling on the United States to get out of the civil war in Yemen for the last four years, and this veto won’t stop me.”"
        },
        {
            "id": 18,
            "text": "Trump’s apparent fondness for Saudi Arabia has drawn the ire of many lawmakers, particularly after last year’s killing of Jamal Khashoggi, a columnist for The Washington Post."
        },
        {
            "id": 19,
            "text": "American intelligence agencies determined that the order to murder Khashoggi at the Saudi Consulate in Istanbul came directly from Saudi Crown Prince Mohammed bin Salman."
        },
        {
            "id": 20,
            "text": "But the president has refused to condemn the crown prince for his role, instead saying that he stood by the Saudis."
        },
        {
            "id": 21,
            "text": "“It could very well be that the crown prince had knowledge of this tragic event — maybe he did and maybe he didn’t,” Trump said in November."
        },
        {
            "id": 22,
            "text": "“In any case, our relationship is with the Kingdom of Saudi Arabia.”"
        },
        {
            "id": 23,
            "text": "America supplies billions in arms sales to Riyadh, and the U.S. military has helped train the Saudi air force while advising the country on its war effort, according to a December report in The New York Times."
        },
        {
            "id": 24,
            "text": "In Washington, lawmakers have grown increasingly concerned about the deaths of civilians during airstrikes in Yemen, a toll that has continued to rise."
        },
        {
            "id": 25,
            "text": "The war in Yemen has caused the worst humanitarian crisis in the world."
        },
        {
            "id": 26,
            "text": "The United Nations estimated in February that 24 million people ― about 80% of Yemen’s population ― were in need of assistance and that hundreds of thousands were at risk of starvation due to a famine."
        },
        {
            "id": 27,
            "text": "“We remain keenly aware that a sustainable peace ... would be the most effective remedy for the humanitarian crisis in Yemen,” Mark Lowcock, the U.N. humanitarian chief, said this week."
        },
        {
            "id": 28,
            "text": "“Without peace, we will simply go on treating the symptoms of this crisis, instead of addressing the cause."
        },
        {
            "id": 29,
            "text": "Let me summarize: Violence has again increased."
        },
        {
            "id": 30,
            "text": "The relief operation is running out of money."
        },
        {
            "id": 31,
            "text": "Barring changes, the end is nigh.”"
        },
        {
            "id": 32,
            "text": ""
        }
    ]
}