{
    "title": "ISIS fight: Congress to vote on arming Syrian rebels",
    "text": [
        {
            "id": 0,
            "text": "Story highlights The House could vote this week on the arming and training of Syrian rebels Vetted elements of Syrian opposition forces could receive equipment to fight ISIS Approval would be tied to a must-pass spending bill that expires in December Congress is about to break for the midterm election campaigning\n\nWashington CNN —\n\nHouse Republicans will require the White House to provide a detailed plan for arming and training Syrian rebels to fight ISIS in exchange for giving it the OK to carry out the mission."
        },
        {
            "id": 1,
            "text": "The provision – which is expected to be added to a must-pass spending bill funding the government through mid-December and could face a vote as early as Wednesday in the House – would require the Secretary of Defense to explain how the Pentagon is vetting Syrian opposition groups."
        },
        {
            "id": 2,
            "text": "The administration would need to submit its plan to Congress at least 15 days before the Pentagon begins training fighters or supplying them with weapons."
        },
        {
            "id": 3,
            "text": "Regular updates, every 90 days, would also be required."
        },
        {
            "id": 4,
            "text": "Yet another beheading."
        },
        {
            "id": 5,
            "text": "What’s the world going to do about ISIS?"
        },
        {
            "id": 6,
            "text": "The House GOP plan also makes it clear that the new authority would not include approval for any U.S. combat troops on the ground."
        },
        {
            "id": 7,
            "text": "Even though House Republicans want to put restrictions on the President’s announced plans to go after ISIS, members of both parties have also made it clear they don’t plan to stay in town to pass a formal military use of force authorization like the one approved after the 9/11 attacks in 2001."
        },
        {
            "id": 8,
            "text": "The tug of the midterm elections is strong, despite sentiment among some lawmakers in both the House and Senate who think it’s critically important for Congress to sign off on the broader war effort."
        },
        {
            "id": 9,
            "text": "“I think this is really serious and that it deserves our being in town and taking it up and debating it,” said Sen. Susan Collins, R-Maine."
        },
        {
            "id": 10,
            "text": "Who is doing what in the coalition battle against ISIS?"
        },
        {
            "id": 11,
            "text": "The House bill approving training for the Syrian rebels would expire in mid-December, at the same time the government funding bill would need to be extended."
        },
        {
            "id": 12,
            "text": "That concerned Sen. Robert Menendez, a New Jersey Democrat who chairs the Foreign Relations Committee."
        },
        {
            "id": 13,
            "text": "“That doesn’t make sense to me,” Menendez said."
        },
        {
            "id": 14,
            "text": "“You want to send the message to the Sunni world, you want to send a message to those rebels you want to fight for you, that we’re not going to cut it off in December.”"
        },
        {
            "id": 15,
            "text": "A House GOP Armed Services Committee aide told reporters that Republicans would ensure the training and weapons program would be extended past December."
        },
        {
            "id": 16,
            "text": "Senior Obama officials will testify before the Senate this week."
        },
        {
            "id": 17,
            "text": "Secretary of Defense Chuck Hagel and Chairman of the Joint Chiefs Martin Dempsey will testify before the Armed Services Committee on Tuesday, and Secretary of State John Kerry will be on Capitol Hill Wednesday and Thursday."
        },
        {
            "id": 18,
            "text": "Is Obama’s plan for confronting ISIS legal?"
        },
        {
            "id": 19,
            "text": "The Senate will quickly pick up the spending bill, with the accompanying OK to arm the rebels, as soon as the House passes it, according to a Democratic leadership aide."
        },
        {
            "id": 20,
            "text": "The vote could be this week or early next week when the Senate is scheduled to adjourn until after the election."
        },
        {
            "id": 21,
            "text": "Lawmakers and senior aides predict broad bipartisan for the measure in the Senate."
        },
        {
            "id": 22,
            "text": "“I think, by and large, you’ll see a big vote in the Congress for this,” said Sen. John Thune, R-South Dakota, the third-ranking Senate Republican said on MSNBC Monday."
        },
        {
            "id": 23,
            "text": "“Both sides recognize something has to be done."
        },
        {
            "id": 24,
            "text": "We’ve got to be aggressive."
        },
        {
            "id": 25,
            "text": "We’ve got to be decisive."
        },
        {
            "id": 26,
            "text": "And we’ve got to rally the world behind us.”"
        },
        {
            "id": 27,
            "text": "ISIS Fast Facts"
        },
        {
            "id": 28,
            "text": "However, there are numerous outspoken detractors in both parties who are critical of the proposal for a variety of reasons."
        },
        {
            "id": 29,
            "text": "Some, like Sen. Mark Kirk, R-Illinois, would prefer to debate the broader mission and have Congress vote up-or-down on whether to go to war with ISIS."
        },
        {
            "id": 30,
            "text": "In a CNN interview he blamed “wimpishness” as a critical factor affecting his colleagues who would prefer to leave town without that tough vote."
        },
        {
            "id": 31,
            "text": "“Congress is very risk adverse."
        },
        {
            "id": 32,
            "text": "When you put a difficult issue before senators and congressmen they don’t want to be forced to decide."
        },
        {
            "id": 33,
            "text": "In this case they should be forced to decide."
        },
        {
            "id": 34,
            "text": "We should have a vote on this mission."
        },
        {
            "id": 35,
            "text": "The American people should see their representatives in Congress make a decision on a critical national security question,” he said\n\nOthers, like Sen. Rand Paul, R-Kentucky, oppose arming the rebels out of fear the weapons will fall into the wrong hands."
        },
        {
            "id": 36,
            "text": "Sen. Lindsey Graham, R-South Carolina, and other Senate hawks want a much more aggressive strategy to destroy ISIS than the one the President is pursuing."
        },
        {
            "id": 37,
            "text": "Senate Majority Leader Harry Reid set the tone for many members of his party when he argued last week the President has the authority he needs to carry out the airstrikes underway against ISIS, and that it would be a mistake for Congress to be “rash” in its decision making."
        },
        {
            "id": 38,
            "text": "“We have to be deliberate in what we do,” he said."
        },
        {
            "id": 39,
            "text": "“Let’s just not rush into things.”"
        }
    ]
}