{
    "title": "Bipartisan Senate Group Reaches Deal on Infrastructure to Present to Biden",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "A bipartisan group of ten senators reached a deal on an infrastructure plan on Thursday to present to the Biden administration for further negotiations."
        },
        {
            "id": 2,
            "text": "The plan includes about $579 billion in new spending and, including expected future spending, would cost $974 billion over five years or $1.2 trillion over eight years, multiple outlets reported."
        },
        {
            "id": 3,
            "text": "The ten senators said there would be no tax increases."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "Senators involved in the bipartisan group discussing infrastructure have reached a bipartisan agreement per statement."
        },
        {
            "id": 6,
            "text": "“This investment would be fully paid for and not include tax increases,” statement reads."
        },
        {
            "id": 7,
            "text": "pic.twitter.com/NTHZ6V7vsw — Jack Turman III (@jackturmanIII) June 10, 2021\n\n“Our group — comprised of 10 Senators, 5 from each party — has worked in good faith and reached a bipartisan agreement on a realistic, compromise framework to modernize our nation’s infrastructure and energy technologies."
        },
        {
            "id": 8,
            "text": "This investment would be fully paid for and not include tax increases,” the group said in a statement."
        },
        {
            "id": 9,
            "text": "Advertisement\n\nAdvertisement"
        },
        {
            "id": 10,
            "text": "The group includes Republican senators Mitt Romney, Susan Collins, Lisa Murkowski, Bill Cassidy, and Rob Portman."
        },
        {
            "id": 11,
            "text": "Democrats in the group are Kyrsten Sinema, Joe Manchin, Jeanne Shaheen, Mark Warner, and Jon Tester."
        },
        {
            "id": 12,
            "text": "The announcement comes after President Biden cut off negotiations with Senator Shelley Moore Capito (R., W.Va.) on an infrastructure plan."
        },
        {
            "id": 13,
            "text": "White House press secretary Jen Psaki said Biden expressed “disappointment” that Republicans were not willing to raise their offer by more than $150 billion, after the president indicated he could reduce the plan by over $1 trillion."
        },
        {
            "id": 14,
            "text": "Biden announced a roughly $2 trillion plan in April that would fund upgrades for highways, bridges, and other U.S. infrastructure as well as provide funding toward a national network of charging stations for electric vehicles."
        },
        {
            "id": 15,
            "text": "Republicans have opposed the price tag of the effort, with Senate Minority Leader Mitch McConnell (R., Ky.) warning against “whack[ing] the economy with major tax increases or run up the national debt even more.”"
        },
        {
            "id": 16,
            "text": ""
        }
    ]
}