{
    "title": "Senate passes bill to make Juneteenth a federal holiday",
    "text": [
        {
            "id": 0,
            "text": "“It was hugely significant, and it did happen fast."
        },
        {
            "id": 1,
            "text": "A lot of us never thought we would see this day."
        },
        {
            "id": 2,
            "text": "It’s a day of rejoicing, it’s a day of hallelujah,” Rep. Marc Veasey, another Texas Democrat, said in an interview shortly after the vote."
        },
        {
            "id": 3,
            "text": "“For me, it’s a lot of history."
        },
        {
            "id": 4,
            "text": "It symbolizes that we’ve come a long way and we have a lot more work to do.”"
        },
        {
            "id": 5,
            "text": "House Majority Leader Steny Hoyer had announced Wednesday morning that the chamber would bring the measure to the floor for a vote, surprising — and delighting — many Democrats with the speed of the process."
        },
        {
            "id": 6,
            "text": "“Black history is American history, and I am proud that Congress is following the lead of the Congressional Black Caucus in reaffirming that sacred principle — because we can’t change the future if we can’t acknowledge the past,” Congressional Black Caucus Chairwoman Joyce Beatty said in a statement after the vote."
        },
        {
            "id": 7,
            "text": "Sponsored by Markey and cosponsored by a bipartisan group of 60 senators, the legislation passed the Senate on Tuesday by unanimous consent, meaning no lawmaker objected to its approval."
        },
        {
            "id": 8,
            "text": "“Making Juneteenth a federal holiday is a major step forward to recognize the wrongs of the past — but we must continue to work to ensure equal justice and fulfill the promise of the Emancipation Proclamation and our Constitution,” Senate Majority Leader Chuck Schumer said in a statement Tuesday after its passage."
        },
        {
            "id": 9,
            "text": "Juneteenth, celebrated annually on June 19 and already recognized as a holiday in 45 states, commemorates the end of slavery in Confederate states."
        },
        {
            "id": 10,
            "text": "While President Abraham Lincoln issued the Emancipation Proclamation to free slaves on Jan. 1, 1863, it took another two and a half years before some 250,000 slaves in Texas learned of their freedom on June 19, 1865."
        },
        {
            "id": 11,
            "text": "Slavery in the U.S. was formally outlawed when the 13th Amendment was ratified in December 1865."
        }
    ]
}