{
    "title": "The Presidential Bid Of Ted Cruz, The Reddest Meat Of The Right",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON --"
        },
        {
            "id": 1,
            "text": "The audience should have belonged to Sen. Rand Paul."
        },
        {
            "id": 2,
            "text": "After all, the thousand or so clean-cut millennials in the D.C.-area ballroom were members of Young Americans for Liberty, a student group founded by Paul’s father, former Rep. Ron Paul."
        },
        {
            "id": 3,
            "text": "The kids chuckled appreciatively as Rand unspooled his tart, college-dorm-room disdain for government."
        },
        {
            "id": 4,
            "text": "But he didn’t fire them up."
        },
        {
            "id": 5,
            "text": "Neither did Utah Sen. Mike Lee, the thoughtful-sounding son of a Reagan-era U.S. solicitor general."
        },
        {
            "id": 6,
            "text": "The man who got them cheering, who got them going, who got them roaring with derisive laughter and bubbling with anger at the depredations of liberals was: Sen. Ted Cruz."
        },
        {
            "id": 7,
            "text": "Striding the stage like Elvis (if Elvis had been a college debater at Princeton and a brilliant student at Harvard Law), Cruz was the firebrand whom the conserva-geeks wanted to either meet or become."
        },
        {
            "id": 8,
            "text": "That was more than a year ago, when the first-term senator from Texas was still in the hard-right afterglow of his bid to shut down the government in a vain (in both senses) attempt to stop Obamacare."
        },
        {
            "id": 9,
            "text": "Much of the rest of the country (including Republican leaders in Congress) viewed Cruz as a vaguely scary renegade, and the GOP establishment’s official grumpy grandpa, Sen. John McCain (Ariz.), dismissed him as a “wacko bird.”"
        },
        {
            "id": 10,
            "text": "But the Young Americans for Liberty loved his loathing of the party elders, and his determination to shove a stick between the spokes of the System."
        },
        {
            "id": 11,
            "text": "And it is that emotion -- across-the-board opposition to every “liberal” idea that exists, and disgust with the System in all of its manifestations -- that Cruz hopes to tap for the energy he thinks can somehow lift him to the presidency."
        },
        {
            "id": 12,
            "text": "Uncorked anger doesn’t usually win presidential nominations, let alone presidencies."
        },
        {
            "id": 13,
            "text": "People want hope and uplift in the White House and not just expressions of outrage."
        },
        {
            "id": 14,
            "text": "The president is the person who is supposed to make things work."
        },
        {
            "id": 15,
            "text": "To some, the 44-year-old Cruz gives off a vaguely scary aura of cheerful menace."
        },
        {
            "id": 16,
            "text": "For now, as Cruz officially announces his 2016 bid, he is nearly an asterisk in the early GOP polls, well behind somewhat less apocalyptic personalities, such as Wisconsin Gov. Scott Walker and former Florida Gov. Jeb Bush."
        },
        {
            "id": 17,
            "text": "But there are several reasons to take Cruz seriously."
        },
        {
            "id": 18,
            "text": "The first is that his angry approach may fit the times."
        },
        {
            "id": 19,
            "text": "Even as the voters depend more and more on government and politics -- perhaps for that very reason -- their regard for the machinery of both continues to plummet to new lows."
        },
        {
            "id": 20,
            "text": "Cruz doesn’t like either party, and neither do the American people."
        },
        {
            "id": 21,
            "text": "And he has the tools with which to attack."
        },
        {
            "id": 22,
            "text": "Cruz is a driven, laser-focused character."
        },
        {
            "id": 23,
            "text": "Even his liberal law professors at Harvard regarded him with a mix of awe and dread."
        },
        {
            "id": 24,
            "text": "He was grown in the intellectual petri dish of second-generation combat thinking about conservative strategy, led by the Federalist Society."
        },
        {
            "id": 25,
            "text": "Cruz beat the establishment in Texas like a drum."
        },
        {
            "id": 26,
            "text": "They hate him for it, but he is also going to raise a lot of cash in, yes, Texas."
        },
        {
            "id": 27,
            "text": "He is as pure an across-the-board conservative as it is possible to find in what has to be regarded as the big leagues of politics: culturally, fiscally, in monetary policy, in foreign policy."
        },
        {
            "id": 28,
            "text": "Cruz is triple 7s on the slot machine of issues: anti-abortion, a global-warming mega-skeptic, to the right of Likud on Israel, anti-immigration to the max, big on defense spending, etc."
        },
        {
            "id": 29,
            "text": "He is a libertarian, traditional conservative, war hawk and evangelical Baptist son of a preacher who fled Fidel Castro’s Cuba."
        },
        {
            "id": 30,
            "text": "There are plenty of philosophical and tactical contradictions in Cruz’s construct, but he ignores them all."
        },
        {
            "id": 31,
            "text": "His array of hot-button positions and his hunger combine to make him, on paper, a potential force in the early primary and caucus states, where true believers matter most."
        },
        {
            "id": 32,
            "text": "He is an academic star with two Ivy League degrees."
        },
        {
            "id": 33,
            "text": "Yet he is making the formal announcement of his candidacy at the Falwell family’s evangelical enterprise, Liberty University in Lynchburg, Virginia."
        },
        {
            "id": 34,
            "text": "At Liberty, founded by the late Rev. Jerry Falwell, they don’t teach evolution; they teach what their website calls a “robust, Young-Earth creationist view of Earth history.”"
        },
        {
            "id": 35,
            "text": "Cruz is an anti-intellectual intellectual, if there is such as thing."
        },
        {
            "id": 36,
            "text": "And that could be just perfect for the Republican Party of today."
        }
    ]
}