{
    "title": "Sandy could delay jobs report ",
    "text": [
        {
            "id": 0,
            "text": "Hurricane Sandy could cause a delay in the release of the highly-anticipated October jobs report set for this Friday."
        },
        {
            "id": 1,
            "text": "The report is normally released at 8:30 a.m. ET the first Friday of the month."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "This month's report is the final reading on the health of the job market before the presidential election."
        },
        {
            "id": 4,
            "text": "The Bureau of Labor Statistics said Monday it hopes to stay on the normal schedule and is working hard to try to do so."
        },
        {
            "id": 5,
            "text": "But because of the shutdown of federal government offices due to the storm Monday, the department is not certain whether it will be able to meet that schedule."
        },
        {
            "id": 6,
            "text": "\"We will assess the situation when the weather emergency is over and notify the press and public of any changes at that time,\" said Gary Steinberg, spokesman for BLS."
        },
        {
            "id": 7,
            "text": "The only other time the monthly jobs report has been delayed was in January, 1996, when a shutdown of the federal government due to a deadlock between the White House and Congress on an operating budget shuttered non-essential government offices."
        },
        {
            "id": 8,
            "text": "The December jobs report did not come out until Jan. 19."
        },
        {
            "id": 9,
            "text": "A delay in the October jobs report could cause a significant outcry."
        },
        {
            "id": 10,
            "text": "When the September jobs report showed a sharp drop in the unemployment rate, some critics of the Obama administration, including former General Electric (GE) CEO Jack Welch, accused BLS of cooking the books in order to make the president look better just before the election."
        },
        {
            "id": 11,
            "text": "Other economists defended the BLS as a group of nonpartisan professionals who would not manipulate the figures for any candidates' benefit."
        },
        {
            "id": 12,
            "text": "But a delay in the report this close to the election, even in the face of a massive storm like Hurricane Sandy, is likely to spark more political complaints."
        }
    ]
}