{
    "title": "Campaigns turn to economy ahead of jobs numbers",
    "text": [
        {
            "id": 0,
            "text": "A day before the Labor Department releases jobs figures for July, the dueling presidential campaigns turned their attention back to the nation's fragile economy, each blasting the other as bad for middle class Americans."
        },
        {
            "id": 1,
            "text": "President Barack Obama's campaign used a 30-second television ad to hit Mitt Romney for his tax plan, saying in the spot that his Republican challenger's proposals would increase taxes on middle class Americans while lowering tax rates for the wealthy."
        },
        {
            "id": 2,
            "text": "The campaign said the ad would run in New Hampshire, Virginia, North Carolina, Florida, Ohio, Iowa, Colorado, Nevada – all battlegrounds in November's election."
        },
        {
            "id": 3,
            "text": "\"You work hard, stretch every penny,\" the narrator in the spot says."
        },
        {
            "id": 4,
            "text": "\"But chances are you pay a higher tax rate than him."
        },
        {
            "id": 5,
            "text": "Mitt Romney made $20 million in 2010 but paid only 14% in taxes."
        },
        {
            "id": 6,
            "text": "Probably less than you."
        },
        {
            "id": 7,
            "text": "Now he has a plan that would give millionaires another tax break, and raises taxes on middle class families on up to $2,000 a year."
        },
        {
            "id": 8,
            "text": "Mitt Romney's middle class tax increase."
        },
        {
            "id": 9,
            "text": "He pays less, you pay more.\""
        },
        {
            "id": 10,
            "text": "In one part of the ad, a picture of Romney in front of Donald Trump's airplane is shown."
        },
        {
            "id": 11,
            "text": "The shot was taken in May, when Trump headlined a fund-raiser for Romney in Las Vegas."
        },
        {
            "id": 12,
            "text": "The ad utilizes the same message Obama used on Wednesday, when he told crowds at campaign rallies in Ohio that Romney's tax plan would only benefit millionaires."
        },
        {
            "id": 13,
            "text": "\"Here's the thing, he's not asking you to contribute more to pay down the deficit, or to invest in our kids' education."
        },
        {
            "id": 14,
            "text": "He's asking you to pay more so that people like him can get a tax cut,\" Obama said at a campaign event in Mansfield."
        },
        {
            "id": 15,
            "text": "Obama used his speeches to highlight a new study by the Urban Institute-Brookings Institution Tax Policy Center that concluded Mitt Romney's tax proposals would provide large tax cuts to the very wealthy while increasing the tax burden on the lower and middle classes."
        },
        {
            "id": 16,
            "text": "The Romney campaign quickly pushed back, pointing out that one of the study's three authors used to work for the Obama White House."
        },
        {
            "id": 17,
            "text": "Adam Looney, now a senior fellow of The Hamilton Project at the Brookings Institution, served as senior economist for public finance and tax policy with the President's Council of Economic Advisers from 2009 to 2010."
        },
        {
            "id": 18,
            "text": "Romney's campaign also argued that the analysis was flawed because it did not account for additional revenue that would result from a reduction in the corporate tax rate - another part of the candidate's plan."
        },
        {
            "id": 19,
            "text": "Romney's campaign was also pushing their candidate's economic message Thursday as the candidate returned to the campaign trail after a week-long foreign swing."
        },
        {
            "id": 20,
            "text": "Romney's team said they would hold 24 \"Strengthening the Middle Class\" events over the next two days in battleground states meant to educate voters about the presumptive GOP nominee's economic plan."
        },
        {
            "id": 21,
            "text": "Romney's team also pushed out a web video in their \"These Hands\" series, highlighting small business owners pushing back on Obama's remark in early July that successful businesses didn't get that way without governmental support."
        },
        {
            "id": 22,
            "text": "The latest video – \"These Hands: Virginia\" – features the owner of an office supply company saying she was \"insulted\" by Obama's remarks, which came at a campaign rally in Roanoke on July 13."
        },
        {
            "id": 23,
            "text": "Obama said: \"If you are successful, somebody along the line gave you some help."
        },
        {
            "id": 24,
            "text": "There was a great teacher somewhere in your life."
        },
        {
            "id": 25,
            "text": "Somebody helped to create this unbelievable American system that we have that allowed you to thrive."
        },
        {
            "id": 26,
            "text": "Somebody invested in roads and bridges."
        },
        {
            "id": 27,
            "text": "If you've got a business, you didn't build that."
        },
        {
            "id": 28,
            "text": "Somebody else made that happen."
        },
        {
            "id": 29,
            "text": "The Internet didn't get invented on its own."
        },
        {
            "id": 30,
            "text": "Government research created the Internet so that all the companies could make money off the Internet.\""
        },
        {
            "id": 31,
            "text": "In the Romney campaign video, the business owner Melissa Ball says Obama's comments, along with his policies, reflect a misunderstanding of small business."
        },
        {
            "id": 32,
            "text": ""
        },
        {
            "id": 33,
            "text": "\"The comments that the president's plan has worked, I haven't seen it work,\" Ball says."
        },
        {
            "id": 34,
            "text": "\"I've seen customers and companies go out of business."
        },
        {
            "id": 35,
            "text": "I've seen friends lose jobs."
        },
        {
            "id": 36,
            "text": "It certainly doesn't feel like it's working."
        },
        {
            "id": 37,
            "text": "We need a president who understands business.\""
        },
        {
            "id": 38,
            "text": "Romney's team has made similar videos using small business owners in Nevada and Ohio."
        },
        {
            "id": 39,
            "text": "Obama's team has pushed back on Republican attacks using the clip from Roanoke, saying the president is being taken out of context."
        },
        {
            "id": 40,
            "text": "Obama returns to Virginia Thursday for a campaign rally in Leesburg, an outer suburb of Washington, D.C."
        },
        {
            "id": 41,
            "text": "He won Loudon County, which includes Leesburg, by 8 points in 2008."
        }
    ]
}