{
    "title": "Republicans gush over Klobuchar",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "Republicans gush over Klobuchar GOP senators praised the Minnesota Democrat for her deal-cutting ways — even as they worried it could doom her presidential bid."
        },
        {
            "id": 2,
            "text": "Amy Klobuchar has an unusual constituency behind her as she launches her run for president: Senate Republicans."
        },
        {
            "id": 3,
            "text": "In a Democratic Caucus filled with presidential hopefuls taking a hard line against Donald Trump’s presidency, the Minnesota senator’s brand of pragmatic politics stands out."
        },
        {
            "id": 4,
            "text": "And numerous Republicans are raving about Klobuchar — her personality, her respect for the other party, even her competitiveness in a general election."
        },
        {
            "id": 5,
            "text": "In fact, a dozen GOP senators were so effusive in interviews this month that some worried they might damage her candidacy in a Democratic nomination fight that has many candidates embracing the party’s left flank."
        },
        {
            "id": 6,
            "text": "“I hope I’m not condemning her nascent run for the presidency,” Sen. John Cornyn (R-Texas) said, praising Klobuchar."
        },
        {
            "id": 7,
            "text": "“She’s too reasonable, too likable, too nice.”"
        },
        {
            "id": 8,
            "text": "“She wants to achieve a solution and I would hope that’s not a disqualifying thing for someone who would like to be president,” said Sen. Roy Blunt (R-Mo.), who runs the Senate Rules Committee, on which Klobuchar serves as ranking member."
        },
        {
            "id": 9,
            "text": "“I like her a lot and hope that’s not harmful to her.”"
        },
        {
            "id": 10,
            "text": "The three-term senator is no Joe Manchin."
        },
        {
            "id": 11,
            "text": "Klobuchar votes with her party when it comes to big issues like abortion and immigration."
        },
        {
            "id": 12,
            "text": "She’s embraced progressives’ ambitious “Green New Deal” and is rarely a headache for Democratic leadership."
        },
        {
            "id": 13,
            "text": "But she’s also established herself as someone who can cut deals with Republicans and occasionally tacks to the center."
        },
        {
            "id": 14,
            "text": "It’s a combination that that could give her a boost among primary voters seeking a candidate with bipartisan bona fides if it doesn’t doom her with a party running to the left."
        },
        {
            "id": 15,
            "text": "In a brief interview, Klobuchar made clear she doesn’t compromise just for compromise’s sake but acknowledged it’s something she seeks as a senator."
        },
        {
            "id": 16,
            "text": "“Often times I’ll stand my ground,” she said."
        },
        {
            "id": 17,
            "text": "“But if I can find common ground to get something done, I do.”"
        },
        {
            "id": 18,
            "text": "Last year, she reached an agreement with Blunt to combat sexual harassment on Capitol Hill that drew ire from liberals."
        },
        {
            "id": 19,
            "text": "And she’s never bought into purity contests, finding herself at odds with other presidential candidates on surveillance issues, a budget deal and some Trump nominees, like Commerce Secretary Wilbur Ross."
        },
        {
            "id": 20,
            "text": "Klobuchar also was the Democratic presidential aspirant most involved with a centrist Senate effort last year to address the plight of hundreds of thousands of immigrants who had been brought to the country illegally as children."
        },
        {
            "id": 21,
            "text": "She was in a series of meetings intended to forge a bipartisan immigration deal that came up short."
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": "Sen. Thom Tillis (R-N.C.). said Klobuchar was one of the “more reasonable voices” in the room."
        },
        {
            "id": 24,
            "text": "“She’s a person of character and great ability,” Sen. Johnny Isakson (R-Ga.), a fellow negotiator, said."
        },
        {
            "id": 25,
            "text": "“She’s the whole package."
        },
        {
            "id": 26,
            "text": "That’s probably too nice.”"
        },
        {
            "id": 27,
            "text": "It’s not just on major legislation that Klobuchar collaborates with the GOP."
        },
        {
            "id": 28,
            "text": "She runs the Congressional Coalition on Adoption Institute with Blunt and has teamed with Sen. Shelley Moore Capito (R-W.Va.) on combating eating disorders and expanding rural broadband."
        },
        {
            "id": 29,
            "text": "She’s worked with conservative Sen. Ron Johnson (R-Wis.) on improving a bridge between their states and pushed through legislation with Tillis to treat veterans exposed to toxic burn pits in combat zones."
        },
        {
            "id": 30,
            "text": "Beyond her ideology and legislative acumen, Klobuchar offers a stylistic contrast from the sharp-edged politics of Sens. Bernie Sanders (I-Vt.),"
        },
        {
            "id": 31,
            "text": "Kirsten Gillibrand (D-N.Y.) and Elizabeth Warren (D-Mass.) and the attention-grabbing inquisitions of Sens. Kamala Harris (D-Calif.) and Cory Booker (D-N.J.)."
        },
        {
            "id": 32,
            "text": "Republicans have said Klobuchar was one of the Democrats on the Judiciary Committee who was most respectful when questioning then-Supreme Court nominee Brett Kavanaugh last year about sexual assault allegations, even as Klobuchar found herself being asked by the nominee whether she had a drinking problem."
        },
        {
            "id": 33,
            "text": "But befitting her “Minnesota nice” style, Klobuchar moved on and didn’t linger on the confrontation."
        },
        {
            "id": 34,
            "text": "“Her questioning [on] the Judiciary Committee is excellent,” Sen. Susan Collins (R-Maine) said."
        },
        {
            "id": 35,
            "text": "“Her questions can be thoughtful and respectful."
        },
        {
            "id": 36,
            "text": "Still probing, they’re not easy, but it’s a good model.”"
        },
        {
            "id": 37,
            "text": "“Of the folks that are running, she’s probably more responsible,” Senate Agriculture Chairman Pat Roberts (R-Kan.) said."
        },
        {
            "id": 38,
            "text": "Klobuchar’s Republican pals say that her political abilities would be imposing in a general election against Trump, noting her strong appeal in the Midwest — the region that tipped the presidency to Trump in 2016."
        },
        {
            "id": 39,
            "text": "Some Democrats are “going to be looking for somebody that is actually going to be electable in a general election."
        },
        {
            "id": 40,
            "text": "And I think it’s a spot she could fill,” said Sen. John Thune of South Dakota, the GOP whip."
        },
        {
            "id": 41,
            "text": "“I don’t like to give Democrats advice"
        },
        {
            "id": 42,
            "text": "but they’ve got to be able to carry the Midwest,” Collins said."
        },
        {
            "id": 43,
            "text": "It’s not just Republican senators who are fans."
        },
        {
            "id": 44,
            "text": "George Will, a conservative columnist for The Washington Post, penned an op-ed recently that described Klobuchar as “the person perhaps best equipped to send the current president packing,” pointing to her Midwest roots as an asset for Democrats and praising her even-keeled temperament."
        },
        {
            "id": 45,
            "text": "However, Klobuchar’s “Minnesota nice” reputation has taken a hit in recent days amid multiple reports she has mistreated staff."
        },
        {
            "id": 46,
            "text": "Regardless, the very qualities that have earned Klobuchar so much love on the right could be liabilities in a Democratic primary."
        },
        {
            "id": 47,
            "text": "Cornyn said Klobuchar “doesn’t strike me as ideological enough to be competitive.”"
        },
        {
            "id": 48,
            "text": "Tillis said she has a “legitimately centrist argument to make, but she’s going to find herself in a field that’s going to out-liberal themselves.”"
        },
        {
            "id": 49,
            "text": "“She’ll probably have a pretty hard time in the nominating process,” Thune said."
        },
        {
            "id": 50,
            "text": "Yet Democrats aren’t so sure."
        },
        {
            "id": 51,
            "text": "For one, many Democrats believe Klobuchar, former Vice President Joe Biden or Montana Gov. Steve Bullock could offer a compelling contrast to the more liberal candidates in the field."
        },
        {
            "id": 52,
            "text": "Members of her caucus have said Klobuchar is results-driven, which inevitably means embracing bipartisanship."
        },
        {
            "id": 53,
            "text": "“She’s someone that’s more oriented toward getting some things done."
        },
        {
            "id": 54,
            "text": "And in order to do that you’ve got to work with both sides."
        },
        {
            "id": 55,
            "text": "That’s the arithmetic around here,” Sen. Angus King (I-Maine), who caucuses with the Democrats, said."
        },
        {
            "id": 56,
            "text": "And in early states, bipartisanship might not be a dirty word."
        },
        {
            "id": 57,
            "text": "Even as New Hampshire keeps electing Democrats to Congress, the Granite State also has a popular GOP governor — and allows undeclared voters to participate in either party’s primary."
        },
        {
            "id": 58,
            "text": "“We like our leaders to work together,” Sen. Jeanne Shaheen (D-N.H.) said."
        },
        {
            "id": 59,
            "text": "“That’s probably the No. 1 concern I hear when I go around the state."
        },
        {
            "id": 60,
            "text": "… ‘Why can’t you all work together to address the challenges facing this country?’”"
        }
    ]
}