{
    "title": "Mitch McConnell: Obama will determine how much new Congress works",
    "text": [
        {
            "id": 0,
            "text": "Ending gridlock in Washington will require a change of heart by President Obama, the Senate’s new leader said Wednesday in laying out terms for getting things done on Capitol Hill this year, now that Republicans have majorities in both chambers."
        },
        {
            "id": 1,
            "text": "Sen. Mitch McConnell, the Kentucky Republican who was recognized as majority leader Tuesday, said in a commentary piece for CNN that Congress will need to learn to function, which means senators will need to rebuild trust, cast votes and allow each other to offer tricky amendments."
        },
        {
            "id": 2,
            "text": "But he laid most of the responsibility at the feet of Mr. Obama, saying it’s the president who will decide whether his troops in Congress cooperate with the GOP or throw up roadblocks."
        },
        {
            "id": 3,
            "text": "“It won’t be easy for him."
        },
        {
            "id": 4,
            "text": "The president’s supporters are pressing for militancy, not compromise."
        },
        {
            "id": 5,
            "text": "But they need to understand that democracy isn’t about what you can get away with, it’s about what you can achieve together,” Mr. McConnell wrote."
        },
        {
            "id": 6,
            "text": "Early signs aren’t encouraging."
        },
        {
            "id": 7,
            "text": "The new Congress had barely convened when the White House issued veto promises on two bipartisan bills — one to build the Keystone XL pipeline, and another to change Obamacare’s definition of the work week back from 30 hours to the more traditional 40 hours."
        },
        {
            "id": 8,
            "text": "That second veto threat is the more striking, because it signals that despite Mr. Obama’s earlier vow to work with Congress on tweaks to his health care law, the president does not see any changes that are necessary."
        },
        {
            "id": 9,
            "text": "Mr. Obama has invited congressional leaders to meet next week."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}