{
    "title": "House Expected to Vote on Training Syrian Rebels to Fight ISIS",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — The House will vote on Wednesday on whether to grant President Obama the authority to train and equip Syrian rebels to battle the Islamic State, but Republicans will insist on a detailed accounting of how the program fits into a broader strategy to defeat the militants, Republican leaders said Tuesday."
        },
        {
            "id": 1,
            "text": "House Republican leaders plan to offer the legislation as an amendment to a broader bill to keep the government funded into December and the Export-Import Bank open through June."
        },
        {
            "id": 2,
            "text": "The Senate would try to pass the bill by the end of the week."
        },
        {
            "id": 3,
            "text": "The House speaker, John A. Boehner of Ohio, walking a line between House Republicans who want to do more to confront ISIS and those who do not want to give the president what he wants, said Congress could weigh back in later this year, if Mr. Obama requests broader authority to expand military operations."
        },
        {
            "id": 4,
            "text": "Using an alternative name for the militant group, he added: “If our goal here is to destroy ISIL, we have got to do more than train a few folks in Syria and train a few folks in Iraq and drop some bombs."
        },
        {
            "id": 5,
            "text": "I just don’t know if that’s enough.”"
        },
        {
            "id": 6,
            "text": "The bipartisan effort to aid Mr. Obama’s campaign against the group, also known as ISIS, is colliding with a separate fight among Republicans over the Export-Import Bank, which guarantees loans to overseas customers of American exporters but which conservatives denounce as crony capitalism."
        },
        {
            "id": 7,
            "text": "Some conservative Republicans in the House are eager to oppose any measure that extends the agency’s life but reluctant to vote against the ISIS measure."
        },
        {
            "id": 8,
            "text": "They had hoped the two issues would be broken into separate bills."
        },
        {
            "id": 9,
            "text": "But Republican leaders, eager to get their candidates back on the campaign trail, rebuffed their conservative colleagues."
        },
        {
            "id": 10,
            "text": "They argued that Senate Democratic leaders would have rolled the authorization for the Syrian rebels into the funding and Export-Import Bank bill anyway, then sent the package back to the House for yet another vote."
        },
        {
            "id": 11,
            "text": "Conservatives who wanted a broader authorization of military force against the militants are expected to come up empty as well."
        },
        {
            "id": 12,
            "text": "Instead, House leaders want to leave an imprint on the bill."
        },
        {
            "id": 13,
            "text": "The amendment, as redrafted by the House Armed Services Committee, will require the Obama administration, 15 days before the program begins, to report to Congress how the training and equipping of Syrian rebels fits with a broader strategy to defeat the Islamic State, how the military plans to vet participants and how officers plan to stop the kinds of attacks by pupils on American forces that have plagued training efforts in Afghanistan."
        },
        {
            "id": 14,
            "text": "The bill also mandates that every 90 days, the administration will update Congress on the program’s performance, how many trainees might have gone over to the militants and how trainees are using American military equipment."
        },
        {
            "id": 15,
            "text": "An Armed Services Committee official said the reporting language was similar to oversight requirements imposed on military training efforts in Iraq and Afghanistan."
        },
        {
            "id": 16,
            "text": "Finally, the legislation makes it clear that Congress is authorizing only the training of Syrian rebels and is not giving a green light to a broader use of military force against the Islamic State."
        },
        {
            "id": 17,
            "text": "It includes no additional money for the training effort, but does allow the administration to accept contributions from foreign powers, in cash or in kind."
        },
        {
            "id": 18,
            "text": "How quickly the legislation reaches the president’s desk will be up to Senate Republicans, who could use delaying tactics to stretch the debate out a week."
        },
        {
            "id": 19,
            "text": "Senate Democratic aides say they are counting on Senator Mitch McConnell, the Republican leader in a tough re-election fight in Kentucky, to keep delays to a minimum and allow incumbents to get back to their states."
        },
        {
            "id": 20,
            "text": "Aside from the ISIS and Export-Import Bank fights, both chambers of Congress will use the few remaining days before the election break to pass bills they hope will resonate with voters, but which have no chance of becoming law."
        },
        {
            "id": 21,
            "text": "The House this week will reprise many of the anti-regulatory bills already passed this year as a comprehensive “jobs” package."
        },
        {
            "id": 22,
            "text": "Lawmakers will do the same for a series of bills to cut regulations and promote development for the energy industry."
        },
        {
            "id": 23,
            "text": "The Senate will try to pass a bill to assist college graduates with their student loan debt, and President Petro O. Poroshenko of Ukraine will address both chambers on Thursday."
        }
    ]
}