{
    "title": "GOP shifting on unemployment benefits as jobless numbers swell",
    "text": [
        {
            "id": 0,
            "text": "Faced with staggering unemployment numbers that are likely to remain elevated through the election, Senate Republicans are reversing their positions on ending a federal increase of state unemployment benefits after July."
        },
        {
            "id": 1,
            "text": "Senate Majority Leader Mitch McConnell (R-Ky.) vowed in a conference call with House Republicans last month that Senate Republicans would block the $600 weekly boost to state unemployment benefits from the federal government."
        },
        {
            "id": 2,
            "text": "Also last month, GOP senators involved in planning for a phase four coronavirus relief bill said there was overwhelming support for entirely ending the federal enhancement of state unemployment benefits."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "Now with the national unemployment rate projected to hit or exceed 20 percent, the highest number since the Great Depression, a growing number of GOP senators say the federal government should continue to augment weekly unemployment benefits in some form — though most want it lower than the $600 figure."
        },
        {
            "id": 5,
            "text": "GOP senators fear that the wave of protests, riots and other forms of social unrest that has rocked major cities around the country is linked to the bleak economic picture and that their majority is on the line."
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": "There’s broad agreement within the Senate GOP conference that the $600 per week federal enhancement of state unemployment benefits — a core element of the $2.2. trillion CARES Act — is too generous and provides a disincentive for returning to work."
        },
        {
            "id": 8,
            "text": "But many Republican senators, including members of the leadership, now say the federal government should continue to enhance state unemployment benefits or provide a back-to-work bonus of $450 per week for laid-off workers who return to their jobs."
        },
        {
            "id": 9,
            "text": "One Republican senator familiar with the negotiations said GOP lawmakers have changed their mind on ending the $600 per week federal benefit entirely because they are starting to realize “once the money is out there in the economy its hard to take it back” and that that the nation may be saddled with “long-term unemployment.”"
        },
        {
            "id": 10,
            "text": "Republicans worry that high unemployment numbers heading into the November elections will make it tougher for incumbents, putting the GOP majority at risk."
        },
        {
            "id": 11,
            "text": "Republicans have to protect Senate 23 seats while Democrats only have to defend 12."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": "Sen. Josh Hawley (R-Mo.) warned on Tuesday: \"I don't think we can ignore the fact that this civil unrest is happening against a backdrop of 20-plus percent unemployment.\""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": "Some economic experts, including the Congressional Budget Office, now project that the nation could have double-digit unemployment into 2021."
        },
        {
            "id": 16,
            "text": "Senate Republican Whip John Thune (S.D.) on Wednesday said Republicans are discussing how to handle the looming expiration of the federal augmentation of unemployment benefits."
        },
        {
            "id": 17,
            "text": "“There are several ideas out there,” said Thune."
        },
        {
            "id": 18,
            "text": "Sen. Rob Portman (R-Ohio) has proposed providing a temporary $450 per week bonus on top of regular wages for people who leave the unemployment rolls and find a job."
        },
        {
            "id": 19,
            "text": "Another idea, Thune said, “would be some sort of ramp down, gradual glide path that reduces the amount over time, depending on how long all this lasts.”"
        },
        {
            "id": 20,
            "text": "Thune said the federal increase of weekly unemployment benefits could last “until the end of the year” in some amount or form."
        },
        {
            "id": 21,
            "text": "Asked if Republicans would now support ending the federal enhancement entirely, Thune said, “I don’t see how that works.”"
        },
        {
            "id": 22,
            "text": "“I think the unemployment rate is going to be pretty high maybe for some time,” he said."
        },
        {
            "id": 23,
            "text": "That’s a shift from where Senate Republicans were a few weeks ago."
        },
        {
            "id": 24,
            "text": "Last month, Portman was pushing a plan to provide workers a $450 per week federal benefit on top of wages if they returned to work before July 31, when the federal add-on to unemployment benefits is set to expire."
        },
        {
            "id": 25,
            "text": "Now Portman’s proposal is a leading contender to provide additional federal weekly assistance after July 31."
        },
        {
            "id": 26,
            "text": "Proponents say it would give laid-off workers strong incentive to return to lower-wage jobs."
        },
        {
            "id": 27,
            "text": "The fact that it’s under serious consideration is an acknowledgement that Republicans will be under heavy pressure to continue helping laid-off workers past July."
        },
        {
            "id": 28,
            "text": "Republican senators now say the question isn’t whether the federal government will continue to supplement weekly state unemployment benefits or provide a weekly wage bonus to laid-off workers who find new jobs, but how far they will have to go to reach a deal with Democrats."
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": "One Republican senator familiar with the internal discussions said “we’re probably closer to unifying” around continuing the added weekly federal unemployment benefit at an amount less than $600 than Portman’s idea, which the senator described as “the idea we pay people to go back to work.”"
        },
        {
            "id": 31,
            "text": "This senator added: “Those are the two ideas out there.”"
        },
        {
            "id": 32,
            "text": "“Whether or not we can get to a number that Democrats could also support, I don’t know,” the senator said."
        },
        {
            "id": 33,
            "text": "A growing number of Republicans now say that Congress needs to appropriate more money to enhance weekly unemployment benefits beyond July."
        },
        {
            "id": 34,
            "text": "\"I think we ought to have an additional plus-up,\" said Sen. Mitt Romney (R-Utah)."
        },
        {
            "id": 35,
            "text": "“I think it should be limited, however, in some way to the wages people had prior to becoming unemployed, which is currently not the case."
        },
        {
            "id": 36,
            "text": "But I would extend it beyond the current time period.”"
        },
        {
            "id": 37,
            "text": "Sen. Shelley Moore Capito (R-W.Va.) said \"there's going to have to be some adjustments at the end of July\" because \"we expect [unemployment numbers] to go up.\""
        },
        {
            "id": 38,
            "text": "Capito grills EPA nominee on '#ResistCapitalism' tweet GOP senators unveil bill designating Taliban as terrorist organization MORE (R-W.Va.)"
        },
        {
            "id": 39,
            "text": "said “there’s going to have to be some adjustments at the end of July” because “we expect [unemployment numbers] to go up.”"
        },
        {
            "id": 40,
            "text": "“What those will look like, I couldn’t predict right now,” she added."
        },
        {
            "id": 41,
            "text": ""
        },
        {
            "id": 42,
            "text": "Sen. Thom Tillis (R-N.C.), who faces a competitive reelection in the fall, said the enhanced unemployment benefits shouldn't be continued \"in its current form.\""
        },
        {
            "id": 43,
            "text": "But he said he is “looking at” some measure of federally enhanced benefits."
        },
        {
            "id": 44,
            "text": "He said Congress may tune the federal benefit to make sure it doesn’t exceed regular wages and provide a disincentive to returning to work."
        },
        {
            "id": 45,
            "text": "Sen. Lindsey Graham (R-S.C.), who was one of the biggest critics in March of the CARES Act's $600 weekly boost to unemployment benefit, on Wednesday said he supports providing federal benefits to people accepting unemployment benefits past July."
        },
        {
            "id": 46,
            "text": ""
        },
        {
            "id": 47,
            "text": "“Unemployment benefits can be enriched, but you don’t want to destroy the incentive to participate."
        },
        {
            "id": 48,
            "text": "Six hundred dollars is a 50 percent pay raise for a lot in the hospitality industry,” he said."
        },
        {
            "id": 49,
            "text": "“I don’t know if you reduce the amount [or] do what Portman’s talking about."
        },
        {
            "id": 50,
            "text": "“I’m very open-minded about how to supplement unemployment benefits,” he added."
        }
    ]
}