{
    "title": "Trump praises Putin for refusing to retaliate on sanctions",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump praised Russian President Vladimir Putin on Friday for holding off on retaliation for U.S. sanctions regarding Russian hacking during the presidential election."
        },
        {
            "id": 1,
            "text": "\"Great move on delay (by V. Putin) - I always knew he was very smart!\""
        },
        {
            "id": 2,
            "text": "the president-elect tweeted mid-day."
        },
        {
            "id": 3,
            "text": "The Russian embassy in the United States retweeted Trump's post."
        },
        {
            "id": 4,
            "text": "The praise came a day after President Obama, responding to Russian efforts to intervene in the 2016 election via cyber-espionage, announced economic sanctions on Russian intelligence officials and institutions, the expulsion of 35 Russian diplomats suspected of being spies, and the shuttering of two Russian facilities in the United States."
        },
        {
            "id": 5,
            "text": "While Russian officials recommended expelling U.S. officials from their country, Putin announced Friday he would not do so, partly in deference to the incoming Trump administration."
        },
        {
            "id": 6,
            "text": "Trump has questioned whether Russia was involved in hacking the emails of Democratic Party officials, and he brushed off the sanctions imposed by Obama."
        },
        {
            "id": 7,
            "text": "“It's time for our country to move on to bigger and better things,\" Trump said in a statement Thursday night."
        },
        {
            "id": 8,
            "text": "He added, \"nevertheless, in the interest of our country and its great people, I will meet with leaders of the intelligence community next week in order to be updated on the facts of this situation.\""
        },
        {
            "id": 9,
            "text": "That briefing will be scheduled for next week, Trump transition spokesman Sean Spicer said."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "U.S. intelligence officials have accused the Russians of hacking Democratic emails in an effort to help Trump win the election."
        },
        {
            "id": 12,
            "text": "While Putin and Russia deny the allegations, the Obama administration is a preparing a report on the cyber attacks, and Congress is likely to conduct an investigation of its own."
        },
        {
            "id": 13,
            "text": "During the campaign, Democrats said Trump was too friendly with Putin; Trump said he only wants to improve U.S.-Russian relations."
        },
        {
            "id": 14,
            "text": "Trump tweeted about the Russian leader on a day in which he continued to hold meetings at his Mar-a-Lago estate in South Florida about plans for his inauguration and administration."
        },
        {
            "id": 15,
            "text": "The president-elect has four Cabinet-level slots to fill: director of National Intelligence, secretary of Agriculture, U.S. trade representative and secretary of Veterans Affairs."
        },
        {
            "id": 16,
            "text": "Trump is also planning a New Year's Eve reception at Mar-a-Lago, with guests including Sylvester Stallone and Quincy Jones."
        },
        {
            "id": 17,
            "text": "The president-elect is scheduled to return to New York City on New Year's Day."
        }
    ]
}