{
    "title": "Hillary Collapses to 37 Percent in Iowa",
    "text": [
        {
            "id": 0,
            "text": "The 2008 Democrat nomination was permanently reshuffled when Barack Obama beat Hillary Clinton in the Iowa Caucus."
        },
        {
            "id": 1,
            "text": "Obama’s win surprised pundits at the time, but a new poll from Bloomberg/Des Moines Register suggests another Hillary defeat is possible."
        },
        {
            "id": 2,
            "text": "This potential upset is being broadcast five months early."
        },
        {
            "id": 3,
            "text": "In the new survey, Hillary has the support of just 37 percent of likely Democrat caucus voters."
        },
        {
            "id": 4,
            "text": "Sanders has nearly doubled his support, garnering 30 percent in the poll."
        },
        {
            "id": 5,
            "text": "Vice President Joe Biden, who is not a candidate, earns 14 percent support."
        },
        {
            "id": 6,
            "text": "Without Biden in the race, his supporters break a little more than evenly for Hillary, putting her just 8 points ahead of Sanders, 43-35 percent."
        },
        {
            "id": 7,
            "text": "In May, Hillary had just under 60% of the vote, while Sanders had just 16 percent."
        },
        {
            "id": 8,
            "text": "“It looks like what people call the era of inevitability is over,” Ann Selzer, whose firm conducted the poll."
        },
        {
            "id": 9,
            "text": "“She has lost a third of the support that she had in May, so any time you lose that much that quickly, it’s a wake-up call.”"
        },
        {
            "id": 10,
            "text": "Seltzer has been polling Iowa caucus-goers for decades and has one of the best records of predicting the outcome of the vote."
        },
        {
            "id": 11,
            "text": "It should be noted that this survey comes after Hillary has blanketed the Hawkeye State with an expensive ad buy highlighting her biography and her political record."
        },
        {
            "id": 12,
            "text": "Hillary’s drop in the poll reflects a challenge for candidates as well known as Clinton."
        },
        {
            "id": 13,
            "text": "Voters already have pretty firm perceptions of Hillary and are somewhat immune from the impact of extensive ad buys."
        },
        {
            "id": 14,
            "text": "No other Democrat candidates have been advertising in Iowa and Hillary’s ad buy was more than all the Republican candidates combined."
        },
        {
            "id": 15,
            "text": "It has to worry Democrat observers that a nearly saturating ad buy can’t stem defections from Hillary."
        },
        {
            "id": 16,
            "text": "Sanders, a quirky, aging socialist from New England isn’t, on paper, the kind of candidate who would ignite the more resonant voters in Iowa."
        },
        {
            "id": 17,
            "text": "Seltzer observed, however, that Sanders makes voters “feel good about being a Democrat.”"
        },
        {
            "id": 18,
            "text": "In many ways, the rise of Sanders is a mirror reflection of the Republican voters’ dissatisfaction that is propelling Donald Trump in the GOP nomination contest."
        },
        {
            "id": 19,
            "text": "The entire voting public, at both ends of the political spectrum, are rebelling against the national parties’ candidates."
        },
        {
            "id": 20,
            "text": "In an age of great anxiety, status quo is anathema to voters."
        },
        {
            "id": 21,
            "text": "The Sanders threat for Hillary is also beginning to look like a replay of 2008."
        },
        {
            "id": 22,
            "text": "In that election, Obama overwhelmed Hillary with support of young, liberal voters who participated in their first caucus."
        },
        {
            "id": 23,
            "text": "Sanders trounces Hillary, 50-27%, among caucus-goers under 45."
        },
        {
            "id": 24,
            "text": "He leads self-described liberals by 5 points and beats Hillary by 12 points among Democrats who plan to participate in the caucuses for the first time."
        },
        {
            "id": 25,
            "text": "There is a glimmer of hope for Hillary, though."
        },
        {
            "id": 26,
            "text": "Just over 60 percent of potential Democrat caucus-goers don’t think the email scandal surrounding Hillary is important."
        },
        {
            "id": 27,
            "text": "That said, she still only gets 37 percent support."
        },
        {
            "id": 28,
            "text": "If Democrats start worrying about the email scandal, the floor could drop out from under Hillary very quickly."
        }
    ]
}