{
    "title": "Trump administration pushed for sale of nuclear plants to Saudi Arabia, Democrats say in report",
    "text": [
        {
            "id": 0,
            "text": "Top Trump administration officials advocated for a plan to build dozens of nuclear power plants in Saudi Arabia despite warnings that the move could pose ethical concerns and violate federal law, according to a report released by House Democrats."
        },
        {
            "id": 1,
            "text": "The 24-page report was compiled for the House Committee on Oversight and Reform, chaired by Democrat Rep. Elijah Cummings, who on Tuesday also announced a widespread probe of the plan, those within the White House who were involved and the financial interests of those individuals."
        },
        {
            "id": 2,
            "text": "Democrats raise concerns that the Trump administration aiding this effort would allow the Saudi regime access to \"sensitive U.S. nuclear technology\" that could in turn \"allow Saudi Arabia to produce nuclear weapons that contribute to the proliferation of nuclear arms throughout an already unstable Middle East.\""
        },
        {
            "id": 3,
            "text": "The White House's relationship with Saudi Arabia has been heavily criticized in the aftermath of the killing of Washington Post columnist Jamal Khashoggi."
        },
        {
            "id": 4,
            "text": "President Donald Trump faced intense pressure to halt an arms deal with the regime after evidence surfaced showing Saudi's crown prince was involved in Khashoggi's death."
        },
        {
            "id": 5,
            "text": "The White House did not immediately respond to inquiries from USA TODAY about the report and the new Democratic-led probe."
        },
        {
            "id": 6,
            "text": "Last week, the House passed a measure aiming to force the president to end U.S. military support for the Saudi-led war in Yemen."
        },
        {
            "id": 7,
            "text": "The measure also acted as a condemnation for the government's role in Khashoggi's slaying."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "In rebuke to President Trump, House approves measure to force U.S. withdrawal from Yemen."
        },
        {
            "id": 10,
            "text": "The report by Democrats includes documents, emails and a number of concerns raised by former National Security Advisor Herbert Raymond McMaster, White House attorneys and whistleblowers within the Trump administration who blasted the plan to allow Saudi Arabia access to U.S. nuclear technology."
        },
        {
            "id": 11,
            "text": "The report alleges those involved in the planning were aiming to enrich themselves and possibly violated the Atomic Energy Act, a federal law that lays out the preconditions of any nuclear deals with another nation and requires Congressional approval."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": "\"The whistleblowers who came forward have expressed significant concerns about the potential procedural and legal violations connected with rushing through a plan to transfer nuclear technology to Saudi Arabia,\" the report notes."
        },
        {
            "id": 14,
            "text": "\"They have warned of conflicts of interest among top White House advisers that could implicate federal criminal statutes.\""
        },
        {
            "id": 15,
            "text": "Democrats lay out a timeline in the report, which goes over the first three months of Trump's presidency and discussions over the plan to help Saudi Arabia build out a nuclear program."
        },
        {
            "id": 16,
            "text": "But, the report also includes events throughout 2018 and 2019 that allude to the possibility of the White House still mulling over a deal, pointing most recently to a Feb. 12 meeting where the president allegedly met with nuclear developers at the White House to discuss the transfer of the sites to Saudi Arabia."
        },
        {
            "id": 17,
            "text": "Former National Security Adviser Michael Flynn, who resigned after a month on the job, was a key supporter of the plan in the early days of the administration to help IP3 International with the nuclear plants in Saudi Arabia, the report alleges."
        },
        {
            "id": 18,
            "text": "Flynn separately pleaded guilty to lying to Congress as part of special counsel Robert Mueller's investigation of Russian meddling in the 2016 election."
        },
        {
            "id": 19,
            "text": "The proposal by IP3 was also promoted heavily by Thomas Barrack, a friend of the president's, according to the report, which also notes Jared Kushner's visits with Saudi officials and the potential financial gain for his business."
        },
        {
            "id": 20,
            "text": "Kushner is scheduled to travel to Saudi Arabia this month as part of a Middle East trip."
        }
    ]
}