{
    "title": "At Bipartisan Budget Meeting, Familiar Hurdles but a New Attitude",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — President Obama and Congressional leaders on Friday reopened budget negotiations that ended badly in 2011 with surprising bipartisan bonhomie, and even some initial agreements toward a year-end deal."
        },
        {
            "id": 1,
            "text": "Yet a familiar hurdle remains before any handshakes: resolving the parties’ dispute over whether to extend the Bush-era tax rates for the wealthy."
        },
        {
            "id": 2,
            "text": "Both sides indicated after the 70-minute White House meeting that their goal is a two-step compromise, since they have little time to work before the end of the year."
        },
        {
            "id": 3,
            "text": "That is when more than $500 billion in automatic tax increases and across-the-board spending cuts hit all Americans, and potentially shake the economy, unless Congress enacts an alternative deficit reduction agreement."
        },
        {
            "id": 4,
            "text": "As tentatively envisioned, a compromise would provide an immediate down payment of at least $50 billion to reduce this year’s projected deficit, in lieu of the automatic measures that would hurt the economy by their size and suddenness, economists say."
        },
        {
            "id": 5,
            "text": "Second, it would define a framework for negotiating a long-term “grand bargain” in 2013 to shave annual deficits by perhaps $4 trillion over the first decade."
        },
        {
            "id": 6,
            "text": "The framework would have separate goals for raising revenues and cutting the two types of federal spending: so-called discretionary financing that Congress sets annually for most programs, domestic and military; and entitlement spending, chiefly for Medicare and Medicaid, which by their growth in an aging population are driving projections of mounting debt."
        },
        {
            "id": 7,
            "text": "The agreement to aim for a framework only in the initial talks is a quick step forward."
        },
        {
            "id": 8,
            "text": "Some lawmakers, including the Senate Republican leader, Mitch McConnell of Kentucky, had wanted a larger deal before Jan. 1 as the price for shutting off the automatic deficit reduction that would hit then."
        },
        {
            "id": 9,
            "text": "Representative Nancy Pelosi of California, the House Democratic leader, went so far as to predict that a deal to head off that so-called fiscal cliff would be at hand “well before Christmas.”"
        },
        {
            "id": 10,
            "text": "While such a two-pronged deal would put off the hardest and most far-reaching policy decisions until next year, no deal is possible unless the negotiators first decide on the deficit down payment."
        },
        {
            "id": 11,
            "text": "That installment, it is widely believed, must be large enough to satisfy financial markets, which oppose the automatic measures as too large and threatening but still want Washington to show some resolve toward getting the nation’s fiscal house in order."
        },
        {
            "id": 12,
            "text": "Mr. Obama, Vice President Joseph R. Biden Jr. and the Democrats — Harry Reid of Nevada, the Senate majority leader, and Ms. Pelosi — made it clear around the negotiating table that the down payment is easily made by letting the Bush tax cuts expire, as scheduled on Dec. 31, for annual income of $250,000 and above for couples and $200,000 for individuals."
        },
        {
            "id": 13,
            "text": "The Bush rates would be extended for lower incomes, preserving them for 98 percent of taxpayers."
        },
        {
            "id": 14,
            "text": "The Republicans — House Speaker John A. Boehner and Mr. McConnell — were just as plain that, while they support raising additional revenues by curbing deductions and through economic growth, they would oppose an increase in marginal tax rates."
        },
        {
            "id": 15,
            "text": "They want the down payment in spending cuts."
        },
        {
            "id": 16,
            "text": "Yet after an election campaign in which Mr. Obama made this a top issue, Republicans have reduced leverage, many acknowledge."
        },
        {
            "id": 17,
            "text": "That shift in the Washington fiscal dynamic since Mr. Obama’s re-election also explains the rapidity with which the Republican leaders have agreed that higher revenues will be part of the deficit-reduction solution — if not through higher rates."
        },
        {
            "id": 18,
            "text": "If the president has his way, the top rates, now 33 percent and 35 percent, would rise to 36 percent and 39.6 percent, the Clinton-era levels, on Jan. 1."
        },
        {
            "id": 19,
            "text": "But Mr. Obama has suggested he is open to a compromise that would set the rates somewhere in between, in combination with limits on deductions."
        },
        {
            "id": 20,
            "text": "With Mr. Obama leaving on Saturday for a four-day diplomatic trip to Asia and Thanksgiving looming, the negotiators directed their staffs to flush out the Republican bottom line on the size and type of savings to get from Medicare and Medicaid in preparation for the leaders’ next meeting in the week after the holiday."
        },
        {
            "id": 21,
            "text": "Republicans were heartened that Mr. Obama designated his soon-to-retire Treasury secretary, Timothy F. Geithner, as his lead negotiator, instead of the White House chief of staff, Jacob J. Lew."
        },
        {
            "id": 22,
            "text": "Mr. Boehner’s relations with Mr. Lew soured during the prolonged and bitter budget talks in 2011."
        },
        {
            "id": 23,
            "text": "The four Congressional leaders emerged from the West Wing round table together and in good spirits — a far cry from the 2011 negotiations, when they generally left separately and, once back at the Capitol, circulated competing versions of the private discussions."
        },
        {
            "id": 24,
            "text": "Mr. Reid virtually promised a deal before a Dec. 31 deadline that would avoid the last-minute brinkmanship so typical of Congress’s budget debates in recent years."
        },
        {
            "id": 25,
            "text": "“We feel very comfortable with each other, and this isn’t something we’re going to wait until the last day of December to get it done,” Mr. Reid said."
        },
        {
            "id": 26,
            "text": "“We have the cornerstones of being able to work something out."
        },
        {
            "id": 27,
            "text": "We’re both going to have to give up some of the things that we know are a problem.”"
        },
        {
            "id": 28,
            "text": "Mr. Boehner said he outlined a framework for overhauling the tax code and spending programs that is “consistent with the president’s call for a fair and balanced approach.”"
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": "“To show our seriousness,” he said, “we put revenue on the table as long as it’s accompanied by significant spending cuts.”"
        },
        {
            "id": 31,
            "text": "Mr. McConnell made plain that Republicans were talking about Medicare and Medicaid spending."
        },
        {
            "id": 32,
            "text": "Republican senators, he said, “fully understand that you can’t save the country until you have entitlement programs that fit the demographics of the changing America in the coming years.”"
        },
        {
            "id": 33,
            "text": "“We’re prepared to put revenues on the table,” he said, “provided we fix the real problem, even though most of my members, I think without exception, believe that we’re in the dilemma we’re in not because we tax too little but because we spend too much.”"
        },
        {
            "id": 34,
            "text": "Ms. Pelosi, whose colleagues include many liberals who resist significant changes to entitlement spending, said: “We understand our responsibility here."
        },
        {
            "id": 35,
            "text": "We understand that it has to be about cuts, it has to be about revenue, it has to be about growth, it has to be about the future.”"
        },
        {
            "id": 36,
            "text": "She added, “I feel confident that a solution may be in sight.”"
        },
        {
            "id": 37,
            "text": "The talks also began on a friendly note: With reporters and cameras briefly allowed in the room, Mr. Obama wished a happy birthday to Mr. Boehner, who turns 63 on Saturday."
        },
        {
            "id": 38,
            "text": "The president gave the speaker, who favors merlot, a bottle of 1997 brunello wine, a pricey Italian red."
        }
    ]
}