{
    "title": "Senate Democrats can now officially pass more bills with 51 votes",
    "text": [
        {
            "id": 0,
            "text": "Senate Democrats just got some wonky procedural news that has some pretty big implications for President Joe Biden’s agenda."
        },
        {
            "id": 1,
            "text": "On Monday night, the Senate parliamentarian — an in-house rules expert — determined that Democrats would be able to do a third budget reconciliation bill this year, a massive development that gives lawmakers more room to pass legislation without Republican support."
        },
        {
            "id": 2,
            "text": "Already, Democrats had the ability to do two budget reconciliation bills: one focused on fiscal year 2021 and one focused on fiscal year 2022."
        },
        {
            "id": 3,
            "text": "Unlike most other bills, budget measures can pass with just 51 votes, instead of 60, which means Democrats are able to usher through the legislation they want if all 50 members of their caucus are onboard."
        },
        {
            "id": 4,
            "text": "(With the American Rescue Plan, for instance, 50 Democrats were able to approve the $1.9 trillion package as part of the FY2021 budget bill, even though no Republicans backed it.)"
        },
        {
            "id": 5,
            "text": "“The Parliamentarian has advised that a revised budget resolution may contain budget reconciliation instructions,” said a spokesperson for Senate Majority Leader Chuck Schumer in a statement."
        },
        {
            "id": 6,
            "text": "“This confirms the Leader’s interpretation of the Budget Act and allows Democrats additional tools to improve the lives of Americans if Republican obstruction continues.”"
        },
        {
            "id": 7,
            "text": "With the new decision from the parliamentarian, Elizabeth MacDonough, Democrats can now do a third budget reconciliation bill, which means they can push through more ambitious measures as long as they are related to taxing and spending."
        },
        {
            "id": 8,
            "text": "The decision is based on MacDonough’s interpretation of Section 304 of the Congressional Budget Act of 1974, which allows lawmakers to revise a budget resolution before the end of the fiscal year that it covers."
        },
        {
            "id": 9,
            "text": "Given her decision, Democrats can now edit the 2021 budget resolution they already passed, and include instructions for another bill."
        },
        {
            "id": 10,
            "text": "Schumer’s spokesperson also noted that “no decisions have been made on a legislative path forward using Section 304 and some parameters still need to be worked out.”"
        },
        {
            "id": 11,
            "text": "Budget reconciliation has its limits: It can’t be used for policies like voting rights reforms or gun control, but it’s still a helpful tool that Democrats have already leveraged to pass a huge expansion of the child tax credit, enhanced unemployment aid, and another round of stimulus checks."
        },
        {
            "id": 12,
            "text": "Democrats now have another opportunity to advance parts of their agenda that Republicans would otherwise block."
        },
        {
            "id": 13,
            "text": "And the decision to push for a workaround shows how limited Democrats’ other options are to pass their agenda."
        },
        {
            "id": 14,
            "text": "Democrats are leaning on budget reconciliation amid disagreements over the filibuster\n\nDemocrats’ efforts to get the most they can out of budget reconciliation underscores the political context they are operating in: namely, that they have dwindling options for passing ambitious legislation."
        },
        {
            "id": 15,
            "text": "If Democrats eliminated the legislative filibuster, all bills could then pass with 51 votes, instead of 60, removing the need to rely so heavily on budget reconciliation."
        },
        {
            "id": 16,
            "text": "But although an increasing number of Democrats appear open to at least modifying how the filibuster works, the caucus doesn’t have the votes it needs to eliminate it."
        },
        {
            "id": 17,
            "text": "Since moderate Sens. Joe Manchin (D-WV) and Kyrsten Sinema (D-AZ) have been staunch in their opposition to ending the rule, it seems unlikely to change in the near term, meaning most bills will need 60 votes to pass."
        },
        {
            "id": 18,
            "text": "To hit that threshold, Democrats will need to convince 10 Republicans to join them on most measures, an outcome that’s become increasingly unlikely for many of the party’s more ambitious bills."
        },
        {
            "id": 19,
            "text": "(On coronavirus relief, for example, Republicans’ opening bid was roughly a third of what President Joe Biden had proposed.)"
        },
        {
            "id": 20,
            "text": "By pushing for a reinterpretation of Section 304, Democrats seemed to be looking for other outlets for passing legislation if those in the caucus who are against eliminating the filibuster don’t budge."
        },
        {
            "id": 21,
            "text": "Now they have one extra shot."
        },
        {
            "id": 22,
            "text": "Infrastructure could be Democrats’ next budget reconciliation bill\n\nDemocrats’ attempts to clear the way for another budget bill also coincide with Biden unveiling a $2 trillion infrastructure and jobs package, along with a proposal to raise the corporate tax rate to 28 percent to pay for it."
        },
        {
            "id": 23,
            "text": "The administration is pitching to Democrats and Republicans in Congress alike, but the prospects of getting a bipartisan bill done appear dim."
        },
        {
            "id": 24,
            "text": "In particular, Republicans are opposed to the tax increases, as well as some of the provisions of Biden’s plan that go beyond roads and bridges."
        },
        {
            "id": 25,
            "text": "The parliamentarian’s decision gives more options and chances to use reconciliation to pass their priorities with 51 votes."
        },
        {
            "id": 26,
            "text": "Biden is expected to soon announce yet another package that deals with child care and health care."
        },
        {
            "id": 27,
            "text": "Though no final decisions have been made on the process, and how these plans will merge into a budget bill, Democrats could theoretically break Biden’s infrastructure plan and his forthcoming child care and health care plan into two different reconciliation bills — sticking one in the amended 2021 resolution and putting the rest in the 2022 resolution."
        },
        {
            "id": 28,
            "text": "There’s another option: Democrats and Republicans could pass a bipartisan infrastructure bill that deals more narrowly with roads and bridges, and then Democrats and the Biden administration put their remaining priorities into a budget reconciliation bill."
        },
        {
            "id": 29,
            "text": "Relevant House and Senate committees are currently working on a surface transportation reauthorization bill, which comes up every five years."
        },
        {
            "id": 30,
            "text": "The five-year reauthorization bills deal pretty narrowly with fixing up roads and bridges, and Republicans on the committees think the reauthorization bill should be worked on and passed in a bipartisan way."
        },
        {
            "id": 31,
            "text": "“Our committee unanimously reported legislation to rebuild our nation’s water systems."
        },
        {
            "id": 32,
            "text": "This proves that infrastructure can and should be done on a bipartisan basis,” Sen. Shelley Moore Capito (R-WV), the ranking member of the Senate Committee on Environment and Health, said in a recent statement."
        },
        {
            "id": 33,
            "text": "However, the White House views its plan as a supplement to whatever Congress does on infrastructure on its own."
        },
        {
            "id": 34,
            "text": "Biden has proposed $621 billion for spending on the nation’s roads and bridges, rail and public transit, and airports and ports."
        },
        {
            "id": 35,
            "text": "“All elements of the plan reflect additional investment on top of existing programs and authorities,” an administration official told Vox."
        },
        {
            "id": 36,
            "text": "“On transportation infrastructure, the plan includes an additional roughly $600B above the five-year budget baseline, assuming a straight extension of FAST-Act funding levels for surface transportation programs.”"
        },
        {
            "id": 37,
            "text": "The next few months of negotiations between the White House and Congress will decide a lot about just how big and bold an infrastructure bill will be."
        },
        {
            "id": 38,
            "text": "But no matter what, budget reconciliation will factor in prominently."
        }
    ]
}