{
    "title": "Senate Democrats strike tentative deal on $3.5 trillion party-line spending package",
    "text": [
        {
            "id": 0,
            "text": "Senate Majority Leader Charles E. Schumer announced Tuesday a tentative framework for a $3.5 trillion party-line social welfare package, although it remains to be seen whether Democrats can unite behind the measure."
        },
        {
            "id": 1,
            "text": "Mr. Schumer announced the deal after meeting with all 11 Democrats on the Senate Budget Committee."
        },
        {
            "id": 2,
            "text": "The panel will be responsible for shepherding the deal through the budget reconciliation process, which allows spending bills to pass via a simple majority of 51 votes in the evenly split Senate."
        },
        {
            "id": 3,
            "text": "“The budget resolution with instructions will be $3.5 trillion,” said Mr. Schumer, New York Democrat."
        },
        {
            "id": 4,
            "text": "“Every major program that President Biden has asked us for is funded in a robust way.”"
        },
        {
            "id": 5,
            "text": "While details remain sparse, the outline presented by Senate Democrats appears to go further than even Mr. Biden has proposed."
        },
        {
            "id": 6,
            "text": "Mr. Biden initially floated spending upwards of $1.9 trillion on “human infrastructure,” including universal pre-kindergarten, job training for felons and free community college."
        },
        {
            "id": 7,
            "text": "Senate Democrats widened the package with $400 billion to provide home care for the elderly, climate change initiatives and funding for racial justice programs."
        },
        {
            "id": 8,
            "text": "Sen. Bernard Sanders, Vermont independent and Senate Budget Committee chairman, also secured a last-minute addition that expands Medicare benefits to include vision, hearing and dental coverage."
        },
        {
            "id": 9,
            "text": "“This is, in our view, a pivotal moment in American history,” said Mr. Sanders, a self-described socialist."
        },
        {
            "id": 10,
            "text": "“What this legislation does, it says we’re going to create millions of good-paying union jobs rebuilding this country not only from a physical infrastructure, but [also] dealing with the human beings.”"
        },
        {
            "id": 11,
            "text": "It is unclear exactly how extensive the $3.5 trillion framework will be or whether everything in it abides by the narrow rules governing the reconciliation process."
        },
        {
            "id": 12,
            "text": "Furthermore, there are questions on whether Mr. Schumer can get all 50 Democrats on board with the deal."
        },
        {
            "id": 13,
            "text": "Moderate Democrats, in particular, have balked at the figure and the scope of the package during earlier discussions."
        },
        {
            "id": 14,
            "text": "Democratic Sen. Joe Manchin III of West Virginia, a key moderate swing vote, has pledged to oppose a reconciliation bill unless it is paid for by repealing the Trump-era tax cuts."
        },
        {
            "id": 15,
            "text": "“We need to pay for it,” said Mr. Manchin."
        },
        {
            "id": 16,
            "text": "“I’d like to pay for all of it."
        },
        {
            "id": 17,
            "text": "I don’t think we need more debt.”"
        },
        {
            "id": 18,
            "text": "Mr. Schumer, himself, cautioned when announcing the framework that nothing was yet final."
        },
        {
            "id": 19,
            "text": "“We are very proud of this plan."
        },
        {
            "id": 20,
            "text": "We know we have a long road to go,” he said."
        },
        {
            "id": 21,
            "text": "“We’re going to get this done for the sake of making average Americans’ lives a whole lot better.”"
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        }
    ]
}