{
    "title": "Senators try Sabotage",
    "text": [
        {
            "id": 0,
            "text": "Republican senators warned Iran on Monday that any nuclear deal made with U.S. President Barack Obama could last only as long as he remains in office, in an unusual intervention into U.S. foreign policy-making."
        },
        {
            "id": 1,
            "text": "The letter, signed by 47 U.S. senators, says Congress plays a role in ratifying international agreements and points out that Obama will leave office in January 2017, while many in Congress will remain in Washington long after that."
        },
        {
            "id": 2,
            "text": "\"We will consider any agreement regarding your nuclear-weapons program that is not approved by the Congress as nothing more than an executive agreement between President Obama and Ayatollah Khamenei,\" the letter read."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "\"The next president could revoke such an executive agreement with the stroke of a pen and future Congresses could modify the terms of an agreement at any time,\" it read."
        },
        {
            "id": 5,
            "text": "The letter, first reported by Bloomberg News, followed a speech to a joint meeting of Congress last week by Israeli Prime Minister Benjamin Netanyahu, who warned that the United States was negotiating a \"bad deal\" with Tehran."
        },
        {
            "id": 6,
            "text": "It comes as world powers have been negotiating with Iran to try to reach some form of understanding by the end of March before a final deal in June that could ease crippling sanctions that have crippled Iran's economy."
        },
        {
            "id": 7,
            "text": "The U.S. Constitution divides foreign policy powers between the president and Congress."
        },
        {
            "id": 8,
            "text": "The executive branch is responsible for negotiating international agreements and lawmakers rarely intervene directly with the leaders of another nation while the president's administration is negotiating a pact."
        },
        {
            "id": 9,
            "text": "Republicans want any U.S. nuclear agreement with Iran to be approved by Congress."
        },
        {
            "id": 10,
            "text": "But Senate Majority Leader Mitch McConnell, who signed the letter released on Monday, agreed to postpone a vote on a bill requiring Obama to submit any deal for congressional approval amid outcry from Democrats."
        },
        {
            "id": 11,
            "text": "Along with McConnell, Republican signers include Tom Cotton, Orrin Hatch, John Cornyn, John McCain, Lindsey Graham, John Thune and Mark Kirk."
        },
        {
            "id": 12,
            "text": "Ted Cruz, Marco Rubio and Rand Paul, two possible 2016 presidential contenders, also signed."
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}