{
    "title": "New emails under review in Clinton case emerged from Weiner investigation",
    "text": [
        {
            "id": 0,
            "text": "FBI Director James Comey said Friday that investigators had found new emails related to the bureau's previously closed inquiry into Hillary Clinton's handling of classified information, restarting a long-simmering debate over the Democratic nominee's conduct as secretary of State in the closing days of a presidential campaign that Clinton appeared to be putting away."
        },
        {
            "id": 1,
            "text": "In a letter to senior lawmakers explaining his decision, Comey said \"the FBI cannot yet assess\" whether the information is \"significant\" nor could he offer a timetable for how long it will take investigators to make an assessment."
        },
        {
            "id": 2,
            "text": "But an official familiar with the matter said Friday that the new materials, perhaps thousands of emails, were discovered in the ongoing and separate investigation into sexually charged communications between former New York congressman Anthony Weiner and a 15-year-old girl."
        },
        {
            "id": 3,
            "text": "Comey was briefed on the findings in recent days, resulting in the director's notification to Congress, said the official who is not authorized to discuss the matter publicly."
        },
        {
            "id": 4,
            "text": "The emails were discovered in a search of a device or devices used by Weiner, who is separated from longtime Clinton aide Huma Abedin."
        },
        {
            "id": 5,
            "text": "Abedin also had access to the same device or devices."
        },
        {
            "id": 6,
            "text": "The official said it was not likely that the FBI's review of the additional emails could be completed by Election Day."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "In a brief news conference in Iowa on Friday evening, Clinton said, \"The American people deserve to get the full and complete facts immediately,\" a position earlier outlined in a statement from her campaign chairman, John Podesta. The Democratic nominee called on the FBI \"to release all the information that it has.\"\n\n\""
        },
        {
            "id": 9,
            "text": "As you know I've had plenty of words about the FBI lately, but I give them great credit for having the courage to right this horrible wrong. Justice will prevail,\" Donald Trump said at a campaign rally in Cedar Rapids, Iowa, Thursday night."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "During a speech in New Hampshire earlier in the day, the Republican presidential nominee gleefully discussed the \"breaking news announcement.\""
        },
        {
            "id": 12,
            "text": "\"Hillary Clinton's corruption is on a scale we have never seen before,\" Trump said, and her \"criminal scheme\" should not be allowed in the Oval Office."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "\"Perhaps justice will be done,\" the GOP nominee said of the development."
        },
        {
            "id": 15,
            "text": "Clinton answers written questions about email server"
        },
        {
            "id": 16,
            "text": "WikiLeaks release reveals internal concern over handling of Clinton emails"
        },
        {
            "id": 17,
            "text": "In his statement, Podesta demanded that the FBI director \"provide the American public more information than is contained in the letter'' to lawmakers."
        },
        {
            "id": 18,
            "text": "\"Upon completing this investigation more than three months ago, FBI Director Comey declared no reasonable prosecutor would move forward with a case like this and added that it was not even a close call,'' Podesta said."
        },
        {
            "id": 19,
            "text": "\"In the months since, Donald Trump and his Republican allies have been baselessly second-guessing the FBI and, in both public and private, browbeating the career officials there to revisit their conclusion in a desperate attempt to harm Hillary Clinton's presidential campaign."
        },
        {
            "id": 20,
            "text": "\"It is extraordinary that we would see something like this just 11 days out from a presidential election,\" Podesta added."
        },
        {
            "id": 21,
            "text": "Speaking to reporters aboard Air Force One Friday, White House spokesman Eric Schultz said nothing had \"surfaced to change the president's opinion and views of Secretary Clinton.''"
        },
        {
            "id": 22,
            "text": "\"He's going to be proud to support her from now until Election Day,\" Schultz said."
        },
        {
            "id": 23,
            "text": "In July, Comey announced that while Clinton and her aides during her tenure as secretary of State had been \"extremely careless\" in the way they'd handled classified information, he recommended that no criminal charges be filed."
        },
        {
            "id": 24,
            "text": "In her press conference Friday, Clinton said she was \"confident\" whatever is included in the new messages under review \"will not change the conclusion reached in July.\""
        },
        {
            "id": 25,
            "text": "In July, Comey testified before skeptical Republican lawmakers to explain the bureau's recommendation, which had been adopted by Attorney General Loretta Lynch."
        },
        {
            "id": 26,
            "text": "“We’re mystified and confused by the fact pattern you laid out and the conclusion you reached,\" House Oversight and Government Reform Chairman Jason Chaffetz, R-Utah, told Comey."
        },
        {
            "id": 27,
            "text": "Comey, however, was unequivocal in maintaining that the conclusion of investigators was not a close call."
        },
        {
            "id": 28,
            "text": "“There is no way anybody would bring a case against John Doe or Hillary Clinton for the second time in 100 years based on those facts,\" he told the House panel on July 7."
        },
        {
            "id": 29,
            "text": "Trump has cited the closed FBI probe as evidence that the election was \"rigged\" against him, and at a recent debate the GOP nominee said that, if he's elected president, he would appoint a special prosecutor to investigate Clinton."
        },
        {
            "id": 30,
            "text": "Following Comey's announcement Friday, Republicans blasted the Democratic presidential nominee."
        },
        {
            "id": 31,
            "text": "\"Hillary Clinton has nobody but herself to blame,\" said House Speaker Paul Ryan of Wisconsin."
        },
        {
            "id": 32,
            "text": "\"This decision, long overdue, is the result of her reckless use of a private email server, and her refusal to be forthcoming with federal investigators,\" Ryan said in a statement, adding that he was again calling for Clinton to no longer receive classified briefings, a traditional courtesy afforded major-party presidential nominees."
        },
        {
            "id": 33,
            "text": "Republican National Committee Chairman Reince Priebus said the timing of the decision, so soon before the election, demonstrated \"how serious this discovery must be.\""
        },
        {
            "id": 34,
            "text": "Trump's campaign manager, Kellyanne Conway, wrote on Twitter that \"a great day in our campaign just got even better.\""
        },
        {
            "id": 35,
            "text": "Meanwhile, Democratic Sen. Dianne Feinstein of California said in a statement that \"without knowing how many emails are involved, who wrote them, when they were written or their subject matter, it’s impossible to make any informed judgment on this development.\""
        },
        {
            "id": 36,
            "text": "She added: \"The FBI has a history of extreme caution near Election Day so as not to influence the results."
        },
        {
            "id": 37,
            "text": "Today’s break from that tradition is appalling.”"
        },
        {
            "id": 38,
            "text": "House Democratic leader Nancy Pelosi accused Republicans of attempting to \"misrepresent'' the FBI's work."
        },
        {
            "id": 39,
            "text": "\"Sadly but predictably, Republicans are doing their best to ... warp the FBI’s work to serve their partisan conspiracy-mongering against Hillary Clinton,'' Pelosi said."
        },
        {
            "id": 40,
            "text": "The uncertainty of what the new FBI review will yield, and when it will be completed, leaves open the question of how much of an impact it will have on the presidential campaign, as Trump looks to mount what would be a historic comeback, as polls show him trailing nationally and in key battleground states."
        },
        {
            "id": 41,
            "text": "\"Unless the FBI closes this new investigation one way or the other next week, the likely impact will be to cut into Clinton’s margin, with the bigger effect being on down-ballot races than on the outcome of the presidential election,\" said Patrick Murray, director of the Monmouth University Polling Institute, in an emailed statement."
        },
        {
            "id": 42,
            "text": "Whatever the long-term impact, the short-term jolt to Trump and his supporters, at least, seemed clear."
        },
        {
            "id": 43,
            "text": "In his New Hampshire speech, the GOP nominee suggested the rest of his message for the day would no longer matter as much, given the FBI announcement."
        },
        {
            "id": 44,
            "text": "\"The rest of my speech is going to be so boring,\" he joked."
        },
        {
            "id": 45,
            "text": ""
        }
    ]
}