{
    "title": "Gabbard Defends ‘Present’ Impeachment Vote, Citing ‘Tribal Animosities’",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "Democratic presidential candidate Tulsi Gabbard cast the lone “present” vote Wednesday evening on both articles of impeachment against President Trump and defended breaking from her party, slamming the process as tainted by partisanship."
        },
        {
            "id": 2,
            "text": "After reading the impeachment report, the Hawaii congresswoman said in a statement that she “came to the conclusion that I could not in good conscience vote either yes or no.”"
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "“I could not in good conscience vote against impeachment because I believe President Trump is guilty of wrongdoing,” Gabbard said."
        },
        {
            "id": 5,
            "text": "“I also could not in good conscience vote for impeachment because removal of a sitting president must not be the culmination of a partisan process, fueled by tribal animosities that have so gravely divided our country.”"
        },
        {
            "id": 6,
            "text": "The House voted Wednesday night to approve two articles of impeachment against Trump, abuse of power and obstruction of Congress."
        },
        {
            "id": 7,
            "text": "Only three Democrats defected to vote no on one or both articles and zero Republicans crossed party lines to vote in favor of either article."
        },
        {
            "id": 8,
            "text": "Gabbard pushed instead for Congress to take up a resolution she introduced this week to censure the president, insisting such a rebuke would “strong message to this president and future presidents that their abuses of power will not go unchecked, while leaving the question of removing Trump from office to the voters to decide.”"
        },
        {
            "id": 9,
            "text": "“Congress must be unequivocal in denouncing the president’s misconduct and stand up for the American people and our democracy,” the moderate Democrat said."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "Some of Gabbard’s Democratic House colleagues expressed frustation with her decision not to come down on one side or the other on impeachment, accusing her of not taking a stand."
        },
        {
            "id": 12,
            "text": "“It’s beyond anything that you can really understand,” said House Judiciary Committee Democrat Steve Cohen."
        },
        {
            "id": 13,
            "text": "“Whenever we have a vote, we should vote yes"
        },
        {
            "id": 14,
            "text": "and we should vote no,” Representative Alexandria Ocasio-Cortez criticized."
        },
        {
            "id": 15,
            "text": "“To not take a stand in a moment that is so consequential I think is quite difficult.”"
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        }
    ]
}