{
    "title": "CDC Considers Asking People to Wear Makeshift Masks in Public",
    "text": [
        {
            "id": 0,
            "text": "Officials at the Centers for Disease Control and Prevention are considering changing their guidance and encouraging people to wear masks when they go out in public."
        },
        {
            "id": 1,
            "text": "But The Washington Post noted there is still no agreement on whether the use of facial coverings would make a major difference in curtailing the outbreak of the coronavirus."
        },
        {
            "id": 2,
            "text": "And some experts are concerned it could provide people with a false sense of security and make them less likely to follow social distancing guidelines."
        },
        {
            "id": 3,
            "text": "A recommendation now being considered by the CDC calls for people to be encouraged to use do-it-yourself cloth coverings on their faces, according to the newspaper."
        },
        {
            "id": 4,
            "text": "The new guidance would make it clear the public should not use medical masks that are needed by healthcare workers, the Post reported."
        },
        {
            "id": 5,
            "text": "Austria is joining a small number of countries to make wearing face masks outside the home mandatory, the Financial Times reported."
        },
        {
            "id": 6,
            "text": "And Time noted that nearly everyone on Hong Kong's streets, trains, and buses has been wearing masks since the outbreak."
        },
        {
            "id": 7,
            "text": "It said South Korea, Singapore, and Japan have distributed face masks to residents."
        },
        {
            "id": 8,
            "text": "President Donald Trump was asked on Monday whether everyone should wear a nonmedical fabric mask."
        },
        {
            "id": 9,
            "text": "\"That's certainly something we could discuss,\" Trump said."
        },
        {
            "id": 10,
            "text": "Thomas Inglesby, director of the Johns Hopkins Center for Health Security, maintained the CDC should push people to use nonmedical masks."
        },
        {
            "id": 11,
            "text": "\"I think it would be a prudent step we can all take to reduce transmission\" by people who are infected but have no symptoms, he said."
        }
    ]
}