{
    "title": "Texas governor signs extreme six-week abortion ban into law",
    "text": [
        {
            "id": 0,
            "text": "The Texas Republican governor Greg Abbott has signed into law one of the most extreme six-week abortion bans in the US, despite strong opposition from the medical and legal communities, who warn the legislation could topple the state’s court system and already fragile reproductive healthcare network."
        },
        {
            "id": 1,
            "text": "“This bill ensures that every unborn child who has a heartbeat will be saved from the ravages of abortion,” said Abbott, flanked by several members of the Texas legislature this morning."
        },
        {
            "id": 2,
            "text": "Senate Bill 8 (SB 8), passed by both chambers of the Republican-dominated Texas legislature, bars abortion at six weeks of pregnancy with no exception for rape or incest, amounting to a near-total ban as most women are not aware they are pregnant at this stage."
        },
        {
            "id": 3,
            "text": "While a dozen states have passed similar so-called “heartbeat” bills – bans on abortion once embryonic cardiac activity is detected – none have yet been enforced due to court challenges."
        },
        {
            "id": 4,
            "text": "Unlike those measures, the Texas version absolves the state from enforcing the law."
        },
        {
            "id": 5,
            "text": "Instead it allows any private citizen the extraordinary authority to sue an abortion provider – they do not need to be connected to the patient or even reside in the same state, opening up the floodgates to harassing and frivolous civil lawsuits that could shut down clinics statewide."
        },
        {
            "id": 6,
            "text": "In fact, any individual can sue anyone who “aids or abets” abortion care or someone who “intends” to help an abortion patient, a breathtakingly wide range of possible people and groups."
        },
        {
            "id": 7,
            "text": "While those who sue can collect a minimum of $10,000 if they are successful, those unjustly sued cannot recover legal fees."
        },
        {
            "id": 8,
            "text": "The anti-abortion law’s private enforcement provision is the first of its kind in the country."
        },
        {
            "id": 9,
            "text": "“This law is so broadly written it could target not just abortion clinics and staff but anyone that volunteers or donates to an abortion fund or activist organization like ours,” says Aimee Arrambide, executive director of reproductive rights advocacy group, Avow Texas."
        },
        {
            "id": 10,
            "text": "“Domestic violence and rape crisis counselors who offer guidance, family members who lend money to abortion patients, a friend who gives a ride to an appointment, or even someone that provides an address to a clinic could also face lawsuits.”"
        },
        {
            "id": 11,
            "text": "Texas abortion laws, which include a 24-hour pre-abortion sonogram rule, limits on judicial bypass, a 20-week ban and private insurance ban, are some of the most restrictive in the country, making the procedure already difficult to access in many parts of Texas."
        },
        {
            "id": 12,
            "text": "The new bill makes abortion care near impossible, advocates say."
        },
        {
            "id": 13,
            "text": "“The six-week ban is egregious enough,” continued Arrambide."
        },
        {
            "id": 14,
            "text": "“But the civil cause of action component is legally irresponsible on its own and could set an example for what other legislatures might introduce across the states.”"
        },
        {
            "id": 15,
            "text": "In response to concerns over the potential for a rapist to sue his victim’s abortion provider under the draconian law, the legislature passed an amendment that exempts rapists and those who commit incest from taking legal action."
        },
        {
            "id": 16,
            "text": "However, as Democratic lawmakers on the House floor pointed out, it only applies to those convicted of rape."
        },
        {
            "id": 17,
            "text": "Since 91% of women in Texas do not report rape to the police and the small number of those who do rarely see their abuser convicted, the amendment largely failed to allay fears."
        },
        {
            "id": 18,
            "text": "Furthermore, the law does nothing to prevent someone associated with a rapist, like a friend or family member, from suing his victim."
        },
        {
            "id": 19,
            "text": "“This bill empowers rapists and abusers, and lawyers and trolls who want to abuse and clog up our courts,” said Representative Donna Howard, a Democrat from Austin, in an impassioned speech on the house floor before the bill’s final passage."
        },
        {
            "id": 20,
            "text": "“And this forced pregnancy act will drive women back into the [pre-Roe] shadows out of fear of harassment through lawsuits that anyone in this country can file.”"
        },
        {
            "id": 21,
            "text": "More than 370 licensed attorneys, including local leaders in major Texas cities, have condemned the unprecedented legislation."
        },
        {
            "id": 22,
            "text": "In an open letter to state lawmakers, they write that the law would undermine the Texas constitution and the “rules and tenets of our civil legal system”."
        },
        {
            "id": 23,
            "text": "Granting legal standing to those who have not personally suffered an injury could have a “destabilizing” impact on the state’s entire legal infrastructure, they warn."
        },
        {
            "id": 24,
            "text": "“SB 8 is a blatantly unconstitutional attempt by Texas Republican leadership to misuse civil courts to restrict women’s access to healthcare, and to allow anti-choice activists to target and penalize healthcare providers,” said Christian Menefee, Harris county attorney."
        },
        {
            "id": 25,
            "text": "“This bill is morally reprehensible and legally nonsense.”"
        },
        {
            "id": 26,
            "text": "Additionally, more than 200 physicians across Texas expressed deep concern over their ability to administer healthcare, cautioning the bill would create a “chilling effect” that would prevent physicians in over 30 specialties, including primary care, emergency medicine, OB/GYN and internal medicine, from providing information on all pregnancy options to patients due to frivolous lawsuits."
        },
        {
            "id": 27,
            "text": "“SB 8 would be catastrophic for both the patients I care for across Texas and for the dedicated physicians across our state,” said Dr Ghazaleh Moayedi, a Dallas-based OB/GYN."
        },
        {
            "id": 28,
            "text": "“No matter your personal opinions on abortion, we can all agree that Texas physicians should be able to provide accurate, non-biased medical information without threats or harassment from out-of-state extremists.”"
        },
        {
            "id": 29,
            "text": "Meanwhile, the state’s major anti-abortion lobby organization, Texas Right to Life, celebrated the bill’s passage as the most “historic” anti-choice measure in recent memory."
        },
        {
            "id": 30,
            "text": "The novel approach to enforcement should help “incentivize” abortion clinics to comply, said the group’s legislative director, John Seago."
        },
        {
            "id": 31,
            "text": "“We will be closely watching whether the abortion industry follows this law, if not they should be prepared for civil liability,” said Seago."
        },
        {
            "id": 32,
            "text": "Elisabeth Smith, chief counsel for state policy and advocacy for the Center for Reproductive Rights, says reproductive health advocates are crafting a legal strategy against the extreme measure, scheduled to be enacted on 1 September."
        },
        {
            "id": 33,
            "text": "The dangerous legal tactics in SB 8 “make a mockery” of the legal system and are meant to drain abortion providers of their time, energy and financial resources in trial court, she stresses."
        },
        {
            "id": 34,
            "text": "“The bottom line is that abortion providers in Texas are not going to let this bill impede their ability to provide care to patients,” says Smith."
        },
        {
            "id": 35,
            "text": "“The law will be challenged with the goal of stopping it from ever taking effect.”"
        }
    ]
}