{
    "title": "GOP Sen. McConnell’s campaign manager resigns",
    "text": [
        {
            "id": 0,
            "text": "LOUISVILLE, Ky. — Senate Minority Leader Mitch McConnell’s campaign manager resigned Friday amid fallout from a scandal in Iowa involving a presidential campaign he worked for in 2012."
        },
        {
            "id": 1,
            "text": "Jesse Benton said he didn’t want to become a distraction as McConnell tries to win a tough re-election campaign in Kentucky."
        },
        {
            "id": 2,
            "text": "“This decision breaks my heart, but I know it is the right thing for Mitch, for Kentucky and for the country,” Benton said in a statement."
        },
        {
            "id": 3,
            "text": "Benton’s resignation, effective Saturday, comes barely two months before Kentucky voters choose between McConnell, a five-term incumbent and the top-ranking Senate Republican, and Democratic challenger Alison Lundergan Grimes."
        },
        {
            "id": 4,
            "text": "In Iowa this week, former state Sen. Kent Sorenson pleaded guilty to federal charges stemming from his switch of support from one Republican presidential candidate to another before the 2012 Iowa caucuses."
        },
        {
            "id": 5,
            "text": "He received thousands of dollars in “under the table payments” before switching loyalties from candidate Michele Bachmann, whose Iowa campaign he headed, to candidate Ron Paul, then lied to federal investigators about the money, the Justice Department said."
        },
        {
            "id": 6,
            "text": "Prosecutors refused to say which campaign paid Sorenson."
        },
        {
            "id": 7,
            "text": "A representative for Bachmann didn’t immediately return voice and email messages seeking comment Friday."
        },
        {
            "id": 8,
            "text": "A phone message for Paul also wasn’t immediately returned."
        },
        {
            "id": 9,
            "text": "Benton, a tea party insider, worked as a top aide to Paul."
        },
        {
            "id": 10,
            "text": "On Friday he said that he has been the target of “inaccurate press accounts and unsubstantiated media rumors” about his role in past campaigns that are “politically motivated, unfair and, most importantly, untrue.”"
        },
        {
            "id": 11,
            "text": "In a separate statement Friday, McConnell’s campaign said the senator “obviously has nothing to do with the Iowa presidential caucus or this investigation, so it would be inappropriate for his campaign to comment on this situation.”"
        },
        {
            "id": 12,
            "text": "Charly Norton, a spokeswoman for the Grimes campaign, said in a statement, “Sen. McConnell owes the people of Kentucky a full account of what he knew and when he knew it.”"
        },
        {
            "id": 13,
            "text": "Benton was mentioned in documents gathered during an Iowa state ethics probe of Sorenson, a complaint to the Federal Election Commission and e-mails purported to be from the Ron Paul campaign obtained by the non-partisan Center for Responsive Politics, which monitors federal campaign finance issues, The Courier-Journal of Louisville reported."
        },
        {
            "id": 14,
            "text": "Benton’s hiring to oversee McConnell’s campaign was seen as a way to appeal to more conservative elements of the Kentucky GOP."
        },
        {
            "id": 15,
            "text": "McConnell eventually faced a tea party-inspired opponent in the Republican primary, which he easily won."
        },
        {
            "id": 16,
            "text": "Early in the campaign, Benton gained unwanted attention with the airing of a recording in which he was heard saying he was “holding my nose” to work for McConnell’s re-election campaign."
        },
        {
            "id": 17,
            "text": "Benton managed Rand Paul’s successful U.S. Senate campaign in Kentucky in 2010."
        },
        {
            "id": 18,
            "text": "Rand Paul is Ron Paul’s son."
        },
        {
            "id": 19,
            "text": "In his statement Friday, Benton said he was troubled that media reports risked “unfairly undermining and becoming a distraction to this re-election campaign.”"
        },
        {
            "id": 20,
            "text": "“I cannot, and will not, allow any possibility that my circumstances will affect the voters’ ability to hear his (McConnell’s) message and assess his record,” he said."
        },
        {
            "id": 21,
            "text": "“This election is far too important and the stakes are way too high.”"
        },
        {
            "id": 22,
            "text": "Benton said he was leaving the campaign with “a top-flight team of incredible people that are working tirelessly to ensure Mitch’s re-election."
        },
        {
            "id": 23,
            "text": "They are a finely oiled machine and will not skip a beat without me.”"
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        }
    ]
}