{
    "title": "Confirmed: Boehner's Debt Limit Plan Raises Spending",
    "text": [
        {
            "id": 0,
            "text": "House Republicans used to be against amnesty and for spending cuts."
        },
        {
            "id": 1,
            "text": "But now on both issues, Speaker John Boehner (R-OH) has entirely capitulated to liberal Democrats."
        },
        {
            "id": 2,
            "text": "Yesterday, House Republican leaders released the official text of Boehner's latest proposal to raise the debt limit."
        },
        {
            "id": 3,
            "text": "And it was just as terrible as conservatives thought it would be."
        },
        {
            "id": 4,
            "text": "Boehner's plan would increase spending by over $8 billion over the next 10 years."
        },
        {
            "id": 5,
            "text": "Most of that spending would go towards restoring the military pension cuts Boehner agreed to earlier this year."
        },
        {
            "id": 6,
            "text": "The rest would go to higher Medicare reimbursement rates for doctors."
        },
        {
            "id": 7,
            "text": "Not a cent of any of this new spending would be paid for until 2023 when Congress would supposedly extend sequester cuts to some mandatory budget programs for another year."
        },
        {
            "id": 8,
            "text": "Just as Boehner wants conservatives to believe that if they give illegal immigrants amnesty now, the federal government will begin enforcing immigration law tomorrow, he also wants conservatives to believe that if we raise federal spending now, we can pay for it by cutting spending ten years from now."
        },
        {
            "id": 9,
            "text": "No honest person with half a brain believes either scenario will ever play out as advertised."
        },
        {
            "id": 10,
            "text": "Instead, House Republicans should take Reps. Raul Labrador's (R-ID) advice, and just bring a clean debt limit hike to the House floor."
        },
        {
            "id": 11,
            "text": "While the military pension cuts should be undone, House Republicans must find a more honest pay for."
        }
    ]
}