{
    "title": "Deal reached on human trafficking bill paves way for Lynch vote",
    "text": [
        {
            "id": 0,
            "text": "Senate Majority Leader Mitch McConnell announced Tuesday that negotiators had reached a “bipartisan” deal on the anti-human trafficking bill, clearing the way for a vote to confirm attorney general nominee Loretta Lynch in the coming days."
        },
        {
            "id": 1,
            "text": "An agreement would end the latest Washington standoff, which has tied the Senate in knots for weeks."
        },
        {
            "id": 2,
            "text": "A skirmish over a provision in the anti-human trafficking bill quickly grew into a larger debate over abortion and race that resulted in the longest delay of an attorney general nominee in decades."
        },
        {
            "id": 3,
            "text": "On Tuesday, McConnell seemed ready to move on."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "“I’m glad we can say there is a bipartisan proposal that will allow us to complete action on this important legislation, so we can provide help to the victims who desperately need it,” he said on the Senate floor."
        },
        {
            "id": 7,
            "text": "Minority Leader Harry Reid said Republicans had “agreed not to expand the scope of the Hyde language,” the abortion provision that had been the sticking point for Senate Democrats who had been filibustering the bill."
        },
        {
            "id": 8,
            "text": "McConnell said Tuesday that “as soon as we finish the trafficking bill,” they’ll take up Lynch’s confirmation vote — “hopefully in the next day or so.”"
        },
        {
            "id": 9,
            "text": "Reid and McConnell thanked Senators Patty Murray, a Democrat from Washington, and John Cornyn, a Texas Republican, as the lead negotiators on hammering out a compromise."
        },
        {
            "id": 10,
            "text": "Lynch’s nomination has taken on historic significance — and not just because she would be the first African-American woman to lead the Justice Department."
        },
        {
            "id": 11,
            "text": "No other nominee for attorney general has had to wait this long for Senate confirmation — 165 days, and counting — since Ronald Reagan was in the White House."
        },
        {
            "id": 12,
            "text": "Lynch supporters have accused Republicans of delaying in part because she’s an African-American woman, a charge they dismiss."
        },
        {
            "id": 13,
            "text": "At issue was the addition of the so-called Hyde Amendment to the anti-human trafficking bill, by Republicans without the knowledge of most Democrats."
        },
        {
            "id": 14,
            "text": "The amendment is a common provision attached to most government funds for health programs that bars such funds from being used to pay for abortions, but Democrats said it was an unprecedented expansion to non-taxpayer dollars."
        },
        {
            "id": 15,
            "text": "The deal is essentially a cosmetic fix that lets both parties claim a win."
        },
        {
            "id": 16,
            "text": "It allows Republicans to say they’ve won their battle against funding abortions with government money, and Democrats to say they’ve avoided expanding the Hyde Amendment."
        },
        {
            "id": 17,
            "text": "According to sources in both parties, the Murray-Cornyn deal pools two sources of funding to support victims of human trafficking, and each is subject to distinct restrictions."
        },
        {
            "id": 18,
            "text": "One funding stream, from fines levied against sex traffickers, could be used for survivor services that do not include health care or medical services, like legal aid and law enforcement."
        },
        {
            "id": 19,
            "text": "That effectively bars the money from being used to fund abortions, but does not technically include the Hyde Amendment."
        },
        {
            "id": 20,
            "text": "The latter funding stream, which comes from community health center funds included in the doc-fix bill President Barack Obama signed into law this week, is already subject to the Hyde Amendment."
        },
        {
            "id": 21,
            "text": "SEE: Obama rips Senate over Lynch nomination: ‘This is embarrassing’"
        },
        {
            "id": 22,
            "text": "While the agreement paves the way for the Senate to move past the controversies, there are still a number of procedural hurdles in the way of a final vote on both the anti-human trafficking bill and Lynch’s confirmation."
        },
        {
            "id": 23,
            "text": "Republican and Democratic leaders are still hammering out which amendments to the anti-trafficking bill to bring up, but votes on those amendments could begin as early as Tuesday night, with a final vote on the bill expected Wednesday."
        },
        {
            "id": 24,
            "text": "Lynch is still facing a filibuster from GOP opponents in the Senate, but McConnell is expected to take procedural steps Tuesday to set up a Thursday-morning vote to break the filibuster."
        },
        {
            "id": 25,
            "text": "That would pave the way for a vote on full confirmation later that day."
        },
        {
            "id": 26,
            "text": "Both face just a 51-vote threshold are expected to easily win approval."
        },
        {
            "id": 27,
            "text": "The movement on the paired issues is the latest signal that the years of gridlock that ground legislative business in the Senate to a halt may be lifting, and further evidence McConnell wasn’t merely bluffing when he promised to prove the GOP could govern when they took control of the Senate this year."
        },
        {
            "id": 28,
            "text": "The deal was a rare legislative compromise on abortion that drew praise from both sides of the debate."
        },
        {
            "id": 29,
            "text": "Cecile Richards, president of the Planned Parenthood Action Fund, used the announcement of the deal to praise Reid and Murray for preventing expansion of the Hyde Amendment."
        },
        {
            "id": 30,
            "text": "“Thankfully, Sens. Reid and Murray and other women’s health champions held the line and today’s agreement prevents Hyde from being extended even further into other funding streams, and provides survivors of human trafficking with immediate access to needed health care services,” Richards said in a statement."
        },
        {
            "id": 31,
            "text": "And Marjorie Dannenfelser, president of the anti-abortion Susan B. Anthony List, said the group is “pleased” with the proposal."
        },
        {
            "id": 32,
            "text": "“This deal ensures no money in the fund is used for abortion and that any funding for health services is subject to the longstanding Hyde amendment."
        },
        {
            "id": 33,
            "text": "It ensures taxpayers will not be in a position of facilitating human trafficking by keeping victims on the street,” she said."
        },
        {
            "id": 34,
            "text": "Lynch’s nomination faces a few GOP critics, but has enough votes to get confirmed."
        },
        {
            "id": 35,
            "text": "Republican Sen. John McCain of Arizona, who plans to vote against Lynch’s confirmation, told CNN’s Wolf Blitzer on the “Situation Room” Monday he expects a vote “fairly soon.”"
        },
        {
            "id": 36,
            "text": "McCain pushed back against the notion that Republicans’ five-month refusal to bring Lynch’s nomination up for a vote was a form of retribution against Democrats."
        },
        {
            "id": 37,
            "text": "Earlier on Monday, Democratic Sen. Debbie Stabenow called the delay “politics at its worst.”"
        }
    ]
}