{
    "title": "Justices take dim view of Trump effort to cut illegal immigrants from census count",
    "text": [
        {
            "id": 0,
            "text": "The government’s lawyer told the Supreme Court on Monday that it may be impossible to subtract illegal immigrants from the 2020 census count, undercutting President Trump’s hopes of shifting political power away from the large Democratic-leaning states where illegal immigrants are concentrated."
        },
        {
            "id": 1,
            "text": "Solicitor General Jeffrey Wall said there is no chance the Census Bureau can identify and eliminate all 10 million to 12 million illegal immigrants believed to be in the U.S."
        },
        {
            "id": 2,
            "text": "He said the bureau should be able to identify thousands who were in detention as of April 1, or Census Day, but there is a wide gulf between tens of thousands and 10 million."
        },
        {
            "id": 3,
            "text": "He said the Census Bureau has no clue where the number would land or whether it would make a meaningful dent in the final tally."
        },
        {
            "id": 4,
            "text": "“We just don’t know at this point,” Mr. Wall told the high court during oral arguments conducted by telephone, as has been the practice during the COVID-19 pandemic."
        },
        {
            "id": 5,
            "text": "Justices across the ideological spectrum expressed incredulity with the administration’s inability to say what is possible and suggested that even making an attempt may not survive legal scrutiny."
        },
        {
            "id": 6,
            "text": "“A lot of the historical evidence and the long-standing practice really cuts against your position,” Justice Amy Coney Barrett told Mr. Wall."
        },
        {
            "id": 7,
            "text": "Mr. Trump over the summer signed a directive ordering the Census Bureau to produce two numbers from the 2020 count."
        },
        {
            "id": 8,
            "text": "The first is the usual tally of all people living in the U.S. on April 1, and the second would try to subtract those without permission to be in the country."
        },
        {
            "id": 9,
            "text": "The first number, broken down by state, usually is submitted to Congress in order to divvy up the 435 seats in the U.S. House according to population."
        },
        {
            "id": 10,
            "text": "Mr. Trump wants Congress to use the second number, which could reduce the political clout of states such as California with a large number of illegal immigrants."
        },
        {
            "id": 11,
            "text": "The president’s opponents say he is trying to sweep illegal immigrants back into the shadows by denying them a presence in the count and curtailing their political power."
        },
        {
            "id": 12,
            "text": "“Millions of undocumented immigrants have lived here for decades and have substantial community ties,” New York Solicitor General Barbara Underwood told the court."
        },
        {
            "id": 13,
            "text": "“Their undocumented status doesn’t erase their presence.”"
        },
        {
            "id": 14,
            "text": "“Undocumented” is the term immigrant rights activists use to refer to illegal immigrants."
        },
        {
            "id": 15,
            "text": "They argue that it’s pejorative to call a person “illegal.”"
        },
        {
            "id": 16,
            "text": "U.S. law uses the term “illegal alien,” as did Mr. Wall and many of the justices during Monday’s argument."
        },
        {
            "id": 17,
            "text": "The census count has been completed, though some Democrats on Capitol Hill say too many people were missed and are pushing for a restart."
        },
        {
            "id": 18,
            "text": "What’s at issue now is who counts as an inhabitant for the purposes of apportioning the House."
        },
        {
            "id": 19,
            "text": "Under prodding by Justice Samuel A. Alito Jr., Ms. Underwood said foreign diplomats on a three-year tour of the U.S. shouldn’t count."
        },
        {
            "id": 20,
            "text": "Neither would someone with a temporary tourist visa, she said."
        },
        {
            "id": 21,
            "text": "But she said migrants who came on a visitor visa but overstayed, becoming illegal immigrants, should be counted because they are “now outside the realm of [when] we expect them to leave.”"
        },
        {
            "id": 22,
            "text": "Justice Alito said he wanted to ask about three other categories, but Chief Justice John G. Roberts Jr. cut him off for going over his time limit for questions."
        },
        {
            "id": 23,
            "text": "The court rushed the case onto the docket this year to speed a decision before the Dec. 31 deadline for the Commerce Department, which oversees the census, to send its report to Mr. Trump, and before his January deadline for submitting an apportionment number to Congress."
        },
        {
            "id": 24,
            "text": "Mr. Wall said the court should wait for Mr. Trump’s next move."
        },
        {
            "id": 25,
            "text": "He said the number of illegal immigrants who can be excluded could be so small that it wouldn’t change any state’s seat count, so the whole fight would be for naught."
        },
        {
            "id": 26,
            "text": "He said illegal immigrants who have sneaked into the U.S. without triggering any notice by federal authorities can’t be deleted from the number."
        },
        {
            "id": 27,
            "text": "Meanwhile, the thousands who were in government custody on April 1 are easy to identify, he said."
        },
        {
            "id": 28,
            "text": "Justice Elena Kagan said agencies do have records on some 800,000 recipients of Deferred Action for Childhood Arrivals, 200,000 who have been ordered deported but are still in the U.S., and 3.2 million who are in deportation proceedings."
        },
        {
            "id": 29,
            "text": "Mr. Wall said the Census Bureau would have to be able to match each of those people against a specific record from this year’s census, and the bureau doesn’t know whether it can do that."
        },
        {
            "id": 30,
            "text": "“Until we actually take the census master file and these various administrative records, once they’re all cleaned up and ready to go, and we actually run the models in a few weeks or, you know, whenever it is, we won’t actually know how many people we pick up,” he said."
        },
        {
            "id": 31,
            "text": "Several justices, noting all the unknowns Mr. Wall laid out, said it might make sense to wait until after the president delivers his number to Congress before ruling on the matter."
        },
        {
            "id": 32,
            "text": "Ms. Underwood and Dale Ho, a lawyer at the American Civil Liberties Union who also argued Monday against Mr. Trump, said the organization would be willing to wait."
        },
        {
            "id": 33,
            "text": "“I’d agree that that short of a wait wouldn’t be disruptive,” Mr. Ho said."
        },
        {
            "id": 34,
            "text": "Mr. Wall, though, said it’s not clear what timeline the Census Bureau will be able to meet."
        },
        {
            "id": 35,
            "text": "He said the bureau is “not currently on pace” to get the report to Mr. Trump by the law’s deadline of the end of the year."
        },
        {
            "id": 36,
            "text": "Even then, he said, Mr. Trump has to decide whether he has the “legal discretion” to exclude each of those categories."
        },
        {
            "id": 37,
            "text": "If the decision is pushed beyond Jan. 20, then it would likely fall to presumptive President-elect Joseph R. Biden, who has criticized Mr. Trump’s move and would almost certainly squelch the effort."
        },
        {
            "id": 38,
            "text": "Monday’s case is the third Trump census tussle to reach the high court."
        },
        {
            "id": 39,
            "text": "Last year, the justices shot down the president’s attempt to shoehorn a citizenship question into the full 2020 questionnaire."
        },
        {
            "id": 40,
            "text": "Earlier this year, the court sided with his administration and blocked a lower-court ruling that imposed a one-month overtime in conducting the in-person count because of the COVID-19 pandemic."
        },
        {
            "id": 41,
            "text": ""
        },
        {
            "id": 42,
            "text": ""
        },
        {
            "id": 43,
            "text": ""
        },
        {
            "id": 44,
            "text": ""
        }
    ]
}