{
    "title": "Obama to campaign base: Get going pushing my agenda",
    "text": [
        {
            "id": 0,
            "text": "President Obama gave supporters their marching orders for promoting his agenda Monday night, urging an advocacy group that was created from the remnants of his re-election campaign to get “fired up” for a summer lobbying effort."
        },
        {
            "id": 1,
            "text": "“I’m going to need your help,” Mr. Obama said."
        },
        {
            "id": 2,
            "text": "“Winning is good, but you run for office and you win so that you can actually get things done. … It’s the beginning, not the end, of a process.”"
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "The president spoke to members of Organizing for Action at the Mandarin Oriental in Washington, a luxury hotel where the volunteer lobbying group held a dinner to kick off a monthlong campaign to pressure lawmakers on Mr. Obama’s domestic priorities."
        },
        {
            "id": 5,
            "text": "Among the topics they addressed were gun control, immigration reform, climate change, abortion and Obamacare."
        },
        {
            "id": 6,
            "text": "The president said there is a continued “sense of insecurity” in America, with college students wondering how to pay their loans and many people not yet seeing the benefits of his signature health care law."
        },
        {
            "id": 7,
            "text": "He told volunteers that they need to stay involved on immigration and other issues because “what you do day-to-day … will make the difference.”"
        },
        {
            "id": 8,
            "text": "“The key is to try to make sure that this town refocuses on the issues that matter most to people day to day,” Mr. Obama said."
        },
        {
            "id": 9,
            "text": "Referring to a speech on the economy that he is scheduled to deliver Wednesday in Illinois, Mr. Obama said “the proposals that we put forward are ones that are going to be very difficult to get through this Congress."
        },
        {
            "id": 10,
            "text": "Of course, everything is very difficult to get through this Congress.”"
        },
        {
            "id": 11,
            "text": "The attendees included House Minority Leader Nancy Pelosi, California Democrat; Senate Majority Leader Harry Reid, Nevada Democrat; and Planned Parenthood President Cecile Richards."
        },
        {
            "id": 12,
            "text": "Organizing for Action Executive Director Jon Carson told supporters in an email that the group is gearing up for “Action August” — a month in which its goal is to raise the pressure on lawmakers who will be home for the summer recess on various issues stalled in Congress."
        },
        {
            "id": 13,
            "text": "“It’s all about making sure members of Congress hear directly from the people they represent, on the issues that matter to all of us,” Mr. Carson said."
        },
        {
            "id": 14,
            "text": "“At the top of the list, a comprehensive immigration reform bill is facing a tough path through the House — and we’re going to be out there demanding action from our representatives.”"
        },
        {
            "id": 15,
            "text": "He said Organizing for Action supporters “will be telling the truth about Obamacare, fighting the outright lies about what health care reform means for ordinary Americans.”"
        },
        {
            "id": 16,
            "text": "Last week, when House Republicans voted again to repeal portions of the health care law, Mr. Obama chided them for “refighting these old battles.”"
        },
        {
            "id": 17,
            "text": "“We’ll be calling out the climate deniers who are standing in the way of progress in Washington, and make sure the senators who hold the key votes on gun violence prevention hear from the people who sent them to Congress,” Mr. Carson said."
        },
        {
            "id": 18,
            "text": "“And we’ll be fighting attacks on a woman’s health choices wherever they pop up.”"
        },
        {
            "id": 19,
            "text": "It was the second time Mr. Obama has spoken to the group since it formed in January, led by some of the president’s former campaign officials and making use of the campaign’s extensive email list of millions of supporters."
        },
        {
            "id": 20,
            "text": "Organizing for Action also stepped up its fundraising operation in the second quarter of this year, pulling in $8.2 million, compared with $4.9 million in the first quarter."
        },
        {
            "id": 21,
            "text": "The organization has more than doubled its number of supporters since Jan. 1, reaching 237,688 in the second quarter, up from about 110,000 at the end of the first quarter."
        },
        {
            "id": 22,
            "text": "Among its biggest donors in the second quarter were Fred Eychaner, president of the Chicago-based Newsweb Corp., and David Shaw, co-founder of the New York investment firm D.E. Shaw."
        },
        {
            "id": 23,
            "text": "Each man donated $500,000 to Organizing for Action in the second quarter."
        },
        {
            "id": 24,
            "text": "The organization is operating as a “social welfare” program within the meaning of Section 501c-4 of Internal Revenue Service code, although it has not applied for tax-exempt status."
        },
        {
            "id": 25,
            "text": "Such groups are ostensibly to be nonpolitical, but the organization’s website says it was “established to support President Obama in achieving enactment of the national agenda Americans voted for on Election Day 2012.”"
        }
    ]
}