{
    "title": "Trump to Launch Social Media Platform, Adviser Says",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump holds a campaign event for Republican senators David Perdue and Kelly Loeffler in Valdosta, Ga., December 5, 2020."
        },
        {
            "id": 1,
            "text": "Former President Donald Trump is reportedly planning to launch his own social media platform in the coming months, after being permanently banned from Twitter, Facebook, and other social media platforms following the Capitol riots in January, an adviser to the former president said Sunday."
        },
        {
            "id": 2,
            "text": "Jason Miller, who served as a spokesperson for the 45th president’s 2020 campaign, told Fox News that Trump will be “returning to social media in probably about two or three months” with “his own platform” that will attract “tens of millions” of new users and “completely redefine the game.”"
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "“This is something that I think will be the hottest ticket in social media,” Miller told Howard Kurtz on MediaBuzz."
        },
        {
            "id": 5,
            "text": "“It’s going to completely redefine the game, and everybody is going to be waiting and watching to see what President Trump does, but it will be his own platform.”"
        },
        {
            "id": 6,
            "text": "Miller said several companies have approached Trump hoping to collaborate on the new platform and that the former president is in talks with teams."
        },
        {
            "id": 7,
            "text": "“This new platform is going to be big,” Miller said."
        },
        {
            "id": 8,
            "text": "“Everyone wants him and he’s going to bring millions and millions — tens of millions — to this platform.”"
        },
        {
            "id": 9,
            "text": "After a group of pro-Trump supporters stormed the U.S. Capitol on January 6, Facebook, Twitter, and YouTube were all blasted by critics who said the tech companies could have done more to prevent the escalation of violence."
        },
        {
            "id": 10,
            "text": "Twitter permanently banned Trump in January citing “the risk of further incitement of violence” after hundreds of Twitter employees demanded in a letter that the platform permanently suspend the account because of Trump’s posts about the Capitol riots."
        },
        {
            "id": 11,
            "text": "A social media platform created by the former president could attract Republicans who have rebuked existing social media platforms for allegedly censoring conservative voices."
        },
        {
            "id": 12,
            "text": "A number of right-wing social media users have moved from mainstream platforms such as Facebook and Twitter to less censored platforms such as Parler and Gab."
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}