{
    "title": "Joe Biden's Son, Beau, Passes Away After Brain Cancer Battle ",
    "text": [
        {
            "id": 0,
            "text": "Vice President Joe Biden’s son, Beau Biden, passed away on Saturday after battling brain cancer."
        },
        {
            "id": 1,
            "text": "He was 46 years old."
        },
        {
            "id": 2,
            "text": "Biden released a statement:\n\nIt is with broken hearts that Hallie, Hunter, Ashley, Jill and I announce the passing of our husband, brother and son, Beau, after he battled brain cancer with the same integrity, courage and strength he demonstrated every day of his life."
        },
        {
            "id": 3,
            "text": "The entire Biden family is saddened beyond words."
        },
        {
            "id": 4,
            "text": "We know that Beau’s spirit will live on in all of us—especially through his brave wife, Hallie, and two remarkable children, Natalie and Hunter."
        },
        {
            "id": 5,
            "text": "Beau’s life was defined by service to others."
        },
        {
            "id": 6,
            "text": "As a young lawyer, he worked to establish the rule of law in war-torn Kosovo."
        },
        {
            "id": 7,
            "text": "A major in the Delaware National Guard, he was an Iraq War veteran and was awarded the Bronze Star."
        },
        {
            "id": 8,
            "text": "As Delaware’s Attorney General, he fought for the powerless and made it his mission to protect children from abuse."
        },
        {
            "id": 9,
            "text": "More than his professional accomplishments, Beau measured himself as a husband, father, son and brother."
        },
        {
            "id": 10,
            "text": "His absolute honor made him a role model for our family."
        },
        {
            "id": 11,
            "text": "Beau embodied my father’s saying that a parent knows success when his child turns out better than he did."
        },
        {
            "id": 12,
            "text": "In the words of the Biden family: Beau Biden was, quite simply, the finest man any of us have ever known."
        }
    ]
}