{
    "title": "U.S. Senate Democrats agree to $3.5 trln for budget reconciliation bill",
    "text": [
        {
            "id": 0,
            "text": "Senate Majority Leader Chuck Schumer (D-NY) speaks to news reporters following the announcement of a bipartisan deal on infrastructure, on Capitol Hill in Washington, U.S., June 24, 2021."
        },
        {
            "id": 1,
            "text": "U.S. President Joe Biden's drive for big new infrastructure investment got a boost on Tuesday when leading Senate Democrats agreed on a $3.5 trillion investment plan they aim to include in a budget resolution to be debated soon, Senate Majority Leader Chuck Schumer said."
        },
        {
            "id": 2,
            "text": "\"We have come to an agreement,\" Schumer told reporters after more than two hours of closed-door talks that included Senate Budget Committee Democrats and White House officials."
        },
        {
            "id": 3,
            "text": "Republicans have not been part of these negotiations."
        },
        {
            "id": 4,
            "text": "\"You add that to the $600 billion in a bipartisan plan and you get to $4.1 trillion, which is very, very close to what President Biden has asked us for,\" Schumer said."
        },
        {
            "id": 5,
            "text": "Schumer was referring to work being done on a separate, bipartisan infrastructure bill totaling $1.2 trillion, of which nearly $600 billion would be new spending."
        },
        {
            "id": 6,
            "text": "This bill would finance the rebuilding of roads, bridges and other traditional infrastructure, as well as expand broadband internet service to many rural parts of the United States."
        },
        {
            "id": 7,
            "text": "Democratic and Republican negotiators on the bipartisan measure also reported progress late in the day."
        },
        {
            "id": 8,
            "text": "Schumer said the $3.5 trillion agreement, which still must be endorsed by the 50-member Senate Democratic caucus, would include a significant expansion of the Medicare healthcare program for the elderly - a top goal of Budget Committee Chairman Bernie Sanders."
        },
        {
            "id": 9,
            "text": "Included in the Medicare expansion, Schumer said, will be coverage for dental, hearing and vision healthcare."
        },
        {
            "id": 10,
            "text": "Further details were expected on Wednesday."
        },
        {
            "id": 11,
            "text": "Biden will travel to Capitol Hill on Wednesday, Schumer said, to have lunch with Senate Democrats and discuss the difficult road ahead for advancing the emerging legislation."
        },
        {
            "id": 12,
            "text": "Senator Mark Warner, a moderate Democratic member of the budget panel, said the agreement includes provisions to fully pay for the $3.5 trillion in infrastructure spending, but he did not elaborate."
        },
        {
            "id": 13,
            "text": "The Senate's 50 Republicans are not expected to back the broader infrastructure effort, likely leaving Democrats to pursue passage on their own under a budget \"reconciliation\" process that sidesteps a rule requiring at least 60 votes to advance legislation in the 100-member chamber."
        },
        {
            "id": 14,
            "text": "Biden has been seeking an increase in taxes on corporations and the wealthy to help fund the initiatives."
        },
        {
            "id": 15,
            "text": "While the Senate Democrats did not detail the tax increases that would be part of this effort, Sanders said: \"The wealthy and large corporations are going to pay their fair share of taxes so that we can protect the working families of this country.\""
        },
        {
            "id": 16,
            "text": "Republicans oppose any rolling back of tax cuts, which were achieved in their signature 2017 tax reform law, to finance Biden's infrastructure initiatives."
        },
        {
            "id": 17,
            "text": "Liberal Democrats, including Sanders, had been seeking a much larger infrastructure effort, one that various lawmakers described as costing between $6 trillion and $10 trillion."
        },
        {
            "id": 18,
            "text": "But Biden and moderate Democrats in Congress tamped down those expectations amid complaints from Republicans over the large government expenditures enacted this year to deal with the COVID-19 pandemic and stimulate the economy."
        },
        {
            "id": 19,
            "text": "Despite the lower level of spending than Sanders wanted, he embraced the plan saying that it comes at \"a pivotal moment in American history.\""
        },
        {
            "id": 20,
            "text": "In a nod to climate change programs expected to be included in the infrastructure package, Sanders said, \"Today we begin the process of having this great country lead the world in transforming our energy system.\""
        },
        {
            "id": 21,
            "text": "TWO-TRACK APPROACH"
        },
        {
            "id": 22,
            "text": "Democrats aim to push through Biden's sweeping infrastructure proposals in two phases: The $1.2 trillion bipartisan bill focused on physical infrastructure like roads and bridges and the $3.5 trillion bill that focuses on home care for the elderly and children, climate change and other non-traditional \"human infrastructure.\""
        },
        {
            "id": 23,
            "text": "It would advance through Congress with only Democratic votes in a maneuver known as \"reconciliation.\""
        },
        {
            "id": 24,
            "text": "Under Schumer's \"two-track\" plan for advancing Biden's vast infrastructure investment goals, the Senate would aim to approve the $1.2 trillion bipartisan bill before going on an August recess."
        },
        {
            "id": 25,
            "text": "It also would pass a budget resolution providing the framework for Democratic legislation this fall on the $3.5 trillion measure."
        },
        {
            "id": 26,
            "text": "Senate negotiators on the bipartisan bill, including Republican Senator Rob Portman, said an evening of negotiations brought progress on that measure."
        },
        {
            "id": 27,
            "text": "They added that a Thursday deadline has been set for resolving many of the remaining disagreements, which include how to finance the cost of the bill."
        },
        {
            "id": 28,
            "text": "PUBLIC SUPPORT FOR PLAN"
        },
        {
            "id": 29,
            "text": "An Ipsos poll conducted this month for Reuters found that most Americans want the kind of infrastructure improvements that are included in the plan being pursued by Biden and congressional Democrats."
        },
        {
            "id": 30,
            "text": "The national opinion poll conducted last Wednesday and Thursday found that 84% of adults in the United States supported a government spending plan that would repair or replace aging ports, railways, bridges and highways."
        },
        {
            "id": 31,
            "text": "Seventy-six percent supported investing in home-based care for the elderly or disabled, 74% supported extending high-speed internet access to all Americans, and 69% supported replacing all lead pipes in the United States."
        },
        {
            "id": 32,
            "text": "When asked how to pay for what could be a multi-trillion-dollar effort by Washington, 64% said they would support a tax increase for top-earning Americans, while 27% said they would oppose such a tax increase."
        },
        {
            "id": 33,
            "text": "Only 37% said they were willing to personally pay more in taxes to help fund a government infrastructure plan."
        },
        {
            "id": 34,
            "text": "The Ipsos poll gathered responses from 1,004 adults and the results had a credibility interval, a measure of precision, of 4 percentage points."
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}