{
    "title": "Sessions likens California sanctuary laws to slave-state nullification",
    "text": [
        {
            "id": 0,
            "text": "Attorney General Jeff Sessions compared California’s new sanctuary city laws to attempts by slave-holding southern states to nullify federal laws, and blasted California officials Wednesday for attempting to force a “radical open borders agenda” on the rest of the country."
        },
        {
            "id": 1,
            "text": "Speaking to California police and sheriffs, Mr. Sessions defended his decision to file a lawsuit against California this week seeking to block three state laws he says are thwarting federal agents’ ability to stop illegal immigration."
        },
        {
            "id": 2,
            "text": "And he took specific aim at Oakland Mayor Libby Schaaf, saying she actively aided illegal immigrants in escaping arrest last month by warning them of an impending sweep by federal deportation officers."
        },
        {
            "id": 3,
            "text": "“Here’s my message to Mayor Schaaf: How dare you,” the attorney general said."
        },
        {
            "id": 4,
            "text": "“How dare you needlessly endanger the lives of law enforcement to promote a radical open borders agenda.”"
        },
        {
            "id": 5,
            "text": "Ms. Schaaf has defended her actions, saying she was trying to give illegal immigrants the tools to defend their rights, and saying she wanted to keep families together."
        },
        {
            "id": 6,
            "text": "She won praise from state officials, who said California is proud to be a sanctuary."
        },
        {
            "id": 7,
            "text": "The state government approved three laws last year that severely limit cooperation police can provide to federal immigration authorities, and also prohibit private businesses from cooperating as well."
        },
        {
            "id": 8,
            "text": "Mr. Sessions said those laws interfere with the federal government, which under the Constitution and laws passed by Congress has supreme power over immigration."
        },
        {
            "id": 9,
            "text": "“There is no nullification."
        },
        {
            "id": 10,
            "text": "There is no secession,” he said."
        },
        {
            "id": 11,
            "text": "“Federal law is ‘the supreme law of the land.’"
        },
        {
            "id": 12,
            "text": "I would invite any doubters to go to Gettysburg, to the tombstones of John C. Calhoun and Abraham Lincoln."
        },
        {
            "id": 13,
            "text": "This matter has been settled.”"
        },
        {
            "id": 14,
            "text": "Mr. Sessions called the laws “an embarrassment” to the state."
        },
        {
            "id": 15,
            "text": "He wondered what would happen if a state passed a law to thwart the Environmental Protection Agency’s ability to target polluters."
        },
        {
            "id": 16,
            "text": "California officials have defended their policies, saying federal agents are allowed to conduct enforcement — but state and local police shouldn’t be forced to assist."
        },
        {
            "id": 17,
            "text": "They argue that immigrants, including those in the country legally, are less willing to cooperate on reporting other crimes if they fear immigration agents could become involved."
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        }
    ]
}