{
    "title": "U.S. Justice Department sues California over 'sanctuary' policies",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON/SAN FRANCISCO  -"
        },
        {
            "id": 1,
            "text": "The U.S. Justice Department sued the state of California over so-called “sanctuary” policies that try to protect illegal immigrants against deportation, ramping up a confrontation over whether local police should enforce federal law."
        },
        {
            "id": 2,
            "text": "The lawsuit, filed late Tuesday in federal court in Sacramento, the California state capital, takes aim at three state laws passed last year that the Justice Department contends violate the U.S. Constitution."
        },
        {
            "id": 3,
            "text": "The issue of illegal immigrants has become increasingly heated since Donald Trump became president last year and signaled that he planned to target a wider swath of people for deportation."
        },
        {
            "id": 4,
            "text": "Trump’s attorney general, Jeff Sessions, has made combating illegal immigration one of his top priorities since taking over the helm of the Justice Department in February 2017."
        },
        {
            "id": 5,
            "text": "A key part of that effort involves a crackdown on primarily Democrat-governed cities and states that Sessions claims are “sanctuaries” that protect illegal immigrants from deportation."
        },
        {
            "id": 6,
            "text": "Sessions is expected to discuss the lawsuit during a speech on Wednesday morning in Sacramento."
        },
        {
            "id": 7,
            "text": "The Justice Department lawsuit cites a provision of the U.S. Constitution known as the “Supremacy Clause,” under which federal laws trump state laws."
        },
        {
            "id": 8,
            "text": "California Attorney General Xavier Becerra on Tuesday said law enforcement in the state is focused on public safety, not deportation."
        },
        {
            "id": 9,
            "text": "The Trump administration’s legal arguments are similar to those it has made in other cases, he said, and his office is prepared to address them."
        },
        {
            "id": 10,
            "text": "“We’ve seen this ‘B’ rated movie before,” Becerra said on a call with reporters."
        },
        {
            "id": 11,
            "text": "U.S. Attorney General Jeff Sessions at the White House in Washington, U.S., March 1, 2018."
        },
        {
            "id": 12,
            "text": "Brown in October signed into law a bill that prevents police from inquiring about immigration status and curtails law enforcement cooperation with immigration officers."
        },
        {
            "id": 13,
            "text": "“The Department of Justice and the Trump administration are going to fight these unjust, unfair and unconstitutional policies that have been imposed on you,” Sessions plans to tell a group of law enforcement officers on Wednesday, according to prepared remarks seen by Reuters."
        },
        {
            "id": 14,
            "text": "Early into his tenure, Trump signed an executive order that sought to block municipalities that failed to cooperate with U.S. immigration authorities from receiving federal grant funding."
        },
        {
            "id": 15,
            "text": "However, the Justice Department’s attempts to implement the order to date have been stymied by lawsuits in the federal courts in Chicago, San Francisco and Philadelphia."
        },
        {
            "id": 16,
            "text": "At issue is whether sanctuary cities are violating a federal law that requires them to share information about people they arrest with the U.S. Immigration and Customs Enforcement agency."
        },
        {
            "id": 17,
            "text": "One case is now on appeal, after a federal judge in San Francisco blocked Trump’s executive order to block funding to sanctuary cities."
        },
        {
            "id": 18,
            "text": "Similar kinds of cases are under way in other parts of the country, including a case on appeal in Chicago after a federal judge issued a nationwide injunction barring the government from blocking grant money typically used to help local police combat violent crime and help victims."
        },
        {
            "id": 19,
            "text": "The Justice Department’s lawsuit on Tuesday against California targets three state laws."
        },
        {
            "id": 20,
            "text": "One of them, known as Assembly Bill 450, prohibits private employers in California from voluntarily cooperating with federal immigration officials."
        },
        {
            "id": 21,
            "text": "A second law, Senate Bill 54, prevents state and local law enforcement from giving federal immigration officials information about when they intend to release an illegal immigrant from their custody."
        },
        {
            "id": 22,
            "text": "The third law empowers the state to inspect federal immigration detention centers."
        },
        {
            "id": 23,
            "text": "The Justice Department filing says all three laws improperly attempt to regulate federal immigration at the state level."
        },
        {
            "id": 24,
            "text": "The department also plans to seek a court order from a judge to temporarily block the state from enforcing the laws."
        }
    ]
}