{
    "title": "Feds to charge Robert Menendez with corruption",
    "text": [
        {
            "id": 0,
            "text": "Embattled Sen. Robert Menendez is unlikely to resign his Senate seat amid looming criminal corruption charges that he allegedly used his office to benefit a well-heeled donor, according to sources familiar with the matter."
        },
        {
            "id": 1,
            "text": "Instead, Menendez, who has survived past scrutiny by federal prosecutors over his actions for years, plans to fight the Justice Department and clear his name, sources said."
        },
        {
            "id": 2,
            "text": "At a press conference in Newark on Friday evening, he said that he has broken no laws and made no mention of plans to step down."
        },
        {
            "id": 3,
            "text": "“Let me be very clear, very clear."
        },
        {
            "id": 4,
            "text": "I have always conducted myself appropriately and in accordance with the law,” Menendez said."
        },
        {
            "id": 5,
            "text": "“I am not going anywhere.”"
        },
        {
            "id": 6,
            "text": "It remains to be seen whether Menendez can hang onto his spot as ranking Democrat on the Senate Foreign Relations Committee once corruption charges are filed."
        },
        {
            "id": 7,
            "text": "Two other senators in recent years, the late Ted Stevens of Alaska and John Ensign of Nevada, each stepped aside from leadership posts as they faced scrutiny over their actions in public office."
        },
        {
            "id": 8,
            "text": "And Menendez as well as Senate Minority Leader Harry Reid (D-Nev.) are likely to face heightened pressure after the Justice Department unveils the charges."
        },
        {
            "id": 9,
            "text": "Menendez made no mention of any plans to relinquish his prominent committee perch."
        },
        {
            "id": 10,
            "text": "As the panel’s top Democrat Menendez is squarely in the middle of an uphill battle for Congress to authorize force against the Islamic State, a full plate well before the corruption charges’ hit."
        },
        {
            "id": 11,
            "text": "The comments come as sources said Friday afternoon that federal prosecutors preparing to bring federal charges against Menendez, who plans to address the charges at a news conference in Newark Friday night."
        },
        {
            "id": 12,
            "text": "A federal grand jury in New Jersey has for months been investigating Menendez’s interactions with Salomon Melgen, a close friend and financial backer of the senator, prompting Menendez to rack up hundreds of thousands in legal bills as the probe intensified."
        },
        {
            "id": 13,
            "text": "A New Jersey newspaper reported this week that several Menendez aides declined to answer questions before the grand jury, citing a constitutional privilege that covers the New Jersey Democrat and other lawmakers and staff."
        },
        {
            "id": 14,
            "text": "It is unclear if Menendez has appeared before the grand jury, although it is considered very unlikely by sources close to the case."
        },
        {
            "id": 15,
            "text": "Sources familiar with the probe say the Justice Department’s Public Integrity unit, which prosecutes federal officials, along with the FBI have cast a wide net, looking at his public actions even before he first came to Congress as a House member in 1993."
        },
        {
            "id": 16,
            "text": "Menendez was appointed to the Senate in 2006, and won reelection in 2012."
        },
        {
            "id": 17,
            "text": "In his 2006 and 2012 races, Menendez faced scrutiny over whether he improperly used his office to help his allies."
        },
        {
            "id": 18,
            "text": "CNN first reported the expected corruption charges, which could come in the next few weeks."
        },
        {
            "id": 19,
            "text": "The charges imperil the career of the powerful New Jersey Democrat, who has emerged as a prominent Democratic skeptic of the White House’s dealings with Iran and Cuba."
        },
        {
            "id": 20,
            "text": "In 2009 and 2012, Menendez intervened with top officials at the Centers for Medicare and Medicaid Services — the agency that oversees the Medicare program — about a CMS ruling that Melgen had overbilled the Medicare program by nearly $9 million."
        },
        {
            "id": 21,
            "text": "Melgen has repaid those funds."
        },
        {
            "id": 22,
            "text": "FBI agents and investigators from the Department of Health and Human Services have searched the Florida ophthalmologist’s offices twice as part of the probe."
        },
        {
            "id": 23,
            "text": "Other actions by Menendez have also come under scrutiny."
        },
        {
            "id": 24,
            "text": "He contacted the State and Commerce departments for help in pressuring the Dominican Republic’s government to honor a contract with a port security company owned by Melgen."
        },
        {
            "id": 25,
            "text": "The senator had traveled repeatedly on Melgen’s private plane, and Menendez was forced to repay $70,000 from his own pocket for some unreported flights after they came to light."
        },
        {
            "id": 26,
            "text": "Melgen has also donated heavily to Menendez’s campaigns, including $700,000 in 2012 to a Democratic super PAC that spent heavily to help the senator secure reelection."
        },
        {
            "id": 27,
            "text": "“We celebrated holidays together, we have been there for family weddings and sad times like funerals."
        },
        {
            "id": 28,
            "text": "And have given each other birthday, holiday and wedding presents just as friends do,” Menendez said on Friday night."
        },
        {
            "id": 29,
            "text": "Menendez made no reference to the corruption charges or Justice probe on Friday night other than a reference to an “ongoing inquiry.”"
        },
        {
            "id": 30,
            "text": "The senator’s office has denied any wrongdoing by Menendez in his dealings with Melgen."
        },
        {
            "id": 31,
            "text": "“As we have said before, we believe all of the senator’s actions have been appropriate and lawful and the facts will ultimately confirm that."
        },
        {
            "id": 32,
            "text": "Any actions taken by Senator Menendez or his office have been to appropriately address public policy issues and not for any other reason,” his spokeswoman, Tricia Enright, said in a statement."
        },
        {
            "id": 33,
            "text": "“The start of this investigation is suspect,” Enright added."
        },
        {
            "id": 34,
            "text": "“We know many false allegations have been made about this matter, allegations that were ultimately publicly discredited."
        },
        {
            "id": 35,
            "text": "We also know that the official investigation of this matter is ongoing, and therefore cannot address allegations being made anonymously.”"
        },
        {
            "id": 36,
            "text": "Attorney General Eric Holder declined to discuss Menendez when approached by reporters on Friday."
        },
        {
            "id": 37,
            "text": "“I can’t comment on that,” Holder said."
        },
        {
            "id": 38,
            "text": "Menendez will soon have a say in Holder’s replacement, when the Senate votes on whether to confirm Loretta Lynch as the next attorney general."
        },
        {
            "id": 39,
            "text": "In 2012, the Daily Caller, a conservative news outlet, published a report that Menendez had sex with underage prostitutes while staying at Melgen’s home in an exclusive resort in the Dominican Republic."
        },
        {
            "id": 40,
            "text": "Menendez angrily denied the report, which came just days before the 2012 election and could not be substantiated."
        },
        {
            "id": 41,
            "text": "However, the media attention surrounding Menendez’s relationship with Melgen led to the discovery of several unreported flights by the senator on Melgen’s plane."
        },
        {
            "id": 42,
            "text": "The FBI and other federal investigators began looking into the Menendez-Melgen relationship, which eventually led to the expected criminal charges against the senator."
        },
        {
            "id": 43,
            "text": "The 61-year-old Menendez is not up for reelection until 2018."
        },
        {
            "id": 44,
            "text": "It remains to be seen whether it will be politically tenable for him to remain in his position on the Foreign Relations Committee, where he helps shape U.S. foreign policy debates and receives classified information, if he is indicted."
        },
        {
            "id": 45,
            "text": "Reid and other top Democrats will come under pressure to force Menendez out of that post."
        },
        {
            "id": 46,
            "text": "Rep. Charlie Rangel (D-N.Y.) had to step down as Ways and Means Committee chairman when he came under investigation, and Stevens had to give up his post as ranking member on the Appropriations Committee when he was indicted in 2008."
        },
        {
            "id": 47,
            "text": "It’s not the first time Menendez has faced legal scrutiny."
        },
        {
            "id": 48,
            "text": "In 2006, FBI agents began looking into Menendez’s relationship with a nonprofit organization that rented office space from him."
        },
        {
            "id": 49,
            "text": "Menendez had secured millions of dollars in federal funds for the organization."
        },
        {
            "id": 50,
            "text": "Republicans attacked Menendez repeatedly over the issue during a nasty 2006 Senate race, but the Democrat vehemently denied any wrongdoing and the controversy failed to derail his election."
        },
        {
            "id": 51,
            "text": "In an unusual move in 2011, the Justice Department announced the criminal probe had ended."
        },
        {
            "id": 52,
            "text": "In addition to his ties to Melgen, federal investigators have more recently on Menendez’s ties to Roberto Isaias and William Isaias."
        },
        {
            "id": 53,
            "text": "The brothers, who fled to the United States, are fighting extradition to Ecuador over charges that they allegedly embezzled tens of millions of dollars from the country’s largest bank before it collapsed and had to be rescued by the Ecuadoran government."
        },
        {
            "id": 54,
            "text": "The Isaias brothers were sentenced in absentia to eight years in prison."
        },
        {
            "id": 55,
            "text": "Menendez repeatedly contacted senior officials in the State and Homeland Security departments on the family’s behalf."
        },
        {
            "id": 56,
            "text": "Menendez also intervened with the State Department on behalf of Estefania Isaias, the daughter of Roberto Isaias, over her visa problems, according to media reports."
        },
        {
            "id": 57,
            "text": "Family members of the Isaias’ brothers donated $10,000 to Menendez’s 2012 reelection campaign, as well as more than $100,000 to the Democratic Party."
        }
    ]
}