{
    "title": "Experts: Ryan’s livestream crackdown may be unconstitutional",
    "text": [
        {
            "id": 0,
            "text": "Paul Ryan’s new crackdown against protests on the House floor — a direct response to the Democrats’ gun-control “sit-in” last summer — is prompting questions from experts in both parties about its constitutionality."
        },
        {
            "id": 1,
            "text": "As part of a House rules package members will vote to approve in early January, House GOP leaders want to empower the sergeant-at-arms to fine lawmakers up to $2,500 for shooting video or taking photos on the chamber floor."
        },
        {
            "id": 2,
            "text": "But experts say Ryan’s proposal may run afoul of Article 1 of the Constitution, which says “each House may … punish its Members for disorderly behavior.”"
        },
        {
            "id": 3,
            "text": "For more than 200 years that has been interpreted to mean any contested sanctions against lawmakers must be approved by the full House with a floor vote, attorneys steeped in congressional legal matters say."
        },
        {
            "id": 4,
            "text": "“The Constitution gives the House the authority to discipline members; I have never heard of anything where an officer of the House was given that authority,” said Mike Stern, a former lawyer for the nonpartisan House counsel’s office and the Senate Homeland Security Committee’s GOP staff."
        },
        {
            "id": 5,
            "text": "Stern, who called the proposed rule a “plausible Constitutional issue to raise,” said Democrats could take the matter to court."
        },
        {
            "id": 6,
            "text": "“Their strongest argument would be: The House doesn’t have the authority to give these officers the power to punish us; only the power of the House can do that, and [Republicans] have short-circuited our rights by the way they’ve done it.’”"
        },
        {
            "id": 7,
            "text": "House rules prohibit taking video or photos of the floor."
        },
        {
            "id": 8,
            "text": "But Democrats defied those restrictions in June, using their cellphones to live-stream a 25-hour protest triggered by Ryan’s refusal to allow a gun-control vote."
        },
        {
            "id": 9,
            "text": "After Democrats seized the floor and refused to yield, Republicans shut down the chamber."
        },
        {
            "id": 10,
            "text": "C-SPAN had been airing the demonstration, but its cameras, which are controlled by the House majority, were turned off when the House shut down."
        },
        {
            "id": 11,
            "text": "The network then picked up a cellphone live-stream from one of the lawmakers protesting."
        },
        {
            "id": 12,
            "text": "Republicans were incensed by the entire spectacle."
        },
        {
            "id": 13,
            "text": "For months GOP leaders met privately to craft a plan to either punish lawmakers who led the charge or write new rules to deter a similar future hijacking of legislative business."
        },
        {
            "id": 14,
            "text": "That led to Ryan’s current proposal."
        },
        {
            "id": 15,
            "text": "As Democrats blasted the new rule Tuesday, House Minority Leader Nancy Pelosi (D-Calif.) and lawyers representing the Democratic minority began examining its legality."
        },
        {
            "id": 16,
            "text": "“We are reviewing this language as it appears to raise constitutional concerns,” Pelosi spokesman Drew Hammill told POLITICO in an email Tuesday."
        },
        {
            "id": 17,
            "text": "Some Democrats are itching for a fight over the rule."
        },
        {
            "id": 18,
            "text": "Rep. Eric Swalwell (D-Calif.), one of the leaders of last summer’s protest, tweeted at Republicans to “bring it on” and dared them to “fine me & @HouseDemocrats all the way into bankruptcy for #gunviolence sit-in, but we will always speak for victims.\""
        },
        {
            "id": 19,
            "text": "“If they cut the camera feed again, I’m going to turn on my phone again,” Swalwell vowed during a brief interview Tuesday."
        },
        {
            "id": 20,
            "text": "Ryan's spokeswoman, AshLee Strong, dismissed the notion that the rule might be unconstitutional."
        },
        {
            "id": 21,
            "text": "Strong said the changes \"will help ensure that order and decorum are preserved in the House\" and pointed to existing automatic penalties for members who fail to file financial disclosure paperwork on time to argue that it's not unprecedented."
        },
        {
            "id": 22,
            "text": "(That $200 penalty, imposed by the bipartisan ethics panel, was instituted in law to ensure members don't hide unlawful conflicts of interest.)"
        },
        {
            "id": 23,
            "text": "At the crux of the debate is a question of whether the House can delegate punishment authority."
        },
        {
            "id": 24,
            "text": "Lawmakers don’t work for party leadership or House administrative staff; they work for themselves and their constituents."
        },
        {
            "id": 25,
            "text": "So the question of docking pay is a tricky one on Capitol Hill."
        },
        {
            "id": 26,
            "text": "Typically, ethical issues regarding lawmakers are referred to the House Ethics Committee, a bipartisan panel split evenly between Democrats and Republicans that can recommend sanctions against a member."
        },
        {
            "id": 27,
            "text": "If a lawmaker protests the sanctions, the matter goes to the full House floor."
        },
        {
            "id": 28,
            "text": "The body then decides with a vote whether the member is guilty and should be punished."
        },
        {
            "id": 29,
            "text": "Ryan’s plan to essentially designate that power to the sergeant-at-arms “could be a problem,” said Stan Brand, a former longtime House counsel for the Democrats."
        },
        {
            "id": 30,
            "text": "During his stint on Capitol Hill, Brand said he litigated a dispute surrounding a century-old statute that barred members from taking pay for days they weren’t working."
        },
        {
            "id": 31,
            "text": "But while the statute gave the sergeant-at-arms the authority to deduct member pay, he “never did,” Brand said, “because he never felt he had the power to do it.”"
        },
        {
            "id": 32,
            "text": "Brand said the sergeant-at-arms doesn’t have as many legal protections as lawmakers and could actually be sued by House members should they feel he unlawfully deducted their pay."
        },
        {
            "id": 33,
            "text": "Brand said it would be better if Republicans simply used their own authority to punish members with a House vote — and not “pass on their dirty work,” as he put it, to nonpartisan House staff."
        },
        {
            "id": 34,
            "text": "“It’s the House that has the power, the self-disciplinary authority, to do this,” Brand said, noting that it’s never been tested in court."
        },
        {
            "id": 35,
            "text": "“I’m not sure they can delegate the disciplinary power to an individual house officer.”"
        },
        {
            "id": 36,
            "text": "Robert Walker, former chief counsel and staff director to the Senate and House ethics panels, did not think Republicans would run afoul of the Constitution with the new rule."
        },
        {
            "id": 37,
            "text": "But he nonetheless wasn’t sure it was a good idea because it could open the door to the House delegating other duties to officers."
        },
        {
            "id": 38,
            "text": "“Do members really want to start this?” he asked."
        },
        {
            "id": 39,
            "text": ""
        },
        {
            "id": 40,
            "text": "“Once you start delegating punishment to an officer, it raises a question of precedent and whether it can be expanded, and I think members will want to think carefully before they do this.”"
        },
        {
            "id": 41,
            "text": "Walker also noted that members don’t appear to have a venue to appeal the verdict: “What happens when there is a difficult circumstance and one of the members thinks there ought to be a right to appeal?"
        },
        {
            "id": 42,
            "text": "Maybe you add that to the rule: a right to appeal."
        },
        {
            "id": 43,
            "text": "Members ought to have procedural rights as well.”"
        },
        {
            "id": 44,
            "text": "Republicans could recraft the proposal to alleviate such concerns, but that might ultimately defeat their initial intent: deterring Democrats from future occupations of the chamber."
        },
        {
            "id": 45,
            "text": "One option could be to have the ethics panel serve as an appeals panel."
        },
        {
            "id": 46,
            "text": "But, as Stern notes, the committee “takes forever” to litigate so “I don’t think it would be as much of a deterrent.”"
        },
        {
            "id": 47,
            "text": "The panel is also evenly split between Democrats and Republicans, potentially allowing the minority to block a punishment."
        },
        {
            "id": 48,
            "text": "Republicans could also amend the rule to force the House to vote to approve the sanctions on members."
        },
        {
            "id": 49,
            "text": "But that, in theory, would allow Democrats to continue the public spectacle Republicans are trying to quash, giving them an even larger platform for their cause."
        },
        {
            "id": 50,
            "text": "\"Look, I understand the Republicans are trying not to inflame things by coming up with something to put a stop on [this protesting], but there is no way around them exercising their own authority to control breeches of decorum,\" Brand said."
        },
        {
            "id": 51,
            "text": "\"That’s the way do it — not by delegating it to some poor officer of the House.”"
        }
    ]
}