{
    "title": "Trump Says Sotomayor, Ginsburg Should Recuse Themselves From Cases Involving Him",
    "text": [
        {
            "id": 0,
            "text": "Trump Says Sotomayor, Ginsburg Should Recuse Themselves From Cases Involving Him."
        },
        {
            "id": 1,
            "text": "President Trump criticized remarks by Justices Sonia Sotomayor and Ruth Bader Ginsburg as \"inappropriate\" and said the Supreme Court justices should recuse themselves from cases involving the president."
        },
        {
            "id": 2,
            "text": "\"I just don't know how they cannot recuse themselves for anything Trump or Trump related,\" Trump said Tuesday in a wide-ranging news conference in New Delhi."
        },
        {
            "id": 3,
            "text": "\"What Justice Sotomayor said yesterday was highly inappropriate,\" Trump added."
        },
        {
            "id": 4,
            "text": "\"She's trying to shame people with perhaps a different view into voting her way.\""
        },
        {
            "id": 5,
            "text": "The remarks are an apparent reference to a recent Sotomayor dissent in which she wrote that the administration had made a habit of turning to the Supreme Court after losses in lower courts."
        },
        {
            "id": 6,
            "text": "\"Claiming one emergency after another, the government has recently sought stays in an unprecedented number of cases, demanding immediate attention and consuming limited court resources in each,\" Sotomayor wrote."
        },
        {
            "id": 7,
            "text": "\"And with each successive application, of course, its cries of urgency ring increasingly hollow.\""
        },
        {
            "id": 8,
            "text": "She added that the Supreme Court was \"partly to blame\" because it \"has been all too quick to grant the government's\" requests."
        },
        {
            "id": 9,
            "text": "Ginsburg had previously criticized Trump before he was elected president."
        },
        {
            "id": 10,
            "text": "Earlier, Trump tweeted: \"Sotomayor accuses GOP appointed Justices of being biased in favor of Trump. ..."
        },
        {
            "id": 11,
            "text": "This is a terrible thing to say."
        },
        {
            "id": 12,
            "text": "Trying to 'shame' some into voting her way?"
        },
        {
            "id": 13,
            "text": "She never criticized Justice Ginsberg when she called me a 'faker'."
        },
        {
            "id": 14,
            "text": "Both should recuse themselves.\""
        },
        {
            "id": 15,
            "text": "The comments, made on the final day of his three-day visit to India, capped an otherwise positive trip for Trump:"
        },
        {
            "id": 16,
            "text": "He was feted by the Indian government of Prime Minister Narendra Modi, covered positively by the Indian media, and greeted by large crowds at a newly built cricket stadium in the western city of Ahmedabad."
        },
        {
            "id": 17,
            "text": "The visit to India offered a welcome distraction to the president who, despite his acquittal earlier this month by the U.S. Senate following his impeachment by the House of Representatives, has continued to rail against congressional Democrats."
        },
        {
            "id": 18,
            "text": "Trump has previously criticized the judge in the trial of his ally Roger Stone, prompting pushback from his attorney general, William Barr; and last week, prior to his departure, news reports said that intelligence officials had told a House panel that Russia seemed to favor Trump in the 2020 election."
        },
        {
            "id": 19,
            "text": "Addressing that issue Tuesday, Trump accused Rep. Adam Schiff, the California Democrat who chairs the House Intelligence Committee and who spearheaded the president's impeachment, of leaking details of the intelligence assessment."
        },
        {
            "id": 20,
            "text": "Schiff has vigorously denied the allegation."
        },
        {
            "id": 21,
            "text": "The president also said he hadn't been briefed on the intelligence that suggested Russia was helping his campaign and that of Sen. Bernie Sanders of Vermont."
        },
        {
            "id": 22,
            "text": "\"Nobody ever told me that,\" he said."
        },
        {
            "id": 23,
            "text": "He later added: \"I want no help from any country, and I haven't been given any help from any country.\""
        },
        {
            "id": 24,
            "text": "The president tweeted repeatedly about many of those developments during his India trip."
        },
        {
            "id": 25,
            "text": "On Tuesday, he had the opportunity to address them in person."
        },
        {
            "id": 26,
            "text": "In a meeting with Indian business leaders Tuesday, Trump said he believed the U.S. economy would be hurt \"if the wrong person gets elected\" in November."
        },
        {
            "id": 27,
            "text": "\"Everything will come to a halt,\" he said."
        },
        {
            "id": 28,
            "text": "Trump also addressed the U.S. stock market's plunge Monday, in which the Dow fell more than 1,000 points, or 3.56%, amid fears that the coronavirus would become a global pandemic."
        },
        {
            "id": 29,
            "text": "Trump tweeted Monday that the coronavirus \"is very much under control in the USA\" and that the \"stock market starting to look very good to me.\""
        },
        {
            "id": 30,
            "text": "Earlier in the day Tuesday he said the stock market's plunge would \"work out fine.\""
        },
        {
            "id": 31,
            "text": "Dow futures were up slightly after Trump's remarks Tuesday."
        },
        {
            "id": 32,
            "text": "On Monday, the White House sought an additional $2.5 billion from Congress to help in the fight against coronavirus."
        },
        {
            "id": 33,
            "text": "Trump leaves India later Tuesday following a state dinner in New Delhi."
        }
    ]
}