{
    "title": "House Judiciary plans vote this week to subpoena Mueller’s report",
    "text": [
        {
            "id": 0,
            "text": "The House Judiciary Committee plans to vote Wednesday to authorize subpoenas to obtain the full report of special counsel Robert S. Mueller III, escalating a feud with the Justice Department over a lengthy document detailing findings about Russian interference in the 2016 presidential election."
        },
        {
            "id": 1,
            "text": "Barr pledged last week to release a redacted version by mid-April, well after Nadler’s deadline."
        },
        {
            "id": 2,
            "text": "Nadler’s committee is seeking to obtain the “full and complete report,” which spans nearly 400 pages, as well as underlying evidence."
        },
        {
            "id": 3,
            "text": "Democrats say they will accuse Barr of a ‘coverup’ if he delivers incomplete Mueller report\n\n“As I have made clear, Congress requires the full and complete Special Counsel report, without redactions, as well as access to the underlying evidence,” Jerrold Nadler said in a statement Monday, in which he urged Barr to reconsider meeting his Tuesday deadline, which Republicans have criticized as arbitrary."
        },
        {
            "id": 4,
            "text": "“The full and complete report must be released to Congress without delay.”"
        },
        {
            "id": 5,
            "text": "Barr informed Congress on March 24 of Mueller’s main findings, writing in a four-page letter to the heads of the House and Senate judiciary committees that the report did not establish a criminal conspiracy between the Trump campaign and Russia to sway the election and offered no conclusion on whether the president sought to obstruct justice during the investigation."
        },
        {
            "id": 6,
            "text": "Absent a firm conclusion from Mueller, Barr, in consultation with Deputy Attorney General Rod J. Rosenstein, determined there was insufficient evidence to establish obstruction, the summary said."
        },
        {
            "id": 7,
            "text": "President Trump has declared that the report amounted to “a complete and total exoneration” for him, while Democrats have begun accusing Barr of angling to protect Trump, who appointed Barr to lead the Justice Department."
        },
        {
            "id": 8,
            "text": "On Monday, Trump asserted on Twitter that “no matter what information is given to the crazed Democrats from the No Collusion Mueller Report, it will never be good enough.”"
        },
        {
            "id": 9,
            "text": "“Behind closed doors the Dems are laughing!” he added."
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": "A Justice Department spokeswoman declined to comment Monday on Nadler’s subpoena plans."
        },
        {
            "id": 12,
            "text": "Rep. Douglas A. Collins (R-Ga.), the top Republican on the Judiciary Committee, accused his Democratic colleagues of having “escalated from setting arbitrary deadlines to demanding unredacted material that Congress does not, in truth, require and that the law does not allow to be shared outside the Justice Department.”"
        },
        {
            "id": 13,
            "text": "“It’s unfortunate that a body meant to uphold the law has grown so desperate that it’s patently misrepresenting the law, even as the attorney general has already demonstrated transparency above and beyond what is required,” he said."
        },
        {
            "id": 14,
            "text": "At a news conference last week, House Speaker Nancy Pelosi (D-Calif.) expressed frustration with the way Barr has handled the report, calling it “condescending” and “arrogant.”"
        },
        {
            "id": 15,
            "text": "“We do not need your interpretation."
        },
        {
            "id": 16,
            "text": "Show us the report,” she said."
        },
        {
            "id": 17,
            "text": "Nadler said Monday that his Democratic-led panel also plans to vote to authorize subpoenas for five former White House aides who might have received documents relevant to the special counsel’s investigation: former White House counsel Donald McGahn; former chief strategist Stephen K. Bannon; former communications director Hope Hicks; former chief of staff Reince Priebus; and Ann Donaldson, McGahn’s former chief of staff."
        },
        {
            "id": 18,
            "text": "The five were among 81 individuals and entities to whom Nadler sent requests for documents last month as part of a larger probe into potential abuse of power by Trump."
        },
        {
            "id": 19,
            "text": "“I am grateful to the many individuals who have cooperated with our initial request for documents,” Nadler said in his statement."
        },
        {
            "id": 20,
            "text": "“Regrettably, not everyone has chosen to voluntarily cooperate with the committee at this time...."
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": "To this end, I have asked the committee to authorize me to issue subpoenas, if necessary, to compel the production of documents and testimony.”"
        },
        {
            "id": 23,
            "text": "In announcing plans for potential subpoenas, the Judiciary Committee pointed to several precedents in which the Justice Department had shared extensive material related to other investigations with Congress, including the probe of Hillary Clinton’s use of a private email server while secretary of state."
        },
        {
            "id": 24,
            "text": "Committee aides said the timing of the issuance of any of the subpoenas authorized by the committee would be left up to Nadler."
        },
        {
            "id": 25,
            "text": "In an opinion piece published Monday by the New York Times, Nadler also sought to make the case for releasing the full report and predicted Congress would act to address Trump’s actions."
        },
        {
            "id": 26,
            "text": "“When the full scope of the president’s misconduct has been revealed, when his lies are debunked and his abuses have been laid bare, I believe that members of Congress on both sides of the aisle will draft legislation to curb the worst of his offenses,” Nadler wrote."
        },
        {
            "id": 27,
            "text": "“Put another way: If President Trump’s behavior wasn’t criminal, then perhaps it should have been.”"
        },
        {
            "id": 28,
            "text": "Separately, the Reporters Committee for Freedom of the Press filed a request in the U.S. District Court for the District of Columbia for an order that would authorize the public release of grand jury material that is “cited, quoted, or referenced” in the Mueller report."
        },
        {
            "id": 29,
            "text": "“The calls for transparency are broad and bipartisan,” said the group’s legal director, Katie Townsend."
        },
        {
            "id": 30,
            "text": "“The president himself has said the report should be made public."
        },
        {
            "id": 31,
            "text": "We agree."
        },
        {
            "id": 32,
            "text": "The public is entitled to see as much of the Mueller report, unredacted, as possible.”"
        },
        {
            "id": 33,
            "text": ""
        }
    ]
}