{
    "title": "Paul Ryan will face 'monumental obstacles' as speaker",
    "text": [
        {
            "id": 0,
            "text": "Rep. Paul Ryan is walking into a hornet’s nest."
        },
        {
            "id": 1,
            "text": "After he managed to win support from his warring caucus, the full House is expected to elect Ryan as speaker on Thursday."
        },
        {
            "id": 2,
            "text": "But he won’t have much time to celebrate, because he will immediately confront a series of divisive issues that could undermine his hold on the speakership just as he reaches the pinnacle of his career."
        },
        {
            "id": 3,
            "text": "“Paul has monumental obstacles,” said Rep. Trent Franks, R-Arizona."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "At the heart of the list: fiscal fights that have badly divided the GOP since it took control of the House in the 2010 elections."
        },
        {
            "id": 6,
            "text": "Congress must raise the national borrowing ceiling – or risk the first-ever default on U.S. debt – by November 3 and then pivot to a high-stakes debate over funding the government the following month."
        },
        {
            "id": 7,
            "text": "The outgoing speaker, John Boehner of Ohio, is trying to take the debt limit off the table for Ryan, but he’s running into familiar obstacles that could force the Wisconsin Republican to deal with the matter after he takes the top job."
        },
        {
            "id": 8,
            "text": "“If you think about what the debt is – it’s what happened in the past – so I think that the speaker is trying to clean that up for before he leaves,” Republican Rep. Tom Rooney of Florida told reporters, but he admitted that might not be possible with time running out before Boehner’s last day at the end of this week."
        },
        {
            "id": 9,
            "text": "READ: How Paul Ryan unified a fractured GOP"
        },
        {
            "id": 10,
            "text": "And Ryan will soon command the lead House GOP role in budget talks with the White House – a discussion centered on raising domestic and defense spending by roughly $76 billion, and one bound to anger the same conservatives the likely new speaker wooed last week."
        },
        {
            "id": 11,
            "text": "President Barack Obama and Democrats on the Hill are insisting that any increase in national security spending be matched dollar for dollar with more money for domestic programs."
        },
        {
            "id": 12,
            "text": "But a deal with the White House could undermine the pledge Ryan has privately been making: that he would restore “regular order” and let congressional committees drive policy – not the speaker’s office."
        },
        {
            "id": 13,
            "text": "Rep. Mark Sanford, a South Carolina Republican and member of the conservative House Freedom Caucus, told CNN that if Ryan agrees to get rid of budget caps it will be a “mixed bag” since it will please defense hawks but anger small-government conservatives."
        },
        {
            "id": 14,
            "text": "“I suspect it would stir up the rank and file."
        },
        {
            "id": 15,
            "text": "And when you get the rank and file at the grass-roots level, other folks get stirred up within the conference,” Sanford said."
        },
        {
            "id": 16,
            "text": "Sources familiar with the leadership discussions with the White House say there remains a possibility of a deal to scrap the automatic cuts known as sequestration for one year, but the two sides still are not in agreement over how to pay for the spending increases."
        },
        {
            "id": 17,
            "text": "Moreover, everything is on hold until House Republicans try to raise the debt ceiling this week – and there is no consensus within the ranks on how to proceed."
        },
        {
            "id": 18,
            "text": "Senate Republicans want to extend the debt ceiling until 2017 to take the issue off the table during an election year."
        },
        {
            "id": 19,
            "text": "House Republicans were forced last week to pull back a proposal crafted by a group of conservatives, that conditioned any debt increase to more spending cuts and a regulatory freeze, because it didn’t have enough support to pass."
        },
        {
            "id": 20,
            "text": "GOP leaders are still trying to come up with a proposal that includes some type of reforms their members can point to in return for increasing the nation’s borrowing authority."
        },
        {
            "id": 21,
            "text": "All but two House Democrats signed a letter to Boehner on Friday demanding he move a “clean” extension of the debt limit – one without conditions – and warning that “failing to do so will plunge the nation into default for the first time in American history, risking economic catastrophe.”"
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": "But some House Republicans say that a short-term increase should be pursued, potentially putting the issue in Ryan’s lap."
        },
        {
            "id": 25,
            "text": "Rep. David Brat, the Virginia Republican who unseated then-Majority Leader Eric Cantor last year, said Ryan should pair a debt ceiling increase with dollar-for-dollar spending cuts – an idea Democrats strongly reject."
        },
        {
            "id": 26,
            "text": "“Leadership promised the American people that,” Brat said."
        },
        {
            "id": 27,
            "text": "“We don’t want to go back on that if we give our word.”"
        },
        {
            "id": 28,
            "text": "Rooney said it’s possible that leaders could be forced again to take up a clean debt limit to avoid a default."
        },
        {
            "id": 29,
            "text": "While he’ll oppose that approach, and noted Ryan voted against it last time, the Florida Republican said no one should blame Ryan for the struggle to avoid an economic crisis."
        },
        {
            "id": 30,
            "text": "“If you really hold Paul Ryan responsible for a clean debt limit vote in his first day on the job, I think that’s a little unfair to say that that’s on him, especially since he’s worked so hard at the issues which really do directly deal with the debt and trying to fix that problem,” Rooney said."
        },
        {
            "id": 31,
            "text": "Yet if Ryan or Boehner try to jam a debt ceiling bill through, they can expect outrage from their right flank."
        },
        {
            "id": 32,
            "text": "“I can’t vote for a bill dropped on my desk 24 hours before the vote,” said Rep. Mick Mulvaney, R-South Carolina, a member of the House Freedom Caucus."
        }
    ]
}