{
    "title": "1.9 Million More Claimed Jobless Benefits Last Week, Bringing Pandemic Total to 42 Million",
    "text": [
        {
            "id": 0,
            "text": "People who lost their jobs wait in line to file for unemployment following an outbreak of the coronavirus, at an Arkansas Workforce Center in Fort Smith, Ark., April 6, 2020."
        },
        {
            "id": 1,
            "text": "Another 1.9 million Americans filed for unemployment benefits last week, bringing the total of jobless claims since the coronavirus pandemic began up to 42 million."
        },
        {
            "id": 2,
            "text": "The level of new claims outpaced the Dow Jones estimate of 1.775 million."
        },
        {
            "id": 3,
            "text": "However, last week’s new claims were still lower than the previous week’s total, which were revised upwards to 2.126 million."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "Meanwhile, continuing jobless claims hit 21.5 million, an increase of 649,000 that rose higher than most economists predicted."
        },
        {
            "id": 7,
            "text": "Continuing unemployment claims began to taper off in May, a sign that the economic destruction from the coronavirus is beginning to slow as some businesses are allowed to reopen and employees return to work."
        },
        {
            "id": 8,
            "text": "Since mid-March, the pandemic has forced businesses to shutter and furlough or lay off employees as states implemented lockdown and stay at home orders that have slowly been lifted, although social distancing restrictions remain in place in many areas."
        },
        {
            "id": 9,
            "text": "Of the 42 million unemployment claims that have been filed since the start of the pandemic, only a fraction have been processed as agencies continued to be overwhelmed by the volume of claims."
        },
        {
            "id": 10,
            "text": "The unemployment rate for May is expected to hit 19 percent, up from 14.7 percent in April, and will be reported in the Labor Department’s monthly unemployment report Friday."
        },
        {
            "id": 11,
            "text": ""
        }
    ]
}