{
    "title": "Obama vetoes GOP attempt to repeal Obamacare",
    "text": [
        {
            "id": 0,
            "text": "President Obama has vetoed the first bill sent to him by Congress this year, a symbolic attempt by Republicans to repeal the Affordable Care Act and defund abortion provider Planned Parenthood in an election year."
        },
        {
            "id": 1,
            "text": "\"Republicans in the Congress have attempted to repeal or undermine the Affordable Care Act over 50 times,\" Obama said in a veto message Friday."
        },
        {
            "id": 2,
            "text": "\"Rather than refighting old political battles by once again voting to repeal basic protections that provide security for the middle class, Members of Congress should be working together to grow the economy, strengthen middle-class families, and create new jobs.\""
        },
        {
            "id": 3,
            "text": "The bill — called the Restoring Americans' Healthcare Freedom Reconciliation Act of 2015 — used an obscure budget-writing procedure known as reconciliation to thwart a Senate filibuster."
        },
        {
            "id": 4,
            "text": "That maneuver allowed a bill repealing Obamacare to get the president's desk for the first time, forcing him to make good on repeated veto threats."
        },
        {
            "id": 5,
            "text": "“It’s no surprise that someone named Obama vetoed a bill repealing Obamacare,\" House Speaker Paul Ryan, R-Wis., said, promising a veto override vote \"taking this process all the way to the end under the Constitution.\""
        },
        {
            "id": 6,
            "text": "Republicans are far short of the two-thirds votes necessary for an override, however."
        },
        {
            "id": 7,
            "text": "It passed the Senate 52 to 47 and the House 240 to 181."
        },
        {
            "id": 8,
            "text": "But Ryan said the bill proved that Obamacare can be repealed, given a Republican in the White House."
        },
        {
            "id": 9,
            "text": "“The idea that Obamacare is the law of the land for good is a myth,\" he said."
        },
        {
            "id": 10,
            "text": "\"We have now shown that there is a clear path to repealing Obamacare without 60 votes in the Senate."
        },
        {
            "id": 11,
            "text": "So, next year, if we’re sending this bill to a Republican president, it will get signed into law.\""
        },
        {
            "id": 12,
            "text": "White House Press Secretary Josh Earnest said the bill accomplished nothing."
        },
        {
            "id": 13,
            "text": "\"It's not significant."
        },
        {
            "id": 14,
            "text": "It got them nothing, and with the stroke of a pen, the president dispensed with it,\" he said."
        },
        {
            "id": 15,
            "text": "It was the eighth veto of Obama's presidency, and the White House has issued three more veto threats just this week."
        },
        {
            "id": 16,
            "text": "In contrast to an elaborate signing ceremony Thursday by House Speaker Paul Ryan, Obama's veto came in a routine veto message."
        }
    ]
}