{
    "title": "Trump to Visit Cities Victimized by Recent Mass Shootings",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump will visit the cities where this weekend's mass shootings took place, according to news reports."
        },
        {
            "id": 1,
            "text": "El Paso, Texas Mayor Dee Margo said at a news conference Monday the president will visit the city Wednesday, and Federal Aviation Administration adviseries suggest Trump will be in Dayton on the same day."
        },
        {
            "id": 2,
            "text": "Margo, a Republican, has been a critic of Trump and earlier this year would not meet with him while he was in El Paso."
        },
        {
            "id": 3,
            "text": "But he said Monday he would meet with him under his capacity as mayor and ask Trump for federal help."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "\"He is president of the United States, so in that capacity, I will fulfill my obligations as mayor of El Paso and hope that if we are expressing specifics that we can get him to come through for us,\" Margo said."
        },
        {
            "id": 6,
            "text": "The mayor also said he will continue to defend the city against attacks against its character, presumably by Trump."
        },
        {
            "id": 7,
            "text": "\"I don't know how we deal with evil,\" Margo said."
        },
        {
            "id": 8,
            "text": "\"I don't have a textbook for dealing with it other than the Bible."
        },
        {
            "id": 9,
            "text": "I'm sorry."
        },
        {
            "id": 10,
            "text": "We are going to go through this."
        },
        {
            "id": 11,
            "text": "The president is coming out."
        },
        {
            "id": 12,
            "text": "I will meet with the president."
        },
        {
            "id": 13,
            "text": "I guess for people who have lots of time on their hands, I will deal with the emails and phone calls.\""
        }
    ]
}