{
    "title": "Lois Lerner, IRS official in tea party scandal, forced out for 'neglect of duties'",
    "text": [
        {
            "id": 0,
            "text": "Lois G. Lerner, the woman at the center of the IRS tea party targeting scandal, retired from the agency Monday morning after an internal investigation found she was guilty of “neglect of duties” and was going to call for her ouster, according to congressional staff."
        },
        {
            "id": 1,
            "text": "Her departure marks the first government official to pay a significant price in the scandal, though Republicans were quick to say her decision doesn’t put the matter to rest and pointed out that she still can be called before Congress to testify."
        },
        {
            "id": 2,
            "text": "The Internal Revenue Service confirmed Ms. Lerner’s retirement in a statement but said it couldn’t release any more information because of privacy concerns."
        },
        {
            "id": 3,
            "text": "Rep. Sander M. Levin of Michigan, the ranking Democrat on the House Ways and Means Committee, said an accountability review board set up to investigate the people at the agency involved with the scandal completed their review and were set to recommend Ms. Lerner’s ouster."
        },
        {
            "id": 4,
            "text": "The review board, though, found no evidence of political bias, he said."
        },
        {
            "id": 5,
            "text": "Ms. Lerner was head of the exempt organizations division of the IRS, which oversaw applications for tax-exempt status, including those from political groups."
        },
        {
            "id": 6,
            "text": "Several congressional committees were examining her behavior and emails that seemed to suggest that she was looking for reasons to deny political groups approval for tax-exempt status."
        },
        {
            "id": 7,
            "text": "Last week, acting IRS Commissioner Daniel Werfel said he had asked a review board and the agency’s inspector general to look at the emails."
        },
        {
            "id": 8,
            "text": "Republicans said Ms. Lerner’s resignation, while a first step, isn’t the end of the scandal."
        },
        {
            "id": 9,
            "text": "“We still don’t know why Lois Lerner, as a senior IRS official, had such a personal interest in directing scrutiny and why she denied improper conduct to Congress,” said Rep. Darrell E. Issa, California Republican and chairman of the House Oversight and Government Reform Committee."
        },
        {
            "id": 10,
            "text": "“Her departure does not answer these questions or diminish the committee’s interest in hearing her testimony.”"
        },
        {
            "id": 11,
            "text": "But Mr. Levin, who called for Ms. Lerner to resign early on, said there is still no evidence of political motivation in Ms. Lerner’s actions or those of others at the IRS."
        },
        {
            "id": 12,
            "text": "He said Republicans are stretching to create a political scandal."
        },
        {
            "id": 13,
            "text": "“The basic overreaching premise of the Republicans that the IRS had an ‘enemies list’ and was being influenced from the outside has been proven wrong again, as it has again and again,” Mr. Levin said."
        },
        {
            "id": 14,
            "text": "“Just as the IRS has to move with all deliberate speed to restore the public trust, so too must the Republicans by not distorting the investigation and by acknowledging the improvements.”"
        },
        {
            "id": 15,
            "text": "Also Monday, one marquee tea party group announced that it had reached a deal with the Obama administration to approve its application for tax-exempt status, ending a three-year ordeal in which it faced the same intrusive scrutiny that characterized the IRS efforts with regard to conservative organizations."
        },
        {
            "id": 16,
            "text": "True the Vote, the Texas-based voters’ rights group, said the Justice Department and IRS agreed late Friday to approve the application for 501(c )(3) status as a charitable organization."
        },
        {
            "id": 17,
            "text": "The group found out earlier this year that it was part of a batch of hundreds of applications that the IRS was delaying, and it sued to force the agency to approve its application."
        },
        {
            "id": 18,
            "text": "The approval of the group’s application does not end the matter, said Cleta Mitchell, lead attorney in the lawsuit."
        },
        {
            "id": 19,
            "text": "She said the IRS still needs to answer for the costs and damages that resulted from the three-year delay, and for probing for information that the internal auditor for the IRS says wasn’t necessary to make a determination."
        },
        {
            "id": 20,
            "text": "Ms. Mitchell also said Ms. Lerner’s resignation doesn’t resolve the IRS situation."
        },
        {
            "id": 21,
            "text": "“From everything that we’ve seen, the emails, the things that drip, drip, drip out of the IRS, clearly she was involved in it, she knew about it, she has an agenda, as do others in the IRS,” Ms. Mitchell said."
        },
        {
            "id": 22,
            "text": "“I’d say good riddance, but the question is how much are we still going to be paying her,” she said."
        },
        {
            "id": 23,
            "text": "Ms. Lerner has amassed more than three decades in government service, including 20 years at the Federal Election Commission before moving to the IRS in 2001."
        },
        {
            "id": 24,
            "text": "She was appointed to be director of the exempt organizations division in 2006."
        },
        {
            "id": 25,
            "text": "She was also a previous president of the Council on Governmental Ethics Laws."
        },
        {
            "id": 26,
            "text": "Her attorney didn’t return a message seeking comment."
        },
        {
            "id": 27,
            "text": "Ms. Lerner previously refused to testify to Congress, citing her Fifth Amendment right against self-incrimination."
        },
        {
            "id": 28,
            "text": "But when she appeared before Congress, she also delivered a brief statement claiming innocence, which some members of the House oversight committee said means she waived her right to silence."
        },
        {
            "id": 29,
            "text": "Jay Sekulow, chief counsel at the American Center for Law and Justice, which is representing 41 conservative groups battling the IRS, said her retirement is “just another troubling move” by the IRS and means she will be receiving taxpayer-funded retirement benefits."
        },
        {
            "id": 30,
            "text": "“Her retirement — along with her continued compensation — is deeply disturbing and sends the wrong message about accountability,” Mr. Sekulow said."
        }
    ]
}