{
    "title": "House Votes to Delay Two Requirements of the Health Care Overhaul",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — Defying a veto threat from President Obama, the House on Wednesday passed bills delaying two crucial parts of his health care overhaul that require most Americans to have insurance and many employers to offer it."
        },
        {
            "id": 1,
            "text": "Republicans said it was unfair for Mr. Obama to delay enforcement of the employer mandate without granting similar relief to individuals, who may face tax penalties if they go without health insurance next year."
        },
        {
            "id": 2,
            "text": "Both requirements were scheduled to take effect in January."
        },
        {
            "id": 3,
            "text": "But the White House announced this month that it would delay the employer mandate to 2015 because of business concerns about the complexity of the requirements."
        },
        {
            "id": 4,
            "text": "On the bill to delay the individual mandate, the vote was 251 to 174."
        },
        {
            "id": 5,
            "text": "On the bill to delay the employer mandate, the vote was 264 to 161."
        },
        {
            "id": 6,
            "text": "The votes generally followed party lines."
        },
        {
            "id": 7,
            "text": "But 22 Democrats supported delay of the individual mandate, and 35 favored postponing the employer requirement."
        },
        {
            "id": 8,
            "text": "The legislation has little prospect of approval in the Senate."
        },
        {
            "id": 9,
            "text": "But the House debate served several purposes for Republicans."
        },
        {
            "id": 10,
            "text": "It allowed them to reiterate their opposition to the individual mandate, which polls show is one of the more unpopular provisions of the 2010 law."
        },
        {
            "id": 11,
            "text": "It also gave them a rare opportunity to portray Mr. Obama as a friend of big business while presenting themselves as defenders of ordinary Americans."
        },
        {
            "id": 12,
            "text": "“Under the president’s policy, million-dollar corporations with access to the White House can be excused from Obamacare, but the struggling family gets left out,” said Representative Pete Olson, Republican of Texas."
        },
        {
            "id": 13,
            "text": "“That’s unfair."
        },
        {
            "id": 14,
            "text": "That’s wrong.”"
        },
        {
            "id": 15,
            "text": "Representative Martha Roby, Republican of Alabama, said Mr. Obama was selectively enforcing the law, known as the Affordable Care Act."
        },
        {
            "id": 16,
            "text": "“Why is big business getting a break while individual Americans get the short end of the stick?”"
        },
        {
            "id": 17,
            "text": "she asked."
        },
        {
            "id": 18,
            "text": "Representative Luke Messer, Republican of Indiana, said: “Fundamental fairness dictates that individuals get the same reprieve."
        },
        {
            "id": 19,
            "text": "Each day this law is delayed gives us more time to seek its total repeal.”"
        },
        {
            "id": 20,
            "text": "Since early 2011, the House has voted more than 35 times to repeal all or part of the law, to scale it back, or to cut financing for its operation."
        },
        {
            "id": 21,
            "text": "The House Democratic leader, Nancy Pelosi of California, said the debate on Wednesday was a political stunt, a futile effort to reopen an issue that “has been settled in Congress, at the Supreme Court and at the ballot box.”"
        },
        {
            "id": 22,
            "text": "Representative Louise M. Slaughter, Democrat of New York, said the Republican attacks were “the height of irresponsibility and nihilistic obstruction.”"
        },
        {
            "id": 23,
            "text": "The law, she said, is already reducing health insurance premiums in New York, Washington, Oregon, California and other states."
        },
        {
            "id": 24,
            "text": "“New York does not want to be relieved of the burden of the Affordable Care Act,” Ms. Slaughter said."
        },
        {
            "id": 25,
            "text": "“Delaying the individual mandate would undermine the very foundation of the law and cause health care premiums to skyrocket.”"
        },
        {
            "id": 26,
            "text": "The Congressional Budget Office said that without the requirement that people carry insurance, premiums for individual coverage would be higher than projected under current law, apparently because fewer healthy people would be in the pool of those buying coverage."
        },
        {
            "id": 27,
            "text": "The White House said the bill delaying the employer mandate was unnecessary, while the bill delaying the individual mandate would increase the number of uninsured Americans."
        },
        {
            "id": 28,
            "text": "Insurance companies oppose a delay of the individual mandate, which is, in essence, a requirement that people buy their products."
        },
        {
            "id": 29,
            "text": "Alissa Fox, a senior vice president of the Blue Cross and Blue Shield Association, said insurers had developed policies and rates for 2014 on the assumption that there would be a broad pool of customers, including many healthy people."
        },
        {
            "id": 30,
            "text": "The 2010 law requires insurers to offer coverage to anyone who seeks it and prohibits them from charging more because of a person’s medical problems."
        },
        {
            "id": 31,
            "text": "“Those rating rules and consumer protections will not work if the individual mandate goes away, since people could wait to purchase coverage until needed, which makes costs go up for everyone,” Ms. Fox said."
        },
        {
            "id": 32,
            "text": "Under the law, employers with more than 50 full-time employees are generally required to offer them coverage."
        },
        {
            "id": 33,
            "text": "Most such employers already offer insurance, though the coverage may not meet all the new federal requirements."
        },
        {
            "id": 34,
            "text": "At a House committee hearing on Wednesday, administration officials expressed confidence that consumers in every state would be able to shop for insurance in new competitive marketplaces, or exchanges, starting Oct. 1."
        },
        {
            "id": 35,
            "text": "But Alan R. Duncan, an assistant inspector general for tax administration at the Treasury Department, raised many questions about “the protection of confidential taxpayer data that will be provided to the state and federal exchanges.”"
        },
        {
            "id": 36,
            "text": "In addition, Mr. Duncan said he was concerned that the Internal Revenue Service might not be able to prevent or detect fraud by some consumers obtaining tax credits and tax refunds under the health care law."
        },
        {
            "id": 37,
            "text": "Subsidies, in the form of tax credits, will be available to millions of low- and moderate-income people."
        },
        {
            "id": 38,
            "text": "To check eligibility, income and citizenship, the federal government is establishing a computer network that will link the insurance exchanges with federal agencies including the Department of Health and Human Services, the I.R.S., the Social Security Administration and the Department of Homeland Security."
        }
    ]
}