{
    "title": "Health Site Chief Expects Low Initial Enrollment Number",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — Marilyn B. Tavenner, the official in charge of President Obama’s health insurance marketplace, apologized on Tuesday to millions of Americans who have been frustrated in trying to buy insurance under the new health care law."
        },
        {
            "id": 1,
            "text": "“I want to apologize to you that the website is not working as well as it should,” Ms. Tavenner said, in remarks addressed to the public during testimony before the House Ways Means Committee."
        },
        {
            "id": 2,
            "text": "Ms. Tavenner, the administrator of the federal Centers for Medicare and Medicaid Services, said that “nearly 700,000 applications have been submitted to the federal and state marketplaces” in the last four weeks."
        },
        {
            "id": 3,
            "text": "But she repeatedly refused to say how many of those people had actually enrolled in health insurance plans since the federal and state marketplaces, or exchanges, opened on Oct. 1."
        },
        {
            "id": 4,
            "text": "“That number will not be available until mid-November,” Ms. Tavenner said."
        },
        {
            "id": 5,
            "text": "“We expect the initial number to be small.”"
        },
        {
            "id": 6,
            "text": "The chairman of the Ways and Means Committee, Representative Dave Camp, Republican of Michigan, said that at least 146,000 Michigan residents had recently received notices that their current insurance policies would be canceled because the coverage did not meet requirements of the new health care law."
        },
        {
            "id": 7,
            "text": "“In fact,” Mr. Camp said, “based on what little information the administration has disclosed, it turns out that more people have received cancellation notices for their health care plans this month than have enrolled in the exchanges.”"
        },
        {
            "id": 8,
            "text": "Ms. Tavenner said that existing insurance policies were, in many cases, inferior to the new policies they could get."
        },
        {
            "id": 9,
            "text": "In compliance with the health care law, she said, new policies will provide more benefits and pay a larger share of medical costs than many existing policies."
        },
        {
            "id": 10,
            "text": "Representative Kevin Brady, Republican of Texas, asked Ms. Tavenner what she would tell people who were losing their current insurance but could not get coverage on the balky federal website."
        },
        {
            "id": 11,
            "text": "“My constituents are frightened,” Mr. Brady said."
        },
        {
            "id": 12,
            "text": "“They are being forced out of health care plans they like."
        },
        {
            "id": 13,
            "text": "The clock is ticking."
        },
        {
            "id": 14,
            "text": "The federal website is broken."
        },
        {
            "id": 15,
            "text": "Their health care isn’t a glitch.”"
        },
        {
            "id": 16,
            "text": "Ms. Tavenner said consumers could seek help from a telephone call center established by the government."
        },
        {
            "id": 17,
            "text": "To enroll, she said, “there are more methods than just the website.”"
        },
        {
            "id": 18,
            "text": "Representative John Lewis, Democrat of Georgia, pushed back against Republican attacks on the law and on the administration."
        },
        {
            "id": 19,
            "text": "“The Affordable Care Act is working,” Mr. Lewis said."
        },
        {
            "id": 20,
            "text": "“It is making health insurance affordable and accessible to hundreds of thousands of citizens who never had it before."
        },
        {
            "id": 21,
            "text": "Health care is a right and not a privilege.”"
        },
        {
            "id": 22,
            "text": "But while she admitted the failings of the site, Ms. Tavenner tried to hold back a bipartisan clamor for a delay in enforcement of the requirement for most Americans to carry health insurance starting next year."
        },
        {
            "id": 23,
            "text": "Lawmakers say it would be unfair to punish Americans for going without insurance if they cannot obtain it on the federal marketplace built by dozens of companies under contract with Ms. Tavenner’s agency."
        },
        {
            "id": 24,
            "text": "Two of the contractors who worked on the site, testified last week before another congressional committee that the Medicare agency had failed to coordinate the work of dozens of contractors and did not begin “end-to-end testing” of the system as a whole until two weeks before it opened to the public on Oct. 1."
        },
        {
            "id": 25,
            "text": "The tests, they said, revealed flaws in the software and suggested that the site could not handle large numbers of users trying to log on at the same time."
        },
        {
            "id": 26,
            "text": "Ms. Tavenner — like her boss, Kathleen Sebelius, the secretary of health and human services, and her deputy, Gary M. Cohen — repeatedly assured Congress in the last year that the federal marketplace and its website would be ready on Oct. 1."
        },
        {
            "id": 27,
            "text": "Ms. Tavenner said Tuesday that “nearly 700,000 applications have been submitted to the federal and state marketplaces” in the last four weeks."
        },
        {
            "id": 28,
            "text": "“This tremendous interest, with over 20 million unique visits to date to HealthCare.gov, confirms that the American people are looking for quality, affordable health coverage,” said Ms. Tavenner, whose agency insures more than 100 million people through Medicare and Medicaid."
        },
        {
            "id": 29,
            "text": "The rocky rollout of the new federal insurance program has irked many consumers, caused some to question the competence of federal officials and created a political crisis for Mr. Obama."
        },
        {
            "id": 30,
            "text": "“Some have had trouble creating accounts and logging in to the site,” Ms. Tavenner said."
        },
        {
            "id": 31,
            "text": "“Others have received confusing error messages, or had to wait for slow page loads or forms that failed to respond in a timely fashion.”"
        },
        {
            "id": 32,
            "text": "But, she said, “We will address these initial and any ongoing problems, and build a website that fully delivers on the promise of the Affordable Care Act.”"
        },
        {
            "id": 33,
            "text": "The chairman of the Ways and Means Committee, Representative Dave Camp, Republican of Michigan, said: “Sooner or later the administration needs to admit the law is unworkable."
        },
        {
            "id": 34,
            "text": "People don’t have access to health plans, they cannot compare coverage options and the true cost is often underreported or completely hidden.”"
        }
    ]
}