{
    "title": "Trump Featured in Terror Recruitment",
    "text": [
        {
            "id": 0,
            "text": "Somalia-based terrorist group al-Shabab, an al Qaeda offshoot, released a recruitment video Saturday showing what it calls racial injustice in the U.S. and featuring clips of Republican presidential front-runner Donald Trump."
        },
        {
            "id": 1,
            "text": "The 51-minute video shows a clip of Mr. Trump at a rally in December where he called for the U.S. to ban all Muslims from entering the country as his supporters cheered, according to reports from the SITE Intelligence Group."
        },
        {
            "id": 2,
            "text": "The image of the real estate mogul was sandwiched between two clips of al Qaeda leader Anwar al-Awlaki, who was killed in a drone strike in 2011, saying Muslims in the U.S. would have to choose between leaving for other Islamic countries or staying at home to fight Western forces, Business Insider reported."
        },
        {
            "id": 3,
            "text": "The video was distributed on Twitter on Friday by Islamist militant organization al-Kataib, SITE reported."
        },
        {
            "id": 4,
            "text": "Mr. Trump’s call to temporarily ban Muslims from entering the U.S. has prompted harsh criticism worldwide."
        },
        {
            "id": 5,
            "text": "Democratic presidential front-runner Hillary Clinton claimed that clips of Mr. Trump spouting his anti-Muslim rhetoric were used in Islamic State propaganda videos."
        },
        {
            "id": 6,
            "text": "However, that claim has never been proved and the video was created by an offshoot of the Islamic State group’s rival, al Qaeda."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        }
    ]
}