{
    "title": "Tulsi Gabbard on Trump impeachment: 'I could not in good conscience vote either yes or no'",
    "text": [
        {
            "id": 0,
            "text": "The only Democrat or Republican to vote \"present\" to impeach President Donald Trump in the House on Tuesday on both articles of impeachment was Hawaiian Rep. Tulsi Gabbard."
        },
        {
            "id": 1,
            "text": "In a statement after her vote, Gabbard, who is also running for the 2020 Democratic presidential nomination, released a statement, claiming that after doing her \"due diligence in reviewing the 658-page impeachment report, I came to the conclusion that I could not in good conscience vote either yes or no.”"
        },
        {
            "id": 2,
            "text": "Stay up to date on the latest impeachment news\n\n“I am standing in the center and have decided to vote Present."
        },
        {
            "id": 3,
            "text": "I could not in good conscience vote against impeachment because I believe President Trump is guilty of wrongdoing."
        },
        {
            "id": 4,
            "text": "I also could not in good conscience vote for impeachment because removal of a sitting President must not be the culmination of a partisan process, fueled by tribal animosities that have so gravely divided our country,” Gabbard said."
        },
        {
            "id": 5,
            "text": "Earlier Wednesday, she introduced a resolution to instead censure Trump, which expresses strong disapproval of conduct, whereas impeachment could result in removal from office."
        },
        {
            "id": 6,
            "text": "Gabbard said she worked for the best interests of the country whether in the military or in Congress."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "'He gave us no choice': Nancy Pelosi's glare and more top impeachment moments from a historic day\n\nHawaiian State Sen. Kai Kahele, who is running mostly uncontested to replace Gabbard in the U.S. House, slammed her “present” votes."
        },
        {
            "id": 9,
            "text": "“Clearly her vote is unacceptable."
        },
        {
            "id": 10,
            "text": "It’s disappointing,” he told USA TODAY on a call."
        },
        {
            "id": 11,
            "text": "“The two most consequential votes a member of Congress will ever take are to send our troops into harm’s way...and a vote to impeach the president of the United States”"
        },
        {
            "id": 12,
            "text": "“That’s not what the taxpayers of Hawaii sent her here for,” Kahele added."
        }
    ]
}