{
    "title": "Obama endorses net neutrality",
    "text": [
        {
            "id": 0,
            "text": "President Obama came out strongly Monday for the concept of net neutrality, saying that \"an open Internet is essential to the American economy, and increasingly to our very way of life.\""
        },
        {
            "id": 1,
            "text": "In a written statement, Obama asked the Federal Communications Commission to \"create a new set of rules protecting net neutrality,\" and to ensure that phone and cable companies will not be able \"to act as a gatekeeper, restricting what you can do or see online.\""
        },
        {
            "id": 2,
            "text": "The FCC is nearing a decision."
        },
        {
            "id": 3,
            "text": "Net neutrality supporters hailed the president's comments as a victory for Internet users and free speech advocates."
        },
        {
            "id": 4,
            "text": "Critics, including major corporations and Republican lawmakers, called it an overreaction that will lead to lawsuits, worse service, and higher prices."
        },
        {
            "id": 5,
            "text": "Tom Wheeler, the Obama-appointed chairman of the FCC, said that \"like the president, I believe that the Internet must remain an open platform for free expression, innovation, and economic growth."
        },
        {
            "id": 6,
            "text": "We both oppose Internet fast lanes."
        },
        {
            "id": 7,
            "text": "The Internet must not advantage some to the detriment of others.\""
        },
        {
            "id": 8,
            "text": "Wheeler said the commission would enter Obama's submission into the record of its proceedings, and would continue to hear \"from all stakeholders, including the public (and) members of Congress of both parties.\""
        },
        {
            "id": 9,
            "text": "In the statement — issued while Obama is in China for an Asian economic summit — the president noted that \"the FCC is an independent agency, and ultimately this decision is theirs alone.\""
        },
        {
            "id": 10,
            "text": "Obama urged an \"explicit ban\" on \"paid prioritization,\" agreements in which large content providers pay Internet companies for faster delivery."
        },
        {
            "id": 11,
            "text": "This involves such profitable, high-traffic sites such as Netflix, Amazon and YouTube."
        },
        {
            "id": 12,
            "text": "He also called for banning the blocking of certain websites and the \"throttling\" of Internet service."
        },
        {
            "id": 13,
            "text": "The president, who recorded his statement on video, also called on the FCC to classify broadband Internet as a telecommunications service."
        },
        {
            "id": 14,
            "text": "Major broadband providers have objected, saying it would make their business subject to onerous regulations."
        },
        {
            "id": 15,
            "text": "In a statement of its own, Verizon said that \"the light-touch regulatory approach in place for the past two decades has been central to the Internet's success."
        },
        {
            "id": 16,
            "text": "\" Reclassification under federal rules \"would be a radical reversal of course that would in and of itself threaten great harm to an open Internet.\""
        },
        {
            "id": 17,
            "text": "Verizon also said new rules would invite \"strong legal challenges.\""
        },
        {
            "id": 18,
            "text": "CTIA, a trade association for wireless communications industry, said that imposing an \"antiquated common carrier regulation\" — Title II of the 1934 Communications Act — would \"impose inappropriate regulation on a dynamic industry and would threaten mobile provider's ability to invest and innovate, all to the detriment of consumers.\""
        },
        {
            "id": 19,
            "text": "Net neutrality backers, meanwhile, cheered Obama's declaration."
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "\"This statement, I think, gives the political cover for the FCC to actually do the right thing,\" said Marvin Ammori, an adviser to tech companies."
        },
        {
            "id": 22,
            "text": "Ammori called Obama's statement a major win for net neutrality supporters, and \"there is rejoicing among every start-up company in America right now.\""
        },
        {
            "id": 23,
            "text": "The statement, Ammori said, is Obama's \"key campaign promise in technology.\""
        },
        {
            "id": 24,
            "text": "Becky Bond, political director of a pro-net neutrality group called CREDO, said the question now belongs to the FCC, and she noted that three of the commissioner's five members are Democrats."
        },
        {
            "id": 25,
            "text": "\"Will they stand with Comcast, AT&T and Verizon or the president and the American people?\""
        },
        {
            "id": 26,
            "text": "Bond said."
        },
        {
            "id": 27,
            "text": "In terms of legal issues, Laura W. Murphy, director of the American Civil Liberties Union's Washington Legislative Office, said that \"preventing 'fast lanes' and discrimination against some content producers on the Internet is one of the most important free speech issues of the digital age.\""
        },
        {
            "id": 28,
            "text": "The net neutrality issue has also split members of Congress."
        },
        {
            "id": 29,
            "text": "Sen. Ed Markey, D-Mass., called Obama's statement a \"game changer,\" and said the president is \"proudly standing up for an open Internet that will remain free of fast and slow lanes for consumers and companies.\""
        },
        {
            "id": 30,
            "text": "Sen. Ted Cruz, R-Texas, who has criticized other Obama regulations, said that net neutrality \"puts the government in charge of determining Internet pricing, terms of service, and what types of products and services can be delivered, leading to fewer choices, fewer opportunities, and higher prices for consumers.\""
        },
        {
            "id": 31,
            "text": "He described it as \"Obamacare for the Internet,\" and said \"the Internet should not operate at the speed of government.\""
        }
    ]
}