{
    "title": " Trump-Appointed HHS Officials Demand Right to Change CDC Info",
    "text": [
        {
            "id": 0,
            "text": "Communications aides Health and Human Services are insisting on reviewing and revising any of the weekly scientific reports released by the Centers for Disease Control and Prevention related to the coronavirus pandemic, according to emails reviewed by Politico."
        },
        {
            "id": 1,
            "text": "HHS communications aides reportedly sent emails complaining to CDC Director Robert Redfield and other senior officials that reports from the agency would subvert the positive coronavirus messaging from President Donald Trump."
        },
        {
            "id": 2,
            "text": "Health and Human Services spokesperson Michael Caputo said in a statement the department reviewed the CDC's reports."
        },
        {
            "id": 3,
            "text": "\"Our intention is to make sure that evidence, science-based data drives policy through this pandemic — not ulterior deep state motives in the bowels of CDC,\" Caputo told Politico."
        },
        {
            "id": 4,
            "text": "\"When Donald Trump told Bob Woodward that he wanted to downplay the virus, this is the exact kind of repugnant betrayal that he meant,\" Deputy Campaign Manager and Communications Director Kate Bedingfield said in a statement."
        },
        {
            "id": 5,
            "text": "Bedingfield continued, \"Instead of telling us the truth about the deadly seriousness of COVID-19, this report is further proof that the Trump administration has been systematically putting political optics ahead of the safety of the American people.\""
        },
        {
            "id": 6,
            "text": "\"Trump's failure has left us with six million infected, millions more unemployed, and the worst outbreak in the developed world,\" Bedingfield added."
        },
        {
            "id": 7,
            "text": "\"We deserve so much better.\""
        },
        {
            "id": 8,
            "text": "The CDC's Morbidity and Mortality Weekly Reports are released by scientists to alert medical officials and the general public about the spread of coronavirus."
        }
    ]
}