{
    "title": "Ruling By Senate Parliamentarian Opens Up Potential Pathway For Democrats",
    "text": [
        {
            "id": 0,
            "text": "Ruling By Senate Parliamentarian Opens Up Potential Pathway For Democrats\n\nEnlarge this image toggle caption Jonathan Ernst/Pool/Getty Images Jonathan Ernst/Pool/Getty Images"
        },
        {
            "id": 1,
            "text": "A new decision from the U.S. Senate's nonpartisan parliamentarian means Democrats could advance more of President Biden's agenda without the support of Republicans."
        },
        {
            "id": 2,
            "text": "The official's interpretation of Senate budget rules would allow the use of the reconciliation process more than once in a fiscal year, and it is viewed by Democrats as a possible strategy for moving top policy priorities with a simple majority, since getting the needed 10 Republican votes in a 50-50 Senate has proved difficult."
        },
        {
            "id": 3,
            "text": "Details are still unclear as to how Democratic leaders might use the additional chance to pass budget-related policies."
        },
        {
            "id": 4,
            "text": "\""
        },
        {
            "id": 5,
            "text": "The Parliamentarian has advised that a revised budget resolution may contain budget reconciliation instructions,\" Justin Goodman, a spokesman for Senate Majority Leader Chuck Schumer, D-N.Y., said in a statement Monday."
        },
        {
            "id": 6,
            "text": "\"While no decisions have been made on a legislative path forward using Section 304 and some parameters still need to be worked out, the Parliamentarian's opinion is an important step forward that this key pathway is available to Democrats if needed.\""
        },
        {
            "id": 7,
            "text": "Democrats have been vague about those additional parameters and the potential limitations that might come with this legislative pathway."
        },
        {
            "id": 8,
            "text": "The ruling appears to mean a majority party could revise budgets more than once in a fiscal year — each time giving them access to reconciliation instructions."
        },
        {
            "id": 9,
            "text": "The decision comes as Democrats take up Biden's more than $2 trillion infrastructure proposal, which he unveiled last week."
        },
        {
            "id": 10,
            "text": "Some moderate Democrats, including Sen. Joe Manchin of West Virginia, have balked at its plan to increase the corporate tax rate from 21% to 28%."
        },
        {
            "id": 11,
            "text": "(Manchin favors a smaller hike.)"
        },
        {
            "id": 12,
            "text": "Party leaders have not released any legislative text or final details of the policies Biden outlined in his proposal, nor have they said how they would work to ensure that there would be unanimous support among Senate Democrats, something that would be necessary to pass the bill without any Republican support."
        },
        {
            "id": 13,
            "text": "The parliamentarian's ruling could allow Democrats to break big packages, like Biden's infrastructure plan, into smaller pieces."
        },
        {
            "id": 14,
            "text": "That could potentially make it easier to pass elements of the sweeping agenda, by enticing Republicans to support some of its policies."
        },
        {
            "id": 15,
            "text": "But using reconciliation also limits what elements can be in a bill."
        },
        {
            "id": 16,
            "text": "Earlier this year, the parliamentarian ruled that a federal minimum wage increase did not fit in the rules."
        }
    ]
}