{
    "title": "Obama: Congress endangers national security with Lynch delay",
    "text": [
        {
            "id": 0,
            "text": "President Obama is accusing Congress of playing politics with law enforcement and national security by holding hostage attorney general nominee Loretta Lynch in exchange for leverage on legislation."
        },
        {
            "id": 1,
            "text": "Mr. Obama blasted Republicans for preventing the female federal prosecutor from New York from succeeding Attorney General Eric Holder during his weekly address to the country to Sunday."
        },
        {
            "id": 2,
            "text": "But lawmakers have delayed the nomination of Ms. Lynch by more than 130 days over concerns surrounding Mr. Obama’s executive action on immigration, which would provide temporary legal status to millions of illegal immigrants and reprieve from deportation."
        },
        {
            "id": 3,
            "text": "Now Senate Majority Leader Mitch McConnell, Kentucky Republican, wants to waylay that nomination over a bill known as the Justice for Victims of Trafficking Act."
        },
        {
            "id": 4,
            "text": "The bill contains language that would prohibit the use of restitution funds for abortions."
        },
        {
            "id": 5,
            "text": "Mr. Obama tapped Ms. Lynch to replace Mr. Holder in November and has this month become more vocal about the roadblocks that Republicans have set up for his nominee."
        },
        {
            "id": 6,
            "text": "Republicans have the majority in both the House and the Senate."
        },
        {
            "id": 7,
            "text": "“No one can claim she’s unqualified,” he said during his weekly address."
        },
        {
            "id": 8,
            "text": "“No one’s saying she can’t do the job."
        },
        {
            "id": 9,
            "text": "Senators from both parties say they support her."
        },
        {
            "id": 10,
            "text": "This is purely about politics."
        },
        {
            "id": 11,
            "text": "First, Republicans held up her nomination because they were upset about the actions I took to make our broken immigration system smarter and fairer."
        },
        {
            "id": 12,
            "text": "Now they’re denying her a vote until they can figure out how to pass a bill on a completely unrelated issue.”"
        },
        {
            "id": 13,
            "text": "This is the third time in less than a week that the White House has lashed out Republicans for stalling a yes-or-no vote for Loretta Lynch."
        },
        {
            "id": 14,
            "text": "White House press secretary Josh Earnest during a March 16 press briefing described the delay of Ms. Lynch’s yes-or-no vote on the Senate floor as “an unconscionable delay.”"
        },
        {
            "id": 15,
            "text": "“There is not a single legitimate question that has been raised about her aptitude for this job,” he said."
        },
        {
            "id": 16,
            "text": "“Instead, all we’ve seen is a bunch of political obstruction from Republicans that, again, does not speak well of Republicans’ efforts to run the Senate in an effective fashion and certainly not in a way that’s in the best interest of the country.”"
        },
        {
            "id": 17,
            "text": "Mr. Obama repeated that point during an interview with Huffington Post, saying that it was wrong for Congress to hold the attorney general nominee hostage “for other issues.”"
        },
        {
            "id": 18,
            "text": "“Republicans promised that Congress would function smoothly with them in charge,” Mr. Obama said during his weekend address."
        },
        {
            "id": 19,
            "text": "“Here’s a small chance for them to prove it.”"
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}