{
    "title": "Biden will nominate Antony Blinken as secretary of State",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "As the virus rages across the country, schools are shutting down again — or remain shuttered — even though they haven't turned out to be the super-spreader sites experts feared."
        },
        {
            "id": 2,
            "text": "At the same time, many bars and restaurants remain open for business."
        },
        {
            "id": 3,
            "text": "POLITICO's Nirvi Shah explains how the situation is reigniting a heated debate over pandemic priorities."
        },
        {
            "id": 4,
            "text": "Plus, the CDC recommends travelers get tested before and after international flights."
        },
        {
            "id": 5,
            "text": "Bloomberg first reported that Joe Biden would tap Blinken as secretary of State."
        },
        {
            "id": 6,
            "text": "Blinken’s bio reads like he was bred for a life in the diplomatic realm."
        },
        {
            "id": 7,
            "text": "He attended high school in Paris, earned an undergraduate degree from Harvard and later picked up a law degree from Columbia."
        },
        {
            "id": 8,
            "text": "Blinken’s father, Donald, also a Harvard graduate, was an investment banker who served as a U.S. ambassador to Hungary."
        },
        {
            "id": 9,
            "text": "The younger Blinken has worked as a lawyer and (briefly) a journalist."
        },
        {
            "id": 10,
            "text": "He served on the National Security Council during the Clinton administration and has spent time on Capitol Hill, where he was Democratic staff director for the Senate Foreign Relations Committee when Biden was chairman."
        },
        {
            "id": 11,
            "text": "During the Obama years, Blinken served as deputy national security adviser and deputy secretary of State."
        },
        {
            "id": 12,
            "text": "Those who know Blinken describe him with words like “polished,” “smooth,” and “kind,” and often add that he plays the guitar well."
        },
        {
            "id": 13,
            "text": "Blinken has been the main face of Biden’s foreign policy during the 2020 campaign, advocating for positions such as the need for the United States to rebuild alliances frayed by Donald Trump’s America First approach."
        },
        {
            "id": 14,
            "text": "Blinken has also been a leading advocate for the United States to rejoin the Iran nuclear deal."
        },
        {
            "id": 15,
            "text": "Transition Playbook Tracking the people, policies, and emerging power centers of the Biden Administration."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": "Blinken was dragged into Republican efforts to tar Biden with questions about his son Hunter’s business activities in Ukraine."
        },
        {
            "id": 20,
            "text": "Blinken was interviewed as part of a GOP-led probe into the matter."
        },
        {
            "id": 21,
            "text": "The investigation was ultimately unable to establish that Hunter Biden’s actions affected his father’s work as vice president or U.S. policy toward Ukraine."
        },
        {
            "id": 22,
            "text": "Sullivan is perhaps best known for his role as an aide to former Secretary of State Hillary Clinton, working for her at the State Department as well as serving as a key figure in her 2016 campaign for president."
        },
        {
            "id": 23,
            "text": "He’s in his early 40s, but has earned a reputation as a whiz kid in the foreign policy realm."
        },
        {
            "id": 24,
            "text": "He played an important role in crafting the Iran nuclear deal, and he served as Biden’s national security adviser for a spell when Biden was vice president."
        },
        {
            "id": 25,
            "text": "Since Clinton’s loss, Sullivan has spent time researching ways to make U.S. foreign policy more relevant to America’s domestic needs."
        },
        {
            "id": 26,
            "text": "He’s written or co-written a number of essays that try to bridge the gaps that have often separated foreign and economic policy, and it was believed that he might be placed in a domestic-focused role in a Biden White House."
        },
        {
            "id": 27,
            "text": "The role of White House national security adviser does not require Senate confirmation."
        },
        {
            "id": 28,
            "text": "Thomas-Greenfield spent 35 years in the Foreign Service, including as ambassador to Liberia and assistant secretary of State for African affairs."
        },
        {
            "id": 29,
            "text": "She’s one of the most prominent Black female diplomats in Washington."
        },
        {
            "id": 30,
            "text": "She also spent time as a top human resources official at the State Department, and could provide Biden valuable advice as he seeks to rebuild morale among U.S. diplomats who have often felt cut out under the Trump administration."
        },
        {
            "id": 31,
            "text": "While the role of ambassador to the United Nations will require Senate confirmation, it was not immediately clear if Biden intends to put the position in his Cabinet."
        }
    ]
}