{
    "title": "Georgia Governor Signs Election Overhaul, Including Changes To Absentee Voting",
    "text": [
        {
            "id": 0,
            "text": "Georgia Governor Signs Election Overhaul, Including Changes To Absentee Voting\n\nEnlarge this image toggle caption Tami Chappell/AFP via Getty Images Tami Chappell/AFP via Getty Images\n\nGeorgia Gov. Brian Kemp on Thursday signed a massive overhaul of election laws, shortly after the Republican-controlled state legislature approved it."
        },
        {
            "id": 1,
            "text": "The bill enacts new limitations on mail-in voting, expands most voters' access to in-person early voting and caps a months-long battle over voting in a battleground state."
        },
        {
            "id": 2,
            "text": "\"With Senate bill 202, Georgia will take another step toward ensuring our elections are secure, accessible and fair,\" Kemp told reporters Thursday evening."
        },
        {
            "id": 3,
            "text": "Kemp's remarks during the signing appeared to have been cut short as Democratic state Rep. Park Cannon was escorted out of the building and arrested by Georgia State Patrol."
        },
        {
            "id": 4,
            "text": "Cannon was seen on video before that knocking on the governor's door as he spoke."
        },
        {
            "id": 5,
            "text": "According to the Fulton County Department of Public Safety website, Cannon was charged with willful obstruction of law enforcement officers by use of threats or violence and preventing or disrupting general assembly sessions."
        },
        {
            "id": 6,
            "text": "The Georgia State Constitution states that lawmakers \"shall be free from arrest during sessions of the General Assembly\" except for treason, felony, or breach of the peace."
        },
        {
            "id": 7,
            "text": "The 96-page bill makes dramatic alterations to Georgia's absentee voting rules, adding new identification requirements, moving back the request deadline and other changes after a record 1.3 million absentee ballots overwhelmed local elections officials and raised Republican skepticism of a voting method they created."
        },
        {
            "id": 8,
            "text": "Previous plans to require an excuse to vote by mail, as well as restrict weekend voting hours primarily used in larger Democratic-leaning counties, were scrapped amid mounting opposition from voting rights groups, Democrats and county elections supervisors."
        },
        {
            "id": 9,
            "text": "On a 100-75 party-line vote, the state House approved SB 202 early Thursday, and the Senate voted later Thursday to agree with the House changes 34-20 on a party-line vote as well."
        },
        {
            "id": 10,
            "text": "\"Included in SB 202 are topics that are important to all Georgians,\" Ethics Committee Chair and state Sen. Max Burns said when presenting the bill, ticking through provisions like a new fraud hotline for the attorney general's office to a new expansion of early voting."
        },
        {
            "id": 11,
            "text": "Earlier law required three weeks of in-person early voting Monday through Friday, plus one Saturday, during \"normal business hours."
        },
        {
            "id": 12,
            "text": "The new bill adds an extra Saturday, makes both Sundays optional for counties, and standardizes hours from 9 a.m. to 5 p.m. or as long as 7 a.m. to 7 p.m.\n\nSB 202 also criminalizes passing out food or drinks to voters waiting in line, except for a self-serve water station."
        },
        {
            "id": 13,
            "text": "Many of the measures in SB 202 will streamline the election administration process at the local level, such as allowing officials to process absentee ballots sooner, require them to count ballots nonstop once the polls close and allow flexibility with voting equipment for smaller, lower-turnout races."
        },
        {
            "id": 14,
            "text": "Poll workers could serve in neighboring counties, after the pandemic saw a shortage of trained workers."
        },
        {
            "id": 15,
            "text": "Precincts with more than 2,000 voters that have lines longer than an hour at three different points throughout the day have to add more machines, add more staff or split up the poll."
        },
        {
            "id": 16,
            "text": "The absentee ballot request window is narrower, starting for most Georgians 11 weeks before the election and ending 11 days before."
        },
        {
            "id": 17,
            "text": "Third-party absentee ballot applications must be more clearly labeled, and state and local governments are not be allowed to send unsolicited applications."
        },
        {
            "id": 18,
            "text": "The bill will also shorten Georgia's nine-week runoff period to four weeks by sending military and overseas voters instant-runoff ranked choice absentee ballots and only requiring in-person early voting starting the Monday eight days before election day."
        },
        {
            "id": 19,
            "text": "Democrats opposed several pieces of the bill, including language that removes the secretary of state as chair of the State Election Board, allowing the SEB and lawmakers a process to temporarily take over elections offices and limiting the number, location and access to secure absentee drop boxes."
        },
        {
            "id": 20,
            "text": "Drop boxes were enacted as an emergency rule of the SEB because of the coronavirus pandemic, so this codifies their existence, requires all counties to have at least one, and would only allow voters to use the drop boxes during early voting hours and inside early voting locations."
        },
        {
            "id": 21,
            "text": "\"How does this bill help to build voter trust and confidence?\""
        },
        {
            "id": 22,
            "text": "state Rep. Debbie Buckner said."
        },
        {
            "id": 23,
            "text": "\"The bill adds up to more burdens and cost and returns to old practices that were abandoned years ago for security, convenience and safety.\""
        },
        {
            "id": 24,
            "text": "Voters who show up to the wrong precinct will not have provisional ballots counted, unless it's after 5 p.m. and they signed a statement they could not make it to the correct poll."
        },
        {
            "id": 25,
            "text": "A performance review of local elections officials could be initiated by the county commission or a certain threshold of General Assembly members."
        },
        {
            "id": 26,
            "text": "The SEB could also create an independent performance review board, and no more than four elections superintendents could be suspended at any given time."
        },
        {
            "id": 27,
            "text": "Democratic Rep. Kim Alexander said county elections officials shared concern about the timing and the cost of the legislation, including a requirement for more expensive security paper for ballots."
        },
        {
            "id": 28,
            "text": "\"We have heard testimony from county election officials ... that more time is needed to fully understand the fiscal and logistical impacts the provisions in these bills would have,\" she said."
        },
        {
            "id": 29,
            "text": "\"Given the substantial changes we'd be making with this legislation, why not take more time to get county input on the proposed legislation and take this up next session?\""
        },
        {
            "id": 30,
            "text": "In the Senate, Democrats objected to the bill being brought up without a fiscal analysis of the cost to the state and counties, but Lt. Gov. Geoff Duncan ruled that the bill did not meet requirements that needed that sort of analysis."
        },
        {
            "id": 31,
            "text": "Elsewhere in the bill, the secretary of state will be required to conduct a pilot of posting scanned ballot images from elections, and those images would be public records."
        },
        {
            "id": 32,
            "text": "Ballots used in the election will have to be on special security paper, which will cost more to use."
        },
        {
            "id": 33,
            "text": "Overall, the bill will touch nearly every facet of elections, like a section that aims to provide more information about vote totals as results come in."
        },
        {
            "id": 34,
            "text": "As soon as possible, but no later than 10 p.m. on election night, counties must publish the total number of votes cast by each method, and all absentee ballots have to be counted by 5 p.m. the day after the election, otherwise a county supervisor could face the state's new performance review process."
        },
        {
            "id": 35,
            "text": "The 20-candidate special election to fill the remainder of Sen. Johnny Isakson's term and accompanying runoff between then-Sen. Kelly Loeffler and current Sen. Raphael Warnock is no more: special elections have special primaries."
        },
        {
            "id": 36,
            "text": "Fulton County is no longer able to use its two mobile voting buses for early voting, as the bill limits mobile polls to emergencies."
        }
    ]
}