{
    "title": "House GOP leaders work to contain defections on Trump’s emergency",
    "text": [
        {
            "id": 0,
            "text": "House Republican leaders — including Reps. Kevin McCarthy, Steve Scalise, Liz Cheney and Tom Cole — are confident Democrats will fall short of the more than 50 GOP votes they'd need for a veto override."
        },
        {
            "id": 1,
            "text": "National Emergency House GOP leaders work to contain defections on Trump’s emergency Republicans are eager to avoid an embarrassing vote for the president."
        },
        {
            "id": 2,
            "text": "House Republicans are working to hold defections on legislation to block President Donald Trump’s emergency declaration to potentially under a dozen on Tuesday."
        },
        {
            "id": 3,
            "text": "The White House and GOP leaders have launched a last-minute push to limit the losses on a House vote to stop Trump from circumventing Congress to build a border wall, in a bid to avoid a humiliating defeat for the president, according to multiple Republican sources."
        },
        {
            "id": 4,
            "text": "So far, just one Republican — libertarian Rep. Justin Amash (R-Mich.) — has backed a Democratic measure to overturn Trump’s national emergency declaration."
        },
        {
            "id": 5,
            "text": "There’s little doubt that the resolution will easily pass the House."
        },
        {
            "id": 6,
            "text": "Instead, the question is whether at least four GOP senators will create a bipartisan majority and help deliver the biggest rebuke of the president since Democrats regained the House last fall."
        },
        {
            "id": 7,
            "text": "The House’s vote on Tuesday could help set the tone in the Senate by offering some political cover to Republican senators who have publicly fretted about Trump’s move to secure billions of dollars without Congress’s approval."
        },
        {
            "id": 8,
            "text": "House Democrats believe they could win support from between five to 10 Republicans in Tuesday’s much-anticipated floor vote, according to two sources — far less than the dozens of House Republicans who have voiced skepticism of the idea at some point in recent months."
        },
        {
            "id": 9,
            "text": "In an attempt to drum up GOP supporters, Democrats have circulated a spreadsheet of hundreds of military construction projects that the White House could potentially take money from for its border project."
        },
        {
            "id": 10,
            "text": "The document shows billions of dollars are at stake in red states from Alaska to Georgia to Texas."
        },
        {
            "id": 11,
            "text": "Pressure has been building."
        },
        {
            "id": 12,
            "text": "Pentagon officials visited Capitol Hill on Friday to brief top defense spending leaders of both parties on where the administration could divert $3.6 billion from military projects to the border."
        },
        {
            "id": 13,
            "text": "So far, Amash is the only House Republican to publicly declare support for the resolution, though dozens of others — including libertarians, defense hawks and appropriators — have been wary of Trump’s tactics."
        },
        {
            "id": 14,
            "text": "That GOP skepticism, though, may not translate into votes for the Democratic measure, particularly because Trump has vowed to veto it."
        },
        {
            "id": 15,
            "text": "And House Republican leaders are confident across the board that Democrats will fall far short of the more than 50 Republican votes they'd need for an override."
        },
        {
            "id": 16,
            "text": "Rep. Mike Turner (R-Ohio), along with four other House Republicans, sent a letter to Trump earlier this month urging Trump to look elsewhere for the money."
        },
        {
            "id": 17,
            "text": "Turner — a defense hawk whose state could lose as much as $90 million in military construction funds — has said Trump’s move would be a \"dangerous precedent.\""
        },
        {
            "id": 18,
            "text": "Still, he hasn’t specifically said if he would support the Democratic resolution."
        },
        {
            "id": 19,
            "text": "Rep. Roger Williams (R-Texas) said he initially feared that Trump's move could take money from Fort Hood, which is in his district."
        },
        {
            "id": 20,
            "text": "But last week, he got a personal assurance from Pentagon officials that no existing funding would be used."
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": "\"That's a big deal to me,\" Williams said Monday night, confirming that he would vote against the resolution."
        },
        {
            "id": 23,
            "text": "Trump began applying public pressure to his own party Monday, warning Republicans not to fall into the Democratic “trap.”"
        },
        {
            "id": 24,
            "text": "“I hope our great Republican Senators don’t get led down the path of weak and ineffective Border Security,” Trump tweeted."
        },
        {
            "id": 25,
            "text": "The White House legislative affairs team has also been making the case privately to Republican lawmakers over the weekend and on Monday, according to a White House official."
        },
        {
            "id": 26,
            "text": "Officials have been doing outreach to provide “as much information as possible,” and plan to take a more targeted approach after they learn which GOP members are considering voting for the measure."
        },
        {
            "id": 27,
            "text": "Separately, House Minority Whip Steve Scalise sent talking points to the GOP caucus on Monday that say there are already 31 national emergencies in effect, and that Trump is specifically working to address a “humanitarian and security crisis.”"
        },
        {
            "id": 28,
            "text": "“Instead of working with the President to secure the border and protect the public, Democrats choose to continue to play politics,” the message from the GOP whip office reads."
        },
        {
            "id": 29,
            "text": "Scalise (R-La.) and his whip team will begin formally counting votes Monday night."
        },
        {
            "id": 30,
            "text": "The White House is eyeing a total of $8 billion in border cash, which would also include $2.5 billion from a Pentagon drug interdiction program as well as $600 million from a Treasury Department forfeiture fund."
        },
        {
            "id": 31,
            "text": "Since Trump's announcement earlier this month, groups of former national security officials and former GOP members of Congress have also expressed opposition to the move."
        },
        {
            "id": 32,
            "text": ""
        }
    ]
}