{
    "title": "Is Mitch McConnell next?",
    "text": [
        {
            "id": 0,
            "text": "House Speaker John Boehner kisses House Minority Leader Nancy Pelosi during a reception in the Rose Garden of the White House on April 21, 2015."
        },
        {
            "id": 1,
            "text": "WASHINGTON, DC - JULY 29: House Speaker John Boehner holds his weekly news conference on Capitol Hill on July 29, 2015 in Washington, DC."
        },
        {
            "id": 2,
            "text": "During the press conference the Speaker listed the accomplishments of the Republican party that saved US tax payers trillions of dollars, but admitted much more needs to be done."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "After 25 years in Congress and five years as Speaker, Boehner said he decided this morning to step down after contemplation and prayer."
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "Speaker of the House John Boehner, tells reporters that he is \"cleaning out the barn, cleaning out the barn,\" as he heads to a GOP conference meeting at the begining of his last week in the House of Representatives October 26 in Washington, DC."
        },
        {
            "id": 7,
            "text": "The White House and Boehner may be nearing a two-year budget deal that would avert another government shutdown, increase defense and defense spending by $80 billion and extend the debt limit through to March 2017, clearing it away until after the 2016 elections."
        },
        {
            "id": 8,
            "text": "Story highlights McConnell isn't a favorite of many conservatives Senate filibuster rules frustrate House Republicans\n\nCNN —\n\nConservatives at the Values Voter Summit cheered Friday morning when they learned that House Speaker John Boehner was retiring."
        },
        {
            "id": 9,
            "text": "Friday afternoon, they cheered again when someone suggested the next establishment Republican to lose his job should be Senate Majority Leader Mitch McConnell."
        },
        {
            "id": 10,
            "text": "“Here’s what I say in response to Speaker Boehner stepping down."
        },
        {
            "id": 11,
            "text": "Mitch McConnell, it is now your turn,” Louisiana Gov. and GOP presidential candidate Bobby Jindal said to raucous applause."
        },
        {
            "id": 12,
            "text": "After the news of Boehner’s resignation, Arizona Rep. Matt Salmon told reporters he had texted his fellow conservative friend, Sen. Mike Lee, R-Utah, with the simple message: “the next guy in the crosshairs is probably McConnell.”"
        },
        {
            "id": 13,
            "text": "The Kentucky Republican has never been the favorite of tea party-aligned conservatives."
        },
        {
            "id": 14,
            "text": "His budget deals with the Obama administration – most notably the December 2012 agreement with Vice President Joe Biden averting the so-called fiscal cliff – haven’t endeared him to the base who say he gives up too much."
        },
        {
            "id": 15,
            "text": "He has declined to get rid of the Senate filibuster in order to block the Iran nuclear deal, and critics say he surrendered the fight over federal funding for Planned Parenthood by declaring early on that he would actively seek to avoid a government shutdown."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "Rep. Salmon: ‘I was surprised’ at Boehner’s resignation"
        },
        {
            "id": 18,
            "text": "But McConnell likely isn’t going anywhere."
        },
        {
            "id": 19,
            "text": "While talk radio may call for his head, there are no signs of a true in-house groundswell against him."
        },
        {
            "id": 20,
            "text": "Making things more difficult for a would-be insurgent, the Senate leader is elected only by his or her conference, meaning it would be harder to get the critical mass needed to unseat him."
        },
        {
            "id": 21,
            "text": "That doesn’t mean conservatives will be silent – McConnell epitomizes the Republican establishment in Washington that several of the top GOP presidential candidates such as Donald Trump, Ben Carson and Carly Fiorina are running against."
        },
        {
            "id": 22,
            "text": "Seventy-two percent of Republican primary voters said they are dissatisfied with the ability of Boehner and McConnell to achieve their party’s goals, according to a new NBC News/Wall Street Journal poll."
        },
        {
            "id": 23,
            "text": "And 36 percent wanted them immediately removed from their leadership positions."
        },
        {
            "id": 24,
            "text": "Jindal’s other big applause line at the Values Voter Summit regarding Boehner: “That’s one down, that’s 434 more to go.”"
        },
        {
            "id": 25,
            "text": "McConnell’s office declined to comment, but referred CNN to the second-ranking Senate Republican, John Cornyn."
        },
        {
            "id": 26,
            "text": "“As someone who’s in constant contact with our members, it’s clear Leader McConnell has overwhelming support within the conference,” Cornyn said."
        },
        {
            "id": 27,
            "text": "Filibuster frustration\n\nRep. Bill Flores, R-Texas, said many House GOP members were frustrated with Senate Republicans for not pushing a more conservative agenda and taking up bills the House passed."
        },
        {
            "id": 28,
            "text": "“In my view the Speaker fell on his sword for all of Congress, and I hope the Senate starts to get things done.”"
        },
        {
            "id": 29,
            "text": "To reporters, Salmon aimed his frustration at the filibuster and the 60-vote threshold that Democrats have used to block House GOP initiatives."
        },
        {
            "id": 30,
            "text": "“A lot of the problem that we’re engaged in is because the Senate doesn’t take any action on anything,” Salmon said."
        },
        {
            "id": 31,
            "text": "“And there is nothing that any presidential candidate on our side says that will ever be realized as long as the modern day filibuster is enacted the way it is today.”"
        },
        {
            "id": 32,
            "text": ""
        },
        {
            "id": 33,
            "text": "McConnell: ‘There will not be a government shutdown’"
        },
        {
            "id": 34,
            "text": "McConnell has been tested before from the right."
        },
        {
            "id": 35,
            "text": "He defeated tea party challenger Matt Bevin in a contentious 2014 Republican Kentucky Senate primary."
        },
        {
            "id": 36,
            "text": "And in July, Sen. Ted Cruz, R-Texas, tore into McConnell in a rare personal attack on the Senate floor, accusing the majority leader of lying."
        },
        {
            "id": 37,
            "text": "Cruz said McConnell had promised he had not cut a deal to allow a vote on the Export-Import Bank, an institution Cruz believes is corrupt."
        },
        {
            "id": 38,
            "text": "“If he was telling us the truth that there was no deal, why would he do what he just did?”"
        },
        {
            "id": 39,
            "text": "Cruz asked."
        },
        {
            "id": 40,
            "text": "“We now know that when the majority leader looks us in the eyes and makes an explicit commitment that he is willing to say things that he knows are false.”\n\nRELATED:"
        },
        {
            "id": 41,
            "text": "In vitriolic Senate floor speech, Cruz accuses McConnell of lying"
        },
        {
            "id": 42,
            "text": "Cruz’s attacks, however, may only have served to remind conservatives about how powerful McConnell is."
        },
        {
            "id": 43,
            "text": "Several influential Republican senators chastised Cruz after the incident."
        },
        {
            "id": 44,
            "text": "Sen. Orrin Hatch, R-Utah, warned Cruz that the type of rhetoric that works outside Washington doesn’t work on the Hill."
        },
        {
            "id": 45,
            "text": "“Squabbling and sanctimony may be tolerated in other venues – or perhaps on the campaign trail,” Hatch said, “but they have no place among colleagues in the United States Senate.”"
        }
    ]
}