{
    "title": "Trump compares impeachment drive to 'lynching'",
    "text": [
        {
            "id": 0,
            "text": "President Trump called the House Democrats’ push for impeachment a “lynching” Tuesday as he pushed Republicans to rally around him amid the inquiry."
        },
        {
            "id": 1,
            "text": "Mr. Trump used the incendiary language as he tested a new line of attack, reasoning that Democrats should be careful what they wish for because he feels they are watering down the standard for impeachment."
        },
        {
            "id": 2,
            "text": "“So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights,” he wrote."
        },
        {
            "id": 3,
            "text": "“All Republicans must remember what they are witnessing here — a lynching."
        },
        {
            "id": 4,
            "text": "But we will WIN!”"
        },
        {
            "id": 5,
            "text": "Washington observers winced at Mr. Trump’s use of the word, since it evoked horrific crimes against black Americans in the U.S. South."
        },
        {
            "id": 6,
            "text": "Rep. Barbara Lee, California Democrat, said the comments exhibited ignorance and will further harm Mr. Trump’s standing with the black community."
        },
        {
            "id": 7,
            "text": "“Of course, he has no understanding of this horrific history, I assume."
        },
        {
            "id": 8,
            "text": "And for him to say something like that was disgusting,” Ms. Lee said."
        },
        {
            "id": 9,
            "text": "“It hurts."
        },
        {
            "id": 10,
            "text": "It’s painful, and he should apologize.”"
        },
        {
            "id": 11,
            "text": "Democratic leaders continued to condemn Mr. Trump through the morning, though said they are not looking to formally rebuke him through a resolution."
        },
        {
            "id": 12,
            "text": "The Southern Poverty Law Center said Mr. Trump’s comment showed “a complete disrespect” for thousands of murdered black Americans, though the White House insisted Mr. Trump wasn’t trying to draw comparisons."
        },
        {
            "id": 13,
            "text": "“The president is not comparing what’s happened to him with one of the darkest moments in American history."
        },
        {
            "id": 14,
            "text": "He’s just not,” White House deputy press secretary Hogan Gidley said."
        },
        {
            "id": 15,
            "text": "“What he’s explaining clearly is the way he’s been treated by the media since he announced for president.”"
        },
        {
            "id": 16,
            "text": "Some Capitol Hill lawmakers said Mr. Trump should at least remove his online posting."
        },
        {
            "id": 17,
            "text": "“You think this impeachment is a LYNCHING?"
        },
        {
            "id": 18,
            "text": "What the hell is wrong with you?”"
        },
        {
            "id": 19,
            "text": "Rep. Bobby L. Rush, Illinois Democrat, tweeted."
        },
        {
            "id": 20,
            "text": "“Do you know how many people who look like me have been lynched, since the inception of this country, by people who look like you. Delete this tweet.”"
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": "House Majority Whip James Clyburn, South Carolina Democrat who is African American, said the president “has always been pretty loose with his words, and this is another indication of that.”"
        },
        {
            "id": 23,
            "text": "“I really believe this man is prone to inflammatory statements,” he told CNN, “and that is one word that no president ought to apply to himself.”"
        },
        {
            "id": 24,
            "text": "Rep. Adam Kinzinger, Illinois Republican, urged Mr. Trump to retract his comment immediately, though Sen. Lindsey Graham, an ardent Trump supporter who pushed back on the president’s Syrian policy, said the term was apt, according to multiple Capitol Hill reporters who interviewed him."
        },
        {
            "id": 25,
            "text": "“This is a lynching in every sense,” the South Carolina Republican said."
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        }
    ]
}