{
    "title": "DOJ official quits after Barr move on election fraud allegations",
    "text": [
        {
            "id": 0,
            "text": "A Justice Department official stepped down from his role overseeing probes into voting crimes hours after Attorney General William Barr announced on Monday that he had authorized the agency to investigate any \"substantial allegations\" of voter fraud in the presidential election."
        },
        {
            "id": 1,
            "text": "In an email first obtained by The New York Times, Richard Pilger wrote to colleagues, “Having familiarized myself with the new policy and its ramifications ..."
        },
        {
            "id": 2,
            "text": "I must regretfully resign from my role as director of the Election Crimes Branch.”"
        },
        {
            "id": 3,
            "text": "Pilger added in the email that the new policy is \"abrogating the forty-year old Non-Interference Policy for ballot fraud investigation in the period prior to elections becoming certified and uncontested.\""
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "According to the Times, Pilger, who had served as director of the Justice Department's Election Crimes Branch since 2010, added that he would \"move to a non supervisory role working on corruption prosecutions.”"
        },
        {
            "id": 6,
            "text": "The Hill has reached out to the agency for comment."
        },
        {
            "id": 7,
            "text": "Pilger’s resignation came after Barr wrote in a memo Monday that Justice Department investigations “may be conducted if there are clear and apparently-credible allegations of irregularities that, if true, could potentially impact the outcome of a federal election in an individual State.”"
        },
        {
            "id": 8,
            "text": "\"Nothing here should be taken as any indication that the Department has concluded that voting irregularities have impacted the outcome of any election,\" Barr added."
        },
        {
            "id": 9,
            "text": "\"Such inquiries and reviews may be conducted if there are clear and apparently-credible allegations of irregularities that, if true, could potentially impact the outcome of a federal election in an individual state.\""
        },
        {
            "id": 10,
            "text": "President-elect Joe Biden on Saturday was projected by every major news outlet as the winner of the presidential election,"
        },
        {
            "id": 11,
            "text": "but President Trump has indicated he will not concede, alleging without evidence that there were several instances of voter fraud in a Democratic attempt to steal the election from him."
        },
        {
            "id": 12,
            "text": "The Trump campaign has filed lawsuits in several key battleground states that Biden won, asking local judges to either invalidate or stop counting mail-in ballots."
        }
    ]
}