{
    "title": "OPINION: Tillerson can survive this Russia trip. Really.",
    "text": [
        {
            "id": 0,
            "text": "Secretary of State Rex Tillerson’s visit to Moscow this week was going to be awkward even before the U.S. attack on Syria, given multiple investigations into the Trump team’s connections to Russia and Tillerson’s status as a novice diplomat."
        },
        {
            "id": 1,
            "text": "His trip, the first by a senior Trump administration official to Russia, will test his skills and also serve as a reality test for President Trump’s dream of improving U.S.-Russian relations."
        },
        {
            "id": 2,
            "text": "The missile strikes on a Syrian airbase last week complicate this dream, but it would be wrong to interpret them as a reversal in Trump’s Russia policy."
        },
        {
            "id": 3,
            "text": "They are best understood as a warning against the use of chemical weapons and a signal that Trump won’t be shy about using force."
        },
        {
            "id": 4,
            "text": "In Moscow, Tillerson is currently scheduled to meet with Russian Foreign Minister Sergei Lavrov."
        },
        {
            "id": 5,
            "text": "It wouldn't be surprising if he also sees President Vladimir Putin, who awarded him the country’s Order of Friendship for his work with Russia as chief executive of ExxonMobil."
        },
        {
            "id": 6,
            "text": "Their words will mean far less than Russia’s actions."
        },
        {
            "id": 7,
            "text": "Tillerson will have the chance to advance U.S. interests in key areas such as Ukraine and Syria if he keeps that in mind and utilizes tactics he developed in business."
        },
        {
            "id": 8,
            "text": "To be effective, a chief executive must grasp the fundamental facts surrounding any strategic decision."
        },
        {
            "id": 9,
            "text": "It is a fundamental fact that Putin is overseeing a focused campaign to undermine U.S. interests globally and subvert our democracy domestically."
        },
        {
            "id": 10,
            "text": "Putin’s indiscriminate bombing of civilians in Syria has not only caused a humanitarian catastrophe, it has also flooded Europe with refugees and radicalized untold numbers of Middle Eastern youths."
        },
        {
            "id": 11,
            "text": "His invasion of Ukraine has rattled the very core of the European state system."
        },
        {
            "id": 12,
            "text": "And whether or not Putin helped Trump win last year, it is indisputable that Russia’s interference has polarized our politics, sowed division and distrust, and discredited some of our most essential institutions."
        },
        {
            "id": 13,
            "text": "Syria missile strike could lead to political solution: Column\n\nBeware the Syria snakepit: Christian Schneider"
        },
        {
            "id": 14,
            "text": "The central theme of U.S. policy on Russia has long been “cooperate where we can but confront where we must.”"
        },
        {
            "id": 15,
            "text": "Tillerson must go beyond this tired cliché."
        },
        {
            "id": 16,
            "text": "Just as a chief executive might strike a performance-based deal with a new contractor, he should require Moscow to meet measurable benchmarks before unlocking further layers of cooperation."
        },
        {
            "id": 17,
            "text": "Instead of “trust but verify,” he should be guided by “don’t trust — verify, then verify again.”"
        },
        {
            "id": 18,
            "text": "A path forward that is limited in scope and measurable in results offers the best chance at success."
        },
        {
            "id": 19,
            "text": "That’s why Tillerson should concentrate on a small set of issues, starting with Ukraine and Syria, and outline concrete steps as testing points for the future of U.S.-Russian relations."
        },
        {
            "id": 20,
            "text": "He must not acquiesce to what Putin wants: broad and symbolic cooperation that allows Moscow a free hand in those two hot spots."
        },
        {
            "id": 21,
            "text": "A good chief executive understands the strengths and weaknesses of his competitors."
        },
        {
            "id": 22,
            "text": "Similarly, Tillerson must bear in mind that while Russia has its strong points, it is not 10-feet-tall."
        },
        {
            "id": 23,
            "text": "Putin may be a shrewd tactician, but his economy — constrained by sanctions, low oil prices, and rampant brain drain — remains feeble."
        },
        {
            "id": 24,
            "text": "Russia is not China; it does not have billions of trade and investment dollars to throw around in hopes of courting influence."
        },
        {
            "id": 25,
            "text": "When you cut through the paranoia, Russia is a formidable military power, with a fearsome nuclear arsenal and advanced cyber capabilities, but it is not a near-peer competitor like China."
        },
        {
            "id": 26,
            "text": "Perhaps Putin’s biggest advantage today is that he knows what he wants."
        },
        {
            "id": 27,
            "text": "As the Trump administration struggles to manage the day-to-day functions of the U.S. government, it has shown little capacity to pursue a strategically ambitious foreign policy."
        },
        {
            "id": 28,
            "text": "Meanwhile, Moscow is intensely focused on eroding U.S. influence and democracy around the globe."
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": "He was wise to draw a bright line on sanctions in Brussels."
        },
        {
            "id": 32,
            "text": "An early lifting of sanctions would have projected weakness and invited further Russian aggression and malfeasance."
        },
        {
            "id": 33,
            "text": "On this visit he should reiterate America’s commitment to hold firm on sanctions until Russia pulls back from Ukrainian territory, and seek to re-energize the diplomatic process."
        },
        {
            "id": 34,
            "text": "The White House could strengthen his hand by indicating it backs a stronger U.S. military presence in Europe and additional sanctions if Russia continues to disregard its neighbors’ sovereignty."
        },
        {
            "id": 35,
            "text": "On Syria, Tillerson must directly confront the Kremlin on its support for Syrian President Bashar Assad."
        },
        {
            "id": 36,
            "text": "He should use the missile strikes to persuade Moscow to back a political transition that removes Assad, and to agree to redirect Russian military assets in Syria to target the Islamic State of Syria and Iraq instead of shoring up Assad."
        },
        {
            "id": 37,
            "text": "Trump may be tempted by a “grand bargain” that makes a flashy headline, but Tillerson should protect his boss from any deal that gives Moscow good publicity before it changes its behavior in practice."
        },
        {
            "id": 38,
            "text": "Many U.S. presidents have entered office seeking a better relationship with Russia; nearly as many have left with such hopes dashed."
        },
        {
            "id": 39,
            "text": "As Tillerson prepares to kick off the new administration’s diplomacy with Russia, he must draw on his experience as a CEO and keep American interests front and center."
        },
        {
            "id": 40,
            "text": "While it would indeed be nice if we “got along with Russia,” as Trump puts it, the key question remains: At what price?"
        },
        {
            "id": 41,
            "text": "Edward Fishman, a fellow at the Atlantic Council, most recently served as a member of the Secretary of State’s policy planning staff during the Obama administration."
        },
        {
            "id": 42,
            "text": "Mark Simakovsky, also a fellow at the Atlantic Council and vice president at Beacon Global Strategies, served in the Bush and Obama administrations and most recently was chief of staff for NATO and Europe in the Office of the Secretary of Defense."
        },
        {
            "id": 43,
            "text": ""
        },
        {
            "id": 44,
            "text": ""
        }
    ]
}