{
    "title": "William Weld: Trump Needs Someone to Challenge His Stances",
    "text": [
        {
            "id": 0,
            "text": "It's important to have somebody who will \"put the president to his proofs\" and to challenge him on his stances, former two-term Massachusetts Gov. William Weld, who has announced his primary challenge against President Donald Trump, said Tuesday."
        },
        {
            "id": 1,
            "text": "\"You ask him some questions, like, why do you think it's good to insult our military allies, why do you praise dictators?\""
        },
        {
            "id": 2,
            "text": "Weld told MSNBC's \"Morning Joe.\""
        },
        {
            "id": 3,
            "text": "\"Is it because you wish the United States was more dictatorial?"
        },
        {
            "id": 4,
            "text": "I'm afraid that might be the case."
        },
        {
            "id": 5,
            "text": "Why are you so angry about everything all the time?\""
        },
        {
            "id": 6,
            "text": "Weld, who also ran for vice president on the 2016 Libertarian party ticket headed by Gary Johnson, said his plan is to enlarge the electorate by targeting independents, millennials, female voters and others, as he did when he ran for governor in Massachusetts."
        },
        {
            "id": 7,
            "text": "He also struck back at people who say they don't like Trump's style, but they do like his substance."
        },
        {
            "id": 8,
            "text": "\"It's not style when you're as angry all the time and uncurious as this president is,\" said Weld. \""
        },
        {
            "id": 9,
            "text": "For example, the president insists that global warming is a hoax."
        },
        {
            "id": 10,
            "text": "Well, does he think those scientists who did those measurements are making money off the deal and lying about the results of the scientific examination?"
        },
        {
            "id": 11,
            "text": "It just betrays a lack of homework and not really thinking ahead about what to do.\""
        },
        {
            "id": 12,
            "text": "Weld also said as president, he'd push for the education displaced workers need in the wake of new technology, including making community college free for them."
        }
    ]
}