{
    "title": "Surprise: Hillary Clinton Went Around Federal Law, Used Her Personal Email Account For Official Business as Secretary of State",
    "text": [
        {
            "id": 0,
            "text": "What difference does it make if you conduct your entire State Department career as secretary on personal email?"
        },
        {
            "id": 1,
            "text": "A huge difference."
        },
        {
            "id": 2,
            "text": "According to a new report in the New York Times, (yes, the New York Times), Hillary Clinton used her personal email account to conduct pretty much all of her official government business during her time at the State Department."
        },
        {
            "id": 3,
            "text": "Hillary Rodham Clinton exclusively used a personal email account to conduct government business as secretary of state, State Department officials said, and may have violated federal requirements that officials’ correspondence be retained as part of the agency’s record."
        },
        {
            "id": 4,
            "text": "Mrs. Clinton did not have a government email address during her four-year tenure at the State Department."
        },
        {
            "id": 5,
            "text": "Her aides took no actions to have her personal emails preserved on department servers at the time, as required by the Federal Records Act."
        },
        {
            "id": 6,
            "text": "It was only two months ago, in response to a new State Department effort to comply with federal record-keeping practices, that Mrs. Clinton’s advisers reviewed tens of thousands of pages of her personal emails and decided which ones to turn over to the State Department."
        },
        {
            "id": 7,
            "text": "All told, 55,000 pages of emails were given to the department."
        },
        {
            "id": 8,
            "text": "Mrs. Clinton stepped down from the secretary’s post in early 2013."
        },
        {
            "id": 9,
            "text": "Her expansive use of the private account was alarming to current and former National Archives and Records Administration officials and government watchdogs, who called it a serious breach."
        },
        {
            "id": 10,
            "text": "This isn't the first time the Obama administration has been caught evading federal records laws by using personal email, which ultimately allows officials to escape scrutiny under the Freedom of Information Act and Congressional investigation."
        },
        {
            "id": 11,
            "text": "During Operation Fast and Furious, former Assistant Attorney General Lanny Breuer got caught fowarding and editing official information about the scandal to his personal email account."
        },
        {
            "id": 12,
            "text": "Former Department of Homeland Security Secretary Janet Napolitano claimed she didn't have an email account."
        },
        {
            "id": 13,
            "text": "IRS officials caught up in the targeting of conservatives, including Lois Lerner, used a personal email account to conduct official government business."
        },
        {
            "id": 14,
            "text": "Former DOJ Civil Rights attorney and current Labor Secretary Tom Perez used his personal email account during his time at DOJ for official business."
        },
        {
            "id": 15,
            "text": "Just yesterday, a federal judge ruled the EPA lied about transparency in response to FOIA requests, and in the past, EPA officials have been caught violating federal records laws by using personal email to conduct government business."
        },
        {
            "id": 16,
            "text": "But back to Hillary."
        },
        {
            "id": 17,
            "text": "Here's another interesting and very telling nugget."
        },
        {
            "id": 18,
            "text": "The existence of Mrs. Clinton’s personal email account was discovered as a House committee investigating the attack on the American Consulate in Benghazi sought correspondence between Mrs. Clinton and her aides about the attack."
        },
        {
            "id": 19,
            "text": "The Benghazi Select Committee, headed by Congressman Trey Gowdy, is continuing its investigation."
        },
        {
            "id": 20,
            "text": "In the meantime, Clinton will certainly have to answer for her non-transparency and years of federal law violation should she announce a run for the White House in April."
        }
    ]
}