{
    "title": "Trey Gowdy Focusing On Hillary Clinton Allies In Closed Benghazi Committee Interviews",
    "text": [
        {
            "id": 0,
            "text": "Rep. Trey Gowdy (R-S.C.) has been attending Benghazi committee interviews with Hillary Clinton allies, not with intelligence officials or diplomatic security agents who survived the 2012 attack."
        },
        {
            "id": 1,
            "text": "WASHINGTON --"
        },
        {
            "id": 2,
            "text": "Rep. Trey Gowdy (R-S.C.) insists his Benghazi Committee investigation isn't about hurting 2016 Democratic presidential candidate Hillary Clinton in the polls."
        },
        {
            "id": 3,
            "text": "It's about providing a definitive account of the 2012 attack on a U.S. consulate in Libya."
        },
        {
            "id": 4,
            "text": "But if you look at the witness interviews he's attended, and not attended, there is a clear theme: Gowdy is mostly there for the people directly connected to Clinton."
        },
        {
            "id": 5,
            "text": "A House Democratic aide familiar with the committee's process tells The Huffington Post that, as of Friday morning, there have been 53 interviews and depositions with witnesses called in for Gowdy's probe."
        },
        {
            "id": 6,
            "text": "The closed-door interviews are staff-led, said the aide, so when members do come, they are typically passive observers."
        },
        {
            "id": 7,
            "text": "Gowdy has attended fewer than 10 of the 53."
        },
        {
            "id": 8,
            "text": "He was there for Cheryl Mills, Clinton's chief of staff when she was secretary of state; Jake Sullivan, Clinton's former deputy chief of staff and current foreign policy adviser on her presidential campaign; Sidney Blumenthal, a longtime Clinton adviser; and Bryan Pagliano, a State Department staffer who managed Clinton's private email server."
        },
        {
            "id": 9,
            "text": "Whom didn't Gowdy go to hear?"
        },
        {
            "id": 10,
            "text": "Three of the four diplomatic security agents who survived the terrorist attack."
        },
        {
            "id": 11,
            "text": "He also didn't attend interviews with CIA Deputy Director Michael Morell or former Defense Intelligence Agency Director Michael Flynn."
        },
        {
            "id": 12,
            "text": "\"Would seem to suggest where his priorities lie,\" the aide said."
        },
        {
            "id": 13,
            "text": "Gowdy spokesman Jamal Ware said the congressman has been to plenty of meetings relating to the Benghazi investigation."
        },
        {
            "id": 14,
            "text": "“Chairman Gowdy has been to interviews and meetings running the gamut from attack survivors to DOJ debriefings to compliance hearings to intelligence officials, interviews and meetings that are both classified and unclassified, both before and during the pendency of the current Select Committee investigation,\" Ware said."
        },
        {
            "id": 15,
            "text": "\"He has attended to far more matters that do not involve Clinton than those that do, including ones involving the White House, State Department on witness document production, and the CIA.\""
        },
        {
            "id": 16,
            "text": "He added that Rep. Elijah Cummings (Md.), the ranking Democrat on the committee, wasn't at many of those witness interviews either."
        },
        {
            "id": 17,
            "text": "Republicans on the committee brought in Huma Abedin, a top Clinton aide, on Friday."
        },
        {
            "id": 18,
            "text": "Cummings said it made no sense that she was there."
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": "\"She has no policy responsibilities, no operational responsibilities, was not with Secretary Clinton on the night of this phenomenal tragedy,\" Cummings told reporters."
        },
        {
            "id": 21,
            "text": "\"The question also becomes whether this is a taxpayer-funded effort to derail the candidacy of Hillary Clinton.\""
        },
        {
            "id": 22,
            "text": "Gowdy did not attend Abedin's interview."
        },
        {
            "id": 23,
            "text": "Republicans continue to say their probe isn't political, but House Majority Leader Kevin McCarthy (R-Calif.) suggested otherwise last month when he said the committee has succeeded in hurting Clinton's presidential bid."
        },
        {
            "id": 24,
            "text": "Rep. Richard Hanna (R-N.Y.), too, said Wednesday that the panel was set up largely to go after Clinton."
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": "\"This may not be politically correct, but I think that there was a big part of this investigation that was designed to go after people and an individual, Hillary Clinton,\" Hanna said on a New York radio show."
        },
        {
            "id": 27,
            "text": "Gowdy slammed Hanna shortly afterward."
        },
        {
            "id": 28,
            "text": "“My team of investigators, drawn from the military, federal agencies and the congressional oversight and ethics committees, has worked hard, and in an above-board manner,\" he said in a statement."
        },
        {
            "id": 29,
            "text": "\"It is unfortunate when claims are made by those who do not know what the committee has done, why it has done it, or the results of its work.\""
        },
        {
            "id": 30,
            "text": "Republican leaders formed the Select Committee on Benghazi nearly a year and a half ago and, so far, have spent $4.5 million on its work."
        },
        {
            "id": 31,
            "text": "There have been at least seven previous investigations."
        },
        {
            "id": 32,
            "text": "Clinton is testifying before the full committee on Oct. 22."
        },
        {
            "id": 33,
            "text": "This post has been updated to note that Gowdy's spokesman said Cummings hasn't attended many of the committee interviews either."
        },
        {
            "id": 34,
            "text": ""
        }
    ]
}