{
    "title": "CDC considering recommending general public wear face coverings in public",
    "text": [
        {
            "id": 0,
            "text": "Should we all be wearing masks?"
        },
        {
            "id": 1,
            "text": "That simple question is under review by officials in the U.S. government and has sparked a grass-roots pro-mask movement."
        },
        {
            "id": 2,
            "text": "But there’s still no consensus on whether widespread use of facial coverings would make a significant difference, and some infectious disease experts worry that masks could lull people into a false sense of security and make them less disciplined about social distancing."
        },
        {
            "id": 3,
            "text": "In recent days, more people have taken to covering their faces, although it remains a scattershot strategy driven by personal choice."
        },
        {
            "id": 4,
            "text": "The government does not recommend it."
        },
        {
            "id": 5,
            "text": "That may change."
        },
        {
            "id": 6,
            "text": "Officials at the Centers for Disease Control and Prevention are considering altering the official guidance to encourage people to take measures to cover their faces amid the coronavirus pandemic, according to a federal official who spoke on the condition of anonymity because it is an ongoing matter of internal discussion and nothing has been finalized."
        },
        {
            "id": 7,
            "text": "CDC guidance on masks remains under development, the federal official said."
        },
        {
            "id": 8,
            "text": "The official said the new guidance would make clear that the general public should not use medical masks — including surgical and N95 masks — that are in desperately short supply and needed by health-care workers."
        },
        {
            "id": 9,
            "text": "Instead, the recommendation under consideration calls for using do-it-yourself cloth coverings, according to a second official who shared that thinking on a personal Facebook account."
        },
        {
            "id": 10,
            "text": "It would be a way to help “flatten the curve,” the official noted."
        },
        {
            "id": 11,
            "text": "Such DIY cloth masks would potentially lower the risk that the wearer, if infected, would transmit the virus to other people."
        },
        {
            "id": 12,
            "text": "Current CDC guidance is that healthy people don’t need masks or face coverings."
        },
        {
            "id": 13,
            "text": "At the daily White House briefing Monday, President Trump was asked if everyone should wear nonmedical fabric masks."
        },
        {
            "id": 14,
            "text": "“That’s certainly something we could discuss,” Trump said, adding, “it could be something like that for a limited period of time.”"
        },
        {
            "id": 15,
            "text": "In recent days, an assortment of scientists, health experts, pundits and influencers has vigorously advanced their position that everyone venturing into public or crowded places should wear a mask or face shield — even a homemade one — to lower the rate of transmission of covid-19, the disease caused by the coronavirus."
        },
        {
            "id": 16,
            "text": "Thomas Inglesby, director of the Johns Hopkins Center for Health Security, said in an interview the CDC should urge people to use nonmedical masks or face coverings."
        },
        {
            "id": 17,
            "text": "“I think it would be a prudent step we can all take to reduce transmission” by people who  are infected but have no symptoms, he said."
        },
        {
            "id": 18,
            "text": "DIY coverings — like the ones his children just fashioned from old clothes for his family — aren’t perfect and should not be used as an excuse to stop social distancing, he said."
        },
        {
            "id": 19,
            "text": "Prominent among the people pushing the idea is Scott Gottlieb, an internist and former commissioner of the Food and Drug Administration in the Trump administration."
        },
        {
            "id": 20,
            "text": "Gottlieb was the lead author of a pandemic-response plan published Sunday by the American Enterprise Institute, a conservative-leaning Washington think tank, and framed as a road map for restoring the economy gradually to normal."
        },
        {
            "id": 21,
            "text": "The road map said that, during this initial phase of rapid community transmission of the coronavirus, “everyone, including people without symptoms, should be encouraged to wear nonmedical fabric face masks while in public.”"
        },
        {
            "id": 22,
            "text": "On CBS’s “Face the Nation” on Sunday, Gottlieb was more specific: “A cotton mask — we should be putting out guidelines from the CDC on how you can develop a mask on your own.”"
        },
        {
            "id": 23,
            "text": "Gottlieb and his allies acknowledge that an improvised mask, including something akin to a bandanna or even a surgical mask, does not provide protection from infection with the virus."
        },
        {
            "id": 24,
            "text": "It could, however, limit the amount of respiratory droplets emitted by the person wearing the mask."
        },
        {
            "id": 25,
            "text": "Epidemiologists believe that infected people can spread covid-19 even when they have no symptoms."
        },
        {
            "id": 26,
            "text": "Two weeks ago, the CDC updated its strategies for “optimizing the supply of face masks.”"
        },
        {
            "id": 27,
            "text": "In health-care settings where face masks are no longer available, providers might use homemade masks, such as bandannas and scarves, for care of patients with covid-19 “as a last resort.”"
        },
        {
            "id": 28,
            "text": "For now, the CDC encourages everyone to engage in social distancing and to not stand within six feet of another person, especially someone suspected of being sick."
        },
        {
            "id": 29,
            "text": "The coronavirus is spread by respiratory droplets."
        },
        {
            "id": 30,
            "text": "The droplets are not aerosolized, and thus do not float through a room but rather fall quickly to the floor."
        },
        {
            "id": 31,
            "text": "Although such droplets can be produced by talking, they are more likely to travel farther via a cough or sneeze."
        },
        {
            "id": 32,
            "text": "The fear among health experts is that ordinary people seeking facial protection will siphon needed masks from the limited stockpile."
        },
        {
            "id": 33,
            "text": "That’s why the surgeon general, Jerome Adams, took to Twitter in late February and wrote “STOP BUYING MASKS!”"
        },
        {
            "id": 34,
            "text": "There are more subtle concerns about mask-wearing and whether it would truly be a positive effect on the spread of covid-19."
        },
        {
            "id": 35,
            "text": "One major concern is that wearing a mask might give a person a false sense of safety and lead someone to be less disciplined about social distancing."
        },
        {
            "id": 36,
            "text": "It’s also conceivable a mask could become contaminated with the virus, not properly cleaned or disposed of, and be handled by someone else, leading to coronavirus transmission."
        },
        {
            "id": 37,
            "text": "Ilhem Messaoudi, a University of California at Irvine epidemiologist, notes that the coronavirus is spread mainly through relatively heavy respiratory droplets."
        },
        {
            "id": 38,
            "text": "Maintaining the six-foot distance and frequent hand-washing are still the most effective ways to stop infections, she said."
        },
        {
            "id": 39,
            "text": "“Given the shortage of PPE available to our healthcare workforce, it is irresponsible for anyone to suggest that we should all don masks, reducing the supply for nurses and physicians who do not have the luxury of treating symptomatic, very sick patients from 6 feet away,” Messaoudi said in an email."
        },
        {
            "id": 40,
            "text": "Jeffrey Duchin, a top health official in Seattle and King County, Wash., which endured the first widespread outbreak of covid-19 in the United States, said the health department there does not recommend that people without illness wear a mask, both because the benefit is uncertain and because there’s a shortage of face masks for health-care workers."
        },
        {
            "id": 41,
            "text": "“Homemade masks theoretically could offer some protection if the materials and fit were optimized, but this is uncertain,” Duchin said in an email."
        },
        {
            "id": 42,
            "text": "“It’s also possible that mask-wearing might increase the risk for infection if other recommendations (like hand washing and distancing) are less likely to be followed or if the mask is contaminated and touched.”"
        },
        {
            "id": 43,
            "text": "He didn’t absolutely rule out masks, however."
        },
        {
            "id": 44,
            "text": "“Well-designed homemade or commercially manufactured masks for the public that did not draw on the supply needed by healthcare workers could potentially provide some protection,” Duchin said."
        },
        {
            "id": 45,
            "text": "A recent article in the journal the Lancet rounded up the disparate advice given by governments across the planet during this pandemic."
        },
        {
            "id": 46,
            "text": "In Hong Kong, people are encouraged to wear a surgical mask when taking public transit or being in a crowded place."
        },
        {
            "id": 47,
            "text": "But the World Health Organization states that healthy people need to wear a mask only if taking care of a person suspected to have the virus."
        },
        {
            "id": 48,
            "text": "The authors of the Lancet review endorsed masks under certain circumstances: “It would be reasonable to suggest vulnerable individuals avoid crowded areas and use surgical face masks rationally when exposed to high-risk areas."
        },
        {
            "id": 49,
            "text": "As evidence suggests COVID-19 could be transmitted before symptom onset, community transmission might be reduced if everyone, including people who have been infected but are asymptomatic and contagious, wear face masks.”"
        },
        {
            "id": 50,
            "text": "In recent days a video has been in circulation via YouTube showing anonymous researchers using laser beams in a darkened laboratory to study the way speaking can generate droplets."
        },
        {
            "id": 51,
            "text": "The researchers urge people to cover their faces to block droplets caused by speech."
        },
        {
            "id": 52,
            "text": "The video ends with an informal appearance by Harold Varmus, former director of the National Institutes of Health and the National Cancer Institute, who urges people to speak virtually and not face to face."
        },
        {
            "id": 53,
            "text": "“The laser beam experiments demonstrate clearly that you don’t need to cough or sneeze to produce the fluid droplets that are likely to be a significant source of infectious virus: simple speech is enough to produce them,” Varmus told The Post."
        },
        {
            "id": 54,
            "text": "“Mask-wearing also serves as a reminder to all that we are in a crisis situation and are trying to be good citizens by covering our mouths,” Varmus said."
        },
        {
            "id": 55,
            "text": "He noted that people walking down the street are at a very low risk of infection."
        },
        {
            "id": 56,
            "text": "“There is nothing you can do to turn your risk to zero, but we have to balance behaviors and resources in a rational way and if you meet with someone for 20 seconds it’s different than if you meet for 20 hours,” he said."
        },
        {
            "id": 57,
            "text": "NIH issued a statement downplaying the significance of the video and advised people to follow CDC guidelines."
        },
        {
            "id": 58,
            "text": "“This is an early basic science experiment that while intriguing, is very preliminary."
        },
        {
            "id": 59,
            "text": "The work has not been validated, peer reviewed, or published,” NIH said."
        },
        {
            "id": 60,
            "text": "“To suggest that this has immediate public health implications for the spread of coronavirus would be misleading.”"
        },
        {
            "id": 61,
            "text": ""
        }
    ]
}