{
    "title": "Mulvaney tapped to lead Trump's budget office",
    "text": [
        {
            "id": 0,
            "text": "One of the founding members of the hard-line House Freedom Caucus, Rep. Mick Mulvaney is a fierce fiscal conservative."
        },
        {
            "id": 1,
            "text": "Rep. Mick Mulvaney has been picked as director of the Office of Management and Budget for President-elect Donald Trump, the transition team confirmed Saturday morning."
        },
        {
            "id": 2,
            "text": "One of the founding members of the hard-line House Freedom Caucus, the South Carolina Republican is a fierce fiscal conservative."
        },
        {
            "id": 3,
            "text": "An aide to the transition team indicated Mulvaney would be tapped Friday night."
        },
        {
            "id": 4,
            "text": "Unlike some Republicans, he has pushed to slash spending on both domestic and defense programs since he was elected to the House in 2010 — in contrast with Trump, who has called for boosting the Pentagon's budget and building up the military."
        },
        {
            "id": 5,
            "text": "Mulvaney will play a crucial role in shaping Trump's early agenda, including through drafting the president's first budget."
        },
        {
            "id": 6,
            "text": "Approval of major regulations also goes through the budget office, which would make Mulvaney a key figure in GOP efforts to pare back President Barack Obama’s federal regulations."
        },
        {
            "id": 7,
            "text": "“We are going to do great things for the American people with Mick Mulvaney leading the Office of Management and Budget,” President-elect Trump said in a statement."
        },
        {
            "id": 8,
            "text": "“Right now we are nearly $20 trillion in debt, but Mick is a very high-energy leader with deep convictions for how to responsibly manage our nation’s finances and save our country from drowning in red ink.”"
        },
        {
            "id": 9,
            "text": "“It is a great honor to be appointed Director of the Office of Management and Budget,” Mulvaney said in a statement sent out by the transition team."
        },
        {
            "id": 10,
            "text": "“The Trump administration will restore budgetary and fiscal sanity back in Washington after eight years of an out-of-control, tax and spend financial agenda, and will work with Congress to create policies that will be friendly to American workers and businesses.”"
        },
        {
            "id": 11,
            "text": "Speaker Paul Ryan tweeted a statement Saturday saying Mulvaney is \"the absolute right choice\" to lead the OMB, calling him \"a conservative reformer from day one.\""
        }
    ]
}