{
    "title": "Darrell Issa forfeits John Kerry appearance on Benghazi",
    "text": [
        {
            "id": 0,
            "text": "It's a near certainty the House’s new select committee will call on the secretary."
        },
        {
            "id": 1,
            "text": "Issa forfeits Kerry appearance\n\nSecretary of State John Kerry will not appear next month before the House Oversight and Government Reform Committee."
        },
        {
            "id": 2,
            "text": "Chairman Darrell Issa (R-Calif.) said Friday he released Kerry from a subpoena to testify on June 12 about the Benghazi terrorist attacks — making it a near certainty that the House’s new select committee on Benghazi will call on the secretary for questioning."
        },
        {
            "id": 3,
            "text": "“Seeing Secretary Kerry and others, who have worked to obstruct critical oversight of Congress’ investigations into Benghazi, attempt to use the upcoming June 12 hearing as a shield against the Select Committee tells me it’s time to reassess,” Issa said in a statement."
        },
        {
            "id": 4,
            "text": "( Also on POLITICO: Hillary Clinton's Benghazi chapter)"
        },
        {
            "id": 5,
            "text": "The California Republican has been engaged in a battle with the State Department over Kerry’s testimony."
        },
        {
            "id": 6,
            "text": "Issa initially subpoenaed the former Massachusetts senator to testify in May but was forced to issue a second appeal as Kerry planned to be in Mexico at the time."
        },
        {
            "id": 7,
            "text": "Issa issued the second subpoena even though the House had already established the select committee."
        },
        {
            "id": 8,
            "text": "This gave ground to critics of the Republicans’ effort that Kerry should not be forced to appear before both the Oversight and select committees."
        },
        {
            "id": 9,
            "text": "By rescinding the request, Issa is opening a path for the select committee to call on Kerry to testify."
        },
        {
            "id": 10,
            "text": "That committee, chaired by Republican Rep. Trey Gowdy of South Carolina, will most likely subpoena or request interviews with a number of high-level White House officials and former Secretary of State Hillary Clinton."
        },
        {
            "id": 11,
            "text": "“As much as we fought to learn what we could, bring critical witnesses forward, and shame the administration into disclosing more than it originally intended, I expect the Select Committee’s unified jurisdiction will afford it better access to the complete picture than any of its investigative predecessors,” Issa said."
        },
        {
            "id": 12,
            "text": "The Oversight Committee was one of the last remaining panels actively investigating the Benghazi attacks after the House Armed Services, Foreign Affairs and Intelligence committees issued a report on their respective probes."
        },
        {
            "id": 13,
            "text": "Issa faced criticism from Republicans over the timing of the Kerry subpoena."
        },
        {
            "id": 14,
            "text": "On Friday, Republican Deputy Whip Rep. Peter Roskam (Ill.) said it was a “procedural snafu.”"
        },
        {
            "id": 15,
            "text": "“I think the way I would characterize it is that the Benghazi Select Committee is going to be dealing exclusively with these jurisdictional questions in the House."
        },
        {
            "id": 16,
            "text": "And I think that that was a — more of a procedural snafu than anything else,” the Illinoisan said on “Political Capital with Al Hunt.”"
        }
    ]
}