{
    "title": "More Federal Privileges to Extend to Same-Sex Couples",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — The federal government will soon treat married same-sex couples the same as heterosexual couples when they file for bankruptcy, testify in court or visit family in prison."
        },
        {
            "id": 1,
            "text": "Attorney General Eric H. Holder Jr. was preparing to issue policies aimed at eliminating the distinction between same-sex and opposite-sex married couples in the federal criminal justice system, according to a speech given at a Saturday event organized by a prominent gay-rights group."
        },
        {
            "id": 2,
            "text": "“In every courthouse, in every proceeding and in every place where a member of the Department of Justice stands on behalf of the United States, they will strive to ensure that same-sex marriages receive the same privileges, protections and rights as opposite-sex marriages,” Mr. Holder’s said."
        },
        {
            "id": 3,
            "text": "The changes were set in motion last year when the Supreme Court declared it unconstitutional to refuse federal benefits to married same-sex couples, a ruling that Mr. Holder supported."
        },
        {
            "id": 4,
            "text": "Gay-rights advocates welcomed the changes but had hoped Mr. Holder would use his address before the Human Rights Campaign to announce that the president would sign an order prohibiting federal contractors from discriminating based on sexual orientation."
        },
        {
            "id": 5,
            "text": "“That would be big,” said Gary Buseck, legal director for Gay and Lesbian Advocates and Defenders."
        },
        {
            "id": 6,
            "text": "Since the Supreme Court ruling in June, the Obama administration has rewritten federal rules to allow same-sex couples to file taxes together and receive Medicare and other benefits reserved for married couples."
        },
        {
            "id": 7,
            "text": "Mr. Holder has been the public face of those efforts and has made championing gay rights one of the central messages of his tenure."
        },
        {
            "id": 8,
            "text": "“These issues are very much at the center of this administration’s civil rights legacy,” said Ian S. Thompson, who works on gay and lesbian issues for the American Civil Liberties Union in Washington."
        },
        {
            "id": 9,
            "text": "Speaking before Sweden’s Parliament a few days ago, Mr. Holder called fighting for gay and lesbian rights one of “the defining civil rights challenges of our time.”"
        },
        {
            "id": 10,
            "text": "The remarks on Saturday by Mr. Holder, the first black attorney general, cast the gay-rights movement as a continuation of the civil rights efforts of the 1960s."
        },
        {
            "id": 11,
            "text": "“As all-important as the fight against racial discrimination was then, and remains today, know this: My commitment to confronting discrimination based on sexual orientation or gender identity runs just as deep,” he said."
        },
        {
            "id": 12,
            "text": "The government estimates that more than 1,100 federal regulations, rights and laws touch on, or are affected by, marital status."
        },
        {
            "id": 13,
            "text": "With a memo on Monday, Mr. Holder plans to make several of those provisions apply equally to gay and straight couples."
        },
        {
            "id": 14,
            "text": "In court cases and criminal investigations, for example, same-sex couples will be covered under what is known as the spousal privilege, a rule that says spouses cannot be forced to testify against each other."
        },
        {
            "id": 15,
            "text": "The Bureau of Prisons will extend the same visitation rights to married same-sex couples that it does to opposite-sex couples, Mr. Holder said."
        },
        {
            "id": 16,
            "text": "The Justice Department will also recognize same-sex couples when determining eligibility for programs like the 9/11 Victim Compensation Fund, which pays people who were injured or made sick by the 2001 terrorist attacks."
        },
        {
            "id": 17,
            "text": "Same-sex spouses of police killed in the line of duty will also be eligible for federal benefits."
        },
        {
            "id": 18,
            "text": "The federal rules have no effect on state laws."
        },
        {
            "id": 19,
            "text": "Seventeen states and the District of Columbia recognize same-sex marriages."
        },
        {
            "id": 20,
            "text": "Challenges to bans on same-sex marriage are under way in several states, including Utah."
        },
        {
            "id": 21,
            "text": "A federal judge there said in December that the state’s ban was unconstitutional, but the Supreme Court put that decision on hold while an appeal played out."
        },
        {
            "id": 22,
            "text": "Between those rulings, about 1,300 couples got marriage licenses in Utah."
        },
        {
            "id": 23,
            "text": "Last month, Mr. Holder said the federal government would recognize those marriages."
        },
        {
            "id": 24,
            "text": "Opponents of same-sex marriage accused Mr. Holder of overstepping his authority in that case."
        },
        {
            "id": 25,
            "text": "Mr. Buseck, meanwhile, said the Obama administration could do more, such as the executive order on discrimination, to leave a civil rights legacy."
        }
    ]
}