{
    "title": "Trump sues Deutsche Bank and Capital One over Democrat subpoenas",
    "text": [
        {
            "id": 0,
            "text": "US President Donald Trump has sued two banks in a bid to stop them handing over his financial records to Congress."
        },
        {
            "id": 1,
            "text": "The lawsuit against Deutsche Bank and Capital One was filed after Democrat-led committees issued subpoenas for information on his finances."
        },
        {
            "id": 2,
            "text": "His three eldest children and the Trump Organisation joined the lawsuit, which argues there are no legitimate grounds for investigating his business affairs."
        },
        {
            "id": 3,
            "text": "Leading Democrats said they would not be deterred by the blocking attempt."
        },
        {
            "id": 4,
            "text": "A Deutsche Bank spokeswoman told the New York Times: \"We remain committed to providing appropriate information to all authorized investigations\"\n\nThere was no immediate comment from Capital One."
        },
        {
            "id": 5,
            "text": "The lawsuit was filed in New York on Monday and aims to block the banks from complying with the subpoenas issued by the Democrat-controlled Congress, which is investigating the Trump family's financial dealings."
        },
        {
            "id": 6,
            "text": "Both banks are involved with Mr Trump's real estate projects."
        },
        {
            "id": 7,
            "text": "The filing says the subpoenas \"have no legitimate or lawful purpose\"."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "\"[They] were issued to harass President Donald J. Trump, to rummage through every aspect of his personal finances, his businesses, and the private information of the president and his family,\" it alleges."
        },
        {
            "id": 10,
            "text": "It adds: \"No grounds exist to establish any purpose other than a political one.\""
        },
        {
            "id": 11,
            "text": "The filing also says that Democrats are hoping \"they will stumble upon something they can expose publicly and use as a political tool against the President\"."
        },
        {
            "id": 12,
            "text": "The House Intelligence and Financial Services Committees issued subpoenas to Germany's Deutsche Bank, which is one of the Trump Organisation's major lenders, and a number of other financial institutions earlier this month."
        },
        {
            "id": 13,
            "text": "The committees are reportedly seeking documents and materials relating to the bank's longstanding relationship with Mr Trump and his family."
        },
        {
            "id": 14,
            "text": "Representative Adam Schiff, the Democratic chairman of the House Intelligence Committee, said the subpoenas were part of an investigation \"into allegations of potential foreign influence on the US political process\"."
        },
        {
            "id": 15,
            "text": "Mr Schiff and fellow Democrat Maxine Waters, the chairwoman of the Financial Services Commission,  described the lawsuit as \"meritless\"."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": "\"[It shows] the depths to which President Trump will go to obstruct Congress's constitutional oversight authority,\" they said in a joint statement."
        },
        {
            "id": 18,
            "text": ""
        },
        {
            "id": 19,
            "text": "\"He will find that Congress will not be deterred from carrying out its constitutional responsibilities,\" it adds."
        },
        {
            "id": 20,
            "text": "In 2017, the bank rejected requests by Democrats in the House of Representatives to provide details of the president's finances, citing privacy laws."
        },
        {
            "id": 21,
            "text": "That year it was also reported that special counsel Robert Mueller, who led the investigation into alleged collusion between the Trump presidential campaign and Russia, had ordered Deutsche Bank to provide records of Mr Trump's accounts."
        }
    ]
}