{
    "title": "Ted Cruz: Net neutrality is ‘Obamacare for the Internet’",
    "text": [
        {
            "id": 0,
            "text": "Sen. Ted Cruz on Monday blasted net neutrality as “the biggest regulatory threat to the Internet” in reaction to President Obama’s request to the Federal Communications Commission to create new rules of the road."
        },
        {
            "id": 1,
            "text": "“In short, net neutrality is Obamacare for the Internet,” the Texas Republican and possible 2016 presidential contender said in a statement distributed by his office."
        },
        {
            "id": 2,
            "text": "“It puts the government in charge of determining Internet pricing, terms of service, and what types of products and services can be delivered, leading to fewer choices, fewer opportunities and higher prices for consumers."
        },
        {
            "id": 3,
            "text": "The Internet should not operate at the speed of government.”"
        },
        {
            "id": 4,
            "text": "Mr. Obama on Monday called on the FCC to create rules governing access to the Internet “ensuring that neither the cable company nor the phone company will be able to act as a gatekeeper, restricting what you can do or see online.”"
        },
        {
            "id": 5,
            "text": "The rules include no blocking by a website or service, no intentional slowing down of service by providers, increased transparency, and no paid prioritization on service speed."
        },
        {
            "id": 6,
            "text": "Net neutrality rules are intended to provide companies the same speed and access to lines as others and curb undue influence from cable corporations."
        },
        {
            "id": 7,
            "text": "Proponents say such oversight helps provide a more level playing field for Internet access but opponents see such rules as government overreach in an area, they argue, that has thrived without them."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": ""
        },
        {
            "id": 11,
            "text": ""
        }
    ]
}