{
    "title": "Here’s why black Americans were mad at Biden’s comment — even if they’d say the same thing themselves",
    "text": [
        {
            "id": 0,
            "text": "On May 22, in a cringe-worthy exchange with Charlamagne tha God on the popular radio show “The Breakfast Club,” Democratic presidential candidate Joe Biden said, “If you have a problem figuring out whether you are for me or Trump, then you ain’t black.”"
        },
        {
            "id": 1,
            "text": "Biden’s comments reflect a common misunderstanding within both political parties about the role that white Americans play in maintaining black support for the Democratic Party."
        },
        {
            "id": 2,
            "text": "In the book “Steadfast Democrats,” two of us, Ismail White and Chryl Laird, offer insight into how Biden could draw the ire of the same black Americans whose Super Tuesday votes put him in a position to win the Democratic Party nomination for president."
        },
        {
            "id": 3,
            "text": "Twitter has started fact-checking Trump."
        },
        {
            "id": 4,
            "text": "Trump threatened to shut it down."
        },
        {
            "id": 5,
            "text": "We find that black social connections are key in maintaining blacks’ commitment to the Democratic Party."
        },
        {
            "id": 6,
            "text": "To most effectively leverage political strength as a minority group, black Americans have come to prioritize group solidarity in party politics."
        },
        {
            "id": 7,
            "text": "This partisan loyalty is maintained through a process we call “racialized social constraint,” whereby support for the Democratic Party is understood as just something you do as a black person, an expectation of political behavior meant to empower the racial group."
        },
        {
            "id": 8,
            "text": "If someone attempts to defect from this group norm, other black Americans enforce group unity by sanctioning the defector."
        },
        {
            "id": 9,
            "text": "They might denigrate them aloud or in print, questioning someone’s commitment to or standing within the racial group by calling them an Uncle Tom, a sellout, or something similar."
        },
        {
            "id": 10,
            "text": "These sanctions can sound a lot like Biden’s comments, phrased as, “If you are for Trump, then you ain’t black.”"
        },
        {
            "id": 11,
            "text": "For those who value their standing within black social networks, such social sanctions can powerfully constrain behavior."
        },
        {
            "id": 12,
            "text": "We tested this idea with an experiment during the 2012 presidential election."
        },
        {
            "id": 13,
            "text": "We solicited an in-person black student convenience sample of 106 participants from a predominantly white university in the Midwest."
        },
        {
            "id": 14,
            "text": "Participants were randomly assigned to one of three groups where we offered participants $10 to donate to an organization that supported either President Barack Obama or his Republican challenger, Mitt Romney."
        },
        {
            "id": 15,
            "text": "Participants were told that they could donate some or all of the money or keep the money for themselves."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "Our participants were then instructed to make this decision in a separate room where there were two donation boxes: one for Romney and one for Obama."
        },
        {
            "id": 19,
            "text": "One group of participants went into the room alone; others were accompanied by someone they believed to be another participant."
        },
        {
            "id": 20,
            "text": "Of those who were accompanied, for half, the other participant was white, while for another half, the other participant was black."
        },
        {
            "id": 21,
            "text": "In both groups, the “other” participant was an actor who was instructed to immediately walk over to the Obama box and say, “I am giving all my money to Obama” and put the money in the box."
        },
        {
            "id": 22,
            "text": "We expected, given the social norm of black partisanship, that when black participants were in the room with a black norm enforcer, they would donate more money to Obama than when they were alone or with a white norm enforcer."
        },
        {
            "id": 23,
            "text": "In fact, when participants were accompanied by a black norm enforcer, they donated $6.85 to the Obama box, on average."
        },
        {
            "id": 24,
            "text": "That’s significantly higher than the average of $3.74 that participants gave when alone or the $4.45 average donated when paired with a white norm enforcer."
        },
        {
            "id": 25,
            "text": "Ultimately, we find that norm enforcement is the most effective when the enforcer is black."
        },
        {
            "id": 26,
            "text": "Trump's problems with senior voters started long before the coronavirus."
        },
        {
            "id": 27,
            "text": "But while many black Americans agree with the idea Biden voiced — that black political empowerment is best achieved by supporting the Democratic Party and its candidates — they do not believe that white Americans, even Democrats, have the standing to question any black person’s “blackness,” under any circumstances."
        },
        {
            "id": 28,
            "text": "Furthermore, the black norm of supporting the Democratic Party is aimed at empowering the group."
        },
        {
            "id": 29,
            "text": "Biden’s comment might well have struck black Americans as suggesting that they are obligated to support him."
        },
        {
            "id": 30,
            "text": "It’s more likely that black Americans believe that he is obligated to them for their support."
        },
        {
            "id": 31,
            "text": "So what could Biden do or say that could effectively convey his commitment to black Americans?"
        },
        {
            "id": 32,
            "text": "One of us, Julian Wamble, found that when candidates signal that they are committed to acting on the racial group’s behalf, black voters are more likely to support them."
        },
        {
            "id": 33,
            "text": "These signals can take different forms."
        },
        {
            "id": 34,
            "text": "For instance, white politicians often convey this by showcasing their social connections to prominent black individuals and organizations."
        },
        {
            "id": 35,
            "text": "Toward that end, Biden has often highlighted his relationship with former president Obama, and regularly points to his record by saying, “The NAACP has endorsed me every time I have run.”"
        },
        {
            "id": 36,
            "text": "Political scientist Andrea Benjamin’s research tells us that such endorsements can influence black voters’ decisions, particularly where race is concerned."
        },
        {
            "id": 37,
            "text": "Political scientists Christopher Stout and Keith Baker argued here at TMC that selecting a black woman as his vice presidential nominee would go a long way to show that commitment."
        },
        {
            "id": 38,
            "text": "That would be especially potent given the fact that black women are a significant force within the Democratic Party."
        },
        {
            "id": 39,
            "text": "Having knowledge of a group’s norms does not mean that an outsider can enforce them."
        },
        {
            "id": 40,
            "text": "The more prudent course for a candidate would be to elevate into positions of power people who can enforce these norms."
        },
        {
            "id": 41,
            "text": "A black woman vice presidential nominee would be an effective signal only if black people themselves perceived her to be committed to the black community’s interests."
        },
        {
            "id": 42,
            "text": ""
        },
        {
            "id": 43,
            "text": ""
        },
        {
            "id": 44,
            "text": ""
        }
    ]
}