{
    "title": "Gowdy and Cummings duke it out over Benghazi ",
    "text": [
        {
            "id": 0,
            "text": "House Benghazi Committee Chairman Trey Gowdy and ranking Democrat Elijah Cummings slugged it out on CBS’s “Face the Nation” Sunday as Gowdy sought to justify his panel’s work and Cummings questioned the committee's motives."
        },
        {
            "id": 1,
            "text": "Gowdy, a South Carolina Republican, again dismissed comments made by three fellow Republicans that suggested the committee is aimed at hurting Hillary Clinton."
        },
        {
            "id": 2,
            "text": "The former Secretary of State is scheduled to testify before the panel on Thursday, Oct. 22."
        },
        {
            "id": 3,
            "text": "“I have told my Republican colleagues and friends: Shut up talking about things you don’t know anything about,” Gowdy said."
        },
        {
            "id": 4,
            "text": "“They’re three people who have no idea what they’re talking about…"
        },
        {
            "id": 5,
            "text": "They have no firsthand knowledge.”"
        },
        {
            "id": 6,
            "text": "Over the past several weeks, Majority Leader Kevin McCarthy, (R-Calif.), Rep. Richard Hanna (R-N.Y.) and a former GOP Benghazi investigator fired from the panel in June all have made statements suggesting Gowdy's probe is a partisan effort aimed at Clinton."
        },
        {
            "id": 7,
            "text": "His two colleagues, he said, “couldn’t name three witnesses we’ve talked to” and the former staffer left in June so doesn’t know what they’ve been up to, he said."
        },
        {
            "id": 8,
            "text": "Cummings, meanwhile, continued to dismiss the entire probe as a sham, predicting Thursday will be a “sad day.”"
        },
        {
            "id": 9,
            "text": "“The families came in with tears in their eyes literally and said, 'Please do not make this a political football.'"
        },
        {
            "id": 10,
            "text": "That’s exactly what’s happened,” the Maryland Democrat said, later adding."
        },
        {
            "id": 11,
            "text": "“We have strayed away from what we were supposed to be doing.”"
        },
        {
            "id": 12,
            "text": "Cummings called for Gowdy — who he called a “good man” who has been “pressured from the right” — to release the transcripts of panel interviews, which he says show the panel “has been zeroing in on Hillary Clinton.”"
        },
        {
            "id": 13,
            "text": "Gowdy used his time on air to downplay Clinton’s role as a witness, saying she’s “an important witness but she is one witness” out of what will be about 70 total."
        },
        {
            "id": 14,
            "text": "He’s more interested in what the former eye witnesses on the ground say — even if she is getting way more attention as the Democratic frontrunner, he said."
        },
        {
            "id": 15,
            "text": "“We are much more focused on the four dead Americans than we are anyone’s presidential aspirations,” Gowdy said, noting that they’ve found new information they cannot yet release that has nothing to do with Clinton."
        },
        {
            "id": 16,
            "text": "He also summarized some of the contents of new emails the panel received from slain U.S. Ambassador to Libya Christopher Stevens, messages no committee has ever seen."
        },
        {
            "id": 17,
            "text": "A number of them, he says, show Stevens asking for more security for the compound just months before the attack, a request that was ultimately denied."
        },
        {
            "id": 18,
            "text": "Meanwhile, Clinton’s top aides in Washington were asking Stevens how to “message” the violence in Libya back home."
        },
        {
            "id": 19,
            "text": "Or to weigh in on Clinton's ally Sid Blumenthal’s unsubstantiated intelligence he sent to the then-Secretary of State."
        },
        {
            "id": 20,
            "text": "“We were facing an uptick in violence while Washington is asking him to read and react to Sidney Blumenthal email and help 'message' the violence,\" Gowdy said, calling it a \"total disconnect\" between State headquarters and the reality on the ground. \""
        },
        {
            "id": 21,
            "text": "He needed help on how to deal with it.”"
        }
    ]
}