{
    "title": "Former Colorado Gov. John Hickenlooper joins 2020 presidential race",
    "text": [
        {
            "id": 0,
            "text": "Former Colorado Gov. John Hickenlooper announced a bid Monday for the Democratic 2020 presidential nomination, giving the more moderate wing of the party a possible champion in a race otherwise shaping up as a sprint to the left."
        },
        {
            "id": 1,
            "text": "The pro-business Democrat, who once talked about chugging fracking fluid, won two terms in Colorado as a consensus-building leader, able to work with a state legislature where Republicans shared control."
        },
        {
            "id": 2,
            "text": "“I am running for president because we need dreamers in Washington, but we also need to get things done,” Mr. Hickenlooper, 67, said in his announcement."
        },
        {
            "id": 3,
            "text": "“I’ve proven again and again I can bring people together to produce the progressive change Washington has failed to deliver.”"
        },
        {
            "id": 4,
            "text": "He enters a field crowded with liberal icons and rising stars, where the conversation has generally focused on just how far they are willing to go in government control over the economy, from single-payer health care to soaring tax rates to the Green New Deal."
        },
        {
            "id": 5,
            "text": "While those sorts of policies are driving the debate, John Couvillon, a pollster, said there is room in the Democratic primary for someone less strident."
        },
        {
            "id": 6,
            "text": "He said surveys have found nearly half of Democrats identify as moderate."
        },
        {
            "id": 7,
            "text": "And if the party looks beyond the primary election, it will find plenty of reasons to consider an option who can appeal to the moderate voters who powered the Democratic takeover of the House in the 2018 midterm election."
        },
        {
            "id": 8,
            "text": "“Right off the bat, I see a lot of potential market space for a more moderate Democratic candidate who is running,” Mr. Couvillon said."
        },
        {
            "id": 9,
            "text": "“It is not poisonous to be running in the moderate swim lane so to speak.”"
        },
        {
            "id": 10,
            "text": "But Neil Sroka, communications director at Democracy for America, said it is hard to imagine a moderate candidate capturing the nomination at a time when the progressive wing of the party is ascending."
        },
        {
            "id": 11,
            "text": "“Nothing excites people more than lukewarm milk,” Mr. Sroka quipped."
        },
        {
            "id": 12,
            "text": "“The only path that these more corporate Democratic candidates have is by hoping that the progressive vote is split literally 10 different ways and that somehow a moderate could slip through.”"
        },
        {
            "id": 13,
            "text": "Mr. Hickenlooper was Denver’s mayor before winning the governorship in 2010, giving him 16 years of high-level executive experience."
        },
        {
            "id": 14,
            "text": "He said he bolstered the job market and strengthened environmental laws."
        },
        {
            "id": 15,
            "text": "He also has been a friend of the LGBT community, passed universal background checks for gun sales following the 2012 shooting at an Aurora movie theater, and expanded Medicaid under Obamacare — checking off many of the same boxes as the rest of the Democratic field."
        },
        {
            "id": 16,
            "text": "He also says he supports some form of the Green New Deal — yet his biggest break with liberal orthodoxy may have come on the environment."
        },
        {
            "id": 17,
            "text": "“I’d say the one sore point for a lot of liberals is his ties to and support for the oil and gas industry, which, in many ways, part of the secret of his success was the business community was always pretty content with him,” said Seth Masket, director of the Center on American Politics at the University of Denver."
        },
        {
            "id": 18,
            "text": "In 2013, Mr. Hickenlooper told a Senate committee that he actually drank a glass of fracking fluid produced by oil field services giant Halliburton to highlight the technological advances of oil and gas companies."
        },
        {
            "id": 19,
            "text": "“You can drink it."
        },
        {
            "id": 20,
            "text": "We did drink it around the table, almost ritual-like, in a funny way,” he said."
        },
        {
            "id": 21,
            "text": "Mr. Masket said Mr. Hickenlooper was considered about as liberal as the state would comfortably elect when he took office in 2011 but said the base of the party has since moved further to the left."
        },
        {
            "id": 22,
            "text": "“I’m not sure he would get the [gubernatorial] nomination if he was starting out today,” Mr. Masket said."
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        }
    ]
}