{
    "title": "McConnell shoots down Schumer's offer on Senate impeachment trial rules",
    "text": [
        {
            "id": 0,
            "text": "Senate Majority Leader Mitch McConnell (R-Ky.) on Tuesday tore into an initial offer from Minority Leader Charles Schumer (D-N.Y.) on impeachment trial rules."
        },
        {
            "id": 1,
            "text": "McConnell, speaking from the Senate floor, described the proposal from the Democratic leader as \"dead wrong\" and warned that it \"could set a nightmarish precedent for our institution.\""
        },
        {
            "id": 2,
            "text": "\"The Senate Democratic leader would apparently like our chamber to do House Democrats' homework for them."
        },
        {
            "id": 3,
            "text": "He wants to volunteer the Senate's time and energy on a fishing expedition,\" McConnell said."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "He added that Schumer's proposal could \"only incentivize an endless stream of dubious partisan impeachments in the future, and we will invite future houses to paralyze future Senates with frivolous impeachments at will.\""
        },
        {
            "id": 6,
            "text": "McConnell's comments are the first time he's responded to Schumer's offer, sent on Sunday night, which outlined Democrats' opening proposal on how to handle the Senate's looming impeachment trial."
        },
        {
            "id": 7,
            "text": "Schumer has defended his decision to send the letter and discuss it publicly, noting that he had tried to get McConnell to sit down to talk about impeachment trial rules two weeks ago."
        },
        {
            "id": 8,
            "text": "But McConnell on Tuesday knocked Schumer, arguing he \"decided to short-circuit the customary and collegial process\" of trying to establish impeachment rules."
        },
        {
            "id": 9,
            "text": "\""
        },
        {
            "id": 10,
            "text": "The preferable path would have been an in-person conversation, which nonetheless, I still hope to pursue,\" McConnell added."
        },
        {
            "id": 11,
            "text": "Schumer wrote that Democrats want to call acting White House chief of staff Mick Mulvaney Mick MulvaneyHeadhunters having hard time finding jobs for former Trump officials: report Trump holdovers are denying Social Security benefits to the hardest working Americans Mulvaney calls Trump's comments on Capitol riot 'manifestly false' MORE, Mulvaney's senior adviser Robert Blair, former national security adviser John Bolton John BoltonOvernight Defense & National Security — Milley becomes lightning rod Joint Chiefs Chairman Milley becomes lightning rod on right Ex-Trump adviser Bolton defends Milley: 'His patriotism is unquestioned' MORE and Office of Management and Budget staffer Michael Duffey to testify as part of a Senate trial."
        },
        {
            "id": 12,
            "text": "\"I did not hear a single argument as to why the witnesses I suggested should not give testimony."
        },
        {
            "id": 13,
            "text": "Impeachment trials, like most trials, have witnesses,\" Schumer said, responding to McConnell, on Tuesday."
        },
        {
            "id": 14,
            "text": "ADVERTISEMENT\n\nMcConnell argued that trying to request witnesses before a trial starts is a \"strange request at this juncture,\" but did not comment specifically on the individuals sought by Schumer."
        },
        {
            "id": 15,
            "text": "\"Presumably, it will be the House prosecutor's job to ask for the witnesses they feel they need to make the case."
        },
        {
            "id": 16,
            "text": "So why does the Democratic leader here in the Senate want to predetermine the House impeachment manager's witness request?\""
        },
        {
            "id": 17,
            "text": "McConnell added."
        },
        {
            "id": 18,
            "text": "McConnell also appeared to take a jab at criticism of his pledge to be in \"total coordination\" with the White House, asking \"might he be coordinating these questions with people outside the Senate?\""
        },
        {
            "id": 19,
            "text": "Schumer wants one resolution — that would cover both procedure and calling specific witnesses — to be passed at the start of the trial."
        },
        {
            "id": 20,
            "text": "Senate GOP leadership has signaled they want to punt a decision on what, if any, witnesses to allow until after the trial starts and both sides make opening arguments."
        },
        {
            "id": 21,
            "text": "McConnell appeared to back that on Tuesday, saying he wants at least two resolutions — one that would deal with procedure and one with potential witnesses — similar to the impeachment trial of President Bill Clinton William (Bill) Jefferson ClintonHas China already won?"
        },
        {
            "id": 22,
            "text": "Budget impasses mark a critical turning point in Biden's presidency Five takeaways from Arizona's audit results MORE."
        },
        {
            "id": 23,
            "text": "\""
        },
        {
            "id": 24,
            "text": "The Democratic leader wants to write a completely new set of rules for President Trump Donald TrumpJan."
        },
        {
            "id": 25,
            "text": "6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE,\" McConnell said."
        },
        {
            "id": 26,
            "text": "\"The same process that Senator Schumer thought was good enough for President Clinton he doesn't want to afford President Trump, go figure.\""
        },
        {
            "id": 27,
            "text": "During Clinton's impeachment trial, senators voted 100-0 on a resolution laying out the process for a trial, but a vote on a subsequent resolution calling for specific witnesses broke down along party lines."
        },
        {
            "id": 28,
            "text": "McConnell, on Tuesday, said he believed the Clinton framework was a \"good idea.\""
        },
        {
            "id": 29,
            "text": "\"The basic procedural framework of the Clinton impeachment trial served the Senate and the nation well, in my view,\" McConnell said."
        },
        {
            "id": 30,
            "text": "\"I still believe the Senate should try to follow the 1999 model.\""
        },
        {
            "id": 31,
            "text": ""
        }
    ]
}