{
    "title": "Official tells Congress Obamacare 'is working,' Republicans disagree",
    "text": [
        {
            "id": 0,
            "text": "A top Obama administration official apologized for website troubles that have marred the rollout of the president’s health-care reforms, but also insisted that the website for enrolling in Obamacare is “a system that’s working.”"
        },
        {
            "id": 1,
            "text": "\"I want to apologize to you that the website has not worked as well as it should,\" Medicare chief Marilyn Tavenner said during a congressional hearing Tuesday – the most direct apology yet from an administration official since the website’s launch on Oct. 1."
        },
        {
            "id": 2,
            "text": "Ms. Tavenner said the site “can and will be fixed” so that it works well for the “vast majority” of users by the end of November."
        },
        {
            "id": 3,
            "text": "And she said that, by meeting that target, the website will allow Americans to sign up for insurance on the law’s new state-level exchanges so that coverage is in place by Jan. 1."
        },
        {
            "id": 4,
            "text": "She said the Obama administration is “in good shape to handle that.”"
        },
        {
            "id": 5,
            "text": "The question on many American minds – and voiced aloud by Republicans at the hearing – is: Will her forecast prove correct?"
        },
        {
            "id": 6,
            "text": "“Why should the American people believe you now?” asked Rep. Kevin Brady (R) of Texas, of the House Ways and Means Committee."
        },
        {
            "id": 7,
            "text": "He said the administration has had four years to get ready to launch the exchanges, and didn’t get it right."
        },
        {
            "id": 8,
            "text": "Tavenner acknowledged that private-sector software contractors and her agency, the Centers for Medicare and Medicaid Services (CMS), have a busy four weeks ahead."
        },
        {
            "id": 9,
            "text": "Although the 2010 law allows people who lack health insurance to sign up for it by March 31, people who want coverage to begin on Jan. 1 must be signed up by Dec. 15."
        },
        {
            "id": 10,
            "text": "So, if the push to make the website work smoothly succeeds, it could pave the way for high traffic in early December."
        },
        {
            "id": 11,
            "text": "“We are working around the clock to deliver the shopping experience you deserve,” Tavenner said."
        },
        {
            "id": 12,
            "text": "Some Democrats joined Republicans in raising worries."
        },
        {
            "id": 13,
            "text": "Rep. Allyson Schwartz (D) of Pennsylvania called a working website for Obamacare a legal obligation, since the site is the central venue for people to enroll under rules set in the law."
        },
        {
            "id": 14,
            "text": "“Going forward there can be no more excuses,” Representative Schwartz said."
        },
        {
            "id": 15,
            "text": "At the Tuesday hearing, Tavenner responded to questions on several other fronts:\n\nShe promised to provide lawmakers with a copy of the “punchlist” of technical problems that need to be resolved."
        },
        {
            "id": 16,
            "text": "Jeffrey Zients, the administration’s point person on the troubleshooting effort, said recently that the top item on that punchlist is resolving errors in the flow of information from enrollees at the front end to private insurance companies on the back end."
        },
        {
            "id": 17,
            "text": "She said she was not aware, ahead of time, how deep the site’s flaws were."
        },
        {
            "id": 18,
            "text": "Members of Congress asked to see reports regarding the testing that was done ahead of time."
        },
        {
            "id": 19,
            "text": "She sought to parry critics of the law who argue that President Obama misled Americans by saying that if they like their current insurance, they can keep it."
        },
        {
            "id": 20,
            "text": "Republicans noted that several million people have recently been notified of policy cancellations as the insurers adjust their offerings to comply with Obamacare."
        },
        {
            "id": 21,
            "text": "Tavenner attributed the changes to natural “churn” by which the insurance industry changes policies from year to year – a trend that existed before Obamacare."
        },
        {
            "id": 22,
            "text": "She noted that the law allowed existing insurance policies to be grandfathered in, as long as insurers didn’t alter the terms after 2010."
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": "Republicans argue that the canceled policies represent a broken promise."
        },
        {
            "id": 27,
            "text": "Rep. Aaron Schock of Illinois noted that a White House backgrounder on Obamacare quotes the president saying, “Here is a guarantee that I've made."
        },
        {
            "id": 28,
            "text": "If you have insurance that you like, then you will be able to keep that insurance.”"
        }
    ]
}