{
    "title": "Darrell Issa Begrudgingly Says John Kerry No Longer Has To Testify On Benghazi",
    "text": [
        {
            "id": 0,
            "text": "“Seeing Secretary Kerry and others, who have worked to obstruct critical oversight of Congress’ investigations into Benghazi, attempt to use the upcoming June 12 hearing as a shield against the Select Committee tells me it’s time to reassess."
        },
        {
            "id": 1,
            "text": "It’s been disappointing to watch a long serving former Senator, like Secretary Kerry, squirm his way to what I’m doing today – releasing him from the upcoming hearing commitment he made only after we issued him a subpoena."
        },
        {
            "id": 2,
            "text": "“No matter how long the investigation of a terrorist attack that killed four Americans takes, getting the full truth is what matters."
        },
        {
            "id": 3,
            "text": "The Select Committee is the House of Representatives’ commitment to getting this truth."
        },
        {
            "id": 4,
            "text": "It will conduct its investigation in the face of an all-hands-on-deck effort by defenders of the principal actors to further obscure the facts."
        },
        {
            "id": 5,
            "text": "While Speaker Boehner and I had both originally concluded that Secretary Kerry needed to promptly testify and explain why his Department had withheld subpoenaed documents, neither of us immediately recognized how opponents of congressional oversight would use this as an opportunity to distract from the Select Committee’s effort."
        },
        {
            "id": 6,
            "text": "“I am extremely proud that the Oversight Committee’s investigation led to a bipartisan vote to establish the Select Committee."
        },
        {
            "id": 7,
            "text": "Our work pierced the original false accounts introduced by senior Administration officials in the immediate aftermath of the attack, and gave the American people many essential facts about events prior to, during and after that terrible night in Benghazi."
        },
        {
            "id": 8,
            "text": "As much as we fought to learn what we could, bring critical witnesses forward, and shame the Administration into disclosing more than it originally intended, I expect the Select Committee’s unified jurisdiction will afford it better access to the complete picture than any of its investigative predecessors."
        },
        {
            "id": 9,
            "text": "In attempting to cover up documents like the September 14 e-mail from Deputy National Security Advisor Ben Rhodes, President Obama, Secretary Kerry, and other officials have no one but themselves to blame for the increased scrutiny they should soon expect.”"
        }
    ]
}