{
    "title": "Trump says he never directed Cohen to break the law, claims lawyer has liability",
    "text": [
        {
            "id": 0,
            "text": "President Trump argued Thursday that he never told Michael Cohen to break the law, just one day after his former lawyer was sentenced to three years in prison for campaign finance and tax violations."
        },
        {
            "id": 1,
            "text": "“I never directed Michael Cohen to break the law."
        },
        {
            "id": 2,
            "text": "He was a lawyer and he is supposed to know the law,” the president tweeted, in his first public reaction to Mr. Cohen’s sentence."
        },
        {
            "id": 3,
            "text": "Mr. Trump argued that it was Mr. Cohen’s responsibility to inform his client what would and would not violate the law, contending that “a lawyer has great liability if a mistake is made.”"
        },
        {
            "id": 4,
            "text": "He also doubled down on arguing that the payments made to two of Mr. Trump’s alleged mistresses should not constitute a violation of campaign finance law and argued that, even if they were, it should only be a civil issue."
        },
        {
            "id": 5,
            "text": "“[Michael Cohen] pleaded to two campaign charges which were not criminal and of which he probably was not guilty [of] even on a civil basis,” Mr. Trump wrote."
        },
        {
            "id": 6,
            "text": "He argued that his former lawyer only took the plea in order to “embarrass” him and reduce his prison sentence for other charges against him."
        },
        {
            "id": 7,
            "text": "“As a lawyer, Michael has great liability to me!”"
        },
        {
            "id": 8,
            "text": "he wrote."
        },
        {
            "id": 9,
            "text": "On Monday, the president called the hush money payments “a simple private transaction.”"
        },
        {
            "id": 10,
            "text": "In his guilty plea, Mr. Cohen said he organized the payments to Karen McDougal and Stormy Daniels, both of whom claimed to have had alleged affairs with Mr. Trump, at the direction of and in coordination with the president."
        },
        {
            "id": 11,
            "text": "During the 2016 campaign, Mr. Cohen arranged for Ms. McDougal to be paid off so that her story would never be published."
        },
        {
            "id": 12,
            "text": "Federal prosecutors continue to build the case around hush money payments, as they announced a deal with National Enquirer publisher American Media Inc. to cooperate with the investigation."
        },
        {
            "id": 13,
            "text": "They told prosecutors that they worked “in concert” with the Trump campaign to bury Ms. Dougal’s claims."
        },
        {
            "id": 14,
            "text": "— Jeff Mordock contributed to this report."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": ""
        }
    ]
}