{
    "title": "Trump sues banks to block House subpoenas for records",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON (AP) — President Trump has filed suit against Deutsche Bank and Capital One in an attempt to block congressional subpoenas for his business records."
        },
        {
            "id": 1,
            "text": "The lawsuit by Trump, sons Donald Jr. and Eric and daughter Ivanka was filed Monday in federal court in New York."
        },
        {
            "id": 2,
            "text": "The Trump Organization and the Donald J. Trump Revocable Trust are among the other plaintiffs."
        },
        {
            "id": 3,
            "text": "Two House committees subpoenaed Deutsche Bank and several other financial institutions earlier this month as part of investigations into the Republican president’s finances."
        },
        {
            "id": 4,
            "text": "House Intelligence Committee Chairman Adam Schiff, D-Calif., said at the time that the subpoenas were part of an investigation “into allegations of potential foreign influence on the U.S. political process.”"
        },
        {
            "id": 5,
            "text": "He has said he wants to know whether Russians used laundered money for transactions with the Trump Organization."
        },
        {
            "id": 6,
            "text": "Trump’s businesses have benefited from Russian investment over the years."
        },
        {
            "id": 7,
            "text": "The Trumps want a federal judge to declare the subpoenas unlawful and unenforceable."
        },
        {
            "id": 8,
            "text": "The lawsuit also seeks to block the financial institutions from disclosing information and complying with the subpoenas."
        },
        {
            "id": 9,
            "text": "The banks did not immediately respond to requests for comment."
        },
        {
            "id": 10,
            "text": "Deutsche Bank, a German asset management firm, has lent Trump’s real estate organization millions of dollars over time."
        },
        {
            "id": 11,
            "text": "When the subpoenas were issued April 15, Eric Trump, executive vice president of The Trump Organization, called the subpoenas “an unprecedented abuse of power and simply the latest attempt by House Democrats to attack the President and our family for political gain.”"
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        }
    ]
}