{
    "title": "DC lawyer's trial to serve as test for Justice Department's foreign lobbying enforcement work",
    "text": [
        {
            "id": 0,
            "text": "One of Washington’s most well-known and accomplished lawyers, the former Obama White House counsel Greg Craig, goes to trial Monday in Washington in a case likely to be seen as a litmus test for the Justice Department’s efforts regarding foreign lobbying."
        },
        {
            "id": 1,
            "text": "Craig is accused of concealing material information in connection with work he performed for Ukraine after he left the Obama administration and joined the Skadden firm as a partner."
        },
        {
            "id": 2,
            "text": "According to his charges, he cut a deal in 2012 to earn $4 million from a Ukrainian client for the law firm by producing a supposedly independent report on the jailing of a political rival of the then-Ukraine president."
        },
        {
            "id": 3,
            "text": "Craig had been caught up in the expansive federal probe of Ukrainian influence in American politics tracked by special counsel Robert Mueller and now led by the Justice Department’s National Security Division and US Attorney’s Office in DC."
        },
        {
            "id": 4,
            "text": "The trial will discuss the influence efforts by Mueller defendants Paul Manafort and Rick Gates, both former Trump campaign leadership, who allegedly had tapped Craig to help with pushing a slanted report on Ukrainian politics among American media, according to court records."
        },
        {
            "id": 5,
            "text": "The trial will also be, in many ways, a defining moment for the Justice Department’s foreign lobbying enforcement efforts."
        },
        {
            "id": 6,
            "text": "In March, the department said it would boost its pursuit of foreign influence operations, in part by appointing a prosecutor who worked on special counsel Mueller’s team to lead a revamped unit intended to crack down on unregistered foreign agents."
        },
        {
            "id": 7,
            "text": "In making the announcement, the department’s national security division head, John Demers, specifically cited a settlement involving Craig’s former law firm, Skadden, Arps, Slate, Meagher & Flom LLP, over the work at issue in Craig’s trial as spurring the department’s interest in enforcement regarding foreign lobbying under the Foreign Agents Registration Act, also known as FARA."
        },
        {
            "id": 8,
            "text": "The overhauled unit at Justice now has 11 prosecutors, an increase from years prior."
        },
        {
            "id": 9,
            "text": "The Craig trial – with its high profile witnesses and recognizable defendant – poses a test of the Justice Department’s stepped up efforts."
        },
        {
            "id": 10,
            "text": "“Disregard for truth undermines our political discourse and it infects our policymaking."
        },
        {
            "id": 11,
            "text": "If the people don’t have the facts, democracy can’t work,” US District Court Judge Amy Berman Jackson, who is overseeing the Craig trial and presided over the Manafort case in Washington, said about these types of alleged lobbying violations at Manafort’s sentencing."
        },
        {
            "id": 12,
            "text": "Major trials regarding foreign lobbying violations have been few since the law was enacted in the 1930s."
        },
        {
            "id": 13,
            "text": "This year alone, there have been two foreign lobbying cases stemming from Mueller’s work: the Craig case and another recent trial in Virginia, where Bijan Kian, a former lobbying partner of Michael Flynn’s, was convicted for working as a foreign agent of Turkey."
        },
        {
            "id": 14,
            "text": "A judge is still considering whether prosecutors presented enough evidence at Kian’s trial for the conviction to stand."
        },
        {
            "id": 15,
            "text": "“Every law firm and lobbyist who does this stuff has woken up,” said Andrew Herman, a defense lawyer who counsels clients on foreign lobbying registration."
        },
        {
            "id": 16,
            "text": "“Nobody would wish what’s happening to Craig on anyone."
        },
        {
            "id": 17,
            "text": "I think he will be the poster child regardless of the result.”"
        },
        {
            "id": 18,
            "text": "A Justice Department spokesperson declined to comment on the potential impact the Craig trial will have for FARA enforcement."
        },
        {
            "id": 19,
            "text": "While coordinating with Manafort’s operation, Craig also allegedly reached out to American reporters to shape news coverage of the report – and, through it all, hadn’t disclosed to the Justice Department he was working for Ukrainians, according to prosecutors."
        },
        {
            "id": 20,
            "text": "Federal law requires those who work on public relations or lobbying efforts in the US to register with the Justice Department under FARA."
        },
        {
            "id": 21,
            "text": "Manafort and Gates both admitted to working illegally on the report on behalf of Ukrainian politicians as part of their guilty pleas in the Mueller investigation last year."
        },
        {
            "id": 22,
            "text": "In some ways, the Craig case has already imposed significant hurdles for the Justice Department, having bounced between numerous prosecutors’ offices before being charged, CNN has reported."
        },
        {
            "id": 23,
            "text": "After the investigation of Craig was opened by Mueller in 2017, the special counsel’s office referred the case to the US Attorney’s office for the Southern District of New York, which devoted significant resources to the investigation."
        },
        {
            "id": 24,
            "text": "But that office, despite its aggressive reputation, declined to bring charges, determining that they didn’t have sufficient evidence."
        },
        {
            "id": 25,
            "text": "In January of this year, the case was transferred yet again, this time to US Attorney’s office for the District of Columbia."
        },
        {
            "id": 26,
            "text": "But by the time Craig was finally charged in April by the DC office, the statute of limitations for the initial matter for which he was investigated – failure to register as a foreign agent – had expired."
        },
        {
            "id": 27,
            "text": "Craig was charged at the time with two crimes: making false statements and concealing material information in connection with work he performed for Ukraine."
        },
        {
            "id": 28,
            "text": "He pleaded not guilty."
        },
        {
            "id": 29,
            "text": "But in recent weeks, the Justice Department faced another setback: the judge threw out the charge over making false statements."
        },
        {
            "id": 30,
            "text": "If found guilty of the remaining charge, Craig faces a maximum penalty of five years in prison."
        },
        {
            "id": 31,
            "text": "It is unlikely he would have a sentence so steep, however."
        },
        {
            "id": 32,
            "text": "Craig was released on a personal recognizance bond following his arraignment in April."
        },
        {
            "id": 33,
            "text": "Craig is the highest-profile Democrat to be indicted in connection to Mueller’s work."
        },
        {
            "id": 34,
            "text": "He’s so well connected in Washington that the list of people who may be mentioned or who may testify at his trial, according to court records, reads like a who’s who list of power and influence inside the Beltway."
        },
        {
            "id": 35,
            "text": "Aside from the obvious names of Mueller defendants like Manafort and Gates, jurors will be asked if they’ve known former congressmen like Jim Slattery, journalists like David Sanger of the New York Times, longtime Clinton adviser Cheryl Mills, lobbyist and political analyst Doug Schoen, prominent white collar lawyers like Brendan Sullivan or the Atlanta judge Clinton Deveaux."
        },
        {
            "id": 36,
            "text": "The list even includes two Kennedy family members: Victoria Reggie Kennedy, the widow of Sen. Ted Kennedy; and Timothy Shriver, the chairman of the Special Olympics and nephew of the former President."
        },
        {
            "id": 37,
            "text": "It’s unclear if they would be mentioned or testify, either by presenting evidence or speaking about Craig’s character as part of his defense."
        },
        {
            "id": 38,
            "text": "Gates is expected to testify as a witness for the prosecution, though what he will say on the stand, especially about his interactions with Manafort, will be limited, prosecutors told the court."
        },
        {
            "id": 39,
            "text": "Soon after the Mueller investigation began, defense lawyers in Washington realized how Mueller was spooking lawyers and lobbyists engaged in foreign work, and began pitching their advice on foreign lobbying registration to clients."
        },
        {
            "id": 40,
            "text": "Flynn was under investigation, and following his guilty plea and the foreign lobbying and financial fraud indictments of Manafort and Gates, some of Washington’s most high-profile lobbyists were on edge."
        },
        {
            "id": 41,
            "text": "The firm of former Republican congressman Vin Weber was examined in the probe, as was the uber-lobbyist Tony Podesta’s."
        },
        {
            "id": 42,
            "text": "Podesta’s lobby shop – at one time one of Washington’s most successful – shut down at the end of 2017 shortly after the Manafort and Gates indictments."
        },
        {
            "id": 43,
            "text": "Neither has been charged with a crime."
        },
        {
            "id": 44,
            "text": "They both could be mentioned or called to testify at Craig’s trial."
        }
    ]
}