{
    "title": "Eric Holder Declares More Rights for Same-Sex Married Couples in Eyes of U.S. Justice Department",
    "text": [
        {
            "id": 0,
            "text": "Story by the Associated Press; curated by Dave Urbanski\n\nWASHINGTON (AP) — In an assertion of same-sex marriage rights, Attorney General Eric Holder is applying a landmark Supreme Court ruling to the Justice Department, announcing Saturday that same-sex spouses cannot be compelled to testify against each other, should be eligible to file for bankruptcy jointly and are entitled to the same rights and privileges as federal prison inmates in opposite-sex marriages."
        },
        {
            "id": 1,
            "text": "The Justice Department runs a number of benefits programs, and Holder says same-sex couples will qualify for them."
        },
        {
            "id": 2,
            "text": "They include the September 11th Victim Compensation Fund and benefits to surviving spouses of public safety officers who suffer catastrophic or fatal injuries in the line of duty."
        },
        {
            "id": 3,
            "text": "“In every courthouse, in every proceeding and in every place where a member of the Department of Justice stands on behalf of the United States, they will strive to ensure that same-sex marriages receive the same privileges, protections and rights as opposite-sex marriages under federal law,” Holder said in prepared remarks to the Human Rights Campaign in New York."
        },
        {
            "id": 4,
            "text": "The advocacy group works on behalf of lesbian, gay, bisexual and transgender equal rights."
        },
        {
            "id": 5,
            "text": "Just as in the civil rights struggles of the 1960s, the stakes in the current generation over same-sex marriage rights “could not be higher"
        },
        {
            "id": 6,
            "text": ",” said Holder."
        },
        {
            "id": 7,
            "text": "“The Justice Department’s role in confronting discrimination must be as aggressive today as it was in Robert Kennedy’s time,” Holder said of the attorney general who played a leadership role in advancing civil rights."
        },
        {
            "id": 8,
            "text": "On Monday, the Justice Department will issue a policy memo to its employees instructing them to give lawful same-sex marriages full and equal recognition, to the greatest extent possible under the law."
        },
        {
            "id": 9,
            "text": "Holder’s address is the latest application of a Supreme Court ruling that struck down a provision in the Defense of Marriage Act defining marriage as the union of one man and one woman."
        },
        {
            "id": 10,
            "text": "The decision applies to legally married same-sex couples seeking federal benefits."
        },
        {
            "id": 11,
            "text": "After the Supreme Court decision last June, the Treasury Department and the IRS said that all legally married gay couples may file joint federal tax returns, even if they reside in states that do not recognize same-sex marriages."
        },
        {
            "id": 12,
            "text": "The Defense Department said it would grant military spousal benefits to same-sex couples."
        },
        {
            "id": 13,
            "text": "The Health and Human Services Department said the Defense of Marriage Act is no longer a bar to states recognizing same-sex marriages under state Medicaid and Children’s Health Insurance Programs."
        },
        {
            "id": 14,
            "text": "The U.S. Office of Personnel Management said it is now able to extend benefits to legally married same-sex spouses of federal employees and annuitants."
        },
        {
            "id": 15,
            "text": "Holder told his audience:\n\n—The Justice Department will recognize that same-sex spouses of individuals involved in civil and criminal cases should have the same legal rights as all other married couples, including the right to decline to give testimony that might incriminate their spouse."
        },
        {
            "id": 16,
            "text": "Prosecutors traditionally have various legal challenges that they can bring to an assertion of the spousal privilege."
        },
        {
            "id": 17,
            "text": "But the attorney general’s speech made clear that the government will not bring a challenge on the ground that the marriage is not recognized in the state where the couple lives."
        },
        {
            "id": 18,
            "text": "—The U.S. Trustee Program will take the position that same-sex married couples should be eligible to file for bankruptcy jointly and that domestic support obligations should include debts such as alimony owed to a former same-sex spouse."
        },
        {
            "id": 19,
            "text": "— Federal prisoners in same-sex marriages will be entitled to visitation by a spouse, inmate furloughs during a crisis involving a spouse, escorted trips to attend a spouse’s funeral, correspondence with a spouse and compassionate release or reduction in sentence based on an inmate’s spouse being incapacitated."
        }
    ]
}