{
    "title": "Sen. Patrick Leahy: Focus on Loretta Lynch’s credentials during confirmation",
    "text": [
        {
            "id": 0,
            "text": "The top Democrat on the Senate Judiciary Committee urged his colleagues to remain focused on the credentials of the president’s nominee to be the next Attorney General."
        },
        {
            "id": 1,
            "text": "“She is the nomination for attorney general and that is why I’m focusing on her,” said Sen. Patrick Leahy, a Vermont Democrat."
        },
        {
            "id": 2,
            "text": "Mr. Leahy’s comments came in apparent response to Republican focus on controversies at the DOJ including the ATF gunwalking scandal and defense of the president’s immigration policies."
        },
        {
            "id": 3,
            "text": "Ms. Lynch will “lead the Justice Department to face these complex challenges,” Mr. Leahy said, and said the confirmation hearing should remain focused on her and not outside issues."
        },
        {
            "id": 4,
            "text": "“Her credentials are beyond reproach,” Mr. Leahy said."
        },
        {
            "id": 5,
            "text": "“She’s fought tirelessly against violent crime and financial fraud…"
        },
        {
            "id": 6,
            "text": "She’s prosecuted those who have committed crimes against police officers, as well as police officers who have committed crimes.”"
        },
        {
            "id": 7,
            "text": "The daughter of a Baptist preacher and school librarian, Mr. Leahy said that Ms. Lynch represents the American dream."
        },
        {
            "id": 8,
            "text": "Despite growing up in the Jim Crow south, “she never lost faith that the way to obtain justice is through our justice system,” Mr. Leahy said."
        },
        {
            "id": 9,
            "text": "New York Sen. Chuck Schumer introduced Ms. Lynch, and also called for the committee to focus only on her record as a prosecutor."
        },
        {
            "id": 10,
            "text": "“The president’s immigration policies are not seeking confirmation today."
        },
        {
            "id": 11,
            "text": "Loretta Lynch is,” he said."
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": ""
        },
        {
            "id": 15,
            "text": ""
        }
    ]
}