{
    "title": "'The president leaves us no choice': Pelosi to proceed with articles of impeachment",
    "text": [
        {
            "id": 0,
            "text": "Pelosi took a similar tone when addressing her caucus in a closed-door meeting after her public announcement."
        },
        {
            "id": 1,
            "text": "She underscored the seriousness of the moment but didn’t provide further details on the timeline or scope of articles that will be drafted."
        },
        {
            "id": 2,
            "text": "Pelosi said waiting any longer for the courts to rule on Trump’s efforts to block key witnesses from testifying — which could take months — would make Democrats “accomplices to his obstruction,” according to sources in the room."
        },
        {
            "id": 3,
            "text": "And she made clear impeachment is their only recourse."
        },
        {
            "id": 4,
            "text": "\"If we aren’t going to impeach this time we should amend the Constitution to remove impeachment,” Pelosi said, according to multiple attendees."
        },
        {
            "id": 5,
            "text": "Pelosi used her news conference Thursday to underscore the caucus’s split-screen mentality on impeachment and the rest of its domestic agenda, ticking off a string of legislative accomplishments."
        },
        {
            "id": 6,
            "text": "And just before she spoke to reporters, Pelosi announced that the House would vote on her signature drug pricing bill next week — a move that appeases many in her caucus, particularly battleground Democrats who fear Republicans will convince the public that they're doing nothing but impeaching Trump."
        },
        {
            "id": 7,
            "text": "The news conference ended with a tense exchange as Pelosi was leaving, after a reporter in the front row shouted a question asking whether she hated the president."
        },
        {
            "id": 8,
            "text": "\"As a Catholic, I resent you using the word hate in a sentence that addresses me,\" Pelosi said, stunning reporters in the room who have long known her to be composed under pressure."
        },
        {
            "id": 9,
            "text": "She then aggressively rejected the notion — fueled by Republicans — that Democrats are impeaching Trump because of personal animosity."
        },
        {
            "id": 10,
            "text": "In an extraordinarily rare display of anger, Pelosi marched back to the lectern to answer the question for the full set of cameras: \"Don't mess with me when it comes to a word like that.\""
        },
        {
            "id": 11,
            "text": "The California Democrat has long refused to put an end-date on Democrats’ investigation, cautioning she and her caucus would not prejudge the process before they were finished gathering evidence."
        },
        {
            "id": 12,
            "text": "But senior Democrats have said privately they hoped to finish the inquiry, likely with a House vote to impeach Trump, before the end of December."
        },
        {
            "id": 13,
            "text": "The six chairs of the committees investigating Trump, including Judiciary Chairman Jerry Nadler, are expected to huddle privately after Pelosi’s announcement."
        },
        {
            "id": 14,
            "text": "House Majority Leader Steny Hoyer also sought to impress upon members the solemness of the moment, particularly voting on articles of impeachment."
        },
        {
            "id": 15,
            "text": "“It’ll be a vote directed by our conscience,” the Maryland Democrat said, according to multiple Democrats in the room."
        },
        {
            "id": 16,
            "text": "Just ahead of Pelosi’s announcement, Trump delivered a defiant tweet."
        },
        {
            "id": 17,
            "text": "“If you are going to impeach me, do it now, fast,” Trump wrote, adding that he wants a “fair trial” in the Senate."
        },
        {
            "id": 18,
            "text": "“We will have Schiff, the Bidens, Pelosi and many more testify, and will reveal, for the first time, how corrupt our system really is.”"
        },
        {
            "id": 19,
            "text": "....."
        },
        {
            "id": 20,
            "text": "trial in the Senate, and so that our Country can get back to business."
        },
        {
            "id": 21,
            "text": "We will have Schiff, the Bidens, Pelosi and many more testify, and will reveal, for the first time, how corrupt our system really is."
        },
        {
            "id": 22,
            "text": "I was elected to “Clean the Swamp,” and that’s what I am doing!"
        },
        {
            "id": 23,
            "text": "— Donald J. Trump (@realDonaldTrump) December 5, 2019"
        },
        {
            "id": 24,
            "text": "Pelosi has tightly controlled every step of Democrats’ impeachment investigation since first launching the inquiry on Sept. 24 after a whistleblower complaint first came to light that Trump was pressuring Ukrainian President Volodymyr Zelensky to investigate political rivals like former Vice President Joe Biden."
        },
        {
            "id": 25,
            "text": "In recent weeks, Pelosi and her top deputies have made a point to be more public-facing, with more high-profile interviews like on CBS’ “Face the Nation” as they attempt to sway the public."
        },
        {
            "id": 26,
            "text": "During a CNN-hosted town hall on Thursday night, Pelosi fielded a number of questions on impeachment, but also pressed the audience to focus on other issues such as climate change and health care."
        },
        {
            "id": 27,
            "text": "When asked how she would want to be remembered as part of the impeachment investigation, she replied: “As part of it?"
        },
        {
            "id": 28,
            "text": "No, I want to be remembered as part of the Affordable Care Act."
        },
        {
            "id": 29,
            "text": "“She later added, while raising her hand: “I would hope that our legacy would be one of respect, one of fairness and one of honoring my oath of office.”"
        },
        {
            "id": 30,
            "text": "Pelosi’s announcement comes one day after the House Judiciary Committee held its first impeachment hearing."
        },
        {
            "id": 31,
            "text": "The panel heard from four constitutional lawyers, three of whom — all Democratic witnesses — said Trump committed impeachable offenses."
        },
        {
            "id": 32,
            "text": "The committee also signaled that Democrats are strongly considering including allegations connected to special counsel Robert Mueller’s probe in articles of impeachment."
        },
        {
            "id": 33,
            "text": "Nadler said Trump’s efforts to pressure Ukraine along with blocking Democrats’ investigation illustrated a clear pattern of abuse of power and obstruction that began with Trump’s efforts to thwart Mueller’s probe."
        },
        {
            "id": 34,
            "text": "Pelosi declined to comment on whether she would support references to the Mueller report in articles of impeachment, deferring to her committee leaders, the House counsel and other members of her caucus."
        },
        {
            "id": 35,
            "text": "A final decision on articles has not been made."
        },
        {
            "id": 36,
            "text": "But Pelosi said each of the six House chairmen investigating Trump will be asked to make recommendations about articles of impeachment."
        },
        {
            "id": 37,
            "text": "\"I don't think it's clear to anybody at this point."
        },
        {
            "id": 38,
            "text": "There are different ways of organizing the various patterns of misconduct,\" Rep. Jamie Raskin (D-Md.) said."
        },
        {
            "id": 39,
            "text": "\"But if you watched the hearings yesterday, you saw what the recurring themes were,\" he added, referring to obstruction."
        },
        {
            "id": 40,
            "text": ""
        },
        {
            "id": 41,
            "text": "\"That's going to be up to the [Judiciary] committee to decide, in consultation with leadership,\" he said."
        },
        {
            "id": 42,
            "text": "The debate over how much Democrats should rely on Mueller’s findings in potential articles — if at all — has resurfaced this month as a tricky issue within the caucus."
        },
        {
            "id": 43,
            "text": "Multiple moderate Democrats have cautioned Pelosi and other leaders against relitigating the special counsel’s investigation into Russian interference in the 2016 election, which hardly budged public opinion on Trump."
        },
        {
            "id": 44,
            "text": "These lawmakers have urged a narrower scope focused on the Ukraine saga, which quickly unified the caucus."
        },
        {
            "id": 45,
            "text": "Other Democrats have argued that ignoring Trump's misconduct and obstruction during the Mueller probe would be a neglection of congressional duties."
        }
    ]
}