{
    "title": "Trump campaign seizes on Biden's 'you aint black' comments to court black voters",
    "text": [
        {
            "id": 0,
            "text": "President Trump Donald Trump"
        },
        {
            "id": 1,
            "text": "Jan. 6 committee chair says panel will issue a 'good number' of additional subpoenas Overnight Defense & National Security — Presented by AM General — Pentagon officials prepare for grilling Biden nominates head of Africa CDC to lead global AIDS response MORE’s reelection campaign plans to use former Vice President Joe Biden Joe BidenFord to bolster electric vehicle production in multi-billion dollar push Protesters demonstrate outside Manchin's houseboat over opposition to reconciliation package Alabama eyes using pandemic relief funds on prison system MORE's \"you ain't black\" comments to further its outreach to black voters, a top aide told Hill."
        },
        {
            "id": 2,
            "text": "TV on Wednesday."
        },
        {
            "id": 3,
            "text": "“I think it’s important for voters to know and fully understand Joe Biden’s background,” Marc Lotter, director of strategic communications Trump's 2020 campaign, said on Hill. TV’s “Rising.\""
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "Biden was criticized after saying on a radio show last week that if you support Trump \"then you ain't black.\""
        },
        {
            "id": 6,
            "text": "He later said he regretted the remark."
        },
        {
            "id": 7,
            "text": "Lotter indicated the campaign also plans to tout Trump's 2018 First Step Act while questioning the effects of the 1994 crime bill that Biden helped draft when he was in the Senate."
        },
        {
            "id": 8,
            "text": "“Criminal justice reform has made a lot of black voters take another look at the president,” Lotter said."
        },
        {
            "id": 9,
            "text": "When asked about decriminalizing marijuana — an issue that disproportionately affects black Americans due to higher arrest rates — Lotter suggested any developments on that front would come from the White House."
        },
        {
            "id": 10,
            "text": "“I think that’s something that we’re going to be working on throughout this campaign,” he said."
        },
        {
            "id": 11,
            "text": "“I’ll let the White House and the president get into the details of what they’re going to propose.”"
        }
    ]
}