{
    "title": "Obama draws line between racial segregation of the past and class segregation today",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "Resident: We need to invest more into our children\n\n:"
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "More than a week after streets in Baltimore erupted in violence, President Barack Obama attempted on Tuesday to pinpoint the roots of the unrest there, which he says include a lack of opportunity for inner-city youth and laws that make it difficult to escape a cycle of crime."
        },
        {
            "id": 7,
            "text": "Joining prominent policy experts to discuss the roots and potential solutions to poverty, Obama identified what he said was a troubling trend toward social stratification that separates the well-off from the poor."
        },
        {
            "id": 8,
            "text": "“What used to be racial segregation now mirrors itself in class segregation,” Obama said."
        },
        {
            "id": 9,
            "text": "“This great sorting (has) taken place."
        },
        {
            "id": 10,
            "text": "It creates its own politics."
        },
        {
            "id": 11,
            "text": "There are some communities where not only do I not know poor people, I don’t even know people who have trouble paying the bills at the end of the month."
        },
        {
            "id": 12,
            "text": "I just don’t know those people."
        },
        {
            "id": 13,
            "text": "And so there’s less sense of investment in those children.”"
        },
        {
            "id": 14,
            "text": "Obama’s remarks came as part of a larger conference on poverty sponsored by Georgetown University’s Initiative on Catholic Thought."
        },
        {
            "id": 15,
            "text": "The panel, moderated by The Washington Post columnist E.J. Dionne, also included Harvard Public Policy Professor Robert Putnam and Arthur Brooks, the president of the right-leaning think tank American Enterprise Institute."
        },
        {
            "id": 16,
            "text": ""
        },
        {
            "id": 17,
            "text": ""
        },
        {
            "id": 18,
            "text": "The gathering came as a response to Pope Francis’ call for the church to better serve the world’s poorest people."
        },
        {
            "id": 19,
            "text": "Obama has publicly praised the renewed attention the pope has placed on combating poverty, and the two discussed the issue when they met last year at the Vatican."
        },
        {
            "id": 20,
            "text": "More recently, Obama has cited the pervasive and seemingly inescapable cycle of poverty when discussing the origins of violence in places like Ferguson and Baltimore, where large protests exploded after black men were shot by police officers."
        },
        {
            "id": 21,
            "text": "On Tuesday Obama cited the programs he’s implemented to address issues like the opportunity gap in inner cities, like his My Brother’s Keeper program that emphasizes mentorships for young minority men and boys."
        },
        {
            "id": 22,
            "text": "And he strongly defended the personal approach he’s taken of late in addressing issues of poverty in black communities."
        },
        {
            "id": 23,
            "text": "“I make no apologies for that."
        },
        {
            "id": 24,
            "text": "And the reason is because I am a black man who grew up without a father,” Obama said."
        },
        {
            "id": 25,
            "text": "“I know the costs that I paid for it."
        },
        {
            "id": 26,
            "text": "And I also know that I had the capacity to break that cycle, and as a consequence I think my daughters are better off.”"
        },
        {
            "id": 27,
            "text": ""
        },
        {
            "id": 28,
            "text": "In 2008, when he was running for president, Obama pledged to end childhood hunger in America by 2015, a goal that now seems all but unattainable."
        },
        {
            "id": 29,
            "text": "The combined forces of the worst recession in decades and stagnant wages have led to yearly increases in the number of Americans on food stamps."
        },
        {
            "id": 30,
            "text": "Last year the Census Bureau estimated 45.3 million Americans lived in poverty – including almost 20% of American children."
        },
        {
            "id": 31,
            "text": "Those figures, however, represented a decline in the poverty rate from mid-recession highs."
        },
        {
            "id": 32,
            "text": "A Census report later in the year found that out-of-pocket medical expenses are causing 11 million Americans to fall into poverty."
        },
        {
            "id": 33,
            "text": "Conversely, benefits from food stamps, tax credits and social security are keeping roughly 40 million Americans from falling below the poverty line."
        },
        {
            "id": 34,
            "text": "The White House points to a slate of programs introduced by Obama that are meant to combat poverty, including new grants for high-poverty areas, the “My Brother’s Keeper” program for young minority men, and raising the maximum Pell grant for higher education."
        },
        {
            "id": 35,
            "text": "“The President doesn’t treat this conversation as one to be had only every few months surrounding the latest tragedy captured on camera and replayed on the news,” wrote Jerry Abramson, the President’s director of intergovernmental affairs, in an email to Obama supporters Tuesday."
        },
        {
            "id": 36,
            "text": "Meanwhile, Republicans – led by Rep. Paul Ryan – have also taken on poverty as an agenda item."
        },
        {
            "id": 37,
            "text": "Ryan, who chairs the House Ways and Means Committee, embarked on a listening tour in poor neighborhoods across the country and sought to include poverty-combatting items in the GOP budgets he prepared as chairman of the House Budget panel."
        },
        {
            "id": 38,
            "text": "Critics complained, however, that government spending programs Ryan’s budgets cut – including job training initiatives – are actually preventing more Americans from falling into poverty."
        },
        {
            "id": 39,
            "text": "Ryan defended his plans Sunday on CBS’ Face the Nation."
        },
        {
            "id": 40,
            "text": "“It’s not a function of pumping more money into the same failed system because we’ll just get the same failed result."
        },
        {
            "id": 41,
            "text": "It’s rethinking how we actually attack the root causes of poverty."
        },
        {
            "id": 42,
            "text": "All we do these days effectively is treat the symptoms of poverty,” Ryan said."
        }
    ]
}