{
    "title": "Donald Trump: ‘Really Bad News’ Someone Broke into Baltimore House of Elijah Cummings",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump commented it was “really bad news” someone broke into the Baltimore house of Rep. Elijah Cummings early Saturday morning."
        },
        {
            "id": 1,
            "text": "“Really bad news!”"
        },
        {
            "id": 2,
            "text": "Trump wrote on Twitter."
        },
        {
            "id": 3,
            "text": "“The Baltimore house of Elijah Cummings was robbed."
        },
        {
            "id": 4,
            "text": "Too bad!”"
        },
        {
            "id": 5,
            "text": "In a statement, Cummings confirmed the attempted break-in, revealing he was home when the incident occurred."
        },
        {
            "id": 6,
            "text": "“An individual attempted to gain entry into my residence at approximately 3:40 AM on Saturday, July 27,” he wrote."
        },
        {
            "id": 7,
            "text": "“I was notified of the intrusion by my security system and I scared the intruder away by telling before the person gained entry into the residential portion of the house.”"
        },
        {
            "id": 8,
            "text": "The break-in took place several hours before Trump first criticized Cummings on Twitter on Saturday morning."
        },
        {
            "id": 9,
            "text": "Trump accused Cummings of acting as a “brutal bully” to border patrol, pointing out that his Baltimore district was “FAR WORSE and more dangerous” than government border facilities."
        },
        {
            "id": 10,
            "text": "“His district is considered the Worst in the USA,” Trump wrote, calling it a “disgusting, rat and rodent-infested mess.”"
        },
        {
            "id": 11,
            "text": "“Why is so much money sent to the Elijah Cummings district when it is considered the worst run and most dangerous anywhere in the United States,” he wrote."
        },
        {
            "id": 12,
            "text": "“No human being would want to live there."
        },
        {
            "id": 13,
            "text": "Where is all this money going?"
        },
        {
            "id": 14,
            "text": "How much is stolen?"
        },
        {
            "id": 15,
            "text": "Investigate this corrupt mess immediately!”"
        }
    ]
}