{
    "title": "Trump Blocks Release of Memo Rebutting Republican Claims",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — President Trump on Friday blocked the release of a classified Democratic memo rebutting Republican claims that top federal law enforcement officials had abused their powers in spying on a former Trump campaign aide, a move that Democrats denounced as politically motivated hypocrisy."
        },
        {
            "id": 1,
            "text": "Last week, the president moved quickly, over the objections of the Justice Department and the F.B.I., to declassify the contents of a rival Republican memo drafted by House Intelligence Committee staff members."
        },
        {
            "id": 2,
            "text": "He claimed, incorrectly, that the Republican memo had vindicated him in the special counsel investigation into Russian election interference."
        },
        {
            "id": 3,
            "text": "But Donald F. McGahn II, the president’s lawyer, said in a letter to the committee on Friday night that the Democratic memo could not be released because it “contains numerous properly classified and especially sensitive passages.”"
        },
        {
            "id": 4,
            "text": "He said the president would again consider making the memo public if the committee, which had approved its release on Monday, revised it to “mitigate the risks.”"
        },
        {
            "id": 5,
            "text": "Under the obscure rule invoked by the Intelligence Committee to initiate the document’s release, the committee could choose to make those changes, or could decide to seek a vote of the full House to try to override Mr. Trump’s decision."
        },
        {
            "id": 6,
            "text": "Democrats expressed outrage at the president’s decision."
        },
        {
            "id": 7,
            "text": "“Republicans and Democrats on the Intelligence Committee voted UNANIMOUSLY to release this memo,” Representative Terri Sewell of Alabama, a Democratic member of the committee, wrote on Twitter."
        },
        {
            "id": 8,
            "text": "“@realDonaldTrump is not interested in transparency, he is interested in protecting himself and derailing the Russia investigation.”"
        },
        {
            "id": 9,
            "text": "Representative Adam B. Schiff of California, the top Democrat on the committee, had said earlier in the week that he feared that Mr. Trump would play politics with the dueling memos."
        },
        {
            "id": 10,
            "text": "Mr. Schiff, who has traded bitter Twitter messages with the president after Mr. Trump called him one of “the biggest liars and leakers” in Washington, warned this week that Mr. Trump might call for “political edits” intended to erase embarrassing parts of the memo, not information related to national security."
        },
        {
            "id": 11,
            "text": "In a statement on Friday night, Mr. Schiff said that Democrats had provided their memo to the F.B.I. and the Justice Department for vetting before it was approved for release by the committee."
        },
        {
            "id": 12,
            "text": "The Democratic memo was drawn from the same underlying documents as the Republican one."
        },
        {
            "id": 13,
            "text": "“We will be reviewing the recommended redactions from D.O.J. and F.B.I., which these agencies shared with the White House,” Mr. Schiff said, “and look forward to conferring with the agencies to determine how we can properly inform the American people about the misleading attack on law enforcement by the G.O.P. and address any concerns over sources and methods.”"
        },
        {
            "id": 14,
            "text": "Representative Devin Nunes of California, the chairman of the Intelligence Committee and the biggest champion of the Republican memo, said in a statement that he “had warned that the Democratic memo” revealed intelligence sources and methods, and that “it’s no surprise that these agencies recommended against publishing the memo without redactions.”"
        },
        {
            "id": 15,
            "text": "“Intelligence Committee Republicans encourage the minority to accept the D.O.J.’s recommendations and make the appropriate technical changes and redactions so that no sources and methods are disclosed and their memo can be declassified as soon as possible,” he said."
        },
        {
            "id": 16,
            "text": "Mr. McGahn said Mr. Trump was “inclined to declassify” the Democratic memo, and encouraged the committee to make the changes that he said the Justice Department had identified as important for “national security and law enforcement interests.”"
        },
        {
            "id": 17,
            "text": "“The executive branch stands ready to review any subsequent draft of the Feb. 5 memorandum for declassification at the earliest opportunity,” Mr. McGahn wrote to the committee."
        },
        {
            "id": 18,
            "text": "In his letter, Mr. McGahn said that Rod J. Rosenstein, the deputy attorney general, and the F.B.I. director, Christopher A. Wray, had identified portions of the memo for which they had “significant concerns.”"
        },
        {
            "id": 19,
            "text": "Mr. McGahn referred the committee to a separate document — not released publicly — in which Mr. Wray and Mr. Rosenstein were said to provide details to the committee about those concerns."
        },
        {
            "id": 20,
            "text": "Spokesmen for the Justice Department did not respond Friday night to questions about the concerns that Mr. Rosenstein and Mr. Wray had reportedly expressed."
        },
        {
            "id": 21,
            "text": "It was not immediately clear what recourse Democrats might seek against the president’s decision to hold up the release of their memo."
        },
        {
            "id": 22,
            "text": "The Democrats, led by Mr. Schiff, would need the support of Republicans, who control the committee, to force a House vote on the matter."
        },
        {
            "id": 23,
            "text": "Senator Chuck Schumer of New York, the top Senate Democrat, said bluntly, “Millions of Americans are asking one simple question: What is he hiding?”"
        },
        {
            "id": 24,
            "text": "Although Republicans eventually voted in favor of releasing the Democratic document after initially opposing it, their support for overriding the president to make public a document that is meant to undercut their own is another matter."
        },
        {
            "id": 25,
            "text": "While many Republicans said their memo showed evidence of political bias in the early stages of the Russia investigation, Mr. Trump went further, claiming on Twitter last Saturday that the Republican memo “totally vindicates” him in the investigation."
        },
        {
            "id": 26,
            "text": "After Mr. Schiff challenged Mr. Trump’s claim, the president lashed out on Twitter, calling him “Little Adam Schiff” and accusing him, without presenting any evidence, of leaving “closed committee hearings to illegally leak confidential information."
        },
        {
            "id": 27,
            "text": "Must be stopped!”"
        },
        {
            "id": 28,
            "text": "Democrats say their 10-page memo corrects key mischaracterizations and crucial omissions in the Republican case."
        },
        {
            "id": 29,
            "text": "The Republicans’ three-and-a-half-page memo focused on the F.B.I.’s use of material from a former British spy, Christopher Steele, to obtain a warrant to spy on Carter Page, the former Trump campaign official."
        },
        {
            "id": 30,
            "text": "Mr. Steele was gathering information on possible connections between Russia and Trump associates, but the Republican memo says that the F.B.I. did not disclose to a Foreign Intelligence Surveillance Court judge that he was being paid by the Democratic National Committee and lawyers for Hillary Clinton’s presidential campaign."
        },
        {
            "id": 31,
            "text": "People familiar with the Democratic memo said that it argues that the F.B.I. was more forthcoming with the surveillance court than Republicans had claimed."
        },
        {
            "id": 32,
            "text": "It says that while the F.B.I. did not name the Democratic National Committee or Mrs. Clinton’s campaign, the bureau did disclose to the court that the information it had received from Mr. Steele was politically motivated."
        },
        {
            "id": 33,
            "text": "Mr. Nunes has since conceded that the political nature of the material was included in a footnote — a fact confirmed in a letter released this week by two senior Republican senators."
        },
        {
            "id": 34,
            "text": "But Mr. Nunes said the disclosure still fell short."
        },
        {
            "id": 35,
            "text": "Democrats also say Republicans misrepresented the words of Andrew G. McCabe, the former deputy director of the F.B.I., when they said he told the committee late last year that the agency would not have sought a wiretap of Mr. Page without Mr. Steele’s dossier of information."
        },
        {
            "id": 36,
            "text": "“One week ago, the Department of Justice and F.B.I. implored the White House not to release a deeply flawed and inaccurate memo prepared by Chairman Devin Nunes,” Mr. Schiff said in his statement."
        },
        {
            "id": 37,
            "text": "“The White House ignored their concerns and approved the publication of the Republican memo with no redactions even though the action was described by the agencies as extraordinarily reckless and omitting material facts.”"
        },
        {
            "id": 38,
            "text": "The F.B.I. suspected that Mr. Page, a former investment banker based in Moscow who had previously been under investigation, was acting as a Russian agent."
        },
        {
            "id": 39,
            "text": "The surveillance warrant application itself remains under tight seal."
        },
        {
            "id": 40,
            "text": "The New York Times has filed a motion asking the Foreign Intelligence Surveillance Court to unseal all materials related to the wiretap."
        },
        {
            "id": 41,
            "text": "There is no precedent for releasing such documents publicly."
        },
        {
            "id": 42,
            "text": "Democrats had sought to release their memo at the same time the Republican one was made public, but lawmakers in the committee’s majority objected."
        },
        {
            "id": 43,
            "text": "They argued that the Democratic document first had to be shared with all members of the House and evaluated to ensure that it did not compromise national security."
        }
    ]
}