{
    "title": "We're on the brink of a majority of gay Americans being able to marry",
    "text": [
        {
            "id": 0,
            "text": "Following a federal judge's decision that gay couples in Idaho can legally marry as of Friday, the number of states that allow same-sex marriage jumps to 19."
        },
        {
            "id": 1,
            "text": "But despite being fewer than half of the states, back-of-the-envelope calculations suggest that just about half of the U.S. gay population lives in a state that allows gay marriage."
        },
        {
            "id": 2,
            "text": "And if you consider states that have same-sex marriage decisions on hold, that percentage is poised to pass 60 percent."
        },
        {
            "id": 3,
            "text": "This is an imprecise but revealing calculation that's worth walking through in detail."
        },
        {
            "id": 4,
            "text": "We start with the states that will allow same-sex marriages as of Friday."
        },
        {
            "id": 5,
            "text": "Here we introduce the (admittedly ugly) color scheme for the following graphs."
        },
        {
            "id": 6,
            "text": "Green means gay marriage is allowed."
        },
        {
            "id": 7,
            "text": "Red means it isn't."
        },
        {
            "id": 8,
            "text": "Yellow means that a same-sex marriage prohibition in the state has been overturned but put on hold pending appeal."
        },
        {
            "id": 9,
            "text": "(You were warned that this was ugly.)"
        },
        {
            "id": 10,
            "text": "The tricky part is determining how many gay people live in each state."
        },
        {
            "id": 11,
            "text": "In February of last year, the Williams Institute at the University of California Los Angeles used census data to calculate the percentage of each state's population that identifies as gay."
        },
        {
            "id": 12,
            "text": "This is necessarily an estimate, and one that is subject to a lot of caveats."
        },
        {
            "id": 13,
            "text": "But it's the most rigorous estimate that we've seen."
        },
        {
            "id": 14,
            "text": "Here's the Williams Institute's map:\n\nIf we then apply those percentages to the 2010 Census counts in each state, we get the following map."
        },
        {
            "id": 15,
            "text": "Darker blue means more gay residents (numbers have been rounded to the nearest thousand here; not quite respecting significant digits)."
        },
        {
            "id": 16,
            "text": "And then we compare the two maps: How many people live in each of the three categories of state."
        },
        {
            "id": 17,
            "text": "The bar chart indicates the raw numbers."
        },
        {
            "id": 18,
            "text": "Per our estimate, just under 5 million gay Americans live in states in which they are not allowed to legally marry."
        },
        {
            "id": 19,
            "text": "About 4.6 million live in states where they can — about 43 percent."
        },
        {
            "id": 20,
            "text": "And in those in-limbo states, another million or so, mostly in Texas."
        },
        {
            "id": 21,
            "text": "It probably doesn't bear mentioning (but we'll mention it anyway):"
        },
        {
            "id": 22,
            "text": "In addition to these numbers being fairly rough estimates, the past few months have shown us that the legal status of any state could change at any time."
        },
        {
            "id": 23,
            "text": "So consider this data pertinent for the early afternoon of May 14, 2014."
        },
        {
            "id": 24,
            "text": "By tomorrow morning, who knows."
        }
    ]
}