{
    "title": "Biden, in Iowa speech, plans to say Trump has ‘fanned the flames of white supremacy’",
    "text": [
        {
            "id": 0,
            "text": "Former vice president Joe Biden accused President Trump of having “fanned the flames of white supremacy in this nation” in a blistering speech delivered Wednesday in Iowa, as Trump visited two cities mourning horrific mass shootings."
        },
        {
            "id": 1,
            "text": "Biden in his speech highlighted Saturday’s shooting in El Paso by a suspect that authorities believe posted an essay with language that closely mirrors Trump’s rhetoric, as well as the language of the white nationalist movement, including a warning about the “Hispanic invasion of Texas.”"
        },
        {
            "id": 2,
            "text": "“How far is it from Trump’s saying this ‘is an invasion’ to the shooter in El Paso declaring this attack is a response to ‘the Hispanic invasion of Texas’?” said Biden."
        },
        {
            "id": 3,
            "text": ""
        },
        {
            "id": 4,
            "text": "He also referred to the deadly clash between white supremacists and protesters in Charlottesville in 2017 and the mass shooting at the Tree of Life synagogue in Pittsburgh last year."
        },
        {
            "id": 5,
            "text": "“I don’t think it’s that far at all."
        },
        {
            "id": 6,
            "text": "In both clear language and in code, this president has fanned the flames of white supremacy in this nation,” said Biden, who has said it was Trump’s response to Charlottesville that convinced him to run for president."
        },
        {
            "id": 7,
            "text": "‘We don’t want him here’:"
        },
        {
            "id": 8,
            "text": "Biden, who is seeking the Democratic presidential nomination, delivered his speech in Burlington, Iowa, on a day when Trump appeared in both El Paso, where 22 people died in Saturday’s rampage, and in Dayton, Ohio, where nine people were killed early Sunday."
        },
        {
            "id": 9,
            "text": "Biden described Trump’s condemnation of white supremacy as “low energy, his vacant eyed mouthing of the words written for him.”"
        },
        {
            "id": 10,
            "text": "“We have a president who has aligned himself with the darkest forces in this nation,” Biden said."
        },
        {
            "id": 11,
            "text": "“Trump offers no moral leadership, no interest in unifying the nation, no evidence the presidency has awakened his conscience in the least.”"
        },
        {
            "id": 12,
            "text": "The president tweeted from Air Force One about Biden’s remarks while traveling between the sites of two mass shootings."
        },
        {
            "id": 13,
            "text": "“Watching sleepy Joe Biden making a speech."
        },
        {
            "id": 14,
            "text": "Sooo Boring!"
        },
        {
            "id": 15,
            "text": "The LameStream Media will die in the ratings and clicks with this guy."
        },
        {
            "id": 16,
            "text": "It will be over for them, not to mention the fact that our Country will do poorly with him."
        },
        {
            "id": 17,
            "text": "It will be one big crash, but at least China will be happy!”"
        },
        {
            "id": 18,
            "text": "Earlier in the day, Booker, standing inside the church where a white supremacist killed black congregants at a Bible study class, argued that those who are not trying to fight racism and white supremacy are contributing to the problem."
        },
        {
            "id": 19,
            "text": "“White supremacy has always been a problem in our American story, if not always at the surface, then lurking not so far beneath it,” said Booker, one of two black candidates running for president."
        },
        {
            "id": 20,
            "text": "“Racist violence has always been part of the American story, never more so than in times of transition and rapid social change.”"
        },
        {
            "id": 21,
            "text": "“There is no neutrality in this fight,” he continued."
        },
        {
            "id": 22,
            "text": "“You are either an agent of justice or you are contributing to the problem.”"
        },
        {
            "id": 23,
            "text": "Booker never used Trump’s name in his speech, but made clear he blamed the president for the massacre in El Paso carried out by a white supremacist gunman that used similar language as the president to describe immigrants, like “invasion.”"
        },
        {
            "id": 24,
            "text": "The shooter’s hatred, Booker said, “was sowed from the highest office in our land, where we see in tweets and rhetoric hateful words that ultimately endanger the lives of people in our country.”"
        }
    ]
}