{
    "title": "Christie won't commit to serving full term in New Jersey",
    "text": [
        {
            "id": 0,
            "text": "Chris Christie won't say how long he'll spend as governor of New Jersey."
        },
        {
            "id": 1,
            "text": "The newly re-elected governor said his focus is on his home state, but acknowledged he could prematurely leave the governor’s mansion to pursue his presidential ambitions."
        },
        {
            "id": 2,
            "text": "When ABC's George Stephanopoulos asked Christie if he expected to serve all four years of his term as governor, Christie sidestepped the question."
        },
        {
            "id": 3,
            "text": "\"Who knows?"
        },
        {
            "id": 4,
            "text": "I don’t know,\" the governor said."
        },
        {
            "id": 5,
            "text": "Christie did insist that he wanted to \"finish the job\" in New Jersey, including helping the state to recover from the devastation wrought by Superstorm Sandy last year."
        },
        {
            "id": 6,
            "text": "Christie told CNN's Jake Tapper last week that the task is his \"mission.\""
        },
        {
            "id": 7,
            "text": "\"Those images of those people and their suffering and their loss are with me every day,\" Christie told Tapper. \""
        },
        {
            "id": 8,
            "text": "So, to finish that (recovery) is not a job."
        },
        {
            "id": 9,
            "text": "It's a mission, because it's sacred.\""
        },
        {
            "id": 10,
            "text": "Christie hedged when Stephanopoulos asked whether or not he would get into the presidential race in 2016."
        },
        {
            "id": 11,
            "text": "\"I didn't expect to be sitting here four years ago,\" Christie said."
        },
        {
            "id": 12,
            "text": "\"Nobody can make those predictions.”"
        },
        {
            "id": 13,
            "text": "Christie struck a different tone on another Sunday morning news program."
        },
        {
            "id": 14,
            "text": "\"What I'm interested in doing is being the governor of New Jersey,\" Christie told Chris Wallace on \"Fox News Sunday.\""
        },
        {
            "id": 15,
            "text": "Still, Christie did admit that \"everybody's going to be speculating on what may come of my future.\""
        }
    ]
}