{
    "title": "House Democrats Fighting Hard Against Republicans' Border Bill",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON -- House Democrats are aggressively urging members to oppose a GOP-authored bill to address the border crisis."
        },
        {
            "id": 1,
            "text": "And with Republican senators voicing opposition of their own -- both to the House bill and to a Senate Democratic alternative -- it appears increasingly unlikely that Congress will send a border bill to the president's desk before leaving for the August recess."
        },
        {
            "id": 2,
            "text": "The Senate held its first vote Wednesday on a bill to provide $2.7 billion to deal with the crisis of more than 57,500 unaccompanied minors who have crossed the border illegally since October."
        },
        {
            "id": 3,
            "text": "The measure passed by a vote of 63 to 33."
        },
        {
            "id": 4,
            "text": "But aides in the chamber cautioned that they aren't confident it will be able to clear a second filibuster that could prevent passage."
        },
        {
            "id": 5,
            "text": "The House, meanwhile, plans to vote Thursday on a package that provides only $659 million in funding, tied to a number of provisions that most Democrats oppose."
        },
        {
            "id": 6,
            "text": "House Democratic aides said leadership is whipping members \"hard\" to oppose the bill."
        },
        {
            "id": 7,
            "text": "One aide, speaking on background to discuss strategy, said legislative staff was in \"late last night on this\" urging members to cast \"no\" votes."
        },
        {
            "id": 8,
            "text": "\"We’re still in the process of talking to members, but it won’t be many [who vote for the bill],\" a Democratic leadership aide said."
        },
        {
            "id": 9,
            "text": "House Minority Whip Steny Hoyer"
        },
        {
            "id": 10,
            "text": "(D-Md.) said Wednesday morning that he expects most Democrats to oppose the bill."
        },
        {
            "id": 11,
            "text": "\"There may be some; we don't think it'll be a large number,\" he said, according to The Hill."
        },
        {
            "id": 12,
            "text": "Democrats have been particularly critical of some of the bill's measures, such as sending National Guard troops to the border and changing a 2008 law so the minors can be deported more quickly, with less time to make a case for why they should be allowed relief."
        },
        {
            "id": 13,
            "text": "\"We must have a heart, and look into our souls to guide us in our treatment of these desperate children,\" House Minority Leader Nancy Pelosi (D-Calif.) said Tuesday in a statement."
        },
        {
            "id": 14,
            "text": "\"While we are reminded of the critical importance of passing comprehensive immigration reform, we must do so much more than the Republicans’ unjust and inhumane proposal.\""
        },
        {
            "id": 15,
            "text": "Democratic votes are especially important if immigration hawks in the House Republican conference decide to defect on the bill."
        },
        {
            "id": 16,
            "text": "Some GOP members said the bill doesn't go far enough, arguing that it should be coupled with a vote to end the Deferred Action for Childhood Arrivals policy that allows undocumented young people who have been in the U.S. for years to apply for temporary relief."
        },
        {
            "id": 17,
            "text": "Senate Republicans Ted Cruz of Texas and Jeff Sessions of Alabama criticized the House bill on Tuesday."
        },
        {
            "id": 18,
            "text": "\"That the House leaders' border package includes no language on executive actions is surrender to a lawless president,\" Sessions said in a statement. \""
        },
        {
            "id": 19,
            "text": "And it is a submission to the subordination of congressional power.\""
        },
        {
            "id": 20,
            "text": "At a Wednesday evening meeting at his office, Cruz plans to urge House Republicans in person to vote no, the Washington Post's Robert Costa reported."
        },
        {
            "id": 21,
            "text": "Heritage Action, an outside group with influence on tea party Republicans, also opposes the bill because it does not block funding for the Deferred Action for Childhood Arrivals policy."
        },
        {
            "id": 22,
            "text": "Senate Majority Leader Harry Reid's (D-Nev.) Tuesday suggestion that comprehensive immigration reform could be attached to the bill could further spook Republicans already wary of voting for it."
        },
        {
            "id": 23,
            "text": "House Speaker John Boehner (R-Ohio) said Tuesday that he wants to pass a bill before the August recess, but passage is still not a certainty."
        },
        {
            "id": 24,
            "text": "\"I think there's sufficient support in the House to move this bill,\" he said."
        },
        {
            "id": 25,
            "text": "\"We have a little more work to do, though.\""
        },
        {
            "id": 26,
            "text": "The border bill will get at least one Democratic vote."
        },
        {
            "id": 27,
            "text": "Rep. Henry Cuellar (D-Texas) plans to support the legislation, which includes measures he proposed in a bill co-authored with Sen. John Cornyn (R-Texas)."
        },
        {
            "id": 28,
            "text": "That bill was largely criticized by fellow Democrats, but Reps. Ron Barber (D-Ariz.) and Collin Peterson (D-Minn.) co-sponsored Cuellar's bill."
        },
        {
            "id": 29,
            "text": "While Boehner faces significant hurdles in passing a border bill, Senate Democrats do too."
        },
        {
            "id": 30,
            "text": "A vote to move forward with their bill, introduced by Appropriations Committee Chairwoman Barbara Mikulski (D-Md.), passed on Wednesday morning, meaning they can proceed to debate on the legislation."
        },
        {
            "id": 31,
            "text": "But several Democrats -- including Sens. Mary Landrieu (D-La.) and Kay Hagan (D-N.C.) -- voted against moving forward."
        },
        {
            "id": 32,
            "text": "The bill must get 60 votes in order to end that debate and amendment process, and as of Wednesday morning, a Senate Democratic leadership aide said they do not expect to hit the 60-vote threshold."
        },
        {
            "id": 33,
            "text": "\"I don’t see a path to 60 on the back end,\" the aide said."
        },
        {
            "id": 34,
            "text": "Were neither chamber to pass legislation before the August recess, it would represent a remarkable show of political futility -- though the failure would be shared, leaving neither side open to a clean political attack."
        },
        {
            "id": 35,
            "text": "UPDATE: 3:40 p.m. -- The White House issued a formal veto threat Wednesday afternoon on the House Republicans' funding bill for the border crisis:\n\nRepublicans have had more than a year to comprehensively fix the Nation's broken immigration system, but instead of working toward a real, lasting solution, Republicans released patchwork legislation that will only put more arbitrary and unrealistic demands on an already broken system."
        },
        {
            "id": 36,
            "text": "H.R. 5230 could make the situation worse, not better."
        },
        {
            "id": 37,
            "text": "By setting arbitrary timelines for the processing of cases, this bill could create backlogs that could ultimately shift resources away from priority public safety goals, like deporting known criminals."
        },
        {
            "id": 38,
            "text": "This bill will undercut due process for vulnerable children which could result in their removal to life threatening situations in foreign countries."
        },
        {
            "id": 39,
            "text": "In addition, the limited resources provided in H.R. 5230 are not designated as emergency, but rather come at the expense of other Government functions."
        },
        {
            "id": 40,
            "text": "This story also has been updated to include Cruz's plans to urge House Republicans in person to vote against the bill."
        }
    ]
}