{
    "title": "Trump blocks release of Russia memo drafted by Democrats",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "President Donald Trump on Friday blocked the release of a classified memo written by congressional Democrats to rebut a Republican document that he allowed to be made public last week that claimed FBI and Justice Department bias against him in the federal probe of Russia and the 2016 U.S. election."
        },
        {
            "id": 2,
            "text": "The Republican president’s decision -- the latest controversy relating to an investigation that has hung over his year in office -- infuriated Democrats."
        },
        {
            "id": 3,
            "text": "Senate Democratic leader Chuck Schumer said, “Millions of Americans are asking one simple question: what is he hiding?”"
        },
        {
            "id": 4,
            "text": "White House Counsel Don McGahn said the Justice Department had identified portions of the 10-page memo written by Democratic members of the House Intelligence Committee that “would create especially significant concerns for the national security and law enforcement interests” of the country."
        },
        {
            "id": 5,
            "text": "The White House also released a letter from the FBI director and the department’s No. 2 official voicing concern about its release in relation to protecting U.S. intelligence sources and methods."
        },
        {
            "id": 6,
            "text": "A week earlier, Trump had overruled similar objections from the Federal Bureau of Investigation and Justice Department about releasing the memo written by the same committee’s Republican members that took aim at senior law enforcement officials."
        },
        {
            "id": 7,
            "text": "“The president’s double standard when it comes to transparency is appalling, Schumer said."
        },
        {
            "id": 8,
            "text": "Trump on Feb. 2 allowed the release of the memo written by the committee’s Republicans with no redactions."
        },
        {
            "id": 9,
            "text": "Democrats said the Republican memo mischaracterized highly sensitive classified information and was intended to discredit Special Counsel Robert Mueller’s investigation of potential collusion between Trump’s 2016 campaign and Russia."
        },
        {
            "id": 10,
            "text": "Mueller is also investigating whether Trump has committed obstruction of justice in trying to impede the Russia probe."
        },
        {
            "id": 11,
            "text": "McGahn said the president would be willing to reconsider the release of the memo if the committee decides to revise it “to mitigate the risks” identified by the Justice Department."
        },
        {
            "id": 12,
            "text": "U.S. President Donald Trump speaks to reporters in the Oval Office at the White House in Washington, U.S. February 9, 2018."
        },
        {
            "id": 13,
            "text": "FBI SURVEILLANCE"
        },
        {
            "id": 14,
            "text": "The committee’s top Democrat, Adam Schiff, said the memo Trump blocked puts forth facts that the public needs to know, including that the FBI acted properly in seeking permission from a special court for surveillance of Carter Page, a Trump campaign adviser with ties to Russia."
        },
        {
            "id": 15,
            "text": "Schiff said the committee’s Democrats “take seriously” the Justice Department and FBI concerns and will review their recommended redactions."
        },
        {
            "id": 16,
            "text": "He said he hopes the matter can be resolved quickly so the committee can return to the Russia investigation."
        },
        {
            "id": 17,
            "text": "The Intelligence Committee voted unanimously on Monday to release the document drafted by the panel’s Democrats, contingent on the Republican president agreeing to reclassify it."
        },
        {
            "id": 18,
            "text": "“Although the President is inclined to declassify the Feb. 5 Memorandum, because the memorandum contains numerous properly classified and especially sensitive passages, he is unable to do so at this time,” McGahn said in a letter to Devin Nunes, the Republican chairman of the House panel."
        },
        {
            "id": 19,
            "text": "The White House also released a letter sent to McGahn by FBI Director Christopher Wray and to Rod Rosenstein, the No. 2 Justice Department official, expressing concerns about the memo’s release “in light of longstanding principles regarding the protection of intelligence sources and methods, ongoing investigations, and other similar sensitive information.”"
        },
        {
            "id": 20,
            "text": "Democratic Representative Ted Lieu wrote on Twitter that Trump’s action was outrageous, adding that he read the memo and is convinced that Trump “is now intentionally hiding relevant information from the American people in order to mislead the public."
        },
        {
            "id": 21,
            "text": "An innocent person would not block the memo.”"
        },
        {
            "id": 22,
            "text": "The Republican memo portrayed the Russia investigation as a product of political bias at the FBI and Justice Department against Trump."
        },
        {
            "id": 23,
            "text": "The president said the document “totally vindicates” him in the Russia investigation, a claim disputed by Democrats and some Republicans."
        },
        {
            "id": 24,
            "text": "Democrats last week warned Trump against using the Republican memo as a pretext to fire Rosenstein, who hired Mueller and oversees the investigation, or to remove Mueller himself."
        },
        {
            "id": 25,
            "text": "The Republican memo singled out Rosenstein and several other officials by name, including former FBI Director James Comey, who Trump fired in May 2017, as the agency investigated the Russia matter."
        },
        {
            "id": 26,
            "text": "Mueller took over the investigation from the FBI."
        },
        {
            "id": 27,
            "text": "U.S. intelligence agencies have concluded that Russia interfered in the 2016 presidential campaign using hacking and propaganda, an effort that eventually included attempting to tilt the race in Trump’s favor."
        },
        {
            "id": 28,
            "text": "Russia denies interfering in the election."
        },
        {
            "id": 29,
            "text": "Trump denies collusion with Moscow."
        },
        {
            "id": 30,
            "text": "The Republican document asserted that a dossier of alleged Trump-Russia contacts compiled by former British spy Christopher Steele, and funded in part by U.S. Democrats, formed an “essential part” of requests to a special court to be allowed to conduct electronic surveillance on Page, an oil industry consultant with numerous contacts in Russia, that began in October 2016."
        }
    ]
}