{
    "title": "YouTube shooter ID’d as woman with apparent vendetta against company",
    "text": [
        {
            "id": 0,
            "text": "The woman suspected of shooting three people at YouTube headquarters in San Bruno, Calif. before killing herself was furious with the company because it had stopped paying her for videos she posted on the platform, her father said late Tuesday."
        },
        {
            "id": 1,
            "text": "The police identified the shooter as Nasim Aghdam, 39, of Southern California -- and said they had a run-in with her earlier in the day."
        },
        {
            "id": 2,
            "text": "Ismail Aghdam said he reported his daughter missing on Monday after she did not answer her phone for two days."
        },
        {
            "id": 3,
            "text": "He said the family received a call from Mountain View police around 2 a.m. Tuesday saying they found Nasim sleeping in a car."
        },
        {
            "id": 4,
            "text": "He said he warned them she might be headed to YouTube because she \"hated\" the company."
        },
        {
            "id": 5,
            "text": "Mountain View Police spokeswoman Katie Nelson confirmed officers located a woman by the same name asleep in a vehicle asleep in a Mountain View parking lot Tuesday morning."
        },
        {
            "id": 6,
            "text": "Nelson said the woman declined to answer further questions but the police spokeswoman did not respond to a question about whether police were warned Aghdam might go to YouTube."
        },
        {
            "id": 7,
            "text": "Aghdam reportedly maintained a personal website alleging that YouTube compensated her unfairly and censored her views."
        },
        {
            "id": 8,
            "text": "Authorities said they are still probing Aghdam's motive, and that there are no indications she knew the victims."
        },
        {
            "id": 9,
            "text": "In online postings last month, Aghdam alleged that YouTube tries to \"censor and suppress people who speak the truth.\""
        },
        {
            "id": 10,
            "text": "\""
        },
        {
            "id": 11,
            "text": "[YouTube] stopped everything and now she has no income."
        },
        {
            "id": 12,
            "text": "\"BE AWARE!"
        },
        {
            "id": 13,
            "text": "\" warns a website that reportedly belonged to Aghdam."
        },
        {
            "id": 14,
            "text": "\"Dictatorship exists in all countries but with different tactics!"
        },
        {
            "id": 15,
            "text": "They only care for personal short term profits & do anything to reach their goals.\""
        },
        {
            "id": 16,
            "text": "The website contains several screenshots purportedly showing Aghdam's YouTube user account page."
        },
        {
            "id": 17,
            "text": "The screenshots suggest that at least one of Aghdam's YouTube accounts had been \"de-monetized,\" meaning that she was not earning significant revenue from her uploads to the site."
        },
        {
            "id": 18,
            "text": "The company \"de-monetizes\" some channels for reasons including inappropriate material or having fewer than 1,000 subscribers."
        },
        {
            "id": 19,
            "text": "Text superimposed on one of the screenshots reads: \"My Revenue for 300,000 Views Is $0.10?????\""
        },
        {
            "id": 20,
            "text": "The website also espouses veganism, and includes videos apparently showing animals being skinned and cooked alive."
        },
        {
            "id": 21,
            "text": "Aghdam's YouTube videos had been removed from the site by Tuesday evening for violating the company's terms of service."
        },
        {
            "id": 22,
            "text": "Her personal website remained online."
        },
        {
            "id": 23,
            "text": "Ismail Aghdam, Nasim's father, told NBC that YouTube \"stopped everything and now she has no income.\""
        },
        {
            "id": 24,
            "text": "The shooting spree left terrified"
        },
        {
            "id": 25,
            "text": "YouTube employees huddled inside, calling 911, as officers and federal agents swarmed the company's suburban campus sandwiched between two interstates just south of San Francisco."
        },
        {
            "id": 26,
            "text": "YouTube employee Dianna Arnspiger said she was on the building's second floor when she heard gunshots, ran to a window and saw the shooter on a patio outside."
        },
        {
            "id": 27,
            "text": "She said the woman wore glasses and a scarf and was using a \"big huge pistol.\""
        },
        {
            "id": 28,
            "text": "\"It was a woman and she was firing her gun."
        },
        {
            "id": 29,
            "text": "And I just said, 'Shooter!,' and everybody started running,\" Arnspiger said."
        },
        {
            "id": 30,
            "text": "She and others hid in a conference room for an hour while another employee repeatedly called 911 for updates."
        },
        {
            "id": 31,
            "text": "\"It was terrifying,\" she said."
        },
        {
            "id": 32,
            "text": ""
        }
    ]
}