{
    "title": "Boehner unsure if spending cuts will hurt economy",
    "text": [
        {
            "id": 0,
            "text": "House Speaker John Boehner says he doesn't know if the forced spending cuts that began taking effect Friday will actually have a negative impact, although he argued in a recent op-ed that the sequester would threaten \"U.S. national security, thousands of jobs and more.\""
        },
        {
            "id": 1,
            "text": "\"I don't know whether it's going to hurt the economy or not,\" he said in an interview that aired Sunday."
        },
        {
            "id": 2,
            "text": "\"I don't think anyone quite understands how the sequester is really going to work.\""
        },
        {
            "id": 3,
            "text": "Boehner and President Barack Obama were among those who issued dire warnings about the $85 billion in cuts that are now supposed to take place over the next seven months, the remainder of the fiscal year."
        },
        {
            "id": 4,
            "text": "Both sides ratcheted up the rhetoric in the weeks before the sequester deadline, March 1, hoping to build pressure on the other side to compromise and reach a deal to avoid the cuts."
        },
        {
            "id": 5,
            "text": "During his interview on NBC's \"Meet the Press,\" Boehner was asked if he had been exaggerating when talking before the deadline about the consequences of the spending cuts."
        },
        {
            "id": 6,
            "text": "\"I am concerned about its impact on our economy and its impact on our military."
        },
        {
            "id": 7,
            "text": "Listen, we've known about this problem for 16 months,\" he said, blaming Democrats and Obama for not acting. \""
        },
        {
            "id": 8,
            "text": "And here we are at the - beyond the 11th hour, looking at each other."
        },
        {
            "id": 9,
            "text": "Without having fixed it.\""
        },
        {
            "id": 10,
            "text": "When Obama held a press conference Friday at the White House, he also didn't sound as pessimistic about the impact of the cuts as he and his administration did before the deadline."
        },
        {
            "id": 11,
            "text": "\"What's important to understand is that not everyone will feel the pain of these cuts right away."
        },
        {
            "id": 12,
            "text": "The pain, though, will be real."
        },
        {
            "id": 13,
            "text": "Beginning this week, many middle-class families will have their lives disrupted in significant ways,\" he said."
        },
        {
            "id": 14,
            "text": "Asked if the president had been exaggerating his claims about the sequester, Boehner pointed to the example of Education Secretary Arne Duncan saying that teachers in West Virginia were already being laid off because of the spending cuts."
        },
        {
            "id": 15,
            "text": "Duncan's claim has since been debunked."
        },
        {
            "id": 16,
            "text": "\"There's a lot of questions about how the White House is handling the communications on this,\" Boehner said."
        }
    ]
}