{
    "title": "Why it matters if Republicans win the Senate",
    "text": [
        {
            "id": 0,
            "text": "Susan Page\n\nUSA TODAY\n\nWASHINGTON — There's one American voter with particularly high stakes in whether Republicans win control of the U.S. Senate on Election Night."
        },
        {
            "id": 1,
            "text": "Meet Barack Obama."
        },
        {
            "id": 2,
            "text": "Republicans wrestled control of the House from Democrats four years ago."
        },
        {
            "id": 3,
            "text": "Since then, President Obama has counted on the Democratic majority in the Senate to block the GOP's congressional agenda and make life a little easier for the White House."
        },
        {
            "id": 4,
            "text": "Senate Democratic Leader Harry Reid has been able to do that because the Senate majority has the power to control the calendar, set the rules and decide which bills come up for debate and a vote."
        },
        {
            "id": 5,
            "text": "Their members also chair the committees, where they can decide to launch an investigation into the administration — or squelch it."
        },
        {
            "id": 6,
            "text": "Watch the video above to see what races and seats are in jeopardy."
        },
        {
            "id": 7,
            "text": "If Republicans win control of both chambers of Congress, Obama's protective shield in Congress would be gone."
        },
        {
            "id": 8,
            "text": "House Speaker John Boehner and Senate Republican Leader Mitch McConnell (assuming he wins his own competitive re-election race) say the GOP would move immediately on some priorities that have been stymied."
        },
        {
            "id": 9,
            "text": "That includes proposals to approve the Keystone XL Pipeline, which Obama has delayed acting on, and revising the Affordable Care Act."
        },
        {
            "id": 10,
            "text": "If that happens, Obama would still have the presidential veto, of course, but he would be forced to take time and effort to defy the Republicans on a whole new range of issues rather than focusing on his own priorities."
        },
        {
            "id": 11,
            "text": "Republicans need to pick up six Senate seats to win control."
        },
        {
            "id": 12,
            "text": "They start with likely victories in three Republican-leaning states that now have Democratic senators: Montana, South Dakota and West Virginia."
        },
        {
            "id": 13,
            "text": "Recent statewide polls show the GOP ahead in Arkansas and Louisiana, red states where Democratic incumbents are fighting for re-election."
        },
        {
            "id": 14,
            "text": "Unexpectedly, the Republican incumbent in Kansas, Pat Roberts, is trailing independent Greg Orman, who hasn't made it clear which party he'd align himself with."
        },
        {
            "id": 15,
            "text": "That means Republicans would need to win two more Democrat seats to be sure of winning control."
        },
        {
            "id": 16,
            "text": "The prime targets: Alaska, Colorado and Iowa."
        }
    ]
}