{
    "title": "Jesse Benton, Mitch McConnell's Campaign Manager, To Resign Amid Bribery Scandal",
    "text": [
        {
            "id": 0,
            "text": "Jesse Benton, campaign manager for Senate Minority Leader Mitch McConnell (R-Ky.), is resigning his position, the Lexington Herald-Leader reported Friday."
        },
        {
            "id": 1,
            "text": "The announcement comes as the McConnell campaign wrestles with Benton's possible ties to a bribery scandal when he was political director for then-Rep. Ron Paul (R-Texas) during the 2012 presidential election."
        },
        {
            "id": 2,
            "text": "Benton told the Herald-Leader that rumors of his involvement in the scandal \"risk unfairly undermining and becoming a distraction to this re-election campaign,\" referring to McConnell's bid for a sixth term in the Senate."
        },
        {
            "id": 3,
            "text": "McConnell reluctantly accepted his departure, Benton told the Herald-Leader, adding, \"This decision breaks my heart, but I know it is the right thing for Mitch, for Kentucky and for the country."
        },
        {
            "id": 4,
            "text": "\" The resignation was set to take effect Saturday."
        },
        {
            "id": 5,
            "text": "As Paul's political director in 2012, Benton has been tied to a scandal that saw thousands of dollars exchanged for political endorsements prior to the Iowa caucuses."
        },
        {
            "id": 6,
            "text": "On Wednesday, former Iowa state Sen. Kent Sorenson pleaded guilty to charges related to receiving under-the-table payments for switching his support from U.S. Rep. Michele Bachmann (R-Minn.) to Paul."
        },
        {
            "id": 7,
            "text": "Sorenson then lied to investigators about the payments, according to the Department of Justice."
        },
        {
            "id": 8,
            "text": "Sorenson's guilty plea was accompanied by two documents that could potentially implicate Benton, the Herald-Leader notes."
        },
        {
            "id": 9,
            "text": "Earlier on Friday, the McConnell campaign said in a statement, \"Sen. McConnell obviously has nothing to do with the Iowa Presidential Caucus or this investigation so it would be inappropriate for his campaign to comment on this situation,\" the Herald-Leader reports."
        },
        {
            "id": 10,
            "text": "Benton maintained his innocence, giving a statement to the Herald-Leader that read, \"There have been inaccurate press accounts and unsubstantiated media rumors about me and my role in past campaigns that are politically motivated, unfair and, most importantly, untrue.\""
        },
        {
            "id": 11,
            "text": "\"Working for Mitch McConnell is one of the great honors of my life,\" Benton said."
        },
        {
            "id": 12,
            "text": "Benton was hired in 2012 to head McConnell's 2014 re-election campaign and boost the senator's credibility with libertarian factions of the Republican Party."
        },
        {
            "id": 13,
            "text": "It was seen as a surprising move, one that has caused other troubles for the McConnell campaign."
        },
        {
            "id": 14,
            "text": "In 2013, a phone recording surfaced in which Benton said that he was holding his nose while working for McConnell and thinking of the long-term best interests of Sen. Rand Paul (R-Ky.)."
        },
        {
            "id": 15,
            "text": "CORRECTION:"
        },
        {
            "id": 16,
            "text": "A previous version of this story incorrectly referred to the Lexington Herald-Leader as the Kentucky Herald-Leader."
        },
        {
            "id": 17,
            "text": "We regret the error."
        }
    ]
}