{
    "title": "Hillary Clinton blasts Benghazi panel as ‘partisan arm of the Republican National Committee’",
    "text": [
        {
            "id": 0,
            "text": "Hillary Rodham Clinton expects to encounter a partisan witch hunt this week when she testifies before a House panel investigating the 2012 Benghazi terrorist attacks, but the committee’s leader is downplaying Mrs. Clinton’s upcoming appearance and casting her as just another witness."
        },
        {
            "id": 1,
            "text": "Ahead of Thursday’s highly anticipated session, Mrs. Clinton and Republican leaders on the House Select Committee on Benghazi painted very different pictures Sunday of the panel’s intentions and motives."
        },
        {
            "id": 2,
            "text": "Committee chairman Rep. Trey Gowdy, South Carolina Republican, said he simply wants to find the truth behind the 2012 terrorist attacks on a U.S. diplomatic compound and CIA annex in Libya that killed Ambassador J. Christopher Stevens and three other Americans."
        },
        {
            "id": 3,
            "text": "But Mrs. Clinton, the Democratic Party’s presidential front-runner, said Mr. Gowdy’s panel simply wants to destroy her political career."
        },
        {
            "id": 4,
            "text": "The panel last week spent five hours behind closed doors questioning Mrs. Clinton’s top aide, Huma Abedin, a prequel to this week’s appearance by the former secretary of state."
        },
        {
            "id": 5,
            "text": "“I really don’t know what to expect,” Mrs. Clinton said on CNN’s “State of the Union.”"
        },
        {
            "id": 6,
            "text": "“I think it is pretty clear [that] whatever they might have thought they were doing, they ended up becoming a partisan arm of the Republican National Committee with an overwhelming focus on, as they admitted, [to] drive down my poll numbers."
        },
        {
            "id": 7,
            "text": "I’ve already testified about Benghazi …"
        },
        {
            "id": 8,
            "text": "I don’t know that I have very much to add.”"
        },
        {
            "id": 9,
            "text": "Mrs. Clinton was referencing comments by House Majority Leader Kevin McCarthy and other Republicans, who have suggested the Benghazi committee is designed to drive down her poll numbers and raise more questions about her use of a private email account while secretary of state."
        },
        {
            "id": 10,
            "text": "Mr. Gowdy has vehemently denied that characterization and insisted Sunday that Mrs. Clinton will be treated fairly."
        },
        {
            "id": 11,
            "text": "“She’s a witness."
        },
        {
            "id": 12,
            "text": "She was the secretary of state, you have to talk to her."
        },
        {
            "id": 13,
            "text": "But we’ve already talked to 50 people not named Clinton."
        },
        {
            "id": 14,
            "text": "We’re going to talk to another couple of dozen not named Clinton,” he said on “Face the Nation” on CBS."
        },
        {
            "id": 15,
            "text": "“So I understand there’s more attention associated with her."
        },
        {
            "id": 16,
            "text": "But, from my perspective, I’m much more interested in Chris Stevens’ emails than her emails, which we just received.”"
        },
        {
            "id": 17,
            "text": "Mr. Gowdy said the panel now is examining Stevens’ emails to and those from other State Department officials, in which he made clear the U.S. compound in Libya needed additional security."
        },
        {
            "id": 18,
            "text": "As for Mr. McCarthy’s comments and the words of other Republicans hinting the committee wants to sabotage the Clinton presidential campaign, Mr. Gowdy fired back, saying they “don’t have any idea what they’re talking about.”"
        },
        {
            "id": 19,
            "text": "Meanwhile, Ms. Abedin’s testimony focused entirely on Benghazi, lawmakers said after the meeting."
        },
        {
            "id": 20,
            "text": "Her close working and personal relationship with Mrs. Clinton has made her a key figure in the ongoing email scandal, including recent revelations that she apparently had access to her boss’ account at the State Department."
        },
        {
            "id": 21,
            "text": "Mrs. Clinton exclusively used a private email server to conduct State Department business during her tenure as secretary."
        },
        {
            "id": 22,
            "text": "Ms. Abedin also has come under scrutiny for pocketing a $33,000 payout from the State Department for unused leave and using her simultaneous employment inside and outside of government to cater to the Clintons’ friends and associates."
        },
        {
            "id": 23,
            "text": "Mrs. Abedin remained tight-lipped, brushing past reporters during occasional breaks from the interview last week."
        },
        {
            "id": 24,
            "text": "Top House Democrats say the focus on Mrs. Clinton, Ms. Abedin and others in the Clinton circle has been a mistake, and they believe Thursday’s testimony will be another unfortunate episode in Republicans’ flawed investigation."
        },
        {
            "id": 25,
            "text": "“I think it’s a sad day for all of us,” Rep. Elijah E. Cummings of Maryland, the ranking Democrat on the Benghazi committee, told CBS News on Sunday."
        },
        {
            "id": 26,
            "text": "“We made a commitment to the families [of the Benghazi victims]."
        },
        {
            "id": 27,
            "text": "The families came in with tears in their eyes, literally, and said, ‘Please do not make this a political football.’"
        },
        {
            "id": 28,
            "text": "That’s exactly what’s happened.”"
        },
        {
            "id": 29,
            "text": ""
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": ""
        },
        {
            "id": 32,
            "text": ""
        }
    ]
}