{
    "title": "House votes to delay two health care mandates: Will it matter?",
    "text": [
        {
            "id": 0,
            "text": "Staging a fresh assault on President Barack Obama's signature healthcare reform law, the Republican-led House of Representatives on Wednesday approved largely symbolic legislation to delay key coverage requirements."
        },
        {
            "id": 1,
            "text": "The measures, the 38th and 39th House bills to take aim at the 2010 reforms known as Obamacare, would delay for a year the requirement that Americans obtain health insurance and would codify the Obama administration's recent decision to delay the mandate for larger employers to offer health coverage."
        },
        {
            "id": 2,
            "text": "The White House's surprise announcement of the one-year employer delay this month sparked a new wave of Republican anger over the healthcare law that threatens to bleed into other issues, such as government spending legislation, in the next fiscal year."
        },
        {
            "id": 3,
            "text": "Obama administration officials have insisted that the law's core provision, the requirement for uninsured Americans to obtain subsidized coverage through new online exchanges, will remain in place."
        },
        {
            "id": 4,
            "text": "Those with no coverage will face tax penalties starting in January."
        },
        {
            "id": 5,
            "text": "The House voted 264-161 for the individual delay, and 251-174 in favor of the employer delay, with some Democrats joining the Republican effort."
        },
        {
            "id": 6,
            "text": "Venting frustration"
        },
        {
            "id": 7,
            "text": "The legislation stopped well short of previous efforts to fully repeal Obamacare, but gave Republicans a new chance to vent their frustration at the law and discredit it as the state-run insurance exchanges prepare to open in October."
        },
        {
            "id": 8,
            "text": "\"The delay of the employer mandate is the latest confirmation of the fatally flawed nature of Obamacare and the need to dismantle it,\" said Rep. John Kline, a Republican from Minnesota."
        },
        {
            "id": 9,
            "text": "\"It isn't right to deny American families the same relief available to American businesses.\""
        },
        {
            "id": 10,
            "text": "While the legislation faces a White House veto threat and is virtually certain to be blocked in the Democratic-controlled Senate, Republicans insist they will keep trying to kill Obamacare and keep it alive as a 2014 campaign issue."
        },
        {
            "id": 11,
            "text": "They argue that the law's mandates will drive up healthcare costs, stunt job growth and cause businesses to cut back employee working hours to avoid the coverage requirements."
        },
        {
            "id": 12,
            "text": "Many Democrats derided the votes as another political sideshow consuming the House's time and energy."
        },
        {
            "id": 13,
            "text": "They pointed to new health insurance pricing information released by New York Governor Andrew Cuomo on Wednesday as evidence that the law will reduce coverage costs."
        },
        {
            "id": 14,
            "text": "Cuomo's report showed that many New York state residents who buy health insurance next year will most likely see their premiums cut by half."
        },
        {
            "id": 15,
            "text": "\"What we're hearing right now is the sound of Republican heart rates going up: Obamacare is coming,\" said Representative Jim McDermott, a Democrat from Washington state."
        },
        {
            "id": 16,
            "text": "\"These last benefits are going to happen - like it or not - and worse, they're going to work.\""
        },
        {
            "id": 17,
            "text": "White House spokesman Jay Carney said Republicans were simply trying \"to refight old battles than have been fought.\""
        },
        {
            "id": 18,
            "text": "Get the Monitor"
        },
        {
            "id": 19,
            "text": "Stories you care about delivered to your inbox."
        },
        {
            "id": 20,
            "text": "Your email address By signing up, you agree to our Privacy Policy"
        },
        {
            "id": 21,
            "text": "He said Obama will give a speech on Thursday touting the healthcare law's benefits, including the 8.5 million consumers who are receiving an average $100 rebate this summer from insurance companies."
        },
        {
            "id": 22,
            "text": "The rebates are due to a provision in the law that requires companies to spend at least 80 percent of premiums on medical care, rather than on administrative costs."
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}