{
    "title": "Trump names Rep. Mick Mulvaney, a fiscal hawk, to head budget office",
    "text": [
        {
            "id": 0,
            "text": "President-elect Donald Trump has named Rep. Mick Mulvaney (R-S.C.) as his director of the Office of Management and Budget, signaling his intent to slash spending and address the deficit as president."
        },
        {
            "id": 1,
            "text": "He has been an advocate for spending cuts, often taking on his own party to push for more aggressive curbs to government spending."
        },
        {
            "id": 2,
            "text": "“We are going to do great things for the American people with Mick Mulvaney leading the Office of Management and Budget,” Trump said in a statement."
        },
        {
            "id": 3,
            "text": "“Right now we are nearly $20 trillion in debt, but Mick is a very high-energy leader with deep convictions for how to responsibly manage our nation’s finances and save our country from drowning in red ink."
        },
        {
            "id": 4,
            "text": "“With Mick at the head of OMB, my administration is going to make smart choices about America’s budget, bring new accountability to our federal government, and renew the American taxpayer’s trust in how their money is spent,” he added."
        },
        {
            "id": 5,
            "text": "Trump has announced plans for increased defense spending in a massive infrastructure bill."
        },
        {
            "id": 6,
            "text": "Adding Mulvaney to his administration could help ease concerns from fiscal conservatives about the cost of such plans and their effect on the deficit."
        },
        {
            "id": 7,
            "text": "A founding member of the House Freedom Caucus, a group of about three dozen conservative hard-liners that has used its leverage to push Republican leaders to the right, Mulvaney was among the group of lawmakers widely credited with pushing House Speaker John A. Boehner (R-Ohio) out of power in 2015."
        },
        {
            "id": 8,
            "text": "He has broken with members of his own party at times, particularly around defense spending issues."
        },
        {
            "id": 9,
            "text": "Mulvaney has been a fierce critic of the use of a separate war funding stream known as overseas contingency operations, a budgetary maneuver used to skirt spending caps to fund military and anti-terror operations abroad."
        },
        {
            "id": 10,
            "text": "Mulvaney has allied himself with Democrats at times to try to force defense spending cuts."
        },
        {
            "id": 11,
            "text": "Mulvaney is also an advocate of a balanced-budget amendment to the Constitution."
        },
        {
            "id": 12,
            "text": "Mulvaney has had largely friendly relations with Boehner’s successor, Paul D. Ryan (R-Wis.)."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "He was among three members who offered nominating speeches for Ryan in a closed-door House GOP leadership election last month."
        },
        {
            "id": 15,
            "text": "In a statement Ryan praised Mulvaney’s appointment to head OMB."
        },
        {
            "id": 16,
            "text": "“Mick Mulvaney is the absolute right choice,” Ryan said."
        },
        {
            "id": 17,
            "text": "“In Congress, he has been a conservative reformer from day one, proposing solutions to fix the budget process and our regulatory system.”"
        },
        {
            "id": 18,
            "text": "“At OMB, he will lead the work he has started to improve the way government does the people’s business,” he added."
        },
        {
            "id": 19,
            "text": "Among Mulvaney’s chief duties will be overseeing the most dramatic overhaul of the nation’s tax code since President Ronald Reagan."
        },
        {
            "id": 20,
            "text": "Trump has pledged to streamline the process for individual households and slash the rate for corporations from 35 percent to 15 percent."
        },
        {
            "id": 21,
            "text": "The changes are a central component of the administration’s promise to boost economic growth to 4 percent or higher, a message that resonated with voters still bruised by the Great Recession but that many economists say is unsustainable."
        },
        {
            "id": 22,
            "text": "In addition, Trump has said that stronger growth would mean his tax proposal would not contribute to the national debt, and he has vowed not to cut expensive but popular entitlement programs such as Medicare and Social Security."
        },
        {
            "id": 23,
            "text": "But experts have been skeptical of those claims, and Mulvaney would be responsible for reconciling the numbers."
        },
        {
            "id": 24,
            "text": "One analysis by the Committee for a Responsible Federal Budget estimated Trump’s tax plan would cost more than $5.3 trillion over the next decade."
        },
        {
            "id": 25,
            "text": "Even after factoring in faster economic growth, Trump’s proposals are expected to add at least $2.6 trillion to the debt over the next decade, according to the nonpartisan Tax Foundation."
        },
        {
            "id": 26,
            "text": "Trump has also called for as much as $1 trillion in infrastructure spending, an investment long sought by Democrats even though GOP leaders, including House Speaker Paul D. Ryan (Wis.) and Senate Majority Leader Mitch McConnell (Ky.), remain opposed."
        },
        {
            "id": 27,
            "text": "It is not clear how Trump intends to pay for rebuilding the nation’s roads and bridges."
        },
        {
            "id": 28,
            "text": "Trump’s nominee for commerce secretary, billionaire industrialist Wilbur Ross, and economic adviser Peter Navarro have proposed tax credits intended to spur $1 trillion in private spending."
        },
        {
            "id": 29,
            "text": "But Trump’s website suggests that fulfilling his pledge will require at least some public money, although it does not detail where the funding will come from."
        },
        {
            "id": 30,
            "text": "Mulvaney has spent the past few years learning Spanish and has been one of just a handful of GOP lawmakers able to appear on Spanish-language television programs to explain and defend Republican policies."
        },
        {
            "id": 31,
            "text": ""
        }
    ]
}