{
    "title": "Reports: Kushner Security Clearance Downgraded Following White House Scandal",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "President Trump's son-in-law, Jared Kushner, has lost the top-level security clearance he has been using on an interim basis to do his work inside the White House, according to reports on Tuesday."
        },
        {
            "id": 2,
            "text": "Instead, Kushner will begin using a lower level of access to classified information along with other White House staffers who had temporary clearances."
        },
        {
            "id": 3,
            "text": "Kushner had held a top-secret clearance with access to Special Compartmented Information, known by the shorthand TS/SCI."
        },
        {
            "id": 4,
            "text": "Now he and other officials will use a lower one, a secret clearance, which restricts the amount of material he can access."
        },
        {
            "id": 5,
            "text": "The news was first reported by Politico."
        },
        {
            "id": 6,
            "text": "The reports appeared ahead of a deadline by which the White House had been asked to submit information about its clearance protocols to the House Oversight Committee."
        },
        {
            "id": 7,
            "text": "Another story on Tuesday raised new questions about Kushner's future inside the White House: The Washington Post reported that foreign officials have discussed among themselves how they might be able to manipulate Kushner by taking advantage of his finances, business dealings or his lack of experience in foreign policy and government."
        },
        {
            "id": 8,
            "text": "For now, Kushner apparently will continue working in his unpaid role as a senior adviser to Trump even after losing this round in a duel with White House chief of staff John Kelly."
        },
        {
            "id": 9,
            "text": "The two men have been at loggerheads over access to the president and the nature of their jobs."
        },
        {
            "id": 10,
            "text": "Trump said last week he trusted Kelly to settle the dispute."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": "\"[Kelly's] going to do what's right for the country"
        },
        {
            "id": 13,
            "text": "and I have no doubt he'll make the right decision,\" Trump told reporters on Friday."
        },
        {
            "id": 14,
            "text": "Kelly said in an earlier statement that he would not comment on any one person's security clearance."
        },
        {
            "id": 15,
            "text": "However: \"As I told Jared days ago, I have full confidence in his ability to continue performing his duties in his foreign policy portfolio including overseeing our Israeli-Palestinian peace effort and serving as an integral part of our relationship with Mexico,\" Kelly said."
        },
        {
            "id": 16,
            "text": "\"Everyone in the White House is grateful for these valuable contributions to furthering the president's agenda."
        },
        {
            "id": 17,
            "text": "There is no truth to any suggestion otherwise,\" Kelly also said."
        },
        {
            "id": 18,
            "text": "Kelly had set Friday as the deadline to discontinue any top-secret or higher-level interim clearances for individuals whose background investigations had been pending since June 1, 2017, or before."
        },
        {
            "id": 19,
            "text": "Kushner's attorney said in a statement that there is a backlog in the process for securing a permanent clearance."
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": "\"Mr. Kushner has done more than what is expected of him in this process,\" attorney Abbe Lowell said in a statement provided to NPR."
        },
        {
            "id": 22,
            "text": "Continued Lowell: \"Those involved in the process again have confirmed that there are dozens of people at Mr. Kushner's level whose process is delayed, that it is not uncommon for these clearance reviews to take this long in a new administration, and that the current backlogs are now being addressed."
        },
        {
            "id": 23,
            "text": "No concerns were raised about Mr. Kushner's application."
        },
        {
            "id": 24,
            "text": "As General Kelly himself said, the new clearance policy will not affect Mr. Kushner's ability to continue to do the very important work he has been assigned by the president.\""
        },
        {
            "id": 25,
            "text": "Sen. Richard Blumenthal, D-Conn., said the change in Kushner's access to sensitive information should have occurred months ago."
        },
        {
            "id": 26,
            "text": "\"Downgrading Jared Kushner's security clearance gives new meaning to the term 'overdue,' \""
        },
        {
            "id": 27,
            "text": "Blumenthal said."
        },
        {
            "id": 28,
            "text": "\"Kushner's access to highly sensitive, classified information should have been not just downgraded, but eliminated long ago."
        },
        {
            "id": 29,
            "text": "There is no reasonable justification for a yearlong policy that allowed people who may have very harmful secrets in their own backgrounds to have access to our nation's secrets.\""
        },
        {
            "id": 30,
            "text": "The resignation of former White House staff secretary Rob Porter had revealed that a number of people on staff had never received full, permanent clearances, meaning they were accessing national security and other secret information even after questions had been raised during background checks about their ability to qualify to do so."
        },
        {
            "id": 31,
            "text": "The Porter scandal embarrassed Kelly and the White House after Trump and Republicans had made the handling of secrets such a focus of their 2016 victory over Hillary Clinton, who operated a private email server while she served as secretary of state."
        },
        {
            "id": 32,
            "text": "Clinton was repeatedly faulted during the campaign about what critics called her slipshod approach to handling sensitive information."
        }
    ]
}