{
    "title": "As Republicans Attack The DOJ And FBI, Sessions Vows To Stand Up To ‘Unfair’ Criticism",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON ―"
        },
        {
            "id": 1,
            "text": "With his Justice Department and FBI facing broad attacks from some of his former colleagues on Capitol Hill, Attorney General Jeff Sessions said on Friday that he’ll stand up to any “unfair” attacks on the men and women of the Justice Department he now oversees."
        },
        {
            "id": 2,
            "text": "Sessions, in a speech in Norfolk, Virginia, on Friday, mentioned the “sharp criticisms” of DOJ coming from Congress."
        },
        {
            "id": 3,
            "text": "He said the Justice Department demands “the highest level of integrity, ethics, and professionalism from every person” in it, and that all employees are expected to “advance the mission of the Department honorably” in the service of the American people."
        },
        {
            "id": 4,
            "text": "“If anyone falls short of these high standards, we will not hesitate to take appropriate action, and we will do so in accordance with the rules and procedures of the Department,” Sessions said."
        },
        {
            "id": 5,
            "text": "“And, while we are open to fair criticism, we will of course defend our investigators and prosecutors from criticism that is unfair.”"
        },
        {
            "id": 6,
            "text": "Such criticism has recently been coming from within Sessions’ own party."
        },
        {
            "id": 7,
            "text": "As they’ve sought to protect President Donald Trump from special counsel Robert Mueller’s investigation, some Republicans on Capitol Hill have made broad attacks on the FBI’s integrity."
        },
        {
            "id": 8,
            "text": "They’ve suggested there’s a “deep state” operation against Trump, and that there was a “secret society” working within the FBI to stop him from ever taking office."
        },
        {
            "id": 9,
            "text": "After reading a secret memo authored by Republican staffers, members of Congress claimed to know about “absolutely shocking,” “sickening” and “jaw-dropping” information that was “worse than Watergate” and comparable to the actions of the KGB."
        },
        {
            "id": 10,
            "text": "The comments from members of his party ― and from his own boss ― have put Sessions in a tricky spot."
        },
        {
            "id": 11,
            "text": "He has a delicate relationship with the president, who blames him for the existence of the probe threatening his administration and members of his family."
        },
        {
            "id": 12,
            "text": "“He has his own detractor, and that detractor is the president of the United States,” Ron Hosko, a former FBI official, told HuffPost before Sessions’ speech."
        },
        {
            "id": 13,
            "text": "“He probably senses that he’s at risk, because of the recusal [from the Russia probe] and because of the deference to [Deputy Attorney General] Rod Rosenstein and the subsequent appointment of Bob Mueller."
        },
        {
            "id": 14,
            "text": "That’s stuck in Donald Trump’s craw, period.”"
        },
        {
            "id": 15,
            "text": "Hosko, now part of the Law Enforcement Legal Defense Fund, praised Sessions’ work on law enforcement issues."
        },
        {
            "id": 16,
            "text": "But he said he wished the attorney general would step out in the bureau’s defense."
        },
        {
            "id": 17,
            "text": "“Sessions is at risk."
        },
        {
            "id": 18,
            "text": "How quickly does he step up to back the men and women of the FBI while this scandal ― which is what it is ― kind of plays itself out?”"
        },
        {
            "id": 19,
            "text": "Hosko said, prior to Sessions’ remarks on Friday."
        },
        {
            "id": 20,
            "text": "“I would certainly love it if the attorney general steps up and says, ‘Hey, look, let’s keep in mind there are 30-some thousand FBI employees who are out there defending our freedom and protecting Americans every day."
        },
        {
            "id": 21,
            "text": "We’ve got to keep that in mind as we work our way through this.’”"
        },
        {
            "id": 22,
            "text": "In his speech, Sessions said he loves the Justice Department and the “great people” who work there."
        },
        {
            "id": 23,
            "text": "“The vast majority are dedicated, hardworking, patriotic Americans."
        },
        {
            "id": 24,
            "text": "It’s an honor to serve with them,” he said."
        },
        {
            "id": 25,
            "text": "A Justice Department official told HuffPost that Sessions’ comments on the criticism DOJ has been facing were added to his speech in recent days."
        },
        {
            "id": 26,
            "text": "Sessions said his goal was “absolutely eliminating political bias or favoritism ― in either direction ― from our investigations and prosecutions,” saying that is the “antithesis of what the Department stands for, and I won’t tolerate it.”"
        },
        {
            "id": 27,
            "text": "Sessions said the best way to respond to criticism is for DOJ to “hear the concerns, and act on them professionally, fairly and completely, in order to maintain the public’s trust in their government.”"
        },
        {
            "id": 28,
            "text": "He also said the department should work on “identifying mistakes of the past, and correcting them for the future,” and should address problems “head on” instead of “sweeping them under the rug.”"
        },
        {
            "id": 29,
            "text": "Criticism from Congress, Sessions said, isn’t a bad thing."
        },
        {
            "id": 30,
            "text": "“We welcome Congress as a partner in this effort,” he said."
        },
        {
            "id": 31,
            "text": "“When they learn of a problem and start asking questions, that is a good thing."
        },
        {
            "id": 32,
            "text": "Sunlight truly is the best disinfectant."
        },
        {
            "id": 33,
            "text": "Truth produces confidence.”"
        },
        {
            "id": 34,
            "text": "Sessions has not confirmed that he offered his resignation to Trump."
        },
        {
            "id": 35,
            "text": "His Justice Department has refused to confirm or deny the existence of his reported resignation letter, claiming that disclosing the existence of such a letter would violate Sessions’ personal privacy."
        },
        {
            "id": 36,
            "text": ""
        },
        {
            "id": 37,
            "text": "H"
        },
        {
            "id": 38,
            "text": ""
        }
    ]
}