{
    "title": "Trump loses temper over border wall funding",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump raised his voice several times in Monday's meeting with Mick Mulvaney, White House staffers and senators."
        },
        {
            "id": 1,
            "text": "| Brendan Smialowski/AFP/Getty Images Trump loses temper over border wall funding The president complained in a private meeting that Senate Republicans won’t fully fund his wall — and threatened a shutdown in September."
        },
        {
            "id": 2,
            "text": "President Donald Trump is getting frustrated with his administration’s own demands for border wall funding."
        },
        {
            "id": 3,
            "text": "In a private meeting regarding the wall Monday, Trump fumed at senators and his own staff about the $1.6 billion the Senate is planning to send him this fall, according to two people familiar with the meeting."
        },
        {
            "id": 4,
            "text": "Trump wants the full $25 billion upfront and doesn’t understand why Congress is going to supply him funds in a piecemeal fashion — even though that’s how the spending process typically works."
        },
        {
            "id": 5,
            "text": "“He’s focused on border security."
        },
        {
            "id": 6,
            "text": "And like all presidents, he wants it done now."
        },
        {
            "id": 7,
            "text": "But we’re part of the legislative process."
        },
        {
            "id": 8,
            "text": "It’s slower and deliberate,\" said Senate Appropriations Committee Chairman Richard Shelby (R-Ala.), who met with Trump."
        },
        {
            "id": 9,
            "text": "The president said at the meeting that if Congress doesn’t give him the resources he needs for border security, he will shut down the government in September, according to one of the people familiar with the meeting."
        },
        {
            "id": 10,
            "text": "He did not give a specific number, but has been fixated on getting the $25 billion in a lump sum."
        },
        {
            "id": 11,
            "text": "In fact, the $1.6 billion figure came from Office of Management and Budget Director Mick Mulvaney, who attended the meeting."
        },
        {
            "id": 12,
            "text": "Mulvaney submitted the request to Congress earlier this year, though the administration has since upped its ask to $2.2 billion."
        },
        {
            "id": 13,
            "text": "Senate Democrats offered to provide $25 billion in border wall funding earlier this year in return for giving 1.8 million young undocumented immigrants a pathway to citizenship."
        },
        {
            "id": 14,
            "text": "But Trump and most Republicans rebuffed that proposal to salvage the Deferred Action for Childhood Arrivals program."
        },
        {
            "id": 15,
            "text": "Democrats are unlikely to provide $25 billion for Trump's wall absent a much broader immigration deal."
        },
        {
            "id": 16,
            "text": "Trump's renewed focus on the border wall comes amid rising pressure to end his administration's policy of separating families that cross the border illegally."
        },
        {
            "id": 17,
            "text": "The “zero tolerance” policy shift has been roundly criticized by lawmakers in both parties, but Trump has blamed Congress for inaction on immigration."
        },
        {
            "id": 18,
            "text": "\"Now is the best opportunity ever for Congress to change the ridiculous and obsolete laws on immigration."
        },
        {
            "id": 19,
            "text": "Get it done, always keeping in mind that we must have strong border security,\" Trump tweeted on Tuesday morning."
        },
        {
            "id": 20,
            "text": "GOP lawmakers are loath to see a government shutdown on their watch just weeks before the midterm elections."
        },
        {
            "id": 21,
            "text": "“It’s probably an overwhelming belief in the House and the Senate, especially the Senate, that government shutdowns aren’t good for anybody,\" Shelby said."
        },
        {
            "id": 22,
            "text": "The Appropriations Committee began working to pass its Homeland Security bill on Tuesday."
        },
        {
            "id": 23,
            "text": "Democrats seem unlikely to change course and agree to add more border security money for the president."
        },
        {
            "id": 24,
            "text": "\"We've got the bill and we're moving forward"
        },
        {
            "id": 25,
            "text": "and I think we're going to get good bipartisan support for it."
        },
        {
            "id": 26,
            "text": "I think it's a good bill that will keep our borders safe,\" said Sen. Jon Tester (D-Mont.), ranking member of the Homeland Security appropriations committee."
        },
        {
            "id": 27,
            "text": "On Monday, GOP Sens. Shelley Moore Capito of West Virginia and Shelby both tried to explain to Trump that the Senate is merely meeting Mulvaney’s request and has to cut a bipartisan deal with Democrats."
        },
        {
            "id": 28,
            "text": "The Senate needs 60 votes to pass a spending bill, so Republicans would have to find at least nine Democratic votes."
        },
        {
            "id": 29,
            "text": "\"We're going to make a down payment on that working together,\" said Capito, chairwoman of Homeland Security spending panel."
        },
        {
            "id": 30,
            "text": "But Trump has not been mollified."
        },
        {
            "id": 31,
            "text": "He raised his voice several times in Monday's meeting with Mulvaney, White House staffers and the senators, insisting he needs the full $25 billion — an unlikely outcome in the narrowly divided Senate."
        },
        {
            "id": 32,
            "text": "Shelby said he views $1.6 billion as a floor in negotiations, which could increase if Democrats want to do some horse-trading."
        }
    ]
}