{
    "title": "Facing Cliff, Obama Tries Again For 'Grand Bargain'",
    "text": [
        {
            "id": 0,
            "text": "Compromise is suddenly the watchword in Washington, as negotiations over taxes, spending and entitlements begin in advance of another self-imposed deadline, popularly known as the \"fiscal cliff.\""
        },
        {
            "id": 1,
            "text": "Automatic tax increases and deep spending cuts are slated for the first of the year, unless the president and Congress take action."
        },
        {
            "id": 2,
            "text": "Leaders on both sides say they are willing to meet in the middle, but that makes their constituents worry about what any compromise will cost them."
        },
        {
            "id": 3,
            "text": "After meeting with President Obama on Tuesday, leaders of progressive groups such as MoveOn.org and labor unions such as the Service Employees International Union said they believed the president would stand firm for their causes."
        },
        {
            "id": 4,
            "text": "\"I think we came away convinced that we are on the same page with the president — that he is committed to making sure that the rich pay their fair share of taxes as a part of a solution to our country's fiscal problems,\" said Deepak Bhargava of the Center for Community Change."
        },
        {
            "id": 5,
            "text": "\"He reiterated his commitment that he's made in public before, that this budget will not be balanced on the backs of the middle class and the poor.\""
        },
        {
            "id": 6,
            "text": "Republicans, while offering an olive branch to the president in the form of greater tax revenues, are still adamant that income tax rates should not go up, even on the richest Americans."
        },
        {
            "id": 7,
            "text": "Liberal groups are just as adamant that no changes be made to Social Security or Medicare — something the president has been open to in the past."
        },
        {
            "id": 8,
            "text": "But on Tuesday, labor leaders like AFL-CIO President Richard Trumka didn't want to talk about differences with the White House."
        },
        {
            "id": 9,
            "text": "\"Are we going to collectively stand up and make sure that workers get a fair shake in all of this?"
        },
        {
            "id": 10,
            "text": "Absolutely we are,\" he said."
        },
        {
            "id": 11,
            "text": "\"Do we believe that the president is committed to that same thing?"
        },
        {
            "id": 12,
            "text": "Absolutely we do.\""
        },
        {
            "id": 13,
            "text": "Inside the White House, officials say the president will stick to his principles but keep his options open."
        },
        {
            "id": 14,
            "text": "Spokesman Jay Carney said the president wants a balanced deal."
        },
        {
            "id": 15,
            "text": "\"If you do that and you get to that $4 trillion mark, the way the president does, you will have a very positive effect, he believes — the president believes — on our overall economic prospects,\" Carney said, \"because you will send a signal to the world that we're getting our fiscal house in order, but you'll also send a signal to the American people that we are doing it in a way that doesn't harm economic growth."
        },
        {
            "id": 16,
            "text": "It, quite the contrary, boosts economic growth.\""
        },
        {
            "id": 17,
            "text": "Obama campaigned on a plan to raise income tax rates for Americans making more than $250,000, but other Democrats have suggested raising that limit to $500,000 or $1 million."
        },
        {
            "id": 18,
            "text": "Carney said the president was sticking to his original plan, but \"he is not wedded to every detail of that plan."
        },
        {
            "id": 19,
            "text": "So I'm not going to negotiate hypothetical details.\""
        },
        {
            "id": 20,
            "text": "Asked if that means the president is not ruling those ideas out, Carney responded: \"You know, I would again cite Speaker [John] Boehner in saying that I'm not in the position to — he's not and I don't think the president is — in the position of boxing ourselves in or boxing others out.\""
        },
        {
            "id": 21,
            "text": "Carney's comments could be a message for Obama's supporters in labor and the left wing of the Democratic Party: Give me some room to reach a deal."
        },
        {
            "id": 22,
            "text": "On Wednesday, Obama will answer questions from reporters in his first full-dress press conference since March."
        },
        {
            "id": 23,
            "text": "He will be asked about the budget negotiations, but also about the scandal involving his CIA director and top general in Afghanistan."
        },
        {
            "id": 24,
            "text": "He will also meet with business leaders, including the heads of Wal-Mart, Ford, General Electric and Chevron, who will strive to counter the message Obama received Tuesday."
        },
        {
            "id": 25,
            "text": "Then on Friday, he will meet with leaders of Congress to get the negotiations going."
        },
        {
            "id": 26,
            "text": "With his re-election campaign behind him, the president is now free to search again for a grand bargain:"
        },
        {
            "id": 27,
            "text": "the kind of big deal that would make both sides happy and mad in equal measure — the kind of deal that eluded him in his first term."
        }
    ]
}