{
    "title": "Obama proposes major overtime pay expansion, amid GOP resistance",
    "text": [
        {
            "id": 0,
            "text": "President Obama unveiled a long-awaited plan to drastically expand the number of people eligible for overtime pay, in a move that he said would ensure \"hard work is rewarded\" -- but that critics warn could hurt job growth at a fragile time."
        },
        {
            "id": 1,
            "text": "Under the proposal unveiled late Monday, salaried workers who earn nearly $1,000 per week would become eligible for overtime pay."
        },
        {
            "id": 2,
            "text": "The rule from the Labor Department would more than double the threshold at which employers can avoid paying overtime, from the current $455 a week to $970 a week by next year."
        },
        {
            "id": 3,
            "text": "That would mean salaried employees earning less than $50,440 a year would be assured overtime if they work more than 40 hours per week, up from the current $23,660 a year."
        },
        {
            "id": 4,
            "text": "\"We've got to keep making sure hard work is rewarded,\" Obama wrote in an op-ed in The Huffington Post."
        },
        {
            "id": 5,
            "text": "\"That's how America should do business."
        },
        {
            "id": 6,
            "text": "In this country, a hard day's work deserves a fair day's pay.\""
        },
        {
            "id": 7,
            "text": "Although the Labor Department's estimates suggest the proposal would raise wages for 5 million people, other estimates are far higher."
        },
        {
            "id": 8,
            "text": "The Economic Policy Institute, a liberal think tank, recently estimated that a threshold of $984 a week would cover 15 million people."
        },
        {
            "id": 9,
            "text": ""
        },
        {
            "id": 10,
            "text": "\"This is by definition middle-class people."
        },
        {
            "id": 11,
            "text": "This reverses decades of neglect,\" said EPI President Larry Mishel."
        },
        {
            "id": 12,
            "text": "Under the current threshold, only about 8 percent of salaried workers are eligible for 11/2 times their regular pay when they work overtime."
        },
        {
            "id": 13,
            "text": "The EPI estimates that doubling the salary level would make up to 40 percent of salaried workers eligible."
        },
        {
            "id": 14,
            "text": "Yet many Republicans have opposed Obama's plans to increase the threshold, arguing that doing so would discourage companies from creating jobs and dampen economic growth."
        },
        {
            "id": 15,
            "text": "Sen. Lamar Alexander of Tennessee, who chairs the Senate's labor panel, has derided the idea as designed \"to make it as unappealing as possible\" for companies to create jobs."
        },
        {
            "id": 16,
            "text": "To keep up with future inflation and wage growth, the proposal will peg the salary threshold at the 40th percentile of income, individuals familiar with the plan said."
        },
        {
            "id": 17,
            "text": "The president was to promote the proposal during a visit Thursday to La Crosse, Wisconsin."
        },
        {
            "id": 18,
            "text": "Obama's proposal aims to narrow a loophole that the president has long said some employers exploit to avoid paying overtime."
        },
        {
            "id": 19,
            "text": "Employees who make above the salary threshold can be denied overtime if they are deemed managers."
        },
        {
            "id": 20,
            "text": "Some work grueling schedules at fast food chains and retail stores, but with no overtime eligibility, their pay may be lower per hour than many workers they supervise."
        },
        {
            "id": 21,
            "text": "The existing salary cap, established in 2004 under President George W. Bush, has been eroded by inflation."
        },
        {
            "id": 22,
            "text": "Obama has long charged that the level is too low and undercuts the intent of the overtime law."
        },
        {
            "id": 23,
            "text": "The proposed changes will be open for public comment and could take months to finalize."
        },
        {
            "id": 24,
            "text": "They can be enacted through regulation, without approval by the Republican-led Congress."
        },
        {
            "id": 25,
            "text": "Obama, in his op-ed, argued the exemption was intended for highly paid, white-collar employees but now punished lower-income workers because the government has failed to update the regulations."
        },
        {
            "id": 26,
            "text": "The beneficiaries would be people like Brittany Swa, 30, a former manager of a Chipotle restaurant in Denver."
        },
        {
            "id": 27,
            "text": "As a management trainee, she started as an entry-level crew member in March 2010."
        },
        {
            "id": 28,
            "text": "After several months she began working as an \"apprentice,\" which required a minimum 50-hour work week."
        },
        {
            "id": 29,
            "text": "Yet her duties changed little."
        },
        {
            "id": 30,
            "text": "She had a key to the shop and could make bank deposits, but otherwise spent nearly all her time preparing orders and working the cash register."
        },
        {
            "id": 31,
            "text": "She frequently worked 60 hours a week but didn't get overtime because she earned $36,000."
        },
        {
            "id": 32,
            "text": "The grueling hours continued after she was promoted to store manager in October 2010."
        },
        {
            "id": 33,
            "text": "She left two years later and has joined a class-action lawsuit against Chipotle, charging that apprentices shouldn't be classified as managers exempt from overtime."
        },
        {
            "id": 34,
            "text": "A spokesman for Chipotle declined to comment on the case."
        },
        {
            "id": 35,
            "text": ""
        }
    ]
}