{
    "title": "Bernie Sanders wins Nevada caucuses, cementing his status as Democratic frontrunner",
    "text": [
        {
            "id": 0,
            "text": "Sen. Bernie Sanders has won the Nevada Democratic caucuses."
        },
        {
            "id": 1,
            "text": "By 8 p.m. EST on Saturday, both Fox News and NBC News projected that Sanders had won The Silver State, dominating his Democratic competitors among Latinos and young voters."
        },
        {
            "id": 2,
            "text": "Sanders was leading with more than 50 percent of the votes, while Joe Biden was in second place with less than 20 percent."
        },
        {
            "id": 3,
            "text": "According to Politico, it is not yet clear when the complete caucus results will be tallied, though it could be sometime Sunday."
        },
        {
            "id": 4,
            "text": "The uncontested victory comes on the heals of Sanders' narrow win in New Hampshire earlier in the month when he bested Pete Buttigieg and Sen. Amy Klobuchar in a much closer race."
        },
        {
            "id": 5,
            "text": "Sanders and Buttigieg also effectively tied in Iowa, meaning Sanders has essentially swept the first three Democratic primary contests."
        },
        {
            "id": 6,
            "text": "Sanders was not in Nevada when his victory was announced."
        },
        {
            "id": 7,
            "text": "Instead, he was campaigning in Texas ahead of Super Tuesday on March 3."
        },
        {
            "id": 8,
            "text": "Brad Parscale, President Donald Trump's campaign manager, said after Sanders' win, \"There is no denying that Big Government Socialism dominated again as Bernie Sanders remained the leader of the leftist pack."
        },
        {
            "id": 9,
            "text": "We are another day closer to Election Day and another day closer to re-electing President Trump.\""
        },
        {
            "id": 10,
            "text": "In his post-caucus speech, Buttigieg laid into Sanders, saying the Vermont senator \"believes in an inflexible, ideological revolution that leaves out most Democrats, not to mention most Americans.\""
        },
        {
            "id": 11,
            "text": "The next Democratic primary will take place in South Carolina on Feb. 29."
        },
        {
            "id": 12,
            "text": "Biden leads there, current polling shows."
        }
    ]
}