{
    "title": "Government shutdown: White House aide predicts long standoff as Trump talks border closure",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON – The partial federal government shutdown entered its second week Saturday with no apparent movement toward a resolution."
        },
        {
            "id": 1,
            "text": "\"The discussions have broken down,\" Mick Mulvaney, Trump's incoming chief of staff told reporters outside the White House Friday."
        },
        {
            "id": 2,
            "text": "\"We do expect this to go on for a while.\""
        },
        {
            "id": 3,
            "text": "Members of Congress remained adjourned until New Year's Eve."
        },
        {
            "id": 4,
            "text": "President Donald Trump remained hunkered down at the White House after threatening to shut down the U.S. border with Mexico if Congress doesn't approve funding to build a border wall."
        },
        {
            "id": 5,
            "text": "\"It’s the only way we can get the Democrats’ attention,\" Mulvaney said of Trump's tweeted threat."
        },
        {
            "id": 6,
            "text": "Trump has made the threat before but has not offered details on how he would carry out such a policy."
        },
        {
            "id": 7,
            "text": "Trump kept a relatively low profile on Saturday, though he tweeted about the budget impasse and special counsel Robert Mueller’s probe into suspected Russian interference in the 2016 election."
        },
        {
            "id": 8,
            "text": "“I am in the White House waiting for the Democrats to come on over and make a deal on Border Security,” Trump posted Saturday morning."
        },
        {
            "id": 9,
            "text": "“From what I hear, they are spending so much time on Presidential Harassment that they have little time left for things like stopping crime and our military!”"
        },
        {
            "id": 10,
            "text": "Mulvaney predicted the budget stalemate won’t be resolved until Democrats come back for the new Congress and likely select Democratic House Leader Nancy Pelosi, D-Calif., as their new speaker Jan. 3."
        },
        {
            "id": 11,
            "text": "Until Pelosi locks up the votes she needs to become speaker, he said, she risks being seen by Democrats as weak if she negotiates with Trump."
        },
        {
            "id": 12,
            "text": "Pelosi's spokesman said Democrats won't consider any offers unless they're publicly endorsed by Trump because the president has changed his position too often."
        },
        {
            "id": 13,
            "text": "\"While we await the president’s public proposal, Democrats have made it clear that, under a House Democratic majority, we will vote swiftly to re-open government on Day One,\" spokesman Drew Hammill said in a statement."
        },
        {
            "id": 14,
            "text": "He declined to comment on a report in The Washington Free Beacon that Pelosi was at a Hawaiian resort."
        },
        {
            "id": 15,
            "text": "Senate Majority Leader Mitch McConnell, R-Kentucky, is in his home state and will call senators back to vote if there is an agreement, according to his spokesman."
        },
        {
            "id": 16,
            "text": "Senate Minority Leader Chuck Schumer, D-N.Y., is also at home where an aide said he is on the phone constantly with staff, Pelosi and other lawmakers."
        },
        {
            "id": 17,
            "text": "Friday afternoon, Trump signed an executive order to freeze pay for federal workers in 2019."
        },
        {
            "id": 18,
            "text": "Trump otherwise spent Friday meeting with staff and making calls, White House press secretary Sarah Sanders said."
        },
        {
            "id": 19,
            "text": "Mulvaney said the administration offered to accept less than the $5 billion in border wall funding included in a short-term funding bill passed by the House – but not the Senate –before lawmakers left town for the holidays."
        },
        {
            "id": 20,
            "text": "He would not specify what that offer was."
        },
        {
            "id": 21,
            "text": "Hammill said Democrats have proposed three options for reopening the government that include \"strong, sensible, and effective border security – but not the president's immoral, ineffective and expensive wall.\""
        },
        {
            "id": 22,
            "text": "Trump ran for president on a promise to strengthen immigration restrictions and build the wall."
        },
        {
            "id": 23,
            "text": "He took heat from conservatives after the White House initially signaled an openness to a short-term funding measure that would have kept government agencies opened but would not have significantly increased funding border barriers."
        },
        {
            "id": 24,
            "text": "\"This issue has become very much a key base issue for Republicans,\" Rep. Jim Banks, R-Ind., told NPR Friday."
        },
        {
            "id": 25,
            "text": "\"In places like where I come from, it’s become one of those issues that the voters are seeing a clear difference between Republicans and Democrats when it comes to funding border security.\""
        },
        {
            "id": 26,
            "text": "Contributing: John Fritze"
        }
    ]
}