{
    "title": "Department of Justice hands 2020 census-related questions to new team of lawyers",
    "text": [
        {
            "id": 0,
            "text": "The Department of Justice announced Sunday that a new team of Civil Division lawyers will take over handling of all 2020 census-related questions."
        },
        {
            "id": 1,
            "text": "The changing of hands comes as President Donald Trump continues to push for the addition of a controversial citizenship question to the census, which takes place every 10 years."
        },
        {
            "id": 2,
            "text": "A statement from DOJ spokeswoman Kerri Kupec did not reveal why the change was made, but stated that the lawyers who have represented the United States in these cases so far \"have consistently demonstrated the highest professionalism, integrity, and skill inside and outside the courtroom.\""
        },
        {
            "id": 3,
            "text": "Another DOJ official said the new team would be a mix of career and political appointees, including lawyers who work in the consumer protection branch, Reuters reported."
        },
        {
            "id": 4,
            "text": "Census citizenship question:What we know about the debate so far\n\nCensus data is used to allot seats in the U.S. House of Representatives, as well as to distribute billions of dollars in federal funding for schools, hospitals, roads and other public works."
        },
        {
            "id": 5,
            "text": "The citizenship question has faced criticism from opponents who have said that its inclusion would prevent millions of non-citizens from responding to the census out of fear that the information could be used for immigration enforcement, thus altering the allocation of federal funding."
        },
        {
            "id": 6,
            "text": "Adding the question could also cost seats in Congress for California, Texas, Florida, New York, Illinois and Arizona — states with large non-citizen populations."
        },
        {
            "id": 7,
            "text": "Meanwhile, the federal government has expressed in court battles over the question that it needs an accurate count of citizens in order to enforce the Voting Rights Act, a piece of legislation from 1965 that banned various types of voter discrimination."
        },
        {
            "id": 8,
            "text": "That rationale may have to change, as the Supreme Court previously blocked the addition of the question on the grounds that the rationale behind the move failed to appropriately justify it."
        },
        {
            "id": 9,
            "text": "The dispute didn't end there."
        },
        {
            "id": 10,
            "text": "Another challenge to the administration's motivation for asking the question is ongoing in another federal district court, potentially dragging the dispute out for the rest of the summer."
        },
        {
            "id": 11,
            "text": "Although questions about citizenship have appeared on the census before, a citizenship question has not been included on the short-form census since 1950."
        },
        {
            "id": 12,
            "text": "Ken Cuccinelli, acting director of U.S. Citizenship and Immigration Services, told Fox News on Sunday that he's confident in Trump's odds of getting the question on the census."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "\"I think the president has expressed determination,\" Cuccinelli said."
        },
        {
            "id": 15,
            "text": "\"He has noted that the Supreme Court didn’t say this can’t be asked."
        },
        {
            "id": 16,
            "text": "They said that they didn’t appreciate the process by which it came forward the first time, so the president is determined to fix that ...\""
        },
        {
            "id": 17,
            "text": "On Friday, Trump said he might issue an executive order to push the question onto the census, a move that would likely be challenged in courts by advocacy groups and opponents."
        },
        {
            "id": 18,
            "text": "\"The News Reports about the Department of Commerce dropping its quest to put the Citizenship Question on the census is incorrect or, to state it differently, FAKE!\""
        },
        {
            "id": 19,
            "text": "Trump tweeted on Wednesday morning."
        },
        {
            "id": 20,
            "text": "\"We are absolutely moving forward, as we must, because of the importance of the answer to this question.\""
        }
    ]
}