{
    "title": "Trump vetoes congressional resolution to end U.S. involvement in Yemen war",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "President Donald Trump has vetoed a congressional resolution that sought to end U.S. involvement in the Saudi-led war in Yemen, the White House said on Tuesday."
        },
        {
            "id": 2,
            "text": "“This resolution is an unnecessary, dangerous attempt to weaken my constitutional authorities, endangering the lives of American citizens and brave service members, both today and in the future,” Trump said in the veto message."
        },
        {
            "id": 3,
            "text": "The resolution passed the House of Representatives in April and the Senate in March, marking the first time both chambers of Congress had supported a War Powers resolution, which limits the president’s ability to send troops into action."
        },
        {
            "id": 4,
            "text": "Neither the 247-175 tally in the Democratic-majority House nor the 54-46 vote in the Republican-led Senate would be enough to override the veto, which would require two-thirds majorities in both chambers."
        },
        {
            "id": 5,
            "text": "Backers of the measure said the Saudi-led bombing campaign in Yemen had made the humanitarian crisis worse, harshly criticizing Riyadh for killing civilians."
        },
        {
            "id": 6,
            "text": "They also argued that U.S. involvement in Yemen violated the constitutional requirement that Congress, not the president, should determine when the country goes to war."
        },
        {
            "id": 7,
            "text": "The four-year-long civil war in Yemen, which pits the Saudi-led coalition against Houthi rebels backed by Iran, has killed tens of thousands of people and spawned what the United Nations calls the world’s most dire humanitarian crisis, with the country on the brink of famine."
        }
    ]
}