{
    "title": "Bill Weld: Trump to face 2020 Republican challenge",
    "text": [
        {
            "id": 0,
            "text": "US President Donald Trump is facing a longshot challenge from within his own party ahead of next year's White House election."
        },
        {
            "id": 1,
            "text": "Former Massachusetts Governor Bill Weld has become the first Republican to challenge Mr Trump in 2020."
        },
        {
            "id": 2,
            "text": "Mr Weld, 73, has released a campaign video contrasting his style with the current president's."
        },
        {
            "id": 3,
            "text": "But he faces an uphill battle to take over a Republican party that has been refashioned in Mr Trump's image."
        },
        {
            "id": 4,
            "text": "Mr Weld was governor of Massachusetts from 1991-97 after serving in the justice department under President Ronald Reagan."
        },
        {
            "id": 5,
            "text": "He was running mate on the Libertarian ticket during the 2016 presidential election."
        },
        {
            "id": 6,
            "text": "\"I really think if we have six more years of the same stuff we've had out of the White House the last two years that would be a political tragedy,\" he said on CNN."
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "\"So I would be ashamed of myself if I didn't raise my hand and run.\""
        },
        {
            "id": 9,
            "text": "Mr Weld's campaign video touts his cross-party credentials as a Republican who was elected in the Democratic stronghold of Massachusetts."
        },
        {
            "id": 10,
            "text": "The three-minute production contrasts his record with clips of provocative statements by Mr Trump."
        },
        {
            "id": 11,
            "text": "The video finishes with the slogan: \"A Better America Starts Here.\""
        },
        {
            "id": 12,
            "text": "But underscoring the long odds for him, party leaders promptly rejected his campaign."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "\"Any effort to challenge the president's nomination is bound to go absolutely nowhere,\" the Republican National Committee said in statement."
        },
        {
            "id": 15,
            "text": "According to the most recent Gallup poll, 89% of Republican voters approve of the president."
        },
        {
            "id": 16,
            "text": "Mr Trump's campaign said on Sunday it had raised more than $30m in the first quarter of this year, far outpacing the political war chests of individual Democratic candidates."
        },
        {
            "id": 17,
            "text": "Ex-Florida Governor Jeb Bush, who was bested by Mr Trump during the 2016 election, has recently been calling for a Republican to oust the president next year."
        },
        {
            "id": 18,
            "text": "Former Ohio Governor John Kasich and Maryland Governor Larry Hogan have also been mentioned in recent months as potential party challengers to Mr Trump."
        },
        {
            "id": 19,
            "text": "Next year Republican and Democratic voters will hold elections known as primaries to pick their respective party's standard bearer for the November 2020 presidential election."
        },
        {
            "id": 20,
            "text": "Sitting presidents do not usually face internal challengers, and only a few have ever been denied renomination by their party."
        },
        {
            "id": 21,
            "text": "Pete Buttigieg has joined the race to stop Donald Trump from being re-elected."
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}