{
    "title": "Obama hears the discontent over immigration loud and clear, rebukes heckler",
    "text": [
        {
            "id": 0,
            "text": "Immigrant-rights protesters confronted President Obama on Monday, interrupting his speech in San Francisco and demanding he use executive authority to halt all deportations, but he rebuked them and told them he doesn’t have that kind of power."
        },
        {
            "id": 1,
            "text": "The confrontation is the latest sign of growing tension between Mr. Obama and some on his political left who say he can do more to push the issue of immigration, even as he argues that the roadblock is actually Republicans on Capitol Hill."
        },
        {
            "id": 2,
            "text": "Hours before Mr. Obama’s immigration speech, protesters chained themselves to the gates of a detention center for illegal immigrants in Adelanto, Calif., to call attention to deportations and what the activists said is inhumane treatment of those awaiting removal from the country."
        },
        {
            "id": 3,
            "text": "“You have a power to stop deportation for all undocumented immigrants in this country,” a man, identified by news reports as Ju Hong, shouted from the stage directly behind Mr. Obama, then helped lead a chant of “Stop deportation!”"
        },
        {
            "id": 4,
            "text": "that was taken up by others in the crowd."
        },
        {
            "id": 5,
            "text": "“Actually, I don’t, and that’s why we are here,” Mr. Obama replied."
        },
        {
            "id": 6,
            "text": "As action on immigration has stalled in Congress, Mr. Obama and activists are increasingly at odds over the question of how much authority he does have."
        },
        {
            "id": 7,
            "text": "Mr. Obama raised expectations with his broad policy last year of granting tentative legal status to young illegal immigrants who were brought to the country as children and call themselves “dreamers.”"
        },
        {
            "id": 8,
            "text": "Under Mr. Obama’s policy they have been granted work permits and authorization to remain in the U.S. without fear of deportation."
        },
        {
            "id": 9,
            "text": "Earlier this month, the administration also announced a policy allowing illegal immigrant relatives of U.S. troops and veterans to apply for “parole in place,” which would also exempt them from being removed from the country."
        },
        {
            "id": 10,
            "text": "The activists say those moves show Mr. Obama has authority to stop deportations for most of the estimated 11 million illegal immigrants in the U.S."
        },
        {
            "id": 11,
            "text": "Not so, the president counters."
        },
        {
            "id": 12,
            "text": "“If, in fact, I could solve all these problems without passing the laws in Congress then I would do so."
        },
        {
            "id": 13,
            "text": "But we’re also a nation of laws, that’s part of our tradition,” he said."
        },
        {
            "id": 14,
            "text": "“The easy way out is to try to yell and pretend like I can do something by violating our laws."
        },
        {
            "id": 15,
            "text": "What I’m proposing is the harder path, which is to use our democratic processes to achieve the same goal that you want to achieve.”"
        },
        {
            "id": 16,
            "text": "Security personnel were about to remove the protesters from the event, but Mr. Obama stopped them."
        },
        {
            "id": 17,
            "text": "“These guys don’t need to go."
        },
        {
            "id": 18,
            "text": "Let me finish."
        },
        {
            "id": 19,
            "text": "No, no, he can stay there,” the president said, drawing cheers from the audience for his act."
        },
        {
            "id": 20,
            "text": "Mr. Obama has said his decision to stop deporting young illegal immigrants was an exercise of “prosecutorial discretion.”"
        },
        {
            "id": 21,
            "text": "It’s a power Mr. Obama has flexed repeatedly — including earlier this month when the White House said it wouldn’t enforce part of the new health care law’s requirements that make many existing health plans illegal."
        },
        {
            "id": 22,
            "text": "But in the case of immigration, Mr. Obama has told interviewers that stopping all deportations would go beyond discretion and cross the line into ignoring the law."
        },
        {
            "id": 23,
            "text": "It’s unclear how many people the president has already placed out of reach of deportation."
        },
        {
            "id": 24,
            "text": "The youth exemption alone has been granted to more than 450,000 people as of Aug. 31, which is the most recent data available."
        },
        {
            "id": 25,
            "text": "U.S. Citizenship and Immigration Services had been updating those numbers monthly, but it has been more than two months since the last figures were released."
        },
        {
            "id": 26,
            "text": "Sen. Jeff Sessions, Alabama Republican, said the GOP shouldn’t accept any immigration bill until Mr. Obama rescinds his nondeportation policies and lets immigration agents do their jobs."
        },
        {
            "id": 27,
            "text": "“During his time in office, the president has systematically dismantled interior enforcement, handcuffing immigration officers and bypassing Congress,” Mr. Sessions said."
        },
        {
            "id": 28,
            "text": "“No agreement should be entered into while such lawlessness continues.”"
        },
        {
            "id": 29,
            "text": "Both Mr. Obama and congressional Republicans are facing increasing heat from activists."
        },
        {
            "id": 30,
            "text": "Monday’s detention center blockade was the latest in a string that has included several locations in Arizona, as well as New Orleans, Atlanta and Chicago."
        },
        {
            "id": 31,
            "text": "Meanwhile, protesters have staked out House Speaker John A. Boehner’s house and, last week, some were arrested outside the office of House Majority Leader Eric Cantor."
        },
        {
            "id": 32,
            "text": "Not every protest is as confrontational."
        },
        {
            "id": 33,
            "text": "Activists are maintaining an ongoing prayer fast at a tent on the Mall in the District — an event that drew a nod of approval from Mr. Obama in his speech Monday."
        },
        {
            "id": 34,
            "text": "The president also repeated his new stance that he is willing to accept an immigration deal from Congress that comes in pieces, rather than the broad single bill that passed in the Senate."
        },
        {
            "id": 35,
            "text": "“It’s Thanksgiving — we can carve that bird into multiple pieces,” Mr. Obama said."
        },
        {
            "id": 36,
            "text": "“But as long as all the pieces get done, soon, and we actually deliver on the core values we’ve been talking about for so long, I think everybody is fine with it."
        },
        {
            "id": 37,
            "text": "They’re not worried about the procedures, they just want the result.”"
        },
        {
            "id": 38,
            "text": "Mr. Obama says any final deal must include a pathway to citizenship for illegal immigrants, along with whatever new border security and interior enforcement measures Congress wants."
        },
        {
            "id": 39,
            "text": "Many Republicans, though, argue that border security should come first, and legalization later."
        },
        {
            "id": 40,
            "text": "Many of those Republicans also object to a full special pathway to citizenship, saying that amounts to amnesty."
        },
        {
            "id": 41,
            "text": "Instead of a single bill, House Republicans are working on a series of bills, and Mr. Boehner has said he will not enter into negotiations with the Senate on its massive legislation."
        },
        {
            "id": 42,
            "text": "Mr. Boehner, though, also said last week that he remains committed to getting something done on immigration, and doesn’t consider it a dead issue in this Congress."
        },
        {
            "id": 43,
            "text": "The activists conducting the prayer fast on the Mall urged Mr. Boehner to put that vow into action."
        },
        {
            "id": 44,
            "text": "“It’s time Speaker Boehner and the House of Representatives address America’s moral crisis — a dysfunctional immigration system that has continuously undermined the integrity of our national values and the unity of our families,” the activists said in a statement."
        }
    ]
}