{
    "title": "Mitt Romney: 'I Have Paid Taxes Every Year. A Lot Of Taxes.",
    "text": [
        {
            "id": 0,
            "text": "Mitt Romney insisted on Friday that he has paid taxes every year and repeated that Senate Majority Leader Harry Reid (D-Nev.) needs \"to put up or shut up\" with his accusations that he hasn't."
        },
        {
            "id": 1,
            "text": "\"Let me also say categorically: I have paid taxes every year."
        },
        {
            "id": 2,
            "text": "A lot of taxes."
        },
        {
            "id": 3,
            "text": "A lot of taxes,\" the presumptive GOP presidential nominee told reporters at a press availability after an event in Nevada."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "\"Harry Reid really has to put up or shut up, alright?"
        },
        {
            "id": 6,
            "text": "So Harry, who are your sources?\""
        },
        {
            "id": 7,
            "text": "Romney said, referring to Reid's claim that a Bain Capital investor told him Romney hadn't paid taxes in 10 years."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "\"And by the way Harry, I understand what you're trying to do."
        },
        {
            "id": 10,
            "text": "You're trying to deflect the fact that jobs numbers are bad, that Americans are out of work, and you're trying to throw anything up on the screen that will grab attention away from the fact that the policies of the White House haven't worked,\" Romney continued. \""
        },
        {
            "id": 11,
            "text": "So Harry Reid is simply wrong.\""
        },
        {
            "id": 12,
            "text": "Reid has been going after Romney all week over the candidate's failure to release his tax returns, a standard practice for presidential candidates."
        },
        {
            "id": 13,
            "text": "The Nevada Democrat sparked a firestorm when, earlier this week, he told The Huffington Post that he heard from a Bain Capital investor that Romney hadn't paid taxes for 10 years."
        },
        {
            "id": 14,
            "text": "Romney spokesman Eric Fehrnstrom said Reid's claims were untrue, and Romney himself said Thursday that Reid needs \"to put up or shut up\" and reveal his source at Bain Capital."
        },
        {
            "id": 15,
            "text": "Reid fired back that he got his information from \"an extremely credible source\" and pushed Romney, again, to just release his tax returns."
        },
        {
            "id": 16,
            "text": "Pressed on Friday why he wouldn't just release his tax returns instead of engaging in a back-and-forth with Reid, Romney said people should visit his website to see his financial disclosure statements dating back to 2002 and his 2010 tax return."
        },
        {
            "id": 17,
            "text": "\"Go on the website, you'll be surprised to see the amazing amount of data that's associated with our campaign's disclosure,\" he said."
        },
        {
            "id": 18,
            "text": "Earlier in the day, Reid launched another round of attacks on Romney, this time for \"insulting\" the American public by refusing to release his tax returns."
        },
        {
            "id": 19,
            "text": "\"It's hard to say which is more insulting to Americans' intelligence, Mitt Romney's tax plan or his refusal to show the American people what's in his tax returns,\" Reid said in a statement."
        },
        {
            "id": 20,
            "text": "\"Romney seems to think he's above the basic level of transparency and openness that every presidential candidate has lived up to since his father set the standard in 1968.\""
        },
        {
            "id": 21,
            "text": "\"In short, Romney's message to Nevadans is this: He won't release his taxes, but he wants to raise yours.\""
        },
        {
            "id": 22,
            "text": "Reid signaled Friday that he's not relenting in his attacks."
        },
        {
            "id": 23,
            "text": "He accused Romney of being \"the most secretive presidential candidate since Richard Nixon\" and pointed out that even nominees overseen by the Senate Finance Committee have to produce more tax returns that Romney is willing to release."
        },
        {
            "id": 24,
            "text": "\"Forget about president -- Mitt Romney couldn't get confirmed as a cabinet secretary,\" Reid said."
        },
        {
            "id": 25,
            "text": "\"The contents of the one year of returns he has released would probably be enough to tank his nomination anyway: secret overseas bank accounts in Switzerland and the Cayman Islands, tax avoidance tricks and a lower tax rate than middle-class families pay.\""
        }
    ]
}