{
    "title": "The Governor Of Texas Has Signed A Law That Bans Abortion As Early As 6 Weeks",
    "text": [
        {
            "id": 0,
            "text": "The Governor Of Texas Has Signed A Law That Bans Abortion As Early As 6 Weeks"
        },
        {
            "id": 1,
            "text": "Enlarge this image toggle caption LM Otero/AP LM Otero/AP\n\nTexas Gov. Greg Abbott on Wednesday signed into law a bill that bans abortion the moment a fetal heartbeat has been detected, a move that makes Texas the largest state in the nation to outlaw abortion so early in a pregnancy."
        },
        {
            "id": 2,
            "text": "The Texas law effectively prohibits any abortion after around six weeks of pregnancy — before many women are even aware they are pregnant."
        },
        {
            "id": 3,
            "text": "The bill, which takes effect in September, makes no exception for pregnancies that are the result of rape or incest but does include a rare provision that allows individual citizens to sue anyone they believe may have been involved in helping a pregnant individual violate the ban."
        },
        {
            "id": 4,
            "text": "The provision cannot be used against pregnant people, but reproductive rights advocates warn it can be used to target abortion providers and abortion-rights activists."
        },
        {
            "id": 5,
            "text": "The use of lawsuits by private citizens may make the measure harder for abortion providers to fight, NPR member station KUT reported."
        },
        {
            "id": 6,
            "text": "Amy Hagstrom Miller, president and CEO of Whole Woman's Health, said the law will put providers through \"more legal chutes and ladders until we can figure out a strategy to try to block it\" and called it unconstitutional."
        },
        {
            "id": 7,
            "text": "\"Usually, when a state is in charge of enforcing a law, it's more clearcut who can sue to stop the law's enforcement,\" KUT reported."
        },
        {
            "id": 8,
            "text": "\"Since almost anyone can enforce a law with a civil suit, SB 8 could be harder to block.\""
        },
        {
            "id": 9,
            "text": "In a letter to lawmakers last month, a coalition of more than 300 Texas attorneys raised constitutional concerns about the language of the legislation, saying the civil lawsuit provision \"weaponizes the judicial system\" and warning it could subject Texans to harassment and abuse through the legal system."
        },
        {
            "id": 10,
            "text": "During a signing ceremony with anti-abortion-rights activists, Abbott, a Republican, cheered the bill, saying, \"Our creator endowed us with the right to life and yet millions of children lose their right to life every year because of abortion.\""
        },
        {
            "id": 11,
            "text": "\"In Texas, we work to save those lives,\" Abbott said."
        },
        {
            "id": 12,
            "text": "\"And that's exactly what the Texas Legislature did this session.\""
        },
        {
            "id": 13,
            "text": "The new law adds Texas to a growing list of states with conservative leaders that have passed increasingly restrictive abortion laws as part of an effort to challenge the Supreme Court's 1973 Roe v. Wade decision and other U.S. Supreme Court precedent guaranteeing the right to an abortion."
        },
        {
            "id": 14,
            "text": "The latest development on that front came Monday when the high court said it would consider a Mississippi law that bans most abortions after 15 weeks — before what is known as fetal viability."
        },
        {
            "id": 15,
            "text": "The court has previously said states cannot impose an \"undue burden\" on a woman's right to an abortion before viability."
        },
        {
            "id": 16,
            "text": "But with the death of Justice Ruth Bader Ginsburg last year and the confirmation of Justice Amy Coney Barrett, conservatives now hold a 6-3 majority on the court and have begun signaling new willingness to reconsider precedent."
        },
        {
            "id": 17,
            "text": "If the court rules to let the Mississippi law stand, abortion-rights supporters fear, it could create a foundation for even more restrictive measures, including the law in Texas, to stand."
        },
        {
            "id": 18,
            "text": "One of the groups challenging the Mississippi law, the Center for Reproductive Rights, called the Texas measure \"draconian\" and said it was \"currently considering all legal options\" to prevent it from taking effect."
        },
        {
            "id": 19,
            "text": "\"Texas is inviting anti-abortion protestors to police abortion clinics and harass providers, even though the state knows that these kind of bans are unconstitutional,\" said Elisabeth Smith, the center's chief counsel of state policy and advocacy, in a statement."
        },
        {
            "id": 20,
            "text": "\"The goal of this law is to saddle doctors and clinics with so many lawsuits that they have no resources left to stay open.\""
        },
        {
            "id": 21,
            "text": "Texas currently bans abortion after 20 weeks, but in the early months of the pandemic the state moved to ban the procedure in almost all cases in what the governor described as an effort to preserve medical supplies and resources."
        },
        {
            "id": 22,
            "text": "The move resulted in states across the Southwest reporting an influx of patients from Texas until the Supreme Court in January vacated a pair of lower court rulings upholding the ban."
        },
        {
            "id": 23,
            "text": "More than 56,000 abortions were performed on Texas residents in 2019, according to The Texas Tribune, most of them in the first trimester."
        },
        {
            "id": 24,
            "text": "In a statement, Texas Right to Life praised the new law as a \"landmark victory\" and a \"vital step in the road to abolishing all abortions in Texas.\""
        },
        {
            "id": 25,
            "text": "Planned Parenthood Texas Votes and the Planned Parenthood Action Fund released a statement condemning the law as \"dangerous\" and among the \"harshest abortion bans in the country.\""
        }
    ]
}