{
    "title": "Debt limit chaos awaits Paul Ryan as he seeks House speakership",
    "text": [
        {
            "id": 0,
            "text": "The stars may be aligning for Paul Ryan to clinch the speakership later this week -- but if he wins, he'll likely immediately be tested by a debt limit crisis for which Congress appears to have no solution."
        },
        {
            "id": 1,
            "text": "House lawmakers are mostly mum on what the plan may be to address the Nov. 3 deadline to raise the federal borrowing limit."
        },
        {
            "id": 2,
            "text": "Without a vote to raise it, the U.S. government could be unable to pay all its bills, threatening benefit payments and agency operations and raising prospect of an unprecedented government default."
        },
        {
            "id": 3,
            "text": "At the same time, the routine raising of the debt ceiling -- this time, past an $18.1 trillion mark -- has outraged fiscal hawks worried that the government borrowing is unsustainable."
        },
        {
            "id": 4,
            "text": "Since President Obama took office, the national debt has increased nearly $8 trillion."
        },
        {
            "id": 5,
            "text": "While the debt ceiling has presented a recurring crisis on Capitol Hill, this time there does not appear to be even a roadmap for raising it, for now."
        },
        {
            "id": 6,
            "text": "Republicans once again are demanding budget cuts as part of any deal, but House Democratic Leader Nancy Pelosi and the White House are insisting on a \"clean\" measure without strings attached."
        },
        {
            "id": 7,
            "text": "Conservative groups are putting pressure on allies in Congress not to give in."
        },
        {
            "id": 8,
            "text": "\"If Congress doesn't use the power of the purse, we don't need a Congress and we just have an executive with no check,\" Michael Needham, CEO of Heritage Action for America, told \"Fox News Sunday.\""
        },
        {
            "id": 9,
            "text": "Needham said he thinks Ryan \"wants to use that leverage\" that comes with the debt ceiling deadline."
        },
        {
            "id": 10,
            "text": "Secret-ballot GOP elections are set for Wednesday in the vote for speaker, followed by a full House vote Thursday."
        },
        {
            "id": 11,
            "text": "Rep. Ryan, R-Wis., appears to have the lion's share of support from all wings of the Republican conference."
        },
        {
            "id": 12,
            "text": "But he would arrive at a particularly tumultuous time, even by House standards."
        },
        {
            "id": 13,
            "text": "Aside from the debt limit deadline, crucial highway funding authority is about to expire, requiring a short-term extension that no one supports."
        },
        {
            "id": 14,
            "text": "And early December will bring the next chapter in the battle over partial government shutdowns, with a must-pass deadline for spending legislation a ripe opportunity for brinkmanship."
        },
        {
            "id": 15,
            "text": "Now Ryan, the GOP's 2012 vice presidential nominee, will face immediate -- and perhaps competing -- tasks: passing must-do debt and spending bills likely to be opposed by a majority of Republicans, even while he attempts to unite a badly fractured House GOP."
        },
        {
            "id": 16,
            "text": "But conservative Republicans suggest Ryan could get leeway for how he navigates the immediate crises he inherits, including the debt ceiling, if it's not dealt with before he assumes the speakership."
        },
        {
            "id": 17,
            "text": "\"If we get six months down the road and nothing's really changed, if we get eight months down the road and nothing's really changed, then I think it's, `Everybody needs to get a helmet' time,' \" said GOP Rep. Mark Amodei of Nevada."
        },
        {
            "id": 18,
            "text": "\"There's a reason John Boehner decided to resign.\""
        },
        {
            "id": 19,
            "text": "After announcing his surprise plans last month to leave Congress on Oct. 30, House Speaker Boehner expressed a desire to \"clean the barn\" of messy must-pass legislation, rather than leave it for his successor."
        },
        {
            "id": 20,
            "text": "The debt limit was at the top of the list, given the impending deadline and the reluctance of most Republicans to pass an increase without accompanying spending cuts the White House is ruling out."
        },
        {
            "id": 21,
            "text": "But Boehner has yet to announce his approach, after leadership backtracked on tentative plans to get the ball rolling with legislation linking a debt limit increase to deep spending cuts and a balanced budget plan."
        },
        {
            "id": 22,
            "text": "That bill faced certain rejection in the Senate, and partly as a result was looking short of votes among House Republicans."
        },
        {
            "id": 23,
            "text": "Now, though GOP leaders won't yet say so, it may be that the House will end up voting on a \"clean\" debt ceiling increase devoid of spending cuts or other attempts at reform."
        },
        {
            "id": 24,
            "text": "Such legislation would pass with almost entirely Democratic votes."
        },
        {
            "id": 25,
            "text": "As of now GOP leaders are claiming they may not even be able to muster the 30-odd Republicans who would be needed to get it through."
        },
        {
            "id": 26,
            "text": "It's a situation certain to provoke howls from the GOP base, especially if it ends up being the first item on a newly installed Speaker Ryan's to-do list."
        },
        {
            "id": 27,
            "text": ""
        }
    ]
}