{
    "title": "Why Donald Trump Declaring Himself A ‘Nationalist’ Is So Loaded",
    "text": [
        {
            "id": 0,
            "text": "In one of the more jarring moments from President Donald Trump’s campaign rally Monday night, he proudly declared himself a nationalist."
        },
        {
            "id": 1,
            "text": "“It’s called a nationalist,” Trump said during his Houston rally when rebuking globalist foreign policy."
        },
        {
            "id": 2,
            "text": "“And I say, really, we’re not supposed to use that word."
        },
        {
            "id": 3,
            "text": "You know what I am?"
        },
        {
            "id": 4,
            "text": "I’m a nationalist, OK?"
        },
        {
            "id": 5,
            "text": "I’m a nationalist.”"
        },
        {
            "id": 6,
            "text": "It’s clear he knows the word is loaded."
        },
        {
            "id": 7,
            "text": "In its mildest implication, Merriam-Webster defines it as a belief system “placing primary emphasis on promotion of its culture and interests as opposed to those of other nations.”"
        },
        {
            "id": 8,
            "text": "But it’s been prominently used by white supremacists in recent years to emphasize that some countries or regions should be defined by a white racial identity ― a trend Trump is well aware of given the rise of news about the ideology during his presidency."
        },
        {
            "id": 9,
            "text": "Words matter, and any world leader should face a high standard for the connotations of the ones they use."
        },
        {
            "id": 10,
            "text": "Trump, perhaps, should be especially scrutinized for language around the issue of white nationalism given his past run-ins with it."
        },
        {
            "id": 11,
            "text": "Here’s a look back on some of the most notable instances."
        },
        {
            "id": 12,
            "text": "He wanted more immigrants from ‘places like Norway’ and fewer from less white ‘shithole countries’"
        },
        {
            "id": 13,
            "text": "In a meeting with lawmakers in the Oval Office in January 2018, Trump argued against restoring protections for immigrants from Haiti and African nations, describing them as “shithole countries,” sources told The Washington Post and NBC News."
        },
        {
            "id": 14,
            "text": "ASSOCIATED PRESS"
        },
        {
            "id": 15,
            "text": "\"You know what I am?"
        },
        {
            "id": 16,
            "text": "I’m a nationalist, OK?"
        },
        {
            "id": 17,
            "text": "I’m a nationalist,\" Trump said during his Houston rally ahead of the 2018 midterm elections."
        },
        {
            "id": 18,
            "text": "“Why are we having all these people from shithole countries come here?”"
        },
        {
            "id": 19,
            "text": "the president reportedly said."
        },
        {
            "id": 20,
            "text": "“We should have more people from places like Norway.”"
        },
        {
            "id": 21,
            "text": "“Certain Washington politicians choose to fight for foreign countries, but President Trump will always fight for the American people,” White House principal deputy press secretary Raj Shah said in a statement later that day."
        },
        {
            "id": 22,
            "text": "The following day, Trump claimed on Twitter that he hadn’t used those specific words, but Sen. Dick Durbin (D-Ill.) ― who was in the room at the time ― swiftly contradicted him, saying that the president had in fact “said these hate-filled things and he said them repeatedly.”"
        },
        {
            "id": 23,
            "text": "He took more than 48 hours to denounce the white supremacist violence in Charlottesville, Virginia"
        },
        {
            "id": 24,
            "text": "Trump came under fire in August 2017 for his response to a white supremacist rally in Charlottesville, Virginia, that left one counterprotester dead."
        },
        {
            "id": 25,
            "text": "The day of the rally, Trump said he condemned the “egregious display of hatred, bigotry and violence on many sides,” without specifically mentioning the white supremacists who organized the rally and the one who ran over a woman with his car."
        },
        {
            "id": 26,
            "text": "“The president’s remarks were morally frustrating and disappointing,” former NAACP president Cornell Brooks said at the time."
        },
        {
            "id": 27,
            "text": "“While it is good that he says he wants to be a president for all the people and he wants to make America great for all of the people, let us know this: Throughout his remarks he refused to” call out white supremacists by name."
        },
        {
            "id": 28,
            "text": "Evelyn Hockstein / The Washington Post via Getty Images White nationalists and white supremacists carrying torches march through the University of Virginia campus on Aug. 11, 2017."
        },
        {
            "id": 29,
            "text": "Then, more than 48 hours after the rally, after dozens of lawmakers on both sides of the aisle and even the maker of the torches used at the rally firmly denounced the white supremacists by name, Trump finally issued a firmer condemnation."
        },
        {
            "id": 30,
            "text": "“Racism is evil, and those who cause violence in its name are criminals and thugs, including the KKK, Neo-Nazis, white supremacists and other hate groups that are repugnant to everything we hold dear as Americans,” he said following the immense public pressure."
        },
        {
            "id": 31,
            "text": "Advertisement"
        },
        {
            "id": 32,
            "text": "He refused to immediately condemn the white supremacists who advocated for him"
        },
        {
            "id": 33,
            "text": "Trump’s response to the Charlottesville chaos wasn’t the first time he appeared hesitant to condemn white supremacists."
        },
        {
            "id": 34,
            "text": "Three times in a row on Feb. 28, 2016, Trump sidestepped opportunities to renounce white nationalist and former KKK leader David Duke, who’d recently told his radio audience that voting for any candidate other than Trump would be “treason to your heritage.”"
        },
        {
            "id": 35,
            "text": "When asked by CNN’s Jake Tapper if he would condemn Duke and say he didn’t want a vote from him or any other white supremacists, Trump claimed that he didn’t know anything about white supremacists or about Duke himself."
        },
        {
            "id": 36,
            "text": "When Tapper pressed him twice more, Trump said he couldn’t condemn a group he hadn’t yet researched."
        },
        {
            "id": 37,
            "text": "By Feb. 29, Trump was saying that in fact he did disavow Duke, and that the only reason he didn’t do so on CNN was because of a “lousy earpiece.”"
        },
        {
            "id": 38,
            "text": "Video of the exchange, however, shows Trump responding quickly to Tapper’s questions with no apparent difficulty in hearing."
        },
        {
            "id": 39,
            "text": "The Independent Former KKK leader David Duke, whom Trump long refused to renounce in the lead-up to his election."
        },
        {
            "id": 40,
            "text": "It’s preposterous to think that Trump didn’t know about white supremacist groups or their sometimes violent support of him."
        },
        {
            "id": 41,
            "text": "Reports of neo-Nazi groups rallying around Trump go back as far as August 2015."
        },
        {
            "id": 42,
            "text": "His white supremacist fan club includes The Daily Stormer, a leading neo-Nazi news site; Richard Spencer, director of the National Policy Institute, which aims to promote the “heritage, identity, and future of European people”; Jared Taylor, editor of American Renaissance, a Virginia-based white nationalist magazine; Michael Hill, head of the League of the South, an Alabama-based white supremacist secessionist group; and Brad Griffin, a member of Hill’s League of the South and author of the popular white supremacist blog Hunter Wallace."
        },
        {
            "id": 43,
            "text": "A leader of the Virginia KKK who backed Trump told a local TV reporter in May 2016, “The reason a lot of Klan members like Donald Trump is because a lot of what he believes, we believe in.”"
        },
        {
            "id": 44,
            "text": "Later that month, the Trump campaign announced that one of its California primary delegates was William Johnson, chair of the white nationalist American Freedom Party."
        },
        {
            "id": 45,
            "text": "The Trump campaign subsequently said his inclusion was a mistake, and Johnson withdrew his name at their request."
        },
        {
            "id": 46,
            "text": "After the election, Spencer’s National Policy Institute held a celebratory gathering in Washington, D.C."
        },
        {
            "id": 47,
            "text": "A video shows many of the white nationalists assembled there doing the Nazi salute after Spencer declared, “Hail Trump, hail our people, hail victory!”"
        },
        {
            "id": 48,
            "text": "Portions of this story have been adapted from a continually updated HuffPost article by Lydia O’Connor and Daniel Marans, “Trump Condemned Racism As ‘Evil.’"
        },
        {
            "id": 49,
            "text": "Here Are 20 Times He Embraced It.”"
        }
    ]
}