{
    "title": "'Angered' Shinseki to speak but say little about growing VA scandal",
    "text": [
        {
            "id": 0,
            "text": "Story highlights CNN has obtained prepared congressional testimony by Eric Shinseki"
        },
        {
            "id": 1,
            "text": "The Veterans Affairs secretary is scheduled to testify to a Senate panel Thursday His statements reflect concern but offer no specifics in the response to VA scandal Since November, CNN has uncovered delays in care at VA facilities across the country\n\nWashington CNN —\n\nUnder fire after veterans died waiting for appointments at VA hospitals, Veteran Affairs Secretary Eric Shinseki will say Thursday that he is “angered and saddened” but won’t be providing much detail about how his department is correcting the problems, according to prepared congressional testimony obtained by CNN."
        },
        {
            "id": 2,
            "text": "In fact, Shinseki, who is scheduled to testify in front of the Senate Veterans Affairs Committee on Thursday, won’t even acknowledge that there are problems."
        },
        {
            "id": 3,
            "text": "Finally, Senate and vets to hear from Shinseki on growing scandal"
        },
        {
            "id": 4,
            "text": "According to the written testimony, Shinseki will say the VA Inspector General’s Office, which has launched an independent investigation, has advised the department not to provide information that could compromise their inquiry."
        },
        {
            "id": 5,
            "text": "“I am personally angered and saddened by any adverse consequence that a veteran might experience while in, or as a result of, our care,” he says in the prepared testimony."
        },
        {
            "id": 6,
            "text": "Last month, CNN revealed that at least 40 veterans died waiting for appointments at the Phoenix Veterans Affairs Health Care system, according to sources inside the hospital and a doctor who worked there."
        },
        {
            "id": 7,
            "text": "Many of those veterans were placed on a secret waiting list, the sources said."
        },
        {
            "id": 8,
            "text": "A fatal wait: Veterans languish and die on a VA hospital’s secret list"
        },
        {
            "id": 9,
            "text": "Since November, CNN has uncovered delays in care at VA facilities across the country where numerous VA staffers have stepped forward to allege dangerously long wait times and efforts by VA officials to cover them up."
        },
        {
            "id": 10,
            "text": "The VA has previously admitted that 23 veterans passed away because of delays, and 53 others had adverse health effects at VA facilities across the country."
        },
        {
            "id": 11,
            "text": "Sources now tell CNN the Office of Inspector General is investigating in six states, including Arizona."
        },
        {
            "id": 12,
            "text": "“In response to allegations about scheduling and delays at the Phoenix VA,” Shinseki will say according to the testimony, “I invited an independent investigation by the VA Office of Inspector General (OIG) to conduct a comprehensive, thorough and timely review."
        },
        {
            "id": 13,
            "text": "“If these allegations are true, they are completely unacceptable – to veterans, to me and to our dedicated VHA employees,” Shinseki says in the prepared testimony."
        },
        {
            "id": 14,
            "text": "“If they are substantiated by OIG, responsible and timely action will be taken.”"
        },
        {
            "id": 15,
            "text": "Shinseki also said that he has placed three employees, including two senior executives, on administrative leave at the request of the Inspector General’s office."
        },
        {
            "id": 16,
            "text": "Shinseki will also tell lawmakers that he has directed the Veterans Health Administration to “complete a nationwide access review,” according to the testimony."
        },
        {
            "id": 17,
            "text": "President Barack Obama has appointed Rob Nabors, his deputy chief of staff, to assist Veterans Affairs officials conduct the review."
        },
        {
            "id": 18,
            "text": "“America has a sacred trust with the men and women who serve our country in uniform – one that continues when they come home – and we must do everything to keep that trust,” Obama said in a statement Wednesday."
        },
        {
            "id": 19,
            "text": "The inspector general’s investigation and access review, along with the administrative leave, have all been previously made public."
        },
        {
            "id": 20,
            "text": "Two VA employees in North Carolina on leave\n\nScheduler in Texas claims waits for appointments were covered up"
        },
        {
            "id": 21,
            "text": "November:"
        },
        {
            "id": 22,
            "text": "A dire situation in South Carolina"
        }
    ]
}