{
    "title": "Barr Appoints Prosecutor To Investigate Start Of Russia Probe: Reports",
    "text": [
        {
            "id": 0,
            "text": "Attorney General William Barr has ordered a federal prosecutor to investigate the inception of the Russia probe, according to multiple media accounts."
        },
        {
            "id": 1,
            "text": "John Durham, the U.S. attorney in Connecticut, has been appointed to oversee the inquiry, The New York Times first reported."
        },
        {
            "id": 2,
            "text": "The effort will focus heavily on intelligence collection methods used by investigators during the early days of special counsel Robert Mueller’s efforts, per The Associated Press."
        },
        {
            "id": 3,
            "text": "The appointment has long been demanded by President Donald Trump, who has continued to attack the Russia investigation as a “witch hunt,” even after Mueller’s report was delivered to the Justice Department last month."
        },
        {
            "id": 4,
            "text": "While the report found no evidence of criminal collusion between Russia and the Trump campaign, the special counsel highlighted 10 instances of potential obstruction of justice by the president."
        },
        {
            "id": 5,
            "text": "Trump has falsely championed himself as exonerated and has pushed far more aggressively for the new investigation since the Mueller report was completed."
        },
        {
            "id": 6,
            "text": "Barr used his congressional testimony last month to tell lawmakers he believed “spying did occur” during the 2016 election cycle against then-candidate Donald Trump, effectively undercutting his own department."
        },
        {
            "id": 7,
            "text": "“I think spying on a political campaign is a big deal,” Barr, who was confirmed to lead the DOJ in February, said during testimony to the Senate Appropriations Committee."
        },
        {
            "id": 8,
            "text": "“I think spying did occur."
        },
        {
            "id": 9,
            "text": "But the question is whether it was ... adequately predicated."
        },
        {
            "id": 10,
            "text": "I’m not suggesting it wasn’t predicated."
        },
        {
            "id": 11,
            "text": "I need to explore that.”"
        },
        {
            "id": 12,
            "text": "There is no public evidence that there was any spying on the Trump campaign, but the president has raised the specter of such things many times in an effort to attack both the FBI and the broader Justice Department."
        },
        {
            "id": 13,
            "text": "FBI Director Christopher Wray defended his agency last week, saying the work done by bureau agents was not “spying.”"
        },
        {
            "id": 14,
            "text": "The FBI did obtain a secret surveillance warrant to monitor Carter Page, a former Trump campaign adviser, after he left the campaign."
        },
        {
            "id": 15,
            "text": "The Times notes that Durham, the top law enforcement official in Connecticut, was nominated by Trump in 2017 and has worked at the DOJ since 1982."
        },
        {
            "id": 16,
            "text": "He has a history of investigating claims of wrongdoing by national security officials, including those who worked for the FBI and the CIA."
        }
    ]
}