{
    "title": "Obama could be impeached, White House aide says",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON --"
        },
        {
            "id": 1,
            "text": "A top aide to President Obama said it's possible that Obama could be impeached by the Republican-controlled House of Representatives."
        },
        {
            "id": 2,
            "text": "House Speaker John Boehner's decision to proceed with a lawsuit against the president has \"opened the door\" to the third presidential impeachment in the nation's history, Senior Adviser Dan Pfeiffer told reporters at a Friday breakfast sponsored by the Christian Science Monitor."
        },
        {
            "id": 3,
            "text": "\"Impeachment is a very serious thing that has been bandied about by the recent Republican vice presidential nominee and others in a very un-serious way,\" he said, referring to former Alaska governor Sarah Palin."
        },
        {
            "id": 4,
            "text": "\"We take it very seriously and I don't think it would be a good thing.\""
        },
        {
            "id": 5,
            "text": "Pfeiffer was quick to add that \"no one has alleged anything that is even six universes from what is generally considered\" to be an impeachable offense."
        },
        {
            "id": 6,
            "text": "Boehner has dismissed calls for Obama to be impeached."
        },
        {
            "id": 7,
            "text": "His spokesman, Michael Steel, called Pfeiffer's comments \"a fundraising exercise for Democrats.\"\n\n\"We have a humanitarian crisis at our border, and the White House is making matters worse with inattention and mixed signals,\" Steel said."
        },
        {
            "id": 8,
            "text": "\"It is telling, and sad, that a senior White House official is focused on political games, rather than helping these kids and securing the border.\""
        },
        {
            "id": 9,
            "text": "Later, White House Press Secretary Josh Earnest said \"prominent voices in the Republican party\" have called for impeachment, but was hard-pressed to name one other than Palin."
        },
        {
            "id": 10,
            "text": "\"I think there are some Republicans, including some Republicans that are running for office, hoping that they can get into office so they can impeach the president,\" he said."
        },
        {
            "id": 11,
            "text": "A CNN/ORC poll released Friday shows 35% of Americans favor impeachment, which is about the same support for efforts to impeach Presidents Clinton and George W. Bush."
        },
        {
            "id": 12,
            "text": "Pfeiffer noted that a majority of Republicans -- 57% -- favor impeaching Obama."
        },
        {
            "id": 13,
            "text": "Impeachment is the bringing of charges against a president or federal judge by the House of Representatives."
        },
        {
            "id": 14,
            "text": "A president can only be removed after a trial on those charges by the Senate."
        },
        {
            "id": 15,
            "text": "Boehner has chosen a less drastic approach with a plan to sue Obama over his decision to delay enforcement of a provision in the Affordable Care Act requiring employers to provide health insurance."
        },
        {
            "id": 16,
            "text": "That plan passed the House Rules Committee Thursday, clearing the way for a vote on the House floor."
        },
        {
            "id": 17,
            "text": "Pfeiffer said the lawsuit won't have an impact on how the president uses his executive authority."
        },
        {
            "id": 18,
            "text": "In fact, he said, the threat of lawsuits validates that Obama's executive actions are \"far from the small ball that some have accused it of being.\""
        },
        {
            "id": 19,
            "text": ""
        }
    ]
}