{
    "title": "Republican senators warn Iran in open letter",
    "text": [
        {
            "id": 0,
            "text": "Republican senators want to give Iranian leaders — and the president — a refresher on the constitutional balance of power."
        },
        {
            "id": 1,
            "text": "In a highly unusual move, a group of 47 Republicans in the upper chamber has written to Iran’s top leaders to let them know that any nuclear deal they reach with the United States would be “nothing more than an executive agreement.”"
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "Freshman Sen. Tom Cotton (R-Ark.) organized the letter, which features signatures from top Republican Senate leadership and potential presidential candidates such as Sens. Marco Rubio of Florida, Ted Cruz of Texas and Rand Paul of Kentucky."
        },
        {
            "id": 4,
            "text": "The following Republican senators did not sign the bill: Lamar Alexander of Tennessee, Dan Coats of Indiana, Thad Cochran of Mississippi, Susan Collins of Maine, Bob Corker of Tennessee, Jeff Flake of Arizona and Lisa Murkowski of Alaska."
        },
        {
            "id": 5,
            "text": "Democrats blasted the letter, with Minority Whip Dick Durbin calling it a “cynical effort” that lays bare partisan rancor for the world to see."
        },
        {
            "id": 6,
            "text": "“Understand that if these negotiations fail, a military response to Iran developing their nuclear capability becomes more likely,” Durbin (D-Ill.) said in a written statement."
        },
        {
            "id": 7,
            "text": "“These Republican Senators should think twice about whether their political stunt is worth the threat of another war in the Middle East.”"
        },
        {
            "id": 8,
            "text": "Responding to the missive on Monday, White House press secretary Josh Earnest told reporters that “writing a letter like this that appeals to the hardliners in Iran is frankly just the latest in an ongoing [Republican] strategy – a partisan strategy – to interfere” in foreign policy."
        },
        {
            "id": 9,
            "text": "And California Rep. Adam Schiff, the ranking Democrat on the House Intelligence Committee, called the letter is “deeply irresponsible.”"
        },
        {
            "id": 10,
            "text": "“We are so far beyond politics ending at the water’s edge,” Schiff said on MSNBC’s “Andrea Mitchell Reports.”"
        },
        {
            "id": 11,
            "text": "“And on an issue of this seminal importance while sensitive negotiations are going forward, for these senators to interfere in this way, it’s really unthinkable."
        },
        {
            "id": 12,
            "text": "And it just shows how the political process has degenerated that these senators would take such a step.”"
        },
        {
            "id": 13,
            "text": "In an appearance on “Fox and Friends” earlier Monday morning, Cotton said Iran is a greater threat to the United States than the Islamic State of Iraq and the Levant and welcomed any Democrats or potential presidential candidates to sign the letter."
        },
        {
            "id": 14,
            "text": "“I’d encourage Hillary Clinton to join us,” he said."
        },
        {
            "id": 15,
            "text": "The letter, first reported by Bloomberg View columnist Josh Rogin, is meant to turn up the heat on President Barack Obama to give Congress some power over the nuclear negotiations."
        },
        {
            "id": 16,
            "text": "“It has come to our attention while observing your nuclear negotiations with our government that you may not fully understand our constitutional system."
        },
        {
            "id": 17,
            "text": "Thus, we are writing to bring to your attention two features of our Constitution—the power to make binding international agreements and the different character of federal offices—which you should seriously consider as negotiations progress,” the senators wrote."
        },
        {
            "id": 18,
            "text": "“Anything not approved by Congress is a mere executive agreement.”"
        },
        {
            "id": 19,
            "text": "Negotiators could soon reach a framework agreement, but not before the March 24 congressional deadline, POLITICO has reported."
        },
        {
            "id": 20,
            "text": "The senators also wrote to inform the Iranian regime that Obama will be in office only until 2017, at which time any nuclear agreement could change."
        },
        {
            "id": 21,
            "text": "“The next president could revoke such an executive agreement with the stroke of a pen and future Congresses could modify the terms of the agreement at any time,” they wrote."
        }
    ]
}