{
    "title": "Lawmakers divided over arming rebels in Syria",
    "text": [
        {
            "id": 0,
            "text": "Lawmakers had varying opinions Sunday on whether the United States should supply Syrian rebel forces with weapons now that the situation has escalated with Syria accusing Israel, a close U.S. ally, of launching rockets into the country."
        },
        {
            "id": 1,
            "text": "While some argued President Barack Obama should continue weighing his options, others, like Sen. John McCain, said the U.S. should have intervened militarily a long time ago."
        },
        {
            "id": 2,
            "text": "\"The whole situation is becoming more and more expansive, and unfortunately, the red line that the president of the United States had written was apparently written in disappearing ink,\" McCain, an Arizona Republican, said on Fox News."
        },
        {
            "id": 3,
            "text": "The Obama administration recently said there was evidence that chemical weapons had been used in Syria."
        },
        {
            "id": 4,
            "text": "Obama had previously said such action would cross a \"red line.\""
        },
        {
            "id": 5,
            "text": "The president, however, has since said he wants to make sure the United States has all the facts before taking any action."
        },
        {
            "id": 6,
            "text": "\"Unlike the president of the United States, (Israel) saw a red line, and they acted,\" McCain told reporters later Sunday."
        },
        {
            "id": 7,
            "text": "\"Unfortunately, this president, President Obama will not act, and that's a tragedy because the massacre goes on and the use of heavier and heavier weapons and more massacres are taking place of the Syrian people.\""
        },
        {
            "id": 8,
            "text": "He suggested the United States establish a \"safe zone\" in Syria, take out the government's air assets - \"which we can do from long range-no American boots on the ground\" - and supply the rebel forces with the weapons they need."
        },
        {
            "id": 9,
            "text": "McCain has long been pressing the Obama administration to further intervene in the civil war in Syria, where, the United Nations estimated, 70,000 people have been killed since the conflict flared in March 2011."
        },
        {
            "id": 10,
            "text": "But Rep. Peter King, former chairman of the House Homeland Security Committee, said handing over weapons to the rebel forces might be \"counterproductive,\" arguing they could end up in the wrong hands."
        },
        {
            "id": 11,
            "text": "\"Unfortunately, to a large extent, al Qaeda elements have a lot of control within the rebel movements."
        },
        {
            "id": 12,
            "text": "My concern is that, by arming the rebels, we could be strengthening al Qaeda,\" King, R-New York, said on CNN's State of the Union."
        },
        {
            "id": 13,
            "text": "\"If we are going to arm the rebels, we have to make sure that those arms are not going to end up in the possession of al Qaeda supporters, nor at the end game is al Qaeda going to be in a position to take over this movement,\" he added."
        },
        {
            "id": 14,
            "text": "Sen. Pat Leahy, D-Vermont, agreed that some of the groups include radical elements."
        },
        {
            "id": 15,
            "text": ""
        },
        {
            "id": 16,
            "text": "\"And we've seen like in Libya and Egypt and elsewhere the Islamists tend to get the upper hand if they get in there,\" he said on NBC's \"Meet the Press.\""
        },
        {
            "id": 17,
            "text": "But he added the United States has already showed support in the Syria conflict by giving hundreds of millions of dollars in refugee aid and anti-aircraft equipment to Turkey."
        },
        {
            "id": 18,
            "text": "Supplying weapons may be the next step, he said."
        },
        {
            "id": 19,
            "text": ""
        },
        {
            "id": 20,
            "text": "\"The idea of getting weapons in, if we know the right people to get them, my guess is, we'll give them to them,\" he said."
        },
        {
            "id": 21,
            "text": "Rep. Tom Cotton, a veteran of the wars in Iraq and Afghanistan, felt more strongly, saying arming the rebels is \"something that should have been done months ago.\""
        },
        {
            "id": 22,
            "text": "\"We have to arm the opposition."
        },
        {
            "id": 23,
            "text": "I think we also need to move towards imposing a no-fly zone so Bashar al-Assad cannot continue to use helicopter gunships against civilians,\" Cotton, R-Arkansas, said on NBC."
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": "\"And so his refugees - so the refugees he's creating aren't destabilizing our allies like Jordan.\""
        },
        {
            "id": 26,
            "text": "Rep. Mike Rogers, chairman of the House Intelligence Committee, said \"we're going to have to play for the best worst option at this point.\""
        },
        {
            "id": 27,
            "text": "\"That's the bad news."
        },
        {
            "id": 28,
            "text": "We've waited such a long time."
        },
        {
            "id": 29,
            "text": "Our Arab League partners are already in Syria and trying to provide help to the opposition,\" he said on CBS' \"Face the Nation.\""
        },
        {
            "id": 30,
            "text": "Rogers, R-Michigan, said the U.S. could \"be hugely helpful\" in bringing down the Assad government by providing intelligence and training – but not boots on the ground."
        },
        {
            "id": 31,
            "text": "Rep. Dutch Ruppersberger, ranking member of the House Intelligence Committee, stood by Obama, saying he agrees with the president in waiting until \"we have all the facts\" and that any further efforts should be made with other countries."
        },
        {
            "id": 32,
            "text": "\"We can't be the sheriff for the whole world."
        },
        {
            "id": 33,
            "text": "We have our own issues right now - Iraq, Afghanistan, we have a sequestration, those types of issues."
        },
        {
            "id": 34,
            "text": "So when we move and make the move to go in, we have to do it with a coalition, the Arab coalition, the other countries in the area,\" Ruppersberger, D-Maryland, said on CBS."
        },
        {
            "id": 35,
            "text": "White House deputy press secretary Josh Earnest told reporters on Air Force One Sunday that the president feels \"that the Israelis are justifiably concerned about the threat posed by Hezbollah obtaining these advanced weapon systems."
        },
        {
            "id": 36,
            "text": "And the president many times has talked about his view that Israel, as a sovereign government, has the right to take the actions they feel are necessary to protect their people.\""
        }
    ]
}