{
    "title": "Trump says US moving forward on additional sanctions on Iran, willing to help 'make Iran great again'",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The House Budget Committee is expected to advance Democrats $3.5 trillion social spending plan during a rare Saturday session, setting it up for a full floor vote next week."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "A timeline of all the ways Trump tried to steal 2020 election\n\nWashington CNN —\n\nPresident Donald Trump says the United States is putting additional sanctions on Iran and that he would support a course of action to “make Iran great again” should Tehran agree to a nuclear weapons ban."
        },
        {
            "id": 4,
            "text": "“We’re putting additional sanctions on, they’re going on slowly and, in some cases, pretty rapidly, but additional sanctions are being put on Iran,” the President told reporters on the South Lawn Saturday before departing to Camp David."
        },
        {
            "id": 5,
            "text": "“Some of them are already in place,” he added, though he didn’t elaborate further on the details of the sanctions."
        },
        {
            "id": 6,
            "text": "In a tweet later Saturday, Trump specified, “We are putting major additional Sanctions on Iran on Monday.”"
        },
        {
            "id": 7,
            "text": "He told reporters Saturday that he believes further sanctions will drive Iran to the bargaining table with the United States, calling Iran an “economic mess” that is “going through hell.”"
        },
        {
            "id": 8,
            "text": "“The sanctions have hit them hard – more sanctions are going to be put on them, a lot more,” the President told reporters."
        },
        {
            "id": 9,
            "text": "The President said he is “getting a lot of praise” for his abrupt decision to reverse course and not carry out the Iran strike following the downing of a US drone Thursday."
        },
        {
            "id": 10,
            "text": "Trump said Friday that he called off the attack on Iran – with the US “cocked & loaded”– ten minutes before the strike because he decided there would be too many deaths for a proportionate response to the downing of an American drone."
        },
        {
            "id": 11,
            "text": "Trump attacked the Iran nuclear deal that was negotiated under former President Barack Obama, adding that it was important to him “to start all over” and that “we could have a deal with them very quickly if they wanted to.”"
        },
        {
            "id": 12,
            "text": "“If Iran wants to become a wealthy nation again, become a prosperous nation, we’ll call it, ‘let’s make Iran great again,’” Trump said."
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "“Does that make sense?"
        },
        {
            "id": 15,
            "text": "Make Iran great again, it’s okay with me.”"
        },
        {
            "id": 16,
            "text": "Trump stressed that “all I want is no nuclear weapons,” adding that he knew “a lot about nuclear” and assuring reporters that Iran would not have such weapons."
        },
        {
            "id": 17,
            "text": "“And when they agree to that, they are going to have a wealthy country."
        },
        {
            "id": 18,
            "text": "They’re going to be so happy, and I’m going to be their best friend,” Trump said, cautioning that while he hopes that happens, “it may not.”"
        },
        {
            "id": 19,
            "text": "Trump said Saturday that he will be having meetings and “a series of very well-connected phone calls” at the presidential retreat to discuss Iran."
        },
        {
            "id": 20,
            "text": "The White House has not released who will be involved in these meetings or calls."
        },
        {
            "id": 21,
            "text": "The President said national security adviser John Bolton is “definitely” a “hawk” but that he is listening to his entire team."
        },
        {
            "id": 22,
            "text": "Trump said Bolton has “taken a tough posture,” but he is doing a good job."
        },
        {
            "id": 23,
            "text": "Five White House staffers were seen boarding Marine One with the President, including assistant to the President Dan Scavino."
        },
        {
            "id": 24,
            "text": "The White House said that the President landed at Camp David just after 11 a.m. on Saturday."
        },
        {
            "id": 25,
            "text": "Trump said he will be spending the night at Camp David and returning to the White House “sometime tomorrow.”"
        }
    ]
}