{
    "title": "Esper forces out Navy secretary over disputed SEAL case",
    "text": [
        {
            "id": 0,
            "text": "In a series of tweets, Trump said Esper fired Spencer, and he criticized Spencer both for his handling of the Gallagher case and for other aspects of his performance as Navy secretary."
        },
        {
            "id": 1,
            "text": "“I was not pleased with the way that Navy Seal Eddie Gallagher’s trial was handled by the Navy,” Trump wrote on Twitter."
        },
        {
            "id": 2,
            "text": "“He was treated very badly but, despite this, was completely exonerated on all major charges."
        },
        {
            "id": 3,
            "text": "I then restored Eddie’s rank."
        },
        {
            "id": 4,
            "text": "Likewise, large cost overruns from past administration’s contracting procedures were not addressed to my satisfaction."
        },
        {
            "id": 5,
            "text": "Therefore, Secretary of the Navy Richard Spencer’s services have been terminated by Secretary of Defense Mark Esper.”"
        },
        {
            "id": 6,
            "text": "Trump didn’t specify which contracting issues he meant, but he and Spencer have butted heads over the delivery schedule of the Navy’s next aircraft carrier, the USS Gerald Ford."
        },
        {
            "id": 7,
            "text": "Delays have plagued the carrier’s weapons elevators, and Spencer publicly bet Trump last January that if the problems weren’t resolved by the next time the warship put out to sea, the president could fire him — only for the carrier to conduct sea trials last month with only some of its elevators working."
        },
        {
            "id": 8,
            "text": "Trump’s relationship with his administration’s top Pentagon leaders has been marked by increasing turmoil over the past year, starting with retired Gen. Jim Mattis’ resignation as Defense secretary in December after a presidential order, which was later partly reversed, to pull U.S. troops out of Syria."
        },
        {
            "id": 9,
            "text": "Trump has since gone through three acting Defense secretaries — including, briefly, Spencer — before Esper was confirmed in July."
        },
        {
            "id": 10,
            "text": "On Esper’s watch, Trump has again ordered a pullout from Syria, only to again partially reverse it under pressure from the Pentagon and Congress."
        },
        {
            "id": 11,
            "text": "Sen. Jim Inhofe (R-Okla.), chairman of the Armed Services Committee, said in a statement: “Both Secretary Esper and President Trump deserve to have a leadership team who has their trust and confidence."
        },
        {
            "id": 12,
            "text": "It is no secret that I had my own disagreements with Secretary Spencer over the management of specific Navy programs, and I look forward to receiving and considering a nomination for the next Secretary of the Navy as soon as possible.”"
        },
        {
            "id": 13,
            "text": "Gallagher was acquitted over the summer of murdering a wounded prisoner in Iraq but convicted of posing for a photo with the militant’s body and was demoted."
        },
        {
            "id": 14,
            "text": "Days after Trump restored Gallagher’s rank earlier this month, Navy officials said the top admiral responsible for the SEALs was notifying Gallagher and three of his superior officers that boards were being convened to consider expelling them from the commando unit."
        },
        {
            "id": 15,
            "text": "“I hereby acknowledge my termination as United States Secretary of the Navy, to be effective immediately,” Spencer wrote in a letter to Trump, which was posted on Twitter by CNN."
        },
        {
            "id": 16,
            "text": "Spencer did not refer in the letter to the communications with the White House that the Pentagon cited in its announcement."
        },
        {
            "id": 17,
            "text": "“Unfortunately it has become apparent that … I no longer share the same understanding with the Commander in Chief who appointed me, in regards to the key principle of good order and discipline."
        },
        {
            "id": 18,
            "text": "I cannot in good conscience obey an order that I believe violates the sacred oath I took in the presence of my family, my flag and my faith to support and defend the Constitution of the United States,” he wrote, in an apparent reference to Trump’s direction that the Navy not eject Gallagher from the SEALs."
        },
        {
            "id": 19,
            "text": "After Esper and Joint Chiefs Chairman Gen. Mark Milley spoke with Trump about Gallagher’s case on Friday, Hoffman said, “Secretary Esper learned that Secretary Spencer had previously and privately proposed to the White House — contrary to Spencer’s public position — to restore Gallagher’s rank and allow him to retire with his Trident pin.”"
        },
        {
            "id": 20,
            "text": "Despite asking for Spencer’s resignation over the proposal, though, Esper “has directed that Gallagher retain his Trident pin,” the insignia that marks him as a SEAL, Hoffman said."
        },
        {
            "id": 21,
            "text": "“Eddie Gallagher‘s and his family‘s fervent hope is that this truly is the end of the road and he can go into retirement” as a SEAL, said Timothy Parlatore, Gallagher‘s lawyer."
        },
        {
            "id": 22,
            "text": "Whatever the apparent mismatch between the Pentagon statement and Spencer’s letter, Trump’s unusual intervention in the Gallagher case is at the root of the clash that led to Spencer’s departure, former Navy Secretary Ray Mabus said."
        },
        {
            "id": 23,
            "text": "“This all started with the president."
        },
        {
            "id": 24,
            "text": "We wouldn’t be here if it wasn’t for his actions, and I don’t think you can lose sight of that,” said Mabus, who held the top Navy post in the Obama administration."
        },
        {
            "id": 25,
            "text": "“He undermined good order and discipline."
        },
        {
            "id": 26,
            "text": "He dishonored the SEALs by saying they couldn’t hold a review board."
        },
        {
            "id": 27,
            "text": "So that’s what got us into this mess."
        },
        {
            "id": 28,
            "text": "This is just one more example showing that if you deal with this president, it’s not going to end well.”"
        },
        {
            "id": 29,
            "text": "“It’s typical Trump,” agreed a former senior Defense official who spoke on condition of anonymity to discuss a situation in which the facts are unclear."
        },
        {
            "id": 30,
            "text": "“This is the Trump circus."
        },
        {
            "id": 31,
            "text": "Everything he touches turns into this convoluted process of politics that we’re seeing today over at the Pentagon.”"
        },
        {
            "id": 32,
            "text": "Trump said he will nominate Rear Adm. Kenneth Braithwaite, the ambassador to Norway, to replace Spencer as Navy secretary."
        },
        {
            "id": 33,
            "text": "And Esper will meet Monday morning “to discuss the way ahead” with Chief of Naval Operations Adm. Michael Gilday and the service’s new acting secretary, Thomas Modly, said Hoffman."
        }
    ]
}