{
    "title": "Loretta Lynch, in Confirmation Hearing, Defends Legality of Obama Immigration Action",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "Again and again, Senate Republicans made one thing clear Wednesday: They would not vote to confirm Eric H. Holder Jr. as attorney general."
        },
        {
            "id": 2,
            "text": "They were less passionate, however, about the person they were considering to replace him, Loretta E. Lynch."
        },
        {
            "id": 3,
            "text": "Ms. Lynch had steeled herself for tough questioning from a new Republican-controlled Judiciary Committee, particularly on her views of President Obama’s immigration policy."
        },
        {
            "id": 4,
            "text": "But the questioning was mostly cordial, and, most important, the Republicans on the committee who hold the key to Ms. Lynch’s confirmation — she needs two of their votes to proceed to a vote by the full Senate — showed little opposition."
        },
        {
            "id": 5,
            "text": "Instead, their sharpest criticism during several hours of questioning was reserved for Mr. Holder, who is resigning as attorney general after six years in which he frequently clashed with Republican lawmakers who accused him of politicizing the Justice Department."
        },
        {
            "id": 6,
            "text": "The focus on Mr. Holder, an outspoken liberal voice in the administration who has referred to himself as the president’s “wingman,” allowed Ms. Lynch to parry the most contentious questions and present herself as an independent alternative."
        },
        {
            "id": 7,
            "text": "“You’re not Eric Holder, are you?”"
        },
        {
            "id": 8,
            "text": "asked Senator John Cornyn of Texas, a Republican who allies of Ms. Lynch believe could be persuaded to vote for her confirmation."
        },
        {
            "id": 9,
            "text": "“No, I’m not, sir,” she replied."
        },
        {
            "id": 10,
            "text": "“No one is suggesting that you are, but of course, Attorney General Holder’s record is heavy on our minds now,” Mr. Cornyn responded."
        },
        {
            "id": 11,
            "text": "On the issue of immigration, Ms. Lynch said she found it “reasonable” that the Justice Department had concluded it was lawful for Mr. Obama to unilaterally ease the threat of deportation for millions of unauthorized immigrants."
        },
        {
            "id": 12,
            "text": "Mr. Holder similarly endorsed that view."
        },
        {
            "id": 13,
            "text": "“Certainly, I was not involved in the decision,” Ms. Lynch said, a theme she revisited when asked about Mr. Holder’s decision not to defend a federal ban on same-sex marriage, about a report on state secrets and about a program to target banks that do business with questionable companies."
        },
        {
            "id": 14,
            "text": "“You’ve asked how I will be different from Eric Holder,” Ms. Lynch told Senator Ted Cruz, Republican of Texas."
        },
        {
            "id": 15,
            "text": "“I will be Loretta Lynch.”"
        },
        {
            "id": 16,
            "text": "That could be enough to win her confirmation."
        },
        {
            "id": 17,
            "text": "Senators raised few questions about Ms. Lynch’s own record."
        },
        {
            "id": 18,
            "text": "She has spent nearly all of her career as a federal prosecutor, which has created a long record of casework but few political decisions to scrutinize."
        },
        {
            "id": 19,
            "text": "She began in government as a young lawyer at the United States attorney’s office in Brooklyn and worked her way into senior management."
        },
        {
            "id": 20,
            "text": "She has twice been confirmed by the Senate to serve as the United States attorney there."
        },
        {
            "id": 21,
            "text": "The Judiciary Committee contains some of the administration’s most strident critics, including Mr. Cruz and Senators Jeff Sessions of Alabama, Mike Lee of Utah and David Vitter of Louisiana, all of whom have expressed outrage over the president’s immigration policy and his exercise of executive power in general."
        },
        {
            "id": 22,
            "text": "Mr. Vitter has already said he will not vote to confirm Ms. Lynch, and Mr. Sessions called her approval of the immigration policy “very troubling.”"
        },
        {
            "id": 23,
            "text": "“Now, you’re here defending this, and I believe it’s indefensible,” Mr. Sessions said."
        },
        {
            "id": 24,
            "text": "“I just want to tell you, that’s a big problem for me.”"
        },
        {
            "id": 25,
            "text": "There were few such exchanges, however."
        },
        {
            "id": 26,
            "text": "And Ms. Lynch, who has a reputation as difficult to rattle, never appeared flustered, even as the hearing stretched into the night."
        },
        {
            "id": 27,
            "text": "Democrats see some Republicans, such as Senators Lindsey Graham of South Carolina, Orrin G. Hatch of Utah and Jeff Flake of Arizona, as possible confirmation votes."
        },
        {
            "id": 28,
            "text": "Mr. Flake said he had made no decision on Ms. Lynch but had come away with a favorable impression and expected that she would be confirmed."
        },
        {
            "id": 29,
            "text": "Mr. Graham said he wanted to hear more from Ms. Lynch about her views on the use of drones and military detention on American citizens."
        },
        {
            "id": 30,
            "text": "But he said, “From my point of view, you’ve acquitted yourself very well.”"
        },
        {
            "id": 31,
            "text": "Mr. Hatch said, “I’m impressed with your qualifications, and I hope I can support your nomination.”"
        },
        {
            "id": 32,
            "text": "He told Ms. Lynch that, if she remained independent of the White House, “I think you’ll be a great attorney general.”"
        },
        {
            "id": 33,
            "text": "On matters of policy, Ms. Lynch called capital punishment “an effective penalty” and said she disagreed with Mr. Obama’s statements that marijuana was no more harmful than alcohol."
        },
        {
            "id": 34,
            "text": "She called the National Security Agency’s collection of American phone records “certainly constitutional, and effective.”"
        },
        {
            "id": 35,
            "text": "Senator Sheldon Whitehouse, a Rhode Island Democrat on the panel, said she had given “a flawless performance.”"
        },
        {
            "id": 36,
            "text": "Senator Richard Blumenthal, Democrat of Connecticut, called her testimony “among the most accomplished and impressive that I’ve seen as a member of this committee.”"
        },
        {
            "id": 37,
            "text": "If confirmed, Ms. Lynch would be the first female African-American attorney general."
        },
        {
            "id": 38,
            "text": "One issue that received little attention in the hearing was the tension between law enforcement and minority communities after the deaths of African-American men at the hands of police officers in Ferguson, Mo., and Staten Island."
        },
        {
            "id": 39,
            "text": "Over the years, she has spoken passionately about the need for minorities to feel safe in their communities, while remaining a strong supporter of the police."
        },
        {
            "id": 40,
            "text": "“What I have found most effective is getting people together and simply listening to their concerns, being open, helping them see that, in fact, we are all in this together,” she said Wednesday."
        },
        {
            "id": 41,
            "text": "Mr. Holder angered some law enforcement groups with comments that they saw as supporting protesters against the police after the Ferguson shooting."
        },
        {
            "id": 42,
            "text": "Mr. Holder’s tenure made him a hero for many liberal groups as the Justice Department increased prosecutions of civil rights violations, embraced same-sex marriage, scaled back the war on drugs and reduced the prison population for the first time in a generation."
        },
        {
            "id": 43,
            "text": "His appearances on Capitol Hill, however, were frequently heated."
        },
        {
            "id": 44,
            "text": "The Republican-controlled House held him in contempt over what critics said was a refusal to cooperate fully in an investigation into the botched gunrunning investigation known as Operation Fast and Furious."
        },
        {
            "id": 45,
            "text": "Going into Wednesday’s hearings, Democrats sought to distance Ms. Lynch from Mr. Holder."
        },
        {
            "id": 46,
            "text": "Eric Schultz, the White House deputy press secretary, said the president was proud of Mr. Holder’s tenure."
        },
        {
            "id": 47,
            "text": "As for Ms. Lynch’s remarks, Mr. Schultz said, “She might have been just being literal, that she’s not Eric Holder.”"
        }
    ]
}