{
    "title": "Chris Christie: Gun Control 'Can Be' A Part Of Violence Control",
    "text": [
        {
            "id": 0,
            "text": "New Jersey Gov. Chris Christie (R) shrugged off the suggestion that he's not conservative enough to win the Republican presidential nomination on Sunday and stood by his belief that gun control can be a necessary part of violence prevention."
        },
        {
            "id": 1,
            "text": "\"If you look at what we've done in New Jersey, we want to control violence,\" Christie told Chris Wallace on Fox News Sunday."
        },
        {
            "id": 2,
            "text": "\"And some of that may involve firearms, but a lot of it doesn't.\""
        },
        {
            "id": 3,
            "text": "Christie stressed that his focus in New Jersey is the mental health care system, because most of the perpetrators of mass shootings are \"deeply disturbed.\""
        },
        {
            "id": 4,
            "text": "But the 2016 presidential hopeful has a mixed record on gun control."
        },
        {
            "id": 5,
            "text": "He signed 10 gun control measures into law in April, and then refused to sign a trio of stronger measures in May, including a ban on .50 sniper caliber rifles."
        },
        {
            "id": 6,
            "text": "Christie insisted that he was for comprehensive \"violence control,\" rather than gun control, but he conceded that gun control measures can be a crucial part of the package."
        },
        {
            "id": 7,
            "text": "He said he would veto gun measures that he considers to be \"overreaching and not consistent with Second Amendment rights.\""
        },
        {
            "id": 8,
            "text": "\"What it is is looking at these things case by case to see, does it make common sense?"
        },
        {
            "id": 9,
            "text": "Does it control violence?\""
        },
        {
            "id": 10,
            "text": "he said."
        },
        {
            "id": 11,
            "text": "\"We need to not pander on this issue."
        },
        {
            "id": 12,
            "text": "We need to have adults in the room who make decisions based upon controlling violence in this country.\""
        },
        {
            "id": 13,
            "text": "As to whether Christie is conservative enough to win over the conservative wing of the Republican Party in 2016, Christie said he doesn't care."
        },
        {
            "id": 14,
            "text": "\"What I'm interested in doing is being the governor of New Jersey,\" he said."
        }
    ]
}