{
    "title": "Navarro's Memos Warned of Millions of Deaths, $6 Trillion in Costs",
    "text": [
        {
            "id": 0,
            "text": "Peter Navarro, President Donald Trump’s trade adviser, warned the administration in late January that the coronavirus outbreak could put millions of Americans at risk and wind up costing the United States trillions of dollars."
        },
        {
            "id": 1,
            "text": "His grim assessment came in a Jan. 29 memo and is the highest level warning known to have circulated inside the White House, The New York Times reported."
        },
        {
            "id": 2,
            "text": "“The lack of immune protection or an existing cure or vaccine would leave Americans defenseless in the case of a full-blown coronavirus outbreak on U.S. soil,” Navarro’s memo said."
        },
        {
            "id": 3,
            "text": "“This lack of protection elevates the risk of the coronavirus evolving into a full-blown pandemic, imperiling the lives of millions of Americans.”"
        },
        {
            "id": 4,
            "text": "He said the economic and human costs could be relatively low if the outbreak turned out to be a problem similar to the seasonal flu."
        },
        {
            "id": 5,
            "text": "But he warned the “risk of a worst-case pandemic scenario should not be overlooked.”"
        },
        {
            "id": 6,
            "text": "Navarro said the eventual price tag could range from “zero economic costs” to $5.7 trillion, according to Axios."
        },
        {
            "id": 7,
            "text": "The memo was addressed to the National Security Council."
        },
        {
            "id": 8,
            "text": "Another stark warning from Navarro came in a Feb. 23 memo and was addressed to Trump."
        },
        {
            "id": 9,
            "text": "The NSC circulated both memos around the White House and other agencies, Axios said."
        },
        {
            "id": 10,
            "text": "In the second memo, Navarro noted the “increasing probability of a full-blown pandemic that could infect as many as 100 million Americans, with a loss of life of as many as 1.2 million souls.”"
        },
        {
            "id": 11,
            "text": "But a senior administration official said: “The supplemental memo lacked any basis for its projections, which led some staff to worry that it could needlessly rattle markets and may not direct funding where it was truly needed,\" Axios reported."
        }
    ]
}