{
    "title": "State Department: New sanctions are deterring Russian defense sales",
    "text": [
        {
            "id": 0,
            "text": "Russian defense industry sales are suffering from sanctions recently mandated by federal law, the State Department told Congress Monday."
        },
        {
            "id": 1,
            "text": "“Today, we have informed Congress that this legislation and its implementation are deterring Russian defense sales,” State Department spokeswoman Heather Nauert said in a Monday evening statement."
        },
        {
            "id": 2,
            "text": "“Since the enactment of the [Russia sanction] legislation, we estimate that foreign governments have abandoned planned or announced purchases of several billion dollars in Russian defense acquisitions.”"
        },
        {
            "id": 3,
            "text": "That briefing averted congressional criticism, even though the administration formally missed a deadline to implement sanctions targeting Russian defense and intelligence industries."
        },
        {
            "id": 4,
            "text": "The law also called for the Jan. 29 release of a report on Russian President Vladimir Putin’s closest and wealthiest associates."
        },
        {
            "id": 5,
            "text": "But a top Democratic lawmaker struck a collaborative note after the update."
        },
        {
            "id": 6,
            "text": "“I appreciate the administration’s engagement with Congress on this issue,” Sen. Ben Cardin, D-Md., said in a Monday evening statement."
        },
        {
            "id": 7,
            "text": "“I am not going to discuss the classified nature of these discussions but I am intently focused on these sanctions and will continue to conduct rigorous oversight to ensure that the Russian government’s ability to conduct this trade is significantly impeded.”"
        },
        {
            "id": 8,
            "text": "Secretary of State Rex Tillerson and other administration officials are also spreading the word “that significant transactions with listed Russian entities will result in sanctions,” according to a State Department spokesperson."
        },
        {
            "id": 9,
            "text": "Cardin’s tone represented a marked shift from October, when the State Department missed another deadline related to the Russia sanctions."
        },
        {
            "id": 10,
            "text": "That lapse provoked frustration among lawmakers who recalled Trump’s opposition to the bill."
        },
        {
            "id": 11,
            "text": "Trump administration officials have to navigate a complicated matrix of issues when implementing these sanctions, however."
        },
        {
            "id": 12,
            "text": "Notably, some of the provisions could affect Turkey, a NATO ally that has agreed to purchase Russian anti-aircraft system."
        },
        {
            "id": 13,
            "text": "\"With respect to Russia in particular, we are being very careful to develop the guidance that companies need, because there are business entities that need guidance; there are important allies and partners in NATO, other parts of the world, who need specific guidance so that they do not run afoul of the sanctions act as well,” Secretary of State Rex Tillerson told CNN in October."
        },
        {
            "id": 14,
            "text": "Such explanations didn’t satisfy lawmakers at the time."
        },
        {
            "id": 15,
            "text": "\"They've had plenty of time to get their act together,\" Cardin and Senate Armed Services Chairman John McCain, R-Ariz., said in a joint statement."
        },
        {
            "id": 16,
            "text": "\"The delay calls into question the Trump administration's commitment to the sanctions bill which was signed into law more than two months ago, following months of public debate and negotiations in Congress.”"
        },
        {
            "id": 17,
            "text": "Trump’s team precluded a repeat of those attacks by coordinating more regularly with Congress."
        },
        {
            "id": 18,
            "text": "“In general, they’ve been much more communicative leading up to the Jan. 29 deadline than they were when they blew past the Oct. 1 deadline by almost a month,” a Senate Democratic aide told the Washington Examiner."
        },
        {
            "id": 19,
            "text": "“So that’s a welcome change.”"
        },
        {
            "id": 20,
            "text": "They’ll have to continue to do so, if the delay persists."
        },
        {
            "id": 21,
            "text": "“The U.S. should be prepared to impose sanctions when the law is clearly violated,” Cardin said."
        },
        {
            "id": 22,
            "text": "“The administration should not rest in these efforts and I expect a frequent and regular dialogue on this issue.”"
        }
    ]
}