{
    "title": "FBI reopens Clinton email investigation",
    "text": [
        {
            "id": 0,
            "text": "The FBI has renewed its investigation into Hillary Clinton’s secret emails, Director James Comey told Congress in a new letter Friday, heightening the stakes for the Democratic presidential nominee with less than two weeks before Election Day."
        },
        {
            "id": 1,
            "text": "Mr. Comey said his agents learned of new emails “pertinent” to their probe while working on an unrelated case."
        },
        {
            "id": 2,
            "text": "He said his agents need to review those messages to see whether they contain classified information and whether they affect his previous decision."
        },
        {
            "id": 3,
            "text": "In July, Mr. Comey announced that while he determined Mrs. Clinton did mishandle classified information, she was too inept to know the risks she was running, so he couldn’t prove she did it intentionally — undercutting a criminal case."
        },
        {
            "id": 4,
            "text": "His new announcement Friday threatened to upend the presidential campaign."
        },
        {
            "id": 5,
            "text": "John Podesta, Mrs. Clinton’s campaign chairman, demanded Mr. Comey explain what new information he’s found, and blamed Republicans for “browbeating” the FBI into Friday’s decision."
        },
        {
            "id": 6,
            "text": "“Director Comey’s letter refers to emails that have come to light in an unrelated case, but we have no idea what those emails are and the Director himself notes they may not even be significant,” he said."
        },
        {
            "id": 7,
            "text": "“It is extraordinary that we would see something like this just 11 days out from a presidential election.”"
        },
        {
            "id": 8,
            "text": "Mrs. Clinton’s running mate, Sen. Tim Kaine of Virginia, said Mr. Comey owes the campaign and the public a “clearer accounting” of the new information."
        },
        {
            "id": 9,
            "text": "“When you do this 11 days before a presidential election, and you don’t provide many details — but details apparently are being given by the FBI to the press — this is very, very troubling,” Mr. Kaine told VICE News."
        },
        {
            "id": 10,
            "text": "“We hope that the director, and we really think that he should, give a clearer accounting of exactly what’s going on right now.”"
        },
        {
            "id": 11,
            "text": "Mr. Podesta predicted the FBI would come to the same conclusion this time as it did in July, and he pointedly noted that the letter was sent to eight Republican committee chairman in Congress."
        },
        {
            "id": 12,
            "text": "But it was also carbon-copied to the ranking Democrats."
        },
        {
            "id": 13,
            "text": "Mr. Comey did not explain in his letter to what information the new emails contain, how long it will take to evaluate them, nor how they were obtained."
        },
        {
            "id": 14,
            "text": "The New York Times reported Friday that the emails were snagged as part of an investigation into former Rep. Anthony Weiner, and allegations he sent illicit messages through text and social media applications to a 15-year-old North Carolina girl."
        },
        {
            "id": 15,
            "text": "The paper reported that law enforcement officials seized at least one device shared by Mr. Weiner and his now estranged wife, Huma Abedin — a top personal aide to Mrs. Clinton."
        },
        {
            "id": 16,
            "text": "The couple announced they were separating in August amid Mr. Weiner’s involvement in another sexting scandal, but before the 15-year-old girl’s allegations surfaced."
        },
        {
            "id": 17,
            "text": "As Mrs. Clinton’s top personal aide, Ms. Abedin also had an account on the secret Clinton email server and exchanged classified information with her boss."
        },
        {
            "id": 18,
            "text": "Mr. Comey said he was briefed on the new emails on Thursday and felt it was important to promptly alert Congress of investigators’ latest efforts."
        },
        {
            "id": 19,
            "text": "Republican leaders who were among the eight recipients of the letter called for further disclosures by the FBI director, with Sen. Richard C. Shelby urging him to provide additional information before voters go to the polls Nov. 8."
        },
        {
            "id": 20,
            "text": "“While I am pleased that the FBI is re-opening this case in light of new information, it is imperative that the Bureau immediately evaluate the material to complete this investigation,” said Mr. Shelby, chairman of the Appropriations Subcommittee on Commerce, Justice, Science, and Related Agencies."
        },
        {
            "id": 21,
            "text": "“The American people are electing their next Commander-in-Chief only days from now, and they deserve to know the conclusion of your review prior to Election Day.”"
        },
        {
            "id": 22,
            "text": "Sen. Charles E. Grassley, who as chairman of the Senate Judiciary Committee was one of the letter’s recipients, said Mr. Comey owes the country more of an explanation about what he’s found."
        },
        {
            "id": 23,
            "text": "“The letter from Director Comey was unsolicited and, quite honestly, surprising."
        },
        {
            "id": 24,
            "text": "But it’s left a lot more questions than answers for both the FBI and Secretary Clinton,” the Iowa Republican said."
        },
        {
            "id": 25,
            "text": "GOP presidential nominee Donald Trump, campaigning in Manchester, New Hampshire, said he respected the FBI for reversing itself."
        },
        {
            "id": 26,
            "text": "“Perhaps, finally, justice will be done,” he said."
        },
        {
            "id": 27,
            "text": "For her part Mrs. Clinton, campaigning in Cedar Rapids, Iowa, did not address the issue, instead sticking doggedly to her stump speech of attacks on Mr. Trump mixed with a plea to voters to focus on issues."
        },
        {
            "id": 28,
            "text": "President Obama, who has been saddled by association with Mrs. Clinton, who was serving him during the time she maintained her secret email server, did not respond to questions shouted by reporters Friday afternoon as he left the White House on a campaign trip to Florida to stump for Mrs. Clinton and Democratic Senate candidate Patrick Murphy."
        },
        {
            "id": 29,
            "text": "Briefing reporters on Air Force One, deputy press secretary Eric Schultz said Mr. Obama President Obama expects the FBI to “follow the facts wherever they lead” and to act “irrespective of politics.”"
        },
        {
            "id": 30,
            "text": "Mr. Schultz said the new email development does not affect Mr. Obama’s support of Mrs. Clinton."
        },
        {
            "id": 31,
            "text": "Libertarian candidate Gary Johnson said on CNN, “Obviously the FBI didn’t do this lightly."
        },
        {
            "id": 32,
            "text": "There has to be something there.”"
        },
        {
            "id": 33,
            "text": "He lamented the prospect of “a president-elect under criminal investigation.”"
        },
        {
            "id": 34,
            "text": "“That’s what’s going to now be the case, if she is elected,” he said."
        },
        {
            "id": 35,
            "text": "“She will control those jobs [in the Justice Department] that controls how this issue moves forward, which points to a special prosecutor."
        },
        {
            "id": 36,
            "text": "This is a mess."
        },
        {
            "id": 37,
            "text": "It’s a mess."
        },
        {
            "id": 38,
            "text": "I think Trump is toast, so Hillary moving forward as president-elect?"
        },
        {
            "id": 39,
            "text": "Four years of this?"
        },
        {
            "id": 40,
            "text": "Ugh.”"
        },
        {
            "id": 41,
            "text": "Congressional Republicans, who have been at odds with Mr. Trump on many issues, found common ground with their nominee in attacking Mrs. Clinton."
        },
        {
            "id": 42,
            "text": "“This decision, long overdue, is the result of her reckless use of a private email server, and her refusal to be forthcoming with federal investigators,” said House Speaker Paul D. Ryan."
        },
        {
            "id": 43,
            "text": "He again called for the Obama administration to suspend the classified intelligence briefings Mrs. Clinton is getting as the Democratic nominee."
        },
        {
            "id": 44,
            "text": "And Sen. John Cornyn, Texas Republican, wondered whether the Justice Department will now convene a grand jury to pursue the case."
        },
        {
            "id": 45,
            "text": "He said the FBI had already cleared Mrs. Clinton of mishandling classified information, so to reopen the case suggests either potential new evidence of intent to mishandle secrets, or other potential criminal questions."
        },
        {
            "id": 46,
            "text": "“Originally FBI focused on ‘classification rules’ and not broader issues related to government records/obstruction of justice."
        },
        {
            "id": 47,
            "text": "Will they now?”"
        },
        {
            "id": 48,
            "text": "Mr. Cornyn tweeted."
        },
        {
            "id": 49,
            "text": "An FBI spokesman declined Friday to comment on the reopening of the investigation."
        },
        {
            "id": 50,
            "text": "The revelation that the investigation is continuing comes too late to affect the 16 million voters who have already cast ballots in absentee or in-person voting."
        },
        {
            "id": 51,
            "text": "Republicans have said Mrs. Clinton appeared to mislead Congress in her sworn testimony to the Benghazi probe in 2015."
        },
        {
            "id": 52,
            "text": "The staggering reversal by Mr. Comey comes as Mrs. Clinton is reeling from another electronic scandal — the revelations from emails obtained and posted by WikiLeaks from Mr. Podesta’s personal email address."
        },
        {
            "id": 53,
            "text": "Mrs. Clinton refused to use an official state.gov email account during her four years as secretary, instead setting up an account on a server she kept at her home in New York."
        },
        {
            "id": 54,
            "text": "That arrangement shielded her emails from public disclosure for six years, thwarting open-records laws."
        },
        {
            "id": 55,
            "text": "She belatedly turned over some 30,000 messages she deemed government-related, but the FBI recovered thousands of others she didn’t — including some that contained classified information."
        },
        {
            "id": 56,
            "text": ""
        },
        {
            "id": 57,
            "text": ""
        },
        {
            "id": 58,
            "text": ""
        },
        {
            "id": 59,
            "text": ""
        },
        {
            "id": 60,
            "text": ""
        }
    ]
}