{
    "title": "Trump sues Deutsche Bank, Capital One to block House subpoenas",
    "text": [
        {
            "id": 0,
            "text": "The lawsuit, filed by Donald Trump and his children, is the latest escalation in the president’s fight against mounting House investigations."
        },
        {
            "id": 1,
            "text": "Trump sues Deutsche Bank, Capital One to block House subpoenas \"No grounds exist to establish any purpose other than a political one.”"
        },
        {
            "id": 2,
            "text": "President Donald Trump and his family are suing Deutsche Bank and Capital One to block subpoenas issued by House Democrats seeking Trump’s financial records."
        },
        {
            "id": 3,
            "text": "In the federal lawsuit filed Monday in New York, Trump’s lawyers argued that the subpoenas serve “no legitimate or lawful purpose.”"
        },
        {
            "id": 4,
            "text": "\"The subpoenas were issued to harass President Donald J. Trump, to rummage through every aspect of his personal finances, his businesses, and the private information of the President and his family, and to ferret about for any material that might be used to cause him political damage,” the lawsuit contends."
        },
        {
            "id": 5,
            "text": "\"No grounds exist to establish any purpose other than a political one.”"
        },
        {
            "id": 6,
            "text": "The lawsuit, seeking to invalidate subpoenas issued by the House Financial Services and Intelligence Committees, is the latest escalation in Trump’s fight against mounting House investigations into his administration, presidential campaign and business empire."
        },
        {
            "id": 7,
            "text": "In recent days, Trump has vowed to fight all congressional subpoenas, accusing Democrats of trying to sully his presidency altogether."
        },
        {
            "id": 8,
            "text": "In a joint statement, House Financial Services Chair Maxine Waters (D-Calif.) and House Intelligence Chair Adam Schiff (D-Calif.) said it was a \"meritless lawsuit\" that was not designed to succeed — but was \"only designed to put off meaningful accountability as long as possible."
        },
        {
            "id": 9,
            "text": "“\n\nMorning Tax Sign up for our tax policy newsletter and stay informed — weekday mornings, in your inbox."
        },
        {
            "id": 10,
            "text": "Email Sign Up By signing up you agree to receive email newsletters or updates from POLITICO and you agree to our privacy policy and terms of service."
        },
        {
            "id": 11,
            "text": "You can unsubscribe at any time and you can contact us here."
        },
        {
            "id": 12,
            "text": "This sign-up form is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
        },
        {
            "id": 13,
            "text": "\"As a private businessman, Trump routinely used his well-known litigiousness and the threat of lawsuits to intimidate others, but he will find that Congress will not be deterred from carrying out its constitutional responsibilities,\" they said."
        },
        {
            "id": 14,
            "text": "Democrats have said they are seeking Trump financial records as part of investigations into potential foreign influence on the U.S. political process and the abuse of the U.S. financial system for illicit purposes."
        },
        {
            "id": 15,
            "text": "Deutsche Bank, a German lender, said in a statement that it was \"committed to providing appropriate information to all authorized investigations and will abide by a court order regarding such investigations.”"
        },
        {
            "id": 16,
            "text": "In addition to serving as Trump’s go-to lender for years, the bank has faced scrutiny for money-laundering scandals."
        },
        {
            "id": 17,
            "text": "The lawsuit was filed on behalf of the president; his sons Donald Trump, Jr. and Eric Trump; his daughter Ivanka Trump; and the Trump Organization."
        },
        {
            "id": 18,
            "text": "Deutsche Bank intends to begin producing documents in response to the subpoena on May 6, and Capital One also feels obligated to comply before May 6 absent court intervention, according to the lawsuit."
        },
        {
            "id": 19,
            "text": "The lawsuit describes a sweeping inquiry into the Trump family’s finances going back decades."
        },
        {
            "id": 20,
            "text": "The two banks provide the Trumps with numerous “personal, family and business accounts.\""
        },
        {
            "id": 21,
            "text": "The committees, the Trumps’ lawyers said, have refused to provide copies of the subpoenas to the Trump family, and their scope was learned from Deustche Bank and Capital One."
        },
        {
            "id": 22,
            "text": "But according to the lawsuit, the committees are seeking “all banking and financial records not just concerning the individual plaintiffs, but also their own family members.”"
        },
        {
            "id": 23,
            "text": "\"This means the subpoenas request documents about accounts of the plaintiffs’ children (and in some cases, grandchildren),” the lawyers said."
        },
        {
            "id": 24,
            "text": "For most of the documents, the lawyers added, the committees are demanding records from the last 10 years but, for others, the request is “unbounded,” going back to the childhoods of individual Trumps."
        },
        {
            "id": 25,
            "text": "\"The House of Representatives is demanding, among other things, records of every single checking withdrawal, credit-card swipe, or debit-card purchase — no matter how trivial or small — made by each and every member of the Trump family,” they said."
        },
        {
            "id": 26,
            "text": "Lawyers representing the Trumps include Marc Mukasey, a former law firm partner of Rudy Giuliani‘s, the president’s personal lawyer."
        },
        {
            "id": 27,
            "text": "In a statement, Mukasey and Patrick Strawbridge, who is also representing the Trumps in the case, said it was filed to \"protect the privacy rights of the President, his family and their businesses.”"
        },
        {
            "id": 28,
            "text": "The lawsuit claims that the subpoenas violate the Right to Financial Privacy Act."
        },
        {
            "id": 29,
            "text": "\"Every citizen should be concerned about this sweeping, lawless, invasion of privacy,” they said."
        },
        {
            "id": 30,
            "text": "\"We look forward to vindicating our clients’ rights in this matter.”"
        },
        {
            "id": 31,
            "text": "Monday’s lawsuit comes a week after the president asked a federal court to block the House Oversight and Reform Committee’s subpoena to accounting firm Mazars USA."
        },
        {
            "id": 32,
            "text": "The Democrat-led committee subpoenaed the firm to obtain eight years of Trump’s financial records."
        },
        {
            "id": 33,
            "text": "The Oversight Committee said it needs the documents in order to corroborate testimony from former Trump attorney and fixer Michael Cohen, who alleged that the president artificially inflated and deflated the value of his assets for his personal benefit."
        },
        {
            "id": 34,
            "text": "During an explosive public hearing in February, Cohen disclosed copies of Trump’s financial statements which he said were turned over to Deutsche Bank as Trump was seeking a loan to place a bid on an NFL team, the Buffalo Bills."
        },
        {
            "id": 35,
            "text": "Those statements, according to Cohen, contained false information."
        },
        {
            "id": 36,
            "text": "The committee has requested similar records from Capital One, which asked for a “friendly” subpoena before it could comply."
        },
        {
            "id": 37,
            "text": "On Capitol Hill, Republicans have rushed to Trump’s defense amid the onslaught of investigations and subpoenas, claiming Democrats are abusing their authority to take down the president and eventually impeach him."
        },
        {
            "id": 38,
            "text": "Democratic leaders remain opposed to launching impeachment proceedings against Trump — preferring instead to continue investigating the president for obstruction of justice allegations and financial misdeeds."
        },
        {
            "id": 39,
            "text": ""
        }
    ]
}