{
    "title": "Romney 47% Obama 44%",
    "text": [
        {
            "id": 0,
            "text": "Following last week’s GOP Convention, Mitt Romney has seen a bump in his polling numbers."
        },
        {
            "id": 1,
            "text": "Just one day after the convention ended, Rasmussen found that Governor Romney now leads President Obama."
        },
        {
            "id": 2,
            "text": "Romney now garners 47% of the vote compared to Obama’s 44%."
        },
        {
            "id": 3,
            "text": "This is an expected modest bounce, but there could be an even larger bounce because of much of this data was collected before Romney’s speech on Thursday night."
        },
        {
            "id": 4,
            "text": "These numbers are quite an improvement compared to where Mr. Romney was before the convention started."
        },
        {
            "id": 5,
            "text": "On Monday Romney stood two points behind President Obama."
        },
        {
            "id": 6,
            "text": "Although this is a great improvement for the governor, it is likely that the President will see a jump in numbers following next week’s Democratic Convention."
        },
        {
            "id": 7,
            "text": "It is important to note how different conventions are nowadays."
        },
        {
            "id": 8,
            "text": "50 years ago conventions were still about actually electing the nominee."
        },
        {
            "id": 9,
            "text": "Now we know who the nominee will be long before the convention begins and the convention is more of a time to remind Americans of the important issues facing the nation, confirm the party platform, and convince people to support your side."
        },
        {
            "id": 10,
            "text": "This has affected how polls vary directly following the conventions."
        },
        {
            "id": 11,
            "text": "We can also expect to see a strange reaction in the numbers next week due to the jobs report that will be out on Friday."
        },
        {
            "id": 12,
            "text": "If the unemployment rate does not change for the better, it is very possible that President Obama will not see the large bounce in numbers that he hopes to see."
        }
    ]
}