{
    "title": "Texas Governor Signs First of Its Kind Fetal Heartbeat Law That Leaves Enforcement to Private Citizens",
    "text": [
        {
            "id": 0,
            "text": "Texas Governor Greg Abbott speaks at the annual National Rifle Association convention in Dallas, Texas, May 4, 2018."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "Texas Governor Greg Abbott signed a bill on Wednesday barring abortions after the detection of a fetal heartbeat — as early as six weeks — with the exception of medical emergencies."
        },
        {
            "id": 3,
            "text": "“Our creator endowed us with the right to life and yet millions of children lose their right to life every year because of abortion,” Abbott, a Republican, said during a bill signing ceremony."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": ""
        },
        {
            "id": 6,
            "text": "He added that the Legislature “worked together on a bipartisan basis to pass a bill that I’m about to sign that ensures that the life of every unborn child who has a heartbeat will be saved from the ravages of abortion.”"
        },
        {
            "id": 7,
            "text": "While more than a dozen other states have passed “heartbeat” bills, Texas on Wednesday became the largest state to do so."
        },
        {
            "id": 8,
            "text": "However, the law, which takes effect in September, is first-of-its-kind in that it includes a unique provision that leaves enforcement to private citizens through lawsuits against abortion providers or anyone who helps a woman get an abortion."
        },
        {
            "id": 9,
            "text": "The person would not have to be connected to the woman who had an abortion or to a provider — or even live in Texas— to file a lawsuit seeking financial damages of up to $10,000 per defendant."
        },
        {
            "id": 10,
            "text": "The provision aims to avoid legal challenges that have slowed the implementation of abortion restrictions."
        },
        {
            "id": 11,
            "text": "Abortion providers would typically file suit against the state to prevent such a law from taking effect, but as there is no state official enforcing the bill, there is no one to sue, proponents say."
        },
        {
            "id": 12,
            "text": "“It’s a very unique law"
        },
        {
            "id": 13,
            "text": "and it’s a very clever law,” Josh Blackman, a constitutional law professor at South Texas College of Law Houston, told the Texas Tribune."
        },
        {
            "id": 14,
            "text": "“Planned Parenthood can’t go to court and sue Attorney General [Ken] Paxton like they usually would because he has no role in enforcing the statute."
        },
        {
            "id": 15,
            "text": "They have to basically sit and wait to be sued.”"
        },
        {
            "id": 16,
            "text": "Currently, Texas prohibits most abortions after 20 weeks and chemical abortions after ten weeks."
        },
        {
            "id": 17,
            "text": "More than 56,600 abortions were performed on Texas residents in 2019, state statistics show."
        },
        {
            "id": 18,
            "text": "Advertisement\n\nAdvertisement"
        },
        {
            "id": 19,
            "text": "According to the CDC, more than 90 percent of abortions are performed in the first 13 weeks of a woman’s pregnancy."
        },
        {
            "id": 20,
            "text": "The Texas bill was signed into law days after the Supreme Court announced in an order on Monday that it would hear a major abortion case that will give the justices an opportunity to reconsider the precedent set by the landmark Roe v. Wade and Planned Parenthood v. Casey decisions."
        },
        {
            "id": 21,
            "text": "The Court said it will take a case involving a Mississippi law passed in 2018 that bans abortions after 15 weeks with limited exceptions."
        },
        {
            "id": 22,
            "text": ""
        }
    ]
}