{
    "title": "Sessions Targets California Immigrants Using a Ruling That Protected Them",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — Attorney General Jeff Sessions sued California this week for not doing enough to find and punish unauthorized immigrants, and said on Wednesday he was girding for an epic battle."
        },
        {
            "id": 1,
            "text": "“California is using every power it has — and some it doesn’t — to frustrate federal law enforcement,” he said in a speech in Sacramento."
        },
        {
            "id": 2,
            "text": "“So you can be sure I’m going to use every power I have to stop them.”"
        },
        {
            "id": 3,
            "text": "One of the weapons Mr. Sessions is counting on is a 2012 Supreme Court ruling siding with the Obama administration, which had sued Arizona for violating federal immigration laws."
        },
        {
            "id": 4,
            "text": "But in that case Mr. Obama’s lawyers accused the state of going too far in trying to find and punish unauthorized immigrants."
        },
        {
            "id": 5,
            "text": "“The state may not pursue policies that undermine federal law,” Justice Anthony M. Kennedy wrote for the majority."
        },
        {
            "id": 6,
            "text": "So it may turn out that the principle of federal supremacy over immigration established by the Obama administration will help the Trump Justice Department achieve diametrically different goals."
        },
        {
            "id": 7,
            "text": "“The tables are turned,” said Peter J. Spiro, a law professor at Temple University."
        },
        {
            "id": 8,
            "text": "The California case seems likely to reach the Supreme Court, where it could give rise to a landmark reckoning on the role of states in setting immigration policy."
        },
        {
            "id": 9,
            "text": "In the process, state and federal officials, along with judges and justices, will face a test of their commitment to consistency."
        },
        {
            "id": 10,
            "text": "They will face stark choices."
        },
        {
            "id": 11,
            "text": "One is to apply legal principles established in a case that mostly protected immigrants to one that seeks to imperil them."
        },
        {
            "id": 12,
            "text": "Another is to revise those principles in light of the very different circumstances."
        },
        {
            "id": 13,
            "text": "Stephen Vladeck, a law professor at the University of Texas, said history was repeating itself, but backward."
        },
        {
            "id": 14,
            "text": "“The suit is modeled on the Obama administration’s successful suit against Arizona,” he said."
        },
        {
            "id": 15,
            "text": "But he added that “some of the key considerations are flipped.”"
        },
        {
            "id": 16,
            "text": "In the Arizona case, conservatives insisted that respect for state sovereignty required letting states play a leading role in controlling immigration within their borders."
        },
        {
            "id": 17,
            "text": "But Mr. Sessions, a longtime conservative himself, disavowed that position in his speech on Wednesday."
        },
        {
            "id": 18,
            "text": "“Immigration law is the province of the federal government,” he said."
        },
        {
            "id": 19,
            "text": "Justice Antonin Scalia, the conservative jurist who died in 2016, took a different view of the Arizona case."
        },
        {
            "id": 20,
            "text": "In an impassioned partial dissent, he wrote that “it is easy to lose sight of the states’ traditional role in regulating immigration — and to overlook their sovereign prerogative to do so.”"
        },
        {
            "id": 21,
            "text": "There is no doubt that the California lawsuit is at odds with some of the Trump administration’s usual positions."
        },
        {
            "id": 22,
            "text": "“It’s a fascinating suit on a number of levels,” Professor Vladeck said, “not the least of which is the aggressive assertion of federal enforcement power directly against states by those, like Attorney General Sessions, who have historically been ardent defenders of states’ rights in the deeply analogous contexts.”"
        },
        {
            "id": 23,
            "text": "Cristina Rodriguez, a law professor at Yale, said she detected political parallels between the two suits."
        },
        {
            "id": 24,
            "text": "“Both administrations claim that the state laws they challenge impermissibly interfere with the executive branch’s ability to enforce the immigration laws,” she said."
        },
        {
            "id": 25,
            "text": "“But both lawsuits are also clearly designed to take on visible and politically powerful local officials whose vision of immigration policy conflicts with the president’s and his supporters’.”"
        },
        {
            "id": 26,
            "text": "In a news conference on Wednesday, Xavier Becerra, the California attorney general, said he was ready for the fight."
        },
        {
            "id": 27,
            "text": "The state’s laws, he said, were “fully constitutional and provide for the safety and welfare of all our people.”"
        },
        {
            "id": 28,
            "text": "“California is in the business of public safety,” he said."
        },
        {
            "id": 29,
            "text": "“We are not in the business of deportations.”"
        },
        {
            "id": 30,
            "text": "The Justice Department challenged parts of three of California’s so-called sanctuary laws."
        },
        {
            "id": 31,
            "text": "One restricts employers from cooperating with immigration officials."
        },
        {
            "id": 32,
            "text": "A second generally prohibits state officials from telling federal ones when undocumented immigrants are to be released from state custody."
        },
        {
            "id": 33,
            "text": "A third requires state officials to inspect some facilities that house people detained on behalf of the federal government."
        },
        {
            "id": 34,
            "text": "Jennifer Chacon, a law professor at the University of California, Irvine, said the state laws had been carefully written to avoid direct conflicts with federal immigration laws."
        },
        {
            "id": 35,
            "text": "“I think it is clear that California deliberately tried to draft laws that involved core exercises of state police power in a way that did not run afoul of federal law,” she said."
        },
        {
            "id": 36,
            "text": "Each state law presents different issues, and courts may give varying answers depending on how directly the state laws conflict with federal ones."
        },
        {
            "id": 37,
            "text": "More generally, though, courts will take account of the Supreme Court’s decision in the Arizona case, which called for collaboration rather than conflict."
        },
        {
            "id": 38,
            "text": "“Consultation between federal and state officials is an important feature of the immigration system,” Justice Kennedy wrote in the court’s decision in the Arizona case."
        },
        {
            "id": 39,
            "text": "Gov. Jerry Brown, a Democrat, has said that consultation is fine but that federal officials should not use California’s resources to pursue undocumented Californians."
        },
        {
            "id": 40,
            "text": "The federal government, he added, may do so on its own."
        },
        {
            "id": 41,
            "text": "“They are free to use their own considerable resources to enforce federal immigration law in California,” he said in October in signing one of the challenged laws."
        },
        {
            "id": 42,
            "text": "The Supreme Court has said that the federal government may not commandeer state resources to achieve federal objectives."
        },
        {
            "id": 43,
            "text": "In his speech on Wednesday, Mr. Sessions denied that anything like that was afoot."
        },
        {
            "id": 44,
            "text": "“Contrary to what you might hear from the lawless open borders radicals,” he said, “we are not asking California, Oakland or anyone else to enforce immigration laws.”"
        },
        {
            "id": 45,
            "text": "“We are simply asking California and other sanctuary jurisdictions to stop actively obstructing federal law enforcement,” he added."
        },
        {
            "id": 46,
            "text": "But Professor Rodriguez said the commandeering issue was a substantial one."
        },
        {
            "id": 47,
            "text": "“To the extent the Trump administration’s claims against California would produce an outcome that would effectively force states and localities to participate in immigration enforcement,” she said, “there could be an unconstitutional commandeering.”"
        },
        {
            "id": 48,
            "text": "Professor Spiro said that California may have the upper hand in the suit’s early stages, as the issues in it are novel, leaving judges with substantial discretion."
        },
        {
            "id": 49,
            "text": "The Trump administration has not fared well in federal courts in California in other cases concerning immigration, including ones challenging President Trump’s efforts to restrict travel from predominantly Muslim countries and to rescind a program protecting some 700,000 young unauthorized immigrants from deportation."
        },
        {
            "id": 50,
            "text": "But the ultimate fate of the suit will probably rest with the Supreme Court."
        },
        {
            "id": 51,
            "text": "In 2012, with what may have been unwarranted optimism, Justice Kennedy said he hoped that conflicts over immigration policy would be worked out through reasoned discussion."
        },
        {
            "id": 52,
            "text": "“The national government has significant power to regulate immigration,” he wrote."
        },
        {
            "id": 53,
            "text": "“The sound exercise of national power over immigration depends on the nation’s meeting its responsibility to base its laws on a political will informed by searching, thoughtful, rational civic discourse.”"
        }
    ]
}