{
    "title": "Top Senate Republicans reject Trump’s renewed call for immediate dismissal of impeachment charges",
    "text": [
        {
            "id": 0,
            "text": "Top Senate Republicans on Monday rejected President Trump’s call for outright dismissal of the impeachment charges against him, but continued to grapple with the shape of the Senate trial that could begin as soon as this week."
        },
        {
            "id": 1,
            "text": "On Monday, senior Republicans said immediate dismissal could not win approval in the chamber, where Republicans hold a 53-seat majority."
        },
        {
            "id": 2,
            "text": "And even some staunch Trump allies argued that the president’s legacy would benefit from a robust trial."
        },
        {
            "id": 3,
            "text": "“I don’t think there’s any interest on our side of dismissing,” said Sen. Roy Blunt (R-Mo.), the fourth-ranking GOP senator."
        },
        {
            "id": 4,
            "text": "“Certainly, there aren’t 51 votes for a motion to dismiss.”"
        },
        {
            "id": 5,
            "text": "Senate Majority Leader Mitch McConnell (R-Ky.) has said that he wants the trial — only the third impeachment of a president in U.S. history — to follow the format used 21 years ago in the trial of President Bill Clinton."
        },
        {
            "id": 6,
            "text": "In that case, the Senate approved a resolution that would have allowed the Senate to vote to dismiss the charges."
        },
        {
            "id": 7,
            "text": "But senior Republicans signaled Monday that they are not inclined to include such a provision in the resolution that will kick off Trump’s trial, perhaps as soon as Thursday."
        },
        {
            "id": 8,
            "text": "“I think the only reason it would be in there is if there’s just some argument for consistency,” Blunt said."
        },
        {
            "id": 9,
            "text": "Another GOP senator, speaking on the condition of anonymity to discuss legislation that is not yet public, also said the inclusion of a provision to dismiss is unlikely."
        },
        {
            "id": 10,
            "text": "Republicans were maneuvering behind the scenes about the vexing issue of witnesses as former national security adviser John Bolton said last week that he would be willing to testify if he receives a Senate subpoena."
        },
        {
            "id": 11,
            "text": "Still, Trump, in a post Sunday that he also retweeted on Monday, made clear that he was still pressing for the Senate to dismiss the charges."
        },
        {
            "id": 12,
            "text": "“Many believe that by the Senate giving credence to a trial based on the no evidence, no crime, read the transcripts, ‘no pressure’ Impeachment Hoax, rather than an outright dismissal, it gives the partisan Democrat Witch Hunt credibility that it otherwise does not have."
        },
        {
            "id": 13,
            "text": "I agree!”"
        },
        {
            "id": 14,
            "text": "he wrote."
        },
        {
            "id": 15,
            "text": "Pelosi says Trump ‘impeached for life’ despite McConnell’s ‘gamesmanship,’ ‘coverup’"
        },
        {
            "id": 16,
            "text": "White House press secretary Stephanie Grisham said during a Fox News interview that while Trump is seeking a dismissal “because he did nothing wrong,” if he faces a Senate trial, “he does want it to be fair, which is all he deserves.”"
        },
        {
            "id": 17,
            "text": "Meanwhile, a senior administration official, speaking on the condition of anonymity to candidly discuss strategy, said the White House wants the dismissal option “available to the president” and not necessarily tucked into the organizing resolution."
        },
        {
            "id": 18,
            "text": "The official also noted that a motion to dismiss could come later in the trial, once the senators have had ample time to digest opening arguments and ask questions."
        },
        {
            "id": 19,
            "text": "Any senator can move to dismiss the charges, as long as it is done in writing."
        },
        {
            "id": 20,
            "text": "Trump has been eager to use the Senate trial on the campaign trail as evidence that he has done nothing wrong and that his impeachment by the House was a political “witch hunt” by Democrats."
        },
        {
            "id": 21,
            "text": "The House voted Dec. 18 to impeach Trump, but House Speaker Nancy Pelosi (D-Calif.) has held the two articles of impeachment as she sought concessions from McConnell on witnesses."
        },
        {
            "id": 22,
            "text": "He refused to budge and Pelosi relented last week, signaling that the House would vote this week to approve a slate of impeachment managers who will deliver the articles to the Senate and prosecute the case against Trump."
        },
        {
            "id": 23,
            "text": "Senate Republicans, most of whom are prepared not to convict Trump on the two charges, believe a vote to acquit will provide a more emphatic statement to rebut the abuse-of-power and obstruction-of-Congress charges he faces over his demands that Ukraine launch investigations that would benefit him politically."
        },
        {
            "id": 24,
            "text": "For that reason, McConnell has long preferred a vote to acquit Trump, rather than a vote to dismiss that has a higher likelihood of failure on the Senate floor — a view echoed Monday by his closest allies and rank-and-file senators."
        },
        {
            "id": 25,
            "text": "Several closely watched Republican senators said Monday that they would reject immediate dismissal of the charges against Trump, including Sens. Lamar Alexander (Tenn.), Mitt Romney (Utah) and Susan Collins (Maine)."
        },
        {
            "id": 26,
            "text": "“My understanding is most Republicans wanted to have a full trial and then have a vote on acquittal or a conviction, which is at a 67-vote threshold,” said Sen. John Cornyn (R-Tex.)."
        },
        {
            "id": 27,
            "text": "Chatter about dismissing the charges began to ramp up last week after Sen. Josh Hawley (R-Mo.) introduced a measure to alter Senate rules to allow for dismissing articles of impeachment, but only if the House had failed to transmit them to the Senate within 25 calendar days."
        },
        {
            "id": 28,
            "text": "McConnell announced last week that he had the votes to proceed with Trump’s impeachment trial without support from Democrats and within the parameters that he sought: hours of opening statements for the House managers and Trump’s defense team, as well as a period for questioning from senators."
        },
        {
            "id": 29,
            "text": "No Republicans signaled dissent from that strategy last week."
        },
        {
            "id": 30,
            "text": "As Senate GOP leaders work to finalize the resolution that would establish Trump’s trial, they also began contending with a growing chorus of Republican senators who could be influential swing votes on procedural matters on the question of witnesses."
        },
        {
            "id": 31,
            "text": "One of them, Collins, said last week that she has spoken with a small circle of Republican senators to ensure that the process for Trump hews as closely to the structure that Clinton was granted during his trial."
        },
        {
            "id": 32,
            "text": "Pelosi moves to end Trump impeachment standoff, signals she will send articles to Senate"
        },
        {
            "id": 33,
            "text": "On Monday, Collins explained that her negotiations are not about “specific witnesses” getting called but are merely an attempt to make sure that no senator could short-circuit the trial without first letting all 100 senators vote on whether to call additional witnesses."
        },
        {
            "id": 34,
            "text": "Other like-minded senators on Monday echoed Collins’s view."
        },
        {
            "id": 35,
            "text": "“I am working to make sure that we will have a process so that we can take a vote on whether or not we need additional information,” which could include witnesses, said Sen. Lisa Murkowski (R-Alaska)."
        },
        {
            "id": 36,
            "text": "Romney said Monday that he plans to vote against early motions by Democrats for witnesses before opening arguments but that later in the trial, “I presume I’ll be voting in favor of hearing from John Bolton perhaps among others."
        },
        {
            "id": 37,
            "text": "That could change depending on what happens in the ensuing days and during those arguments, but I’m not going to be voting for witnesses prior to the opening arguments.”"
        },
        {
            "id": 38,
            "text": "Senior Republicans stressed Monday that such a vote would probably occur, with Senate Majority Whip John Thune (R-S.D.) telling reporters: “I don’t think there’s any question that there’ll probably be that vote at some point in the process.”"
        },
        {
            "id": 39,
            "text": "“I think we should hear the case."
        },
        {
            "id": 40,
            "text": "We have a constitutional duty to do that,” Alexander said."
        },
        {
            "id": 41,
            "text": "“That means to me, number one, hear the arguments."
        },
        {
            "id": 42,
            "text": "Number two, to ask our questions."
        },
        {
            "id": 43,
            "text": "Number three, to be guaranteed the right to vote on whether we need additional evidence following hearing the case."
        },
        {
            "id": 44,
            "text": "Evidence could be witnesses, it could be documents.”"
        },
        {
            "id": 45,
            "text": ""
        }
    ]
}