{
    "title": "Energy Secretary Jennifer Granholm: Clock is ticking on infrastructure",
    "text": [
        {
            "id": 0,
            "text": "Energy Secretary Jennifer Granholm said Sunday the administration will push for a bipartisan deal on infrastructure but the House will begin marking up key parts of the plan on Wednesday with or without the GOP."
        },
        {
            "id": 1,
            "text": "“This has got to be done soon,” Ms. Granholm told CNN’s “State of the Union.”"
        },
        {
            "id": 2,
            "text": "Democrats control the House, but the key obstacle for Mr. Biden’s ambitions will be in the evenly divided Senate."
        },
        {
            "id": 3,
            "text": "Republicans are dispatching Sen. Shelley Moore Capito of West Virginia to the White House to lead talks, though Mr. Biden rejected a GOP counteroffer that added $50 billion in spending but remains far short of the president’s"
        },
        {
            "id": 4,
            "text": "$1.7 trillion plan."
        },
        {
            "id": 5,
            "text": "Ms. Capito and Mr. Biden will meet again Monday."
        },
        {
            "id": 6,
            "text": "Ms. Granholm put the onus on Republicans to explain why they haven’t adopted critical pieces of Mr. Biden’s plan, such as improving the electrical grid and expanding nuclear power, citing their past support for those measures."
        },
        {
            "id": 7,
            "text": "“It’s just curious why there isn’t more coming together,” Ms. Granholm said."
        },
        {
            "id": 8,
            "text": "She also said Republicans and Sen. Joe Manchin III, a Democratic swing vote, should relish the chance to help West Virginians pivot from dying fossil-fuel industries to jobs in renewables."
        },
        {
            "id": 9,
            "text": "“They need these investments,” Ms. Granholm said."
        },
        {
            "id": 10,
            "text": "“Joe Biden wants to have them see their future in energy 2.0.”"
        },
        {
            "id": 11,
            "text": "Transportation Secretary Pete Buttigieg said there is plenty of “daylight” between the administration and GOP negotiations."
        },
        {
            "id": 12,
            "text": "He downplayed Republicans’ leverage even though Mr. Biden would need 10 of them to overcome a filibuster in the Senate."
        },
        {
            "id": 13,
            "text": "“The American people are with us in terms of how we want to pay for this, which is ensuring corporations and the wealthy pay their fair share,” Mr. Buttigieg told CBS’ “Face the Nation.”"
        },
        {
            "id": 14,
            "text": "“We think the wind is at our backs.”"
        },
        {
            "id": 15,
            "text": "Members of both parties want to improve roads, bridges and things like broadband internet, but Washington has struggled to reach a deal."
        },
        {
            "id": 16,
            "text": "“Infrastructure Week” became a running joke during the prior administration because attempts to focus on the topic fell flat in a dramatic fashion."
        },
        {
            "id": 17,
            "text": "Ms. Granholm underscored the need to bolster the country’s cyber defenses, in particular, suggesting that foreign malign actors have the power to shut down the power grid as industries reel from ransomware attacks."
        },
        {
            "id": 18,
            "text": "“Uh, yeah."
        },
        {
            "id": 19,
            "text": "They do,” the energy secretary told CNN’s Jake Tapper."
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}