{
    "title": "Florida election official Brenda Snipes resigns after tumultuous recount",
    "text": [
        {
            "id": 0,
            "text": "An embattled Florida elections supervisor, Brenda Snipes, has resigned following the tumultuous and at times bitter voting and recount process in the knife-edge midterm election in her state, according to reports."
        },
        {
            "id": 1,
            "text": "A few hours after the election recount finished in Florida on Sunday – almost two weeks after election day on 6 November – Snipes submitted a resignation letter, according to the Sun Sentinel and other reports."
        },
        {
            "id": 2,
            "text": "Snipes, 75, is the Broward county supervisor of elections."
        },
        {
            "id": 3,
            "text": "The top elections official endured national humiliation last week after missing a midterms recount deadline by two minutes."
        },
        {
            "id": 4,
            "text": "She told the Guardian before quitting that racism is “probably” a factor in the backlash against her."
        },
        {
            "id": 5,
            "text": "Recounts in Florida after the election eventually saw upcoming Democratic hopeful Andrew Gillum narrowly fail to become Florida’s governor after a racially charged contest against the Republican Ron DeSantis."
        },
        {
            "id": 6,
            "text": "He conceded on Saturday."
        },
        {
            "id": 7,
            "text": "DeSantis said on Monday that a “blue wave” did sweep over Florida and Democrats really turned out the vote."
        },
        {
            "id": 8,
            "text": "“Kinda was a blue wave, we were just able to overcome it,” he told Fox & Friends in a TV interview."
        },
        {
            "id": 9,
            "text": "On Sunday it was confirmed after a noon deadline for a recount that the longtime Democratic senator Bill Nelson had lost his seat to the Florida governor, Rick Scott, in what turned out ultimately to be a crushing election for Democrats in the state."
        },
        {
            "id": 10,
            "text": "On Sunday evening, Snipes resigned and submitted a letter declaring as much."
        },
        {
            "id": 11,
            "text": "She intends to leave her post in January."
        },
        {
            "id": 12,
            "text": "“It is true."
        },
        {
            "id": 13,
            "text": "She did send it,” Burnadette Norris-Weeks, an attorney who works as counsel to the supervisor of elections office, said of the letter to the Sun Sentinel."
        },
        {
            "id": 14,
            "text": "Snipes has suffered criticism from Scott, Senator Marco Rubio and Donald Trump amid confusion and disarray during the recount process."
        },
        {
            "id": 15,
            "text": "She was also condemned by Democrats last week after failing to submit tallies in the race between Scott and Nelson on schedule, and has suffered bouts of intense criticism during her tenure, despite being repeatedly re-elected to her position after being appointed in 2003 by Jeb Bush."
        },
        {
            "id": 16,
            "text": "Last Friday, with a hand count of votes under way, about two dozen protesters held a vigil in a car park outside Snipes’s headquarters."
        },
        {
            "id": 17,
            "text": "Some claimed without evidence that she had missed the deadline deliberately because the results she oversaw boosted Scott’s overall lead."
        },
        {
            "id": 18,
            "text": "Snipes is a Democrat."
        },
        {
            "id": 19,
            "text": "In a short interview last week Snipes told the Guardian: “You know, the protesters have been claiming stuff all week so whatever they’re doing, that’s what they’re doing."
        },
        {
            "id": 20,
            "text": "That’s what they feel like they need to do.”"
        },
        {
            "id": 21,
            "text": "Asked if she felt it was racially motivated, the supervisor replied: “Probably."
        },
        {
            "id": 22,
            "text": "Probably.”"
        },
        {
            "id": 23,
            "text": "She declined to elaborate."
        }
    ]
}