{
    "title": "Freshman Democrat embroiled in scandal to resign",
    "text": [
        {
            "id": 0,
            "text": "Rep. Katie Hill on Sunday announced her resignation from Congress amid a House Ethics Committee investigation into her alleged involvement in a bisexual love triangle and an affair with a member of her congressional staff."
        },
        {
            "id": 1,
            "text": "“It is with a broken heart that today I announce my resignation from Congress,” Ms. Hill said in a statement."
        },
        {
            "id": 2,
            "text": "“This is the hardest thing I have ever had to do, but I believe it is the best thing for my constituents, my community, and our country.”"
        },
        {
            "id": 3,
            "text": "The freshman California Democrat is embroiled in a messy divorce, which led to the revelations of the office romance, which is prohibited under House rules."
        },
        {
            "id": 4,
            "text": "The House Ethics Committee last week announced the investigation following news reports that she was involved in a three-way relationship with her husband and a female campaign staffer, even as she had an affair with a male staffer in her official congressional office."
        },
        {
            "id": 5,
            "text": "As reported by Red State, a conservative website, Ms. Hill was involved with a 22-year-old campaign staffer and her husband in a “throuple” relationship."
        },
        {
            "id": 6,
            "text": "The ethics probe of Ms. Hill was among a series of investigations into sex scandals involving Democratic House members caught up in the ban on romantic relationships with staff members."
        },
        {
            "id": 7,
            "text": "The ban was recently implemented as part of Congress’ response to the #MeToo movement, aiming to protect congressional staff from predatory bosses."
        },
        {
            "id": 8,
            "text": "The Ethics panel last week also announced an investigation into allegations that Democrat Michael F.Q. San Nicolas, the non-voting member from Guam, had a sexual relationship with a member of his congressional staff."
        },
        {
            "id": 9,
            "text": "Ms. Hill’s husband was apparently OK with that arrangement but felt the line was crossed when he learned Ms. Hill, 32, was also having another relationship with her male office employee."
        },
        {
            "id": 10,
            "text": "“I didn’t file for divorce bc she was bi! I just didn’t know she opened our relationship. Lol,” Kenny Heslep, Ms. Hill’s estranged husband, wrote on Facebook."
        },
        {
            "id": 11,
            "text": ""
        },
        {
            "id": 12,
            "text": ""
        },
        {
            "id": 13,
            "text": ""
        },
        {
            "id": 14,
            "text": "Red State published text messages it said were from the relationship between Ms. Hill and the 22-year-old campaign staffer."
        },
        {
            "id": 15,
            "text": "Ms. Hill on Tuesday denied having a relationship with the staffer in her office, calling the allegation “absolutely false.”"
        },
        {
            "id": 16,
            "text": "She blamed her husband, who she said was “abusive,” for the revelations."
        },
        {
            "id": 17,
            "text": "“This coordinated effort to try to destroy me and people close to me is despicable and will not succeed. I, like many women who have faced attacks like this before, am stronger than those who want me to be afraid,”"
        },
        {
            "id": 18,
            "text": "I, like many women who have faced attacks like this before, am stronger than those who want me to be afraid,”"
        },
        {
            "id": 19,
            "text": "The congresswoman said she had asked the U.S. Capitol Police to investigate the leak of photos, including one published by Red State showing her undressed and brushing another woman’s hair."
        },
        {
            "id": 20,
            "text": "Ms. Hill last year defeated Republican incumbent Steve Knight in the race to represents California’s 25th district, which includes parts of Los Angeles and Ventura counties."
        },
        {
            "id": 21,
            "text": "Speaker of the House Nancy Pelosi said Ms. Hill came to Congress with a bright future."
        },
        {
            "id": 22,
            "text": "“She has acknowledged errors in judgment that made her continued service as a Member untenable."
        },
        {
            "id": 23,
            "text": "We must ensure a climate of integrity and dignity in the Congress, and in all workplaces,” Ms. Pelosi said"
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        },
        {
            "id": 27,
            "text": ""
        }
    ]
}