{
    "title": "Darrell Issa: What We Don't Know Could Kill Us",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON --"
        },
        {
            "id": 1,
            "text": "At a Congressional hearing to evaluate America's response to the Ebola outbreak, House Oversight Committee Chairman Darrell Issa (R-Calif.) eschewed the calm approach, suggesting U.S. medical officials are flailing in the dark and that their ignorance could prove deadly."
        },
        {
            "id": 2,
            "text": "Issa started by pointing out the flaws of the response so far, which has seen two nurses become infected in Texas while treating the first victim of the disease to become ill in the United States."
        },
        {
            "id": 3,
            "text": "Then he went on to compare Ebola, which can only be spread by contact with bodily fluids of a person showing symptoms of the disease, to infamous outbreaks of highly contagious flu in the past."
        },
        {
            "id": 4,
            "text": "The Spanish flu \"claimed at least 20 million people,\" Issa said, noting that more recent outbreaks of easily spread flu in the 1950s and '60s killed tens of thousands of people."
        },
        {
            "id": 5,
            "text": "\"It would be a major mistake to underestimate what Ebola could do to populations around the world, and any further fumbles, bumbles or missteps, or relying on postulates, certainties, told to us by people who in fact cannot defend how that certainty came to be, and, when it fails to be correct, how they could have been so wrong, can no longer be tolerated,\" Issa said."
        },
        {
            "id": 6,
            "text": "He apparently was referring to the early CDC guidelines that were in effect when Thomas Duncan first showed up at a Dallas hospital and was sent home, sick with Ebola, only to return."
        },
        {
            "id": 7,
            "text": "The two nurses were later infected there, and the guidelines on how to deal with patients have since been upgraded."
        },
        {
            "id": 8,
            "text": "None of the other people who came in contact with Duncan are ill, and the spread in that case seems to have been halted."
        },
        {
            "id": 9,
            "text": "Issa also pointed to a doctor who returned from Guinea to New York City, and was admitted to an isolation center Thursday, as more reason to be alarmed, although it is not yet clear yet whether any procedures in that case have been inadequate."
        },
        {
            "id": 10,
            "text": "U.S. health officials warned in a hearing over the summer that it was certainly possible, and probably inevitable that people would return to the United States from the affected region and subsequently become ill."
        },
        {
            "id": 11,
            "text": "But they also said that the medical establishment in the United States would be able to contain the disease and prevent any widespread outbreak."
        },
        {
            "id": 12,
            "text": "That has been the case, but Issa summed up with a dark warning."
        },
        {
            "id": 13,
            "text": "\"I look forward to hearing from this panel of witnesses in an effort not to solve a problem, but to take the problem appropriately seriously, and recognize what we don't know could kill us.\""
        }
    ]
}