{
    "title": "What to expect when Shinseki testifies about VA troubles on Thursday",
    "text": [
        {
            "id": 0,
            "text": "Shinseki is scheduled to appear before the Senate Veterans Affairs Committee, which will likely focus on recent claims that VA health clinics in Phoenix and Fort Collins, Colo., used elaborate schemes to hide records of patients who waited too long for care to meet the department’s goals."
        },
        {
            "id": 1,
            "text": "In an interview on Wednesday, Senate Veterans Affairs Committee Chairman Bernie Sanders (I-Vt.) said the delay is not surprising."
        },
        {
            "id": 2,
            "text": "“Anyone who knows the VA knows it’s a bureaucracy that moves slowly — often too slowly,” he said."
        },
        {
            "id": 3,
            "text": "Sanders has been adamant about waiting for the VA inspector general’s office to finish its investigation of the allegations before drawing conclusions."
        },
        {
            "id": 4,
            "text": "“I’ll let the facts speak for themselves,” he said Wednesday."
        },
        {
            "id": 5,
            "text": "The VA has placed three Phoenix executives on administrative leave as the review takes place, and Shinseki has ordered face-to-face audits of the scheduling systems at all the department’s medical centers."
        },
        {
            "id": 6,
            "text": "The chairman indicated he wants to know more on Thursday about VA staffing levels and whether additional personnel could help the clinics provide care in a more timely fashion."
        },
        {
            "id": 7,
            "text": "Sanders also said he will examine the department’s goal of seeing patients within 14 to 30 days to determine whether that timeframe is realistic considering the VA’s current budget limitations and workload."
        },
        {
            "id": 8,
            "text": "“I don’t know there are enough staff to provide the healthcare veterans need,” he said."
        },
        {
            "id": 9,
            "text": "“We have to take a look at that.”"
        },
        {
            "id": 10,
            "text": "President Obama’s 2015 budget proposal asks Congress to provide $56 billion for veteran medical care."
        },
        {
            "id": 11,
            "text": "That amount would represent an increase of 3 percent compared to the enacted level for 2014."
        },
        {
            "id": 12,
            "text": "Sanders noted that the VA health system generally receives high marks from patients who use it."
        },
        {
            "id": 13,
            "text": "The American Customer Satisfaction Index shows that the network, which serves more than 8 million veterans, achieved scores equal to or better than those in the private sector last year."
        },
        {
            "id": 14,
            "text": "In terms of what Sanders expects from the VA at this point, he said he wants the department to be responsive to congressional inquiries and to take action if the investigation uncovers wrongdoing or mismanagement."
        },
        {
            "id": 15,
            "text": "“They are funded by taxpayers, and the VA has to be responsive to the concerns that these committees are raising,” he said."
        },
        {
            "id": 16,
            "text": "“If there are managers around the country who are not doing their jobs, then those people have to be held accountable.”"
        },
        {
            "id": 17,
            "text": "Republicans on the committee will probably challenge Shinseki over bonuses that have gone to executives overseeing troubled health facilities in locations such as Pittsburgh, where a Legionnaires disease outbreak killed several patients in 2012, and in Atlanta, where a federal audit determined that the clinic there was not sufficiently addressing patient safety."
        },
        {
            "id": 18,
            "text": "The House last month passed legislation to ban bonuses for senior VA executives in response to the department’s recent problems."
        },
        {
            "id": 19,
            "text": "The bill’s sponsor, Rep. Tim Huelskamp (R-Kan.), said the measure is necessary because of “systematic leadership failures.”"
        },
        {
            "id": 20,
            "text": ""
        },
        {
            "id": 21,
            "text": ""
        },
        {
            "id": 22,
            "text": ""
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}