{
    "title": "George W. Bush: Jeb Would Beat Hillary Clinton In 2016",
    "text": [
        {
            "id": 0,
            "text": "George W. Bush says that he badly wants his brother Jeb to run for president -- and that if he were to face off against Hillary Clinton, he would \"absolutely\" beat her in a 2016 matchup."
        },
        {
            "id": 1,
            "text": ""
        },
        {
            "id": 2,
            "text": "\"He knows I want him to run,\" the former president told Candy Crowley on CNN's \"State of the Union\" Sunday."
        },
        {
            "id": 3,
            "text": "\"If I need to reiterate it, I will: Run, Jeb."
        },
        {
            "id": 4,
            "text": "I think he'd be a great president.\""
        },
        {
            "id": 5,
            "text": "Asked if he considered Clinton to be \"formidable,\" Bush said, \"Very much so."
        },
        {
            "id": 6,
            "text": "No question."
        },
        {
            "id": 7,
            "text": "So is he, though."
        },
        {
            "id": 8,
            "text": "\"I think he'd beat her,\" he said."
        },
        {
            "id": 9,
            "text": "Of course, neither Clinton nor Jeb Bush, a former governor of Florida, has declared a candidacy for 2016, though Clinton is widely considered a frontrunner for the Democratic ticket should she pursue it."
        },
        {
            "id": 10,
            "text": "Jeb Bush leads the Republican pack in many polls based on potential candidates."
        },
        {
            "id": 11,
            "text": "George W. Bush said that politicians considering a run for president need to ask themselves two questions: whether they fear success, and whether they fear failure."
        },
        {
            "id": 12,
            "text": "\"Jeb doesn't,\" Bush said of fearing failure. \""
        },
        {
            "id": 13,
            "text": "Nor does he fear success, by the way."
        },
        {
            "id": 14,
            "text": "One reason why is because he was an able governor of Florida."
        },
        {
            "id": 15,
            "text": "\"The final consideration, of course, is ... the family,\" Bush went on. \""
        },
        {
            "id": 16,
            "text": "And he has -- he's seen what it's like to be the son of a president."
        },
        {
            "id": 17,
            "text": "He's seen what it's like to be a brother of the president ..."
        },
        {
            "id": 18,
            "text": "He's not rushing into running for the presidency."
        },
        {
            "id": 19,
            "text": "I have no clue where his head is now.\""
        },
        {
            "id": 20,
            "text": "Bush, in clips from the show that were released late last week, was also asked about the lack of an indictment in the case of Eric Garner, the African-American man whose death due to a police chokehold on Staten Island was caught on video."
        },
        {
            "id": 21,
            "text": "He said he found the grand jury's decision puzzling."
        }
    ]
}