{
    "title": "Supreme Court sides with Native American hunter as Gorsuch joins liberals",
    "text": [
        {
            "id": 0,
            "text": "The Supreme Court on Monday sided with a Wyoming hunter charged with off-season hunting, ruling 5-4 that a 150-year-old treaty between a Native American tribe and the United States was still active and protected the man's rights."
        },
        {
            "id": 1,
            "text": "Clayvin Herrera was charged in 2014 with off-season hunting, but he argued that an 1868 treaty between the U.S. and the Crow Tribe — of which he is a member — protected his ability to hunt at that time."
        },
        {
            "id": 2,
            "text": "Wyoming had argued that the treaty was invalidated when it achieved statehood and lower courts agreed, leading to Herrera's conviction on the hunting charge."
        },
        {
            "id": 3,
            "text": "The court sided with Herrera and found that the treaty with the tribe did not expire when Wyoming became a state in 1890."
        },
        {
            "id": 4,
            "text": "They also ruled against Wyoming's argument that Bighorn National Forest, where Herrera was hunting, was not \"unoccupied lands\" as required under the treaty."
        },
        {
            "id": 5,
            "text": "Wyoming had pointed to another Supreme Court ruling that found another Native American treaty ended when the state formally entered the union."
        },
        {
            "id": 6,
            "text": "However, Justice Sonia Sotomayor wrote the majority opinion that Herrera's case centered on another ruling that found \"Congress 'must clearly express' any intent to abrogate Indian treaty rights.\""
        },
        {
            "id": 7,
            "text": "\"There is simply no evidence that Congress intended to abrogate the 1868 Treaty right through the Wyoming Statehood Act, much less the 'clear evidence' this Court's precedent requires,\" Sotomayor wrote."
        },
        {
            "id": 8,
            "text": "\"Nor is there any evidence in the treaty itself that Congress intended the hunting right to expire at statehood, or that the Crow Tribe would have understood it to do so.\""
        }
    ]
}