{
    "title": "What to Watch For as Harris and Pence Visit Wisconsin on Labor Day",
    "text": [
        {
            "id": 0,
            "text": "Labor Day is the traditional kickoff to the fall campaign season, but this year the holiday represents something more: the first time both candidates for vice president will be on the trail on the same day in the same state."
        },
        {
            "id": 1,
            "text": "Vice President Mike Pence and Senator Kamala Harris on Monday will be on opposite ends of Wisconsin, a battleground that’s increasingly essential to President Trump’s electoral map."
        },
        {
            "id": 2,
            "text": "There were a few more competitive states in 2016, but no loss was as devastating to Democrats as Wisconsin."
        },
        {
            "id": 3,
            "text": "Michigan they saw coming and raced in vain to salvage at the end of the race, sending former President Barack Obama and Hillary Clinton herself for 11th-hour rallies."
        },
        {
            "id": 4,
            "text": "And Democrats never took Pennsylvania for granted, with Mrs. Clinton and Mr. Obama concluding the campaign in Philadelphia on the eve of the election."
        },
        {
            "id": 5,
            "text": "But Mrs. Clinton, confident in success after Mr. Obama carried the state twice with ease, (in)famously did not campaign in Wisconsin in the final stretch of the campaign."
        },
        {
            "id": 6,
            "text": "Mr. Trump captured just 47 percent of the vote, but that was enough to win the state by less than 23,000 votes."
        },
        {
            "id": 7,
            "text": "The race in Wisconsin, it turned out, was truer to what happened in 2000 and 2004, when the results were similarly close, than to Mr. Obama’s anomalous margins."
        },
        {
            "id": 8,
            "text": "Much to the relief of Wisconsin Democrats, Joseph R. Biden Jr. is not taking the state for granted."
        },
        {
            "id": 9,
            "text": "In his first coronavirus-era campaign trip outside Delaware and Pennsylvania — his home and neighboring states — the former vice president visited Kenosha, Wis., last week, meeting with the family of Jacob Blake, the Black man shot by the police last month."
        },
        {
            "id": 10,
            "text": "Yet while Democrats would relish reclaiming Wisconsin, it’s more imperative for Mr. Trump to keep it in his column."
        },
        {
            "id": 11,
            "text": "If he holds every other state he captured in 2016, the president must win at least one of the three pivotal Big Ten states to claim re-election: Michigan, Pennsylvania or Wisconsin."
        },
        {
            "id": 12,
            "text": "With his campaign increasingly concerned about his ability to win again in Michigan, where it has cut its advertising, Wisconsin and Pennsylvania loom even larger."
        },
        {
            "id": 13,
            "text": "And if Mr. Biden can run just slightly stronger in the state of his birth and early childhood than Mrs. Clinton did and win Pennsylvania, Mr. Trump’s hopes may rest entirely on Wisconsin."
        },
        {
            "id": 14,
            "text": "Mr. Pence and Ms. Harris will spend the day in very different parts of the state with very different audiences."
        },
        {
            "id": 15,
            "text": "The vice president is speaking to employees at the Dairyland Power Cooperative in La Crosse, a heavily white Mississippi River city at the western edge of the state."
        },
        {
            "id": 16,
            "text": "Ms. Harris, who is making her first trip to a battleground state since joining the Democratic ticket, is visiting with union workers and leaders as well as African-American businesspeople and pastors in Milwaukee, the Black hub of the state."
        },
        {
            "id": 17,
            "text": "Each is expected to focus on the economy, with Mr. Pence hailing the state’s job growth before the coronavirus pandemic and Ms. Harris critiquing the administration’s handling of the virus and the resultant impact on the economy."
        },
        {
            "id": 18,
            "text": "Yet their political missions are different."
        },
        {
            "id": 19,
            "text": "The vice president is hoping to appeal to voters in a historically Democratic part of Wisconsin, where Mr. Trump outperformed his Republican predecessors, in hopes they abandon their political roots again."
        },
        {
            "id": 20,
            "text": "Ms. Harris, for her part, is not traveling to heavily Democratic Milwaukee to win over Republicans."
        },
        {
            "id": 21,
            "text": "She’s hoping to rouse Black Democrats in a city where far fewer of them showed up in 2016 than in Mr. Obama’s two winning campaigns."
        },
        {
            "id": 22,
            "text": "Ms. Harris has appeared with Mr. Biden a few times in Delaware, delivered a speech in Washington and conducted some carefully selected interviews."
        },
        {
            "id": 23,
            "text": "But for the most part, she has receded from view in the weeks since her splashy selection."
        },
        {
            "id": 24,
            "text": "That’s not terribly surprising — running mates usually draw the most attention in the days immediately after they’re picked, and Mr. Trump overwhelms political news coverage."
        },
        {
            "id": 25,
            "text": "Still, Ms. Harris’s trip on Monday will be the first time she has appeared with battleground state voters and, really, the first time she has been in any sort of spontaneous setting since she was chosen."
        },
        {
            "id": 26,
            "text": "Such forums are not her forte — she’s better working from prepared remarks — so Mr. Biden’s top aides will be keeping a close eye on how closely she sticks to her talking points."
        },
        {
            "id": 27,
            "text": "That could help shape the nature of the events she does in the final stretch of the campaign."
        }
    ]
}