{
    "title": "Central figure in IRS tea party controversy resigns",
    "text": [
        {
            "id": 0,
            "text": "Lois Lerner, a central figure in the Internal Revenue Service’s tea party controversy, resigned Monday morning after an internal-\n\nreview board determined that she should be removed from the agency for “neglect of duties,” according to a statement from the top Democrat on the House Ways and Means Committee."
        },
        {
            "id": 1,
            "text": "The IRS confirmed Lerner’s resignation but said it could not comment further because of federal privacy rules."
        },
        {
            "id": 2,
            "text": "Lerner’s attorney did not respond to requests for comment Monday."
        },
        {
            "id": 3,
            "text": "An inspector general’s audit found that the IRS had inappropriately targeted groups for extra scrutiny based on their political leanings, leading to congressional and Justice Department investigations and a leadership shake-up, including the forced resignation of former agency commissioner Steven Miller, and Lerner being placed on administrative leave."
        },
        {
            "id": 4,
            "text": "Lerner, head of the IRS’s exempt-organizations division, invoked her Fifth Amendment right against self-incrimination when she appeared before a congressional panel in May."
        },
        {
            "id": 5,
            "text": "But she did tell the panel that she had not done anything wrong and had not broken any laws."
        },
        {
            "id": 6,
            "text": "Democrats and Republicans alike had called for her removal."
        },
        {
            "id": 7,
            "text": "“Lois Lerner is being held responsible for her gross mismanagement of the IRS tax-exempt division, which led to improper handling of applications for tax-exempt status,” Rep. Sander M. Levin (Mich.), the ranking Democrat on the House Ways and Means Committee, said in a statement Monday."
        },
        {
            "id": 8,
            "text": "Lawmakers have disagreed over the implications of the IRS controversy and what to do next after numerous hearings."
        },
        {
            "id": 9,
            "text": "GOP lawmakers have said that the IRS actions were politically motivated and aimed at conservatives during the 2010 and 2012 elections."
        },
        {
            "id": 10,
            "text": "Democrats say the problems resulted from poor management and confusion over how much political activity is acceptable for “social welfare” groups that apply for tax-exempt status."
        },
        {
            "id": 11,
            "text": "Democrats released documents , including IRS training materials and congressional interviews with agency staff, showing that the IRS targeted groups from both sides of the political spectrum."
        },
        {
            "id": 12,
            "text": "Republicans on Monday said Lerner’s departure will not deter their investigations."
        },
        {
            "id": 13,
            "text": "“Just because Lois Lerner is retiring from the IRS does not mean the investigation is over,” Sen. Orrin G. Hatch (Utah), the ranking Republican on the Senate Finance Committee, said in a statement."
        },
        {
            "id": 14,
            "text": "House Oversight and Government Reform Committee Chairman Darrell Issa (R-Calif.) said key questions remain."
        },
        {
            "id": 15,
            "text": "“We still don’t know why Lois Lerner, as a senior IRS official, had such a personal interest in directing scrutiny and why she denied improper conduct to Congress,” he said in a statement."
        },
        {
            "id": 16,
            "text": "Levin noted that neither the inspector general nor the review board found conclusive evidence of politicalbias or willful misconduct by the IRS."
        },
        {
            "id": 17,
            "text": "“The basic overreaching premise of the Republicans that the IRS had an ‘enemies list’ and was being influenced from the outside has been proven wrong again, as it has again and again,” he said, adding that GOP lawmakers should acknowledge IRS moves to address its missteps."
        },
        {
            "id": 18,
            "text": "The IRS first acknowledged that it had targeted tea party groups when Lerner answered a planted question at a legal conference in May. Administration officials quickly said the actions were not politically motivated."
        }
    ]
}