{
    "title": "Former top U.S. security officials decry Trump's emergency bid",
    "text": [
        {
            "id": 0,
            "text": "Nearly 60 former senior U.S. national security officials on Monday rejected President Donald Trump’s national emergency declaration, saying there was “no factual basis” to circumvent Congress to build his long-promised border wall."
        },
        {
            "id": 1,
            "text": "U.S. President Donald Trump speaks during a meeting with U.S. Governors at the White House in Washington, U.S., February 25, 2019."
        },
        {
            "id": 2,
            "text": ""
        },
        {
            "id": 3,
            "text": "In an 11-page letter, former Secretaries of State Madeleine Albright and John Kerry, both Democrats, along with former Republican Defense Secretary Chuck Hagel and others, said there was no documented emergency at the U.S. border with Mexico."
        },
        {
            "id": 4,
            "text": "Diverting funds to the project will “undermine U.S. national security and foreign policy interests,” the 58 ex-officials wrote in the letter, first reported by the Washington Post."
        },
        {
            "id": 5,
            "text": "Trump moved to redirect federal funds intended for other purposes to build the border wall after Congress rejected his demand for $5.7 billion in construction money."
        },
        {
            "id": 6,
            "text": "His effort already faces numerous challenges, including multiple lawsuits."
        },
        {
            "id": 7,
            "text": "Democrats have also launched a resolution to stop Trump’s border emergency and, on Tuesday, the Democratically controlled House of Representatives is scheduled to vote on the measure aimed at stopping it."
        },
        {
            "id": 8,
            "text": "The resolution’s fate is less clear in the U.S. Senate, which is controlled by Trump’s fellow Republicans, though some Republicans have expressed concern about his declaration."
        },
        {
            "id": 9,
            "text": "In a separate letter on Monday, 23 former Republican U.S. lawmakers also urged current members of Congress to pass the resolution, Politico reported."
        },
        {
            "id": 10,
            "text": "Even if it passes, Trump has said he would veto it, and Congress would need to muster two-thirds of lawmakers to override a veto."
        },
        {
            "id": 11,
            "text": "Trump on Monday continued to defend the declaration on Twitter and called on Republican senators to stand by him."
        },
        {
            "id": 12,
            "text": "“Be strong and smart, don’t fall into the Democrats ‘trap’ of Open Borders and Crime!”"
        },
        {
            "id": 13,
            "text": "he wrote."
        },
        {
            "id": 14,
            "text": "The former security officials, in Monday’s letter, cited U.S. government statistics showing illegal border crossings at nearly 40-year lows."
        },
        {
            "id": 15,
            "text": "They also pointed to other government data on drug trafficking that showed most opioids enter the country via legal entry points -- something they said a border wall would not stop."
        },
        {
            "id": 16,
            "text": "“There is no factual basis for the declaration of a national emergency for the purpose of circumventing the appropriations process and reprogramming billions of dollars in funding to construct a wall at the southern border,” they wrote."
        },
        {
            "id": 17,
            "text": "While the letter included both Republicans and Democrats, as well as career civil servants who served under presidents of both parties, the bulk of its most senior signatories rose to their top positions under Democratic presidents."
        },
        {
            "id": 18,
            "text": "Among these former officials were CIA Director and Defense Secretary Leon Panetta, CIA Director John Brennan, White House National Security Adviser Susan Rice, Deputy Secretary of State Antony Blinken and Deputy CIA Director David Cohen, all of whom held those posts under Democratic President Barack Obama."
        },
        {
            "id": 19,
            "text": "However, the list also included lower-level former officials such as John Bellinger, a former State Department legal adviser, and Eliot Cohen, a former State Department counselor, both of whom served under Republican President George W. Bush."
        }
    ]
}