{
    "title": "F.D.A. to Release Stricter Guidelines for Emergency Vaccine Authorization",
    "text": [
        {
            "id": 0,
            "text": "The Food and Drug Administration plans to soon issue stricter guidelines for the emergency authorization of any new coronavirus vaccine, adding a new layer of caution to the vetting process even as President Trump continues to contradict his own scientific experts and promise that a vaccine will be available as early as next month."
        },
        {
            "id": 1,
            "text": "The guidelines, which may be formally released as early as this week if approved by the White House, would lay out more specific criteria for clinical trial data and recommend that the data be vetted by a committee of independent experts before the F.D.A. authorizes any vaccine, according to several people familiar with the draft."
        },
        {
            "id": 2,
            "text": "The guidelines would be the most detailed description yet by the federal government about how the vaccine vetting process will proceed."
        },
        {
            "id": 3,
            "text": "With the election just six weeks away, Mr. Trump has repeatedly promised that the nation’s problems will soon be solved with a vaccine, although no vaccine has yet been proven to work."
        },
        {
            "id": 4,
            "text": "His own scientific experts continue to counter his statements, telling Congress that it will likely be the middle of next year, if not later, before a vaccine is readily available to most Americans."
        },
        {
            "id": 5,
            "text": "Drafted by a small group of career scientists at the F.D.A., the guidelines state that participants in late-stage trials should be tracked for a median of two months after receiving the final dose before an emergency authorization can be considered."
        },
        {
            "id": 6,
            "text": "Two companies with vaccine candidates in active Phase 3 trials — Pfizer and Moderna — both require two doses."
        },
        {
            "id": 7,
            "text": "Vaccine regulators have been concerned that a vaccine may only induce short-term immunity."
        },
        {
            "id": 8,
            "text": "The two-month threshold would make it easier to predict whether a vaccine can produce long-term responses, one person familiar with the guidance said."
        },
        {
            "id": 9,
            "text": "The draft guidelines also call for a more thorough safety follow-up with participants who would receive a vaccine under emergency authorization."
        },
        {
            "id": 10,
            "text": "The guidelines ask the sponsor — such as the drugmaker or Operation Warp Speed, the federal government’s crash vaccine program — to present such a plan."
        },
        {
            "id": 11,
            "text": "They also call for at least five cases of severe infection in the placebo group of a vaccine trial, as a way to assess whether participants who do receive the vaccine are at lower risk for more complicated cases of Covid-19, the disease caused by the coronavirus."
        },
        {
            "id": 12,
            "text": "Because approximately 10 percent of cases tend to be severe, this threshold of five would correspond to about 50 total cases of Covid-19 in the placebo group."
        },
        {
            "id": 13,
            "text": "And the guidelines recommend standards for manufacturing and testing vaccines seeking emergency authorization, enabling the F.D.A. to determine that a vaccine manufactured after an emergency approval will be as safe and effective as the materials tested in clinical trials."
        },
        {
            "id": 14,
            "text": "The Washington Post first reported the upcoming guidance."
        },
        {
            "id": 15,
            "text": "The guidelines have already passed muster with the Department of Health and Human Services and been circulated to various agencies under it, including the Centers for Disease Control and Prevention."
        },
        {
            "id": 16,
            "text": "But changes could still be made before their release."
        },
        {
            "id": 17,
            "text": "Guidelines of this type are routinely reviewed by the White House Office of Management and Budget."
        },
        {
            "id": 18,
            "text": "The agency’s vaccine advisory committee typically examines data in a public meeting before the agency grants approval, but the process is not mandatory."
        },
        {
            "id": 19,
            "text": "By setting out its expectations in written guidance, the agency appears to be trying to reassure the American public and, some experts suggest, ward off possible political interference by the White House."
        },
        {
            "id": 20,
            "text": "In June, the F.D.A. said that a company would need to prove through randomized clinical trials that its vaccine was safe and at least 50 percent effective to qualify for approval."
        },
        {
            "id": 21,
            "text": "Dr. Hahn has publicly promised that any vaccine would be vetted by the advisory committee, but he could be overruled by Alex M. Azar II, the health secretary, or the White House."
        },
        {
            "id": 22,
            "text": "The F.D.A.’s effort to shore up its credibility follows multiple missteps."
        },
        {
            "id": 23,
            "text": "After the president touted the malaria drug hydroxychloroquine, the agency gave the drug emergency authorization as a Covid-19 treatment, only to reverse the decision three months later because of lack of evidence of the benefits."
        },
        {
            "id": 24,
            "text": "The C.D.C. has also bent under political pressure, including delaying important scientific reports on Covid-19 after officials loyal to Mr. Trump objected to them."
        },
        {
            "id": 25,
            "text": "A look at all the vaccines that have reached trials in humans."
        }
    ]
}