{
    "title": "Mike Huckabee Slams Obama Cabinet's Lack Of Diversity ",
    "text": [
        {
            "id": 0,
            "text": "Mike Huckabee criticized President Obama on Wednesday for the lack of diversity in his cabinet, accusing the president of waging his own \"war on women\" by not appointing more women to top administration posts."
        },
        {
            "id": 1,
            "text": "\"Now a lot of those females who supported Barack Obama are scratching their heads, and they’re saying, ‘Whoa!"
        },
        {
            "id": 2,
            "text": "How come there is so much testosterone in the Obama Cabinet and so little estrogen?'\""
        },
        {
            "id": 3,
            "text": "the former Arkansas governor and one-time Republican presidential candidate said during his radio show."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "\"Because if you look around, all of these high-powered appointments that he is making are all white guys.\""
        },
        {
            "id": 6,
            "text": "According to Huckabee, Obama used charges of a Republican \"war on women\" and promises of \"contraceptives and free abortions” to get women to vote for him, but \"never promised women would have seats of significance at the table of power.\""
        },
        {
            "id": 7,
            "text": "“But don’t worry about positions of authority,” he sarcastically continued."
        },
        {
            "id": 8,
            "text": "“They shouldn’t be asking for such things.”"
        },
        {
            "id": 9,
            "text": "As many of his cabinet members depart their posts at the outset of his second term, Obama has faced scrutiny over the dearth of women being appointed to seats left vacant by the likes of Secretary of State Hillary Clinton, Treasury Secretary Timothy Geithner, and Defense Secretary Leon Panetta."
        },
        {
            "id": 10,
            "text": "Earlier this week, Obama announced his nomination of former Sen. Chuck Hagel (R-Neb.) to take over for Panetta at the Pentagon."
        },
        {
            "id": 11,
            "text": "Obama is expected to announce White House Chief of Staff Jack Lew as his pick for Treasury Secretary on Thursday."
        },
        {
            "id": 12,
            "text": "Obama also nominated Deputy National Security Advisor for Homeland Security John Brennan to be director of the Central Intelligence Agency."
        },
        {
            "id": 13,
            "text": "None of the recent cabinet appointments the president has made have been women."
        },
        {
            "id": 14,
            "text": "While Obama's top pick to fill Clinton's role was U.N. Ambassador Susan Rice, she withdrew her name from consideration after Republicans vowed to wage a brutal confirmation fight."
        },
        {
            "id": 15,
            "text": "Obama instead nominated Sen. John Kerry (D-Mass.)."
        },
        {
            "id": 16,
            "text": "On Wednesday, Labor Secretary Hilda Solis announced her resignation, marking another female departure from the administration."
        },
        {
            "id": 17,
            "text": "According to the New York Times, about 43 percent of Obama's appointees have been women -- more women than George W. Bush appointed, but about the same ratio as Bill Clinton."
        },
        {
            "id": 18,
            "text": "\"We’re not only getting better than previous administrations, but we also want to get better ourselves as well,” Nancy D. Hogan, assistant to the president and director of presidential personnel, told the Times."
        },
        {
            "id": 19,
            "text": "\"The president puts a premium on making his team representative of the American people.\""
        },
        {
            "id": 20,
            "text": ""
        }
    ]
}