{
    "title": "Trump publicly breaks his silence after former \"fixer\" sentenced to 3 years in prison",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON, DC - SEPTEMBER 25: The U.S. Capitol on September 25, 2021 in Washington, DC."
        },
        {
            "id": 1,
            "text": "The House Budget Committee is expected to advance Democrats $3.5 trillion social spending plan during a rare Saturday session, setting it up for a full floor vote next week."
        },
        {
            "id": 2,
            "text": "(Photo by Stefani Reynolds/Getty Images)"
        },
        {
            "id": 3,
            "text": "A timeline of all the ways Trump tried to steal 2020 election\n\nCNN —\n\nPresident Donald Trump publicly broke his silence Thursday morning on the sentencing of his former personal attorney and “fixer” Michael Cohen."
        },
        {
            "id": 4,
            "text": "The President did not dispute directing Cohen to make payments to women who accused him of having an affair in order to keep them quiet, but said he did not direct Cohen to break the law while doing so."
        },
        {
            "id": 5,
            "text": "“I never directed Michael Cohen to break the law."
        },
        {
            "id": 6,
            "text": "He was a lawyer and he is supposed to know the law,” Trump tweeted."
        },
        {
            "id": 7,
            "text": "“It is called ‘advice of counsel,’ and a lawyer has great liability if a mistake is made,” he added."
        },
        {
            "id": 8,
            "text": "During an interview with Fox News that aired later Thursday, Trump dismissed Cohen’s more than decade-long work with his company, saying Cohen did “very low-level work” and more public relations than law."
        },
        {
            "id": 9,
            "text": "“I never directed him to do anything wrong."
        },
        {
            "id": 10,
            "text": "Whatever he did he did on his own."
        },
        {
            "id": 11,
            "text": "He’s a lawyer."
        },
        {
            "id": 12,
            "text": "A lawyer who represents a client is supposed to do the right thing."
        },
        {
            "id": 13,
            "text": "That’s why you pay them a lot of money,” the President added."
        },
        {
            "id": 14,
            "text": "Cohen was sentenced to three years in prison Wednesday for crimes that included making false statements to Congress, tax evasion, and arranging payments during the 2016 election to silence women who claimed they had affairs with Trump."
        },
        {
            "id": 15,
            "text": "Trump denies those claims."
        },
        {
            "id": 16,
            "text": "Cohen attributed his offenses related to Trump to his “duty to cover up his dirty deeds.”"
        },
        {
            "id": 17,
            "text": "As the courtroom drama unfolded Wednesday, Trump remained largely silent and ignored reporters’ questions about Cohen during an executive order signing event at the White House."
        },
        {
            "id": 18,
            "text": "But CNN reported that the President was privately seething about Cohen’s sentencing, telling associates that Cohen is a “liar,” according to one administration official."
        },
        {
            "id": 19,
            "text": "While the White House did not comment on Trump’s private conversations, one official pointed to a tweet Trump sent last week as an indication of his sentiments."
        },
        {
            "id": 20,
            "text": "“He lied for this outcome and should, in my opinion, serve a full and complete sentence,” Trump tweeted about Cohen last week."
        },
        {
            "id": 21,
            "text": "Trump, during his Fox News interview, also tried to distance himself from the two campaign finance charges related to payments Cohen arranged for two women who claimed they had affairs with Trump."
        },
        {
            "id": 22,
            "text": "The President said the charges “are not criminal and shouldn’t have been on there.”"
        },
        {
            "id": 23,
            "text": "“They put that on there to embarrass me,” he said, adding, “What happened was, either Cohen or the prosecutors in order to embarrass me, said, ‘Listen, I’m making this deal for reduced time and everything else – do me a favor, put these two charges on.’"
        },
        {
            "id": 24,
            "text": "“"
        }
    ]
}