{
    "title": "Tillerson, G7 ministers look to pressure Russia to reconsider Assad support",
    "text": [
        {
            "id": 0,
            "text": "Secretary of State Rex Tillerson, along with six other Group of Seven foreign ministers, aims to send Russia a “clear and coordinated message” in the wake of the U.S.’ response to a gas attack in Syria that left scores dead."
        },
        {
            "id": 1,
            "text": "Tillerson, British Foreign Secretary Boris Johnson, Japanese Foreign Minister Fumio Kishida and the other ministers aim to pressure Russia to end its support for Syrian President Bashar al-Assad after a tumultuous week, which included the nerve gas attack and the U.S.’ airstrikes on a Syrian air base."
        },
        {
            "id": 2,
            "text": "The U.S. received broad support from Europe after the airstrikes."
        },
        {
            "id": 3,
            "text": "Italian Foreign Minister Angelino Alfano, who is hosting the meeting, said the missile strike contributed to a “renewed harmony” between the U.S. and its partners ahead of the first meeting of G7 foreign ministers since President Trump took office."
        },
        {
            "id": 4,
            "text": "\"We need to remember that not 10 years ago, but 100 or 120 days ago, the concern in Europe was that the United States and the EU were moving apart,\" Alfano told Sky TG24 Sunday."
        },
        {
            "id": 5,
            "text": "\"I welcome this renewed harmony.\""
        },
        {
            "id": 6,
            "text": "With ties between the U.S. and Europe seemingly getting better, there has been no indication President Vladimir Putin was going to move from his position on the Assad regime in Syria."
        },
        {
            "id": 7,
            "text": "Russia and Iran said in a joint statement Sunday that the countries would “respond to any aggression” in wake of the airstrikes in Syria."
        },
        {
            "id": 8,
            "text": "“What America waged in an aggression on Syria is a crossing of red lines,” the countries said, The Sun reported."
        },
        {
            "id": 9,
            "text": "“From now on we will respond with force to any aggressor or any breach of red lines from whoever it is and America knows our ability to respond well.”"
        },
        {
            "id": 10,
            "text": "H.R. McMaster, President Trump’s national security adviser, said in an interview on “Fox News Sunday” that Russia should re-evaluate its support for Assad."
        },
        {
            "id": 11,
            "text": "He added that Russia will have to decide whether it wanted to continue backing a “murderous regime” as Trump weighed the next steps against Syria."
        },
        {
            "id": 12,
            "text": "Tillerson is expected to meet with Russian Foreign Minister Sergey Lavrov after the G7 meeting."
        },
        {
            "id": 13,
            "text": ""
        }
    ]
}