{
    "title": "Michael Cohen Tape Suggests Team Trump Lied About Karen McDougal",
    "text": [
        {
            "id": 0,
            "text": "A recording of then-candidate Donald Trump talking about a payment to a woman who claimed they’d had an affair suggests Trump’s team later lied about his knowledge of the payment."
        },
        {
            "id": 1,
            "text": "The tape, first reported by The New York Times on Friday but not made public, reportedly features Trump speaking with his longtime attorney Michael Cohen about a payment to former Playboy model Karen McDougal two months before the 2016 presidential election."
        },
        {
            "id": 2,
            "text": "The recording was among the documents and items the FBI seized from Cohen during a raid of his New York office earlier this year."
        },
        {
            "id": 3,
            "text": "McDougal, who claims she began an affair with Trump in 2006, sold her story to The National Enquirer in 2016 for $150,000."
        },
        {
            "id": 4,
            "text": "The Enquirer is owned by American Media Inc, whose CEO, David Pecker, is a friend of Trump’s."
        },
        {
            "id": 5,
            "text": "The tabloid sat on the story, preventing it from being made public in a practice known as “catch and kill.”"
        },
        {
            "id": 6,
            "text": "The deal effectively ensured McDougal’s silence for the remainder of the presidential campaign."
        },
        {
            "id": 7,
            "text": "Asked about the deal just days before the 2016 election, Trump campaign spokeswoman Hope Hicks told The Wall Street Journal: “We have no knowledge of any of this.”"
        },
        {
            "id": 8,
            "text": "Hicks also called McDougal’s claim that she had an affair with Trump “totally untrue.”"
        },
        {
            "id": 9,
            "text": "Rudy Giuliani, another attorney for the president, confirmed the recording’s existence on Friday, but dismissed its significance."
        },
        {
            "id": 10,
            "text": "According to the Times, the Justice Department seized the documents and recordings from Cohen’s office in part to investigate whether payments to women alleging affairs with the president constituted illegal campaign contributions or violations of federal campaign finance laws."
        },
        {
            "id": 11,
            "text": "The AMI payment to McDougal could have constituted an illegal campaign contribution."
        },
        {
            "id": 12,
            "text": "The White House did not immediately respond to HuffPost’s request for comment."
        }
    ]
}