{
    "title": "Trump’s Ryan endorsement infuriates anti-establishment activists: ‘Sold us out’",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump on Friday endorsed House Speaker Paul D. Ryan, ending days of hesitation by the Republican presidential nominee to get behind the party’s most powerful elected leader."
        },
        {
            "id": 1,
            "text": "“In our shared mission to make American great again, I support and endorse our speaker of the House, Paul Ryan."
        },
        {
            "id": 2,
            "text": "He’s a good man,” Mr. Trump said at a campaign rally in Mr. Ryan’s home state of Wisconsin."
        },
        {
            "id": 3,
            "text": "The endorsement sent a clear message that the New York billionaire was ready to work with the Republican Party establishment that had opposed his candidacy for the start."
        },
        {
            "id": 4,
            "text": "However, it also infuriated grass-roots conservative who wanted Mr. Trump to help overthrow establishment figures such as Mr. Ryan, who are viewed as fake conservatives or RINOs, the derogatory acronym for those deemed to be Republicans in name only."
        },
        {
            "id": 5,
            "text": "Mr. Trump had withheld his endorsement in Mr. Ryan’s primary race against an anti-establishment rival Paul Nehlen, who is a strong Trump supporter."
        },
        {
            "id": 6,
            "text": "Mr. Trump in recent days had said that he “wasn’t there yet” in backing Mr. Ryan, echoing the speaker’s earlier comments when he resisted endorsing Mr. Trump."
        },
        {
            "id": 7,
            "text": "At the rally in Green Bay, Wisconsin, Mr. Trump said he was following Ronald Reagan’s tenet that an 80 percent ally was not a 20 percent enemy."
        },
        {
            "id": 8,
            "text": "“We may disagree on a couple of things, but mostly we agree."
        },
        {
            "id": 9,
            "text": "And we’re going to get it done, and we’re going to do a lot of wonderful [things],” Mr. Trump said."
        },
        {
            "id": 10,
            "text": "Mr. Trump also announced endorsements for a couple Senate Republican incumbents in tough races who have been tentative in their support for him: Arizona Sen. John McCain and New Hampshire Sen. Kelly Ayotte."
        },
        {
            "id": 11,
            "text": "The trio of endorsements — especially the one for Mr. Ryan — shocked some of Mr. Trump’s diehard supporters."
        },
        {
            "id": 12,
            "text": "“He has broken our heart doing this tonight,” said Trump supporter Sue Payne, a conservative activist working to defeat Mr. Ryan."
        },
        {
            "id": 13,
            "text": "“We finally thought we had a voice to stand up against the RINO establishment."
        },
        {
            "id": 14,
            "text": "He sold us out,” she said."
        },
        {
            "id": 15,
            "text": "“What happened tonight is the establishment got their claws in him and they are pulling the strings."
        },
        {
            "id": 16,
            "text": "What do we believe now?”"
        },
        {
            "id": 17,
            "text": "Mr. Nehlen said he understood Mr. Trump’s decision to back the party leadership."
        },
        {
            "id": 18,
            "text": "“Given his stature as our party’s official nominee, Mr. Trump’s decision to support the Republican Speaker is appropriate and is a display of true leadership,” Mr. Nehlen said in a statement."
        },
        {
            "id": 19,
            "text": "“Mr. Trump’s early refusal to endorse Ryan sent a clear signal to Wisconsin voters that Ryan is not his preferred candidate in this race."
        },
        {
            "id": 20,
            "text": "Speaker Ryan’s globalist agenda stands in clear opposition to the will of the Republican electorate, who want safe communities, immigration control, smart trade deals, and leaders who put the needs of the American people first,” he said."
        },
        {
            "id": 21,
            "text": "Mr. Nehlen faced an uphill in taking on the powerful House speaker."
        },
        {
            "id": 22,
            "text": "Mr. Ryan leads Mr. Nehlen in the Janesville district 80 percent to 14 percent, according to a Remington Research Group poll released Friday."
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": ""
        },
        {
            "id": 26,
            "text": ""
        }
    ]
}