{
    "title": "Gov. Jan Brewer to CNN: 'I will do the right thing for the state of Arizona'",
    "text": [
        {
            "id": 0,
            "text": "8 years ago\n\n– Arizona Gov. Jan Brewer tells CNN she will make her decision in the “near future” about whether to sign or veto a bill that supporters say promotes religious freedom and opponents call discriminatory against gays and lesbians."
        },
        {
            "id": 1,
            "text": "“I can assure you, as always, I will do the right thing for the state of Arizona,” Brewer told CNN in an exclusive interview at the site of the National Governors Association meeting in Washington."
        },
        {
            "id": 2,
            "text": "[twitter-follow screen_name='politicalticker'][twitter-follow screen_name='DanaBashCNN']\n\nBrewer plans to return to Arizona Tuesday, and a source tells CNN those familiar with her thinking say she will likely spend at least one full business day in the state before acting."
        },
        {
            "id": 3,
            "text": "She has until Saturday morning to sign or veto the bill."
        },
        {
            "id": 4,
            "text": "If she does nothing, the bill automatically becomes law."
        },
        {
            "id": 5,
            "text": "The measure would allow Arizona business owners to deny service to gay and lesbian customers as long as they assert their religious beliefs."
        },
        {
            "id": 6,
            "text": "“I'm going to go home, and when I receive the bill, I'm going to read it"
        },
        {
            "id": 7,
            "text": "and I'm going to be briefed on it."
        },
        {
            "id": 8,
            "text": "We have been following it."
        },
        {
            "id": 9,
            "text": "And I will make my decision in the near future,” Brewer told CNN."
        },
        {
            "id": 10,
            "text": "Although she was cautious in her public comments, some Arizona Republicans who know her well say they are confident that when she says she will \"do the right thing,\" that almost surely means vetoing the bill."
        },
        {
            "id": 11,
            "text": "Arizona GOP sources say Brewer considers herself a pro-business governor - someone who above all else wants to protect and promote Arizona’s economic interests - and she knows full well there will be economic retribution against the state if it has a law on the books perceived to effectively codify discrimination."
        },
        {
            "id": 12,
            "text": "“I have a history of deliberating and having an open dialogue on bills that are controversial, to listen to both sides of those issues, and I welcome the input, and information that they can provide to me."
        },
        {
            "id": 13,
            "text": "And certainly I am pro-business, and that is what's turning our economy around, so I appreciate their input, as I appreciate the other side,” Brewer said."
        },
        {
            "id": 14,
            "text": "Business leaders in Arizona and around the country, including American Airlines’ CEO, have urged Brewer publicly and privately to veto the bill."
        },
        {
            "id": 15,
            "text": "The measure is being pushed by the Center for Arizona Policy, a conservative group opposed to abortion and same-sex marriage."
        },
        {
            "id": 16,
            "text": "The group argues the proposal protects people against increasingly activist federal courts."
        },
        {
            "id": 17,
            "text": "Brewer vetoed a similar bill last year, arguing that the state legislature should focus on more pressing issues, such as a Medicaid expansion plan she was promoting."
        },
        {
            "id": 18,
            "text": "Sources say she is concerned about this bill taking away from other issues she is now pressing, such as overhauling Arizona’s child protective services system."
        }
    ]
}