{
    "title": "Republican lawmakers disrupt Democratic-led Trump impeachment inquiry",
    "text": [
        {
            "id": 0,
            "text": "Republican lawmakers, encouraged by President Donald Trump to get tougher in fighting Democrats’ attempts to impeach him, on Wednesday disrupted the U.S. House of Representatives impeachment inquiry and prevented a Pentagon official from testifying."
        },
        {
            "id": 1,
            "text": "The Republicans stormed into a hearing room where Laura Cooper, the U.S. defense official who oversees Ukraine and Russia matters, was due to testify behind closed doors and began yelling, lawmakers and aides said."
        },
        {
            "id": 2,
            "text": "The impeachment inquiry focuses on Trump’s request for Ukraine to investigate a domestic rival - Democrat Joe Biden - for his personal political benefit."
        },
        {
            "id": 3,
            "text": "In a dramatic confrontation during an escalating probe that threatens Trump’s presidency even as he seeks re-election next year, Capitol police were called in to clear the room and bring order, a Republican congressional aide said."
        },
        {
            "id": 4,
            "text": "A witness inside the room said the Republicans brought cellphones into the high-security facility where electronic devices are forbidden."
        },
        {
            "id": 5,
            "text": "“They’re freaked out."
        },
        {
            "id": 6,
            "text": "They’re trying to stop this investigation,” Democratic Representative Ted Lieu said."
        },
        {
            "id": 7,
            "text": "“They don’t want to hear from witness Cooper today."
        },
        {
            "id": 8,
            "text": "They know more facts are going to be delivered which are absolutely damning to the president of the United States.”"
        },
        {
            "id": 9,
            "text": "Republican Representative Mark Meadows told reporters of the situation in the hearing room: “There’s about 20 members (lawmakers) down there, at least a dozen that are not on the three committees."
        },
        {
            "id": 10,
            "text": "And they’re going to wait until there’s a more open and transparent process.”"
        },
        {
            "id": 11,
            "text": "Republicans have called the rules for the impeachment inquiry set by the leaders of the Democratic-led House unfair."
        },
        {
            "id": 12,
            "text": "The U.S. Constitution gives the House wide latitude in how to conduct the impeachment process and set rules for the inquiry."
        },
        {
            "id": 13,
            "text": "The witness who saw the events said the Republican lawmakers pushed past Capitol Police personnel and started yelling, voicing their objections to decisions made by the Democratic leaders of the House to hold depositions in closed sessions and not release transcripts of the testimony."
        },
        {
            "id": 14,
            "text": "Republican Representative Matt Gaetz, an outspoken Trump supporter who led Wednesday’s action, had tried to enter the committee room last week but was turned away because he was not a member of any of the three committees leading the investigation."
        },
        {
            "id": 15,
            "text": "Democratic Representative Stephen Lynch, who is allowed to attend depositions as a member of House Oversight Committee, said Cooper did not testify."
        },
        {
            "id": 16,
            "text": "A House aide said the day’s impeachment-related proceedings were suspended for the time being."
        },
        {
            "id": 17,
            "text": "Democratic Representative Eric Swalwell told reporters that the Republicans had compromised a secure area of the Capitol, obstructing the impeachment inquiry and sought to intimidate a witness, but would not delay the impeachment probe overall."
        },
        {
            "id": 18,
            "text": "“We see this a an effort not only to intimidate this witness but also to intimidate future witnesses from coming forward."
        },
        {
            "id": 19,
            "text": "It’s not going to work,” Swalwell added."
        },
        {
            "id": 20,
            "text": "“We’re not going to be deterred,” Swalwell added."
        },
        {
            "id": 21,
            "text": "Cooper, the deputy assistant secretary of defense for Russia, Ukraine and Eurasia, earlier in the day arrived for testimony and was expected to face questions about Trump’s decision this year to withhold $391 million in security assistance to Ukraine approved by Congress."
        },
        {
            "id": 22,
            "text": "In testimony to the inquiry on Tuesday, William Taylor, the top U.S. diplomat in Ukraine, said Trump had made the aid contingent on Ukraine announcing it would conduct politically motivated investigations the president demanded."
        },
        {
            "id": 23,
            "text": ""
        },
        {
            "id": 24,
            "text": ""
        },
        {
            "id": 25,
            "text": "Trump on Monday told reporters that “Republicans have to get tougher and fight” the impeachment, saying the Democrats “vicious and they stick together.”"
        },
        {
            "id": 26,
            "text": "“It never ends."
        },
        {
            "id": 27,
            "text": "The Do Nothing Dems are terrible!”"
        },
        {
            "id": 28,
            "text": "Trump wrote on Twitter earlier on Wednesday, later adding their “case is DEAD!”"
        },
        {
            "id": 29,
            "text": "Before the hearing room was stormed, dozens of House Republicans appeared before reporters with some denouncing the impeachment process run by Democrats as a “joke,” a “railroad job,” a “charade” and “Soviet-style.”"
        },
        {
            "id": 30,
            "text": "They complained that testimony was being taken privately rather than in public hearings and that the House did not hold a vote formally authorizing the investigation."
        },
        {
            "id": 31,
            "text": "“It is a sham, and it’s time for it to end,” Republican congressman Mark Walker said."
        },
        {
            "id": 32,
            "text": "The inquiry could lead to the House passing formal charges known as articles of impeachment, prompting a trial in the Republican-controlled Senate on whether to remove Trump from office."
        },
        {
            "id": 33,
            "text": "Senate Republicans have shown little appetite for removing Trump."
        },
        {
            "id": 34,
            "text": "As she arrived at the U.S. Capitol, Cooper did not answer questions from reporters."
        },
        {
            "id": 35,
            "text": "She apparently appeared voluntarily before the lawmakers as the Pentagon had not blocked her from testifying."
        },
        {
            "id": 36,
            "text": "The Trump administration had sought to block testimony by several other current and former officials."
        },
        {
            "id": 37,
            "text": "Taylor testified that he was told by the U.S. envoy to the European Union, that Trump had linked the aid’s release to public declarations by Ukrainian President Volodymyr Zelenskiy that he would investigate Biden, his son Hunter Biden’s tenure on the board of a Ukrainian energy company called Burisma, and a debunked conspiracy theory that Ukraine, and not Russia, meddled in the 2016 U.S. presidential election."
        },
        {
            "id": 38,
            "text": "The impeachment inquiry, triggered by a whistleblower complaint against Trump by a person within the U.S. intelligence community, focuses on a July 25 telephone call in which Trump asked Zelenskiy to carry out those two investigations."
        },
        {
            "id": 39,
            "text": "Zelenskiy agreed during the call."
        },
        {
            "id": 40,
            "text": "The aid was later provided."
        },
        {
            "id": 41,
            "text": "Federal election law prohibits candidates from accepting foreign help in an election."
        },
        {
            "id": 42,
            "text": "So far, few of Trump’s fellow conservatives have appeared inclined toward his removal, though there have been some cracks in their support."
        },
        {
            "id": 43,
            "text": "Senator John Thune, the Senate’s No. 2 Republican, told reporters that the picture painted by Taylor’s testimony “based on the reporting that we’ve seen is not a good one.”"
        }
    ]
}