{
    "title": "Justice Department Finds Pattern of Police Bias and Excessive Force in Ferguson",
    "text": [
        {
            "id": 0,
            "text": "WASHINGTON — Ferguson, Missouri, is a third white, but the crime statistics compiled in the city over the past two years seemed to suggest that only black people were breaking the law."
        },
        {
            "id": 1,
            "text": "They accounted for 85 percent of traffic stops, 90 percent of tickets and 93 percent of arrests."
        },
        {
            "id": 2,
            "text": "In cases like jaywalking, which often hinge on police discretion, blacks accounted for 95 percent of all arrests."
        },
        {
            "id": 3,
            "text": "The racial disparity in those statistics was so stark that the Justice Department has concluded in a report scheduled for release on Wednesday that there was only one explanation: The Ferguson Police Department was routinely violating the constitutional rights of its black residents."
        },
        {
            "id": 4,
            "text": "The report, based on a six-month investigation, provides a glimpse into the roots of the racial tensions that boiled over in Ferguson last summer after a black teenager, Michael Brown, was fatally shot by a white police officer, making it a worldwide flash point in the debate over race and policing in America."
        },
        {
            "id": 5,
            "text": "It describes a city where the police used force almost exclusively on blacks and regularly stopped people without probable cause."
        },
        {
            "id": 6,
            "text": "Racial bias is so ingrained, the report said, that Ferguson officials circulated racist jokes on their government email accounts."
        },
        {
            "id": 7,
            "text": "In a November 2008 email, a city official said Barack Obama would not be president long because “what black man holds a steady job for four years?”"
        },
        {
            "id": 8,
            "text": "Another email included a cartoon depicting African-Americans as monkeys."
        },
        {
            "id": 9,
            "text": "A third described black women having abortions as a way to curb crime."
        },
        {
            "id": 10,
            "text": "“There are serious problems here that cannot be explained away,” said a law enforcement official who has seen the report and spoke on the condition of anonymity because it had not been released yet."
        },
        {
            "id": 11,
            "text": "Those findings reinforce what the city’s black residents have been saying publicly since the shooting in August, that the criminal justice system in Ferguson works differently for blacks and whites."
        },
        {
            "id": 12,
            "text": "A black motorist who is pulled over is twice as likely to be searched as a white motorist, even though searches of white drivers are more likely to turn up drugs or other contraband, the report found."
        },
        {
            "id": 13,
            "text": "Minor, largely discretionary offenses such as disturbing the peace and jaywalking were brought almost exclusively against blacks."
        },
        {
            "id": 14,
            "text": "When whites were charged with these crimes, they were 68 percent more likely to have their cases dismissed, the Justice Department found."
        },
        {
            "id": 15,
            "text": "“I’ve known it all my life about living out here,” Angel Goree, 39, who lives in the apartment complex where Mr. Brown was killed, said Tuesday by phone."
        },
        {
            "id": 16,
            "text": "Many such statistics surfaced in the aftermath of Mr. Brown’s shooting, but the Justice Department report offers a more complete look at the data than ever before."
        },
        {
            "id": 17,
            "text": "Federal investigators conducted hundreds of interviews, reviewed 35,000 pages of police records and analyzed race data compiled for every police stop."
        },
        {
            "id": 18,
            "text": "The report will most likely force Ferguson officials to either negotiate a settlement with the Justice Department or face being sued by it on charges of violating the Constitution."
        },
        {
            "id": 19,
            "text": "Under Attorney General Eric H. Holder Jr., the Justice Department has opened more than 20 such investigations into local police departments and issued tough findings against cities including Newark; Albuquerque, N.M.; and Cleveland."
        },
        {
            "id": 20,
            "text": "But the Ferguson case has the highest profile of Mr. Holder’s tenure and is among the most closely watched since the Justice Department began such investigations in 1994, spurred by the police beating of Rodney King in Los Angeles and the riots that followed."
        },
        {
            "id": 21,
            "text": "While much of the attention in Ferguson has been on Mr. Brown’s death, federal officials quickly concluded that the shooting was simply the spark that ignited years of pent-up tension and animosity in the area."
        },
        {
            "id": 22,
            "text": "The Justice Department is expected to issue a separate report Wednesday clearing the police officer, Darren Wilson, of civil rights violations in the shooting."
        },
        {
            "id": 23,
            "text": "It is not clear what changes Ferguson could make that would head off a lawsuit."
        },
        {
            "id": 24,
            "text": "The report calls for city officials to acknowledge that the police department’s tactics have caused widespread mistrust and violated civil rights."
        },
        {
            "id": 25,
            "text": "Ferguson officials have so far been reluctant to do so, particularly as relations between the city and Washington have grown strained."
        },
        {
            "id": 26,
            "text": "Mr. Holder was openly critical of the way local officials handled the protests and the investigation into Mr. Brown’s death, and declared a need for “wholesale change” in the police department."
        },
        {
            "id": 27,
            "text": "Ferguson officials criticized Mr. Holder for a rush to judgment and saw federal officials as outsiders who did not understand their city."
        },
        {
            "id": 28,
            "text": "Brian P. Fletcher, a former Ferguson mayor who is running for City Council in next month’s election, said he believed the report was unfair because the Justice Department relied on incomplete data."
        },
        {
            "id": 29,
            "text": "For example, he said, the racial disparity could be explained not by bias but by the large number of black people from surrounding towns who visit Ferguson to shop."
        },
        {
            "id": 30,
            "text": "“I know to some degree we’re already on the right track because we’ve already modified our courts to make it fairer,” he said."
        },
        {
            "id": 31,
            "text": "For Mr. Holder, the case has been deeply personal."
        },
        {
            "id": 32,
            "text": "He spoke about conversations he had as a boy with his father about what to do when stopped by the police."
        },
        {
            "id": 33,
            "text": "And he described his own experience as the victim of racial profiling."
        },
        {
            "id": 34,
            "text": "Such comments drew the ire of police groups who said Mr. Holder, the nation’s first black attorney general, was fueling anti-police sentiment in minority neighborhoods."
        },
        {
            "id": 35,
            "text": "Mr. Holder has stood by his remarks, which have since been echoed by James Comey, the F.B.I. director."
        },
        {
            "id": 36,
            "text": "The report is due to be released in Mr. Holder’s final days in office."
        },
        {
            "id": 37,
            "text": "He announced his retirement last year and plans to leave as soon as the nominee to succeed him, Loretta E. Lynch, is confirmed in the Senate."
        },
        {
            "id": 38,
            "text": "In pushing for police reforms, the Justice Department typically does not call for personnel changes, such as the firing of a police chief."
        },
        {
            "id": 39,
            "text": "Instead, it typically seek institutional changes, such as mandated training, efforts to diversify the police force and more outside oversight."
        },
        {
            "id": 40,
            "text": "In many cities, the two sides agree on a federal monitor to ensure the police department is complying."
        },
        {
            "id": 41,
            "text": "Ms. Goree said she was skeptical that changes would be made without the city’s being sued."
        },
        {
            "id": 42,
            "text": "“If the Justice Department doesn’t take it to the full extent of the law,” she said, “it’s not going to be one iota of a change.”"
        }
    ]
}