{
    "title": "Senate aides: Bipartisan deal reached on gun background checks",
    "text": [
        {
            "id": 0,
            "text": "A pair of pro-gun senators announced a compromise plan Wednesday to expand background checks for many firearm purchases."
        },
        {
            "id": 1,
            "text": "The proposal stopped short of the expansive system sought by President Obama and many gun-control advocates."
        },
        {
            "id": 2,
            "text": "But it won swift bipartisan backing and became the template for what would be the most consequential congressional action on firearm regulations since the 1990s — suddenly upending the polarized politics of gun control."
        },
        {
            "id": 3,
            "text": "It won praise from advocates of stiffer restrictions, including Obama and New York Mayor Michael R. Bloomberg (I), reflecting the eagerness on that side of the debate to score concessions after months of intense opposition from the National Rifle Association."
        },
        {
            "id": 4,
            "text": "The NRA opposed the plan, which was offered by two lawmakers it had backed for years,"
        },
        {
            "id": 5,
            "text": "Sens. Pat Toomey(R-Pa.) and Joe Manchin III (D-W.Va.)."
        },
        {
            "id": 6,
            "text": ""
        },
        {
            "id": 7,
            "text": ""
        },
        {
            "id": 8,
            "text": "But an otherwise critical statement the NRA released after a Toomey-Manchin news conference cited “a positive development” in the move toward a background check system the group viewed as less intrusive than the one being pushed by Bloomberg and the White House."
        },
        {
            "id": 9,
            "text": "The Toomey-Manchin plan would extend the current background check requirement from covering only sales at licensed dealerships to any sale that takes place at a gun show or that was advertised in print or online."
        },
        {
            "id": 10,
            "text": "However, checks would not be required for many sales between private individuals — a loophole that many gun-control advocates had hoped would be closed."
        },
        {
            "id": 11,
            "text": "The proposal also would expand some gun rights."
        },
        {
            "id": 12,
            "text": "Gun dealers would be able to sell firearms across state lines, for example, and gun owners with state-issued permits to carry concealed weapons would be allowed to take their firearms through states that don’t allow concealed weapons."
        },
        {
            "id": 13,
            "text": "The senators also called for a national commission to evaluate causes of violence, including the entertainment industry’s role."
        },
        {
            "id": 14,
            "text": "The NRA has long recommended the gun rights expansions."
        },
        {
            "id": 15,
            "text": "And gun-control advocates, including the White House, appeared ready to accept such compromises in the name of a broader deal — effectively conceding that their hopes for universal background checks and bans on military-style assault weapons and high-capacity ammunition magazines had proved unrealistic in the months since the Dec. 14 elementary school massacre in Newtown, Conn., jump-started the gun debate."
        },
        {
            "id": 16,
            "text": "“This is not my bill, and there are aspects of the agreement that I might prefer to be stronger,” Obama said in a statement Wednesday."
        },
        {
            "id": 17,
            "text": "“But the agreement does represent welcome and significant bipartisan progress."
        },
        {
            "id": 18,
            "text": "It recognizes that there are good people on both sides of this issue, and we don’t have to agree on everything to know that we’ve got to do something to stem the tide of gun violence.”"
        },
        {
            "id": 19,
            "text": "Toomey and Manchin’s appearance Wednesday followed weeks of negotiations."
        },
        {
            "id": 20,
            "text": "The Republican stepped into the mix in the final days when conversations with a GOP colleague, Sen. Tom Coburn (Okla.), stalled amid disagreements about whether an expanded check system would collect records about gun owners."
        },
        {
            "id": 21,
            "text": "Law enforcement officials say records are necessary to track criminal use of firearms, but many gun-rights activists consider them a threat to Second Amendment rights."
        },
        {
            "id": 22,
            "text": "The new proposal would require that all sales covered under a new system be recorded by licensed dealers."
        },
        {
            "id": 23,
            "text": "Toomey predicted that the plan would pick up support from conservative Senate and House Republicans."
        },
        {
            "id": 24,
            "text": "“Candidly, I don’t consider criminal background checks to be gun control,” he said."
        },
        {
            "id": 25,
            "text": "“I think it’s common sense.”"
        },
        {
            "id": 26,
            "text": "Manchin said the plan would force both sides to make concessions."
        },
        {
            "id": 27,
            "text": "“All of them have to look at it and say: Listen, are the gun show loopholes closed?"
        },
        {
            "id": 28,
            "text": "Absolutely,” he said."
        },
        {
            "id": 29,
            "text": "“Are Internet sales stopped from proliferating to a much larger degree?"
        },
        {
            "id": 30,
            "text": "Absolutely."
        },
        {
            "id": 31,
            "text": "Did we create new law?"
        },
        {
            "id": 32,
            "text": "No."
        },
        {
            "id": 33,
            "text": "We expanded on existing law."
        },
        {
            "id": 34,
            "text": "The things the NRA would love are in this bill.”"
        },
        {
            "id": 35,
            "text": "The men have a delicate sales job ahead."
        },
        {
            "id": 36,
            "text": "Pro-gun lawmakers and the NRA could seek to block it or offer amendments to undermine the compromise, and some lawmakers were already vowing they would do so as the legislation begins to move later this week."
        },
        {
            "id": 37,
            "text": "Even if the measure were to pass the Democratic-led Senate, it would face stiff odds in the Republican-led House."
        },
        {
            "id": 38,
            "text": "The Senate is set to vote Thursday on a “motion to proceed” to consider a gun-control bill that will be offered by Majority Leader Harry M. Reid (D-Nev.) and eventually include the Toomey-Manchin proposal."
        },
        {
            "id": 39,
            "text": "Sixty votes are needed to overcome a filibuster threatened by some conservative Republicans, and supporters appear to have secured them."
        },
        {
            "id": 40,
            "text": "The push by Toomey and Manchin to carefully woo conservatives came into play even in the choreography of Wednesday’s announcement."
        },
        {
            "id": 41,
            "text": "Toomey asked Sen. Charles E. Schumer (D-N.Y.) not to appear at the news conference, and he consented, said several aides familiar with the talks."
        },
        {
            "id": 42,
            "text": "The conservative group Heritage Action criticized the bill and its GOP sponsor, issuing a press release Wednesday stating, “We expect more of Pat Toomey.”"
        },
        {
            "id": 43,
            "text": "Coburn was critical, saying the plan would encourage criminals to find loopholes."
        },
        {
            "id": 44,
            "text": "“Why wouldn’t you just make an agreement to make the purchase later after the gun show?” Coburn asked."
        },
        {
            "id": 45,
            "text": ""
        },
        {
            "id": 46,
            "text": "Behind the scenes, gun industry advocates were divided and uncertain, according to people familiar with the deliberations."
        },
        {
            "id": 47,
            "text": "Despite the NRA’s opposition, “we are looking closely at this proposal and examining its merits,” said one longtime industry advocate, speaking on the condition of anonymity to discuss internal thinking."
        },
        {
            "id": 48,
            "text": "Another, Richard Feldman, a former NRA political director and lobbyist for manufacturers, said he is “enthusiastically in support.”"
        },
        {
            "id": 49,
            "text": "Late Wednesday, the NRA’s chief lobbyist wrote to members of the Senate restating opposition to the proposal and other “antigun” measures and vowing to review votes on those proposals and related procedural actions when evaluating a candidate’s suitability for NRA support."
        },
        {
            "id": 50,
            "text": "At the same time, a group recently formed by former congresswoman Gabrielle Giffords (D-Ariz.) and her husband, Mark Kelly, promised to campaign against senators who try to block consideration of the legislation."
        }
    ]
}