{
    "title": "Conservatives Celebrate John Boehner's Exit, But They're Still Mad At Mitch McConnell",
    "text": [
        {
            "id": 0,
            "text": "Credit: J. Scott Applewhite/Associated Press House Speaker John Boehner (R-Ohio) announced he'd be stepping down on Friday."
        },
        {
            "id": 1,
            "text": "Some conservatives want Senate Majority Leader Mitch McConnell (R-Ky.) to go, too."
        },
        {
            "id": 2,
            "text": "WASHINGTON --"
        },
        {
            "id": 3,
            "text": "There are a lot of things conservatives at the Values Voter Summit don't like about House Speaker John Boehner (R-Ohio), who announced his resignation on Friday."
        },
        {
            "id": 4,
            "text": "He has been in politics for too long, some said, and he is too willing to compromise."
        },
        {
            "id": 5,
            "text": "He gives up too easily, rather than fighting for conservative values, they said."
        },
        {
            "id": 6,
            "text": "But there's another person those criticisms apply to: Senate Majority Leader Mitch McConnell (R-Ky.)."
        },
        {
            "id": 7,
            "text": "They're not happy with him, either."
        },
        {
            "id": 8,
            "text": ""
        },
        {
            "id": 9,
            "text": "\"Here's what I say in response to Speaker Boehner stepping down: Mitch McConnell, it is now your turn,\" said Louisiana Gov. Bobby Jindal, a GOP presidential hopeful, to a ballroom full of cheering conservatives."
        },
        {
            "id": 10,
            "text": "\"If Senator McConnell is not willing to fight for our conservative principles, he needs to follow John Boehner's example,\" he said."
        },
        {
            "id": 11,
            "text": "Hundreds of people gathered at a hotel in Washington to hear from GOP candidates, politicians and activists mostly about social issues, such as religious liberty and ending abortion and same-sex marriage."
        },
        {
            "id": 12,
            "text": "Many of them want Congress to do anything possible to reach those goals, including risking a government shutdown in order to cut off federal funds for Planned Parenthood."
        },
        {
            "id": 13,
            "text": "Boehner and McConnell, meanwhile, have indicated they will hold votes to keep the government open without tying them to a fight over abortion -- a betrayal to some social conservatives."
        },
        {
            "id": 14,
            "text": "This month, the senator also drew ire for not changing Senate rules so fewer votes would be needed to pass a bill rejecting the Iran nuclear deal."
        },
        {
            "id": 15,
            "text": "Conservatives will be able to accomplish much more in 2017 with a Republican president, so they should bide their time until then, he said in a recent interview."
        },
        {
            "id": 16,
            "text": "Most conservative politicians discussing Boehner's resignation at Friday's event pivoted to talking about Republican leadership in general -- an unmistakable jab at McConnell, although they stopped short of saying he should step down."
        },
        {
            "id": 17,
            "text": "\"I'm disappointed in both houses."
        },
        {
            "id": 18,
            "text": "I'm disappointed that they haven't done what we sent them here to do,\" said former Arkansas Gov. Mike Huckabee, also a GOP presidential contender."
        },
        {
            "id": 19,
            "text": "\"When people sent them here, they didn't send them to give the president more power on Obamacare, immigration and even trade, and certainly not the Iranian deal,\" Huckabee said."
        },
        {
            "id": 20,
            "text": "\"I know on those four areas alone, the president got more power and Congress didn't exercise much.\""
        },
        {
            "id": 21,
            "text": "Sen. Ted Cruz (R-Texas), another candidate for president, said \"not a darn thing has changed\" since McConnell took over as majority leader earlier this year."
        },
        {
            "id": 22,
            "text": "He said that whether McConnell should resign is a question for the majority leader himself and the GOP conference -- of which he is a member -- but reiterated that he doesn't think the Kentucky Republican is a very faithful conservative."
        },
        {
            "id": 23,
            "text": "\"I've privately urged them, 'Look, stand up and lead."
        },
        {
            "id": 24,
            "text": "I will sing your praises,'\" Cruz told journalists before the event."
        },
        {
            "id": 25,
            "text": "\"I would be thrilled to appear at a press conference and talk about the brave, courageous, principled John Boehner and Mitch McConnell, if they would simply act in a way that I could say that truthfully.\""
        },
        {
            "id": 26,
            "text": "Former Sen. Rick Santorum (R-Pa.), also a presidential candidate, criticized leaders who \"are just focused on making the trains run and getting things done, as opposed to standing up for the that things we need to fight for."
        },
        {
            "id": 27,
            "text": "\" But he skirted the question of whether McConnell should resign."
        },
        {
            "id": 28,
            "text": ""
        },
        {
            "id": 29,
            "text": "\"All I can say is that we have an election coming up, and that's where the real change is going to occur,\" Santorum told reporters, before going on to talk about why he should be elected president."
        },
        {
            "id": 30,
            "text": ""
        },
        {
            "id": 31,
            "text": "Kansas Gov. Sam Brownback (R), who served with McConnell in the Senate for 15 years, declined to say whether he thinks it's time for the majority leader to step down."
        },
        {
            "id": 32,
            "text": "But he did say that conservatives are looking from more from their leaders."
        },
        {
            "id": 33,
            "text": "\"People are very frustrated with the lack of progress in Washington,\" Brownback said."
        },
        {
            "id": 34,
            "text": "\"That's why I think the outsiders are all leading in the presidential campaigns."
        },
        {
            "id": 35,
            "text": "Because it's like, if the guys in there aren't getting it done, I'm going to go somewhere else.\""
        },
        {
            "id": 36,
            "text": "Sen. John McCain (R-Ariz.) just wants his party to get along already."
        },
        {
            "id": 37,
            "text": "\"We're spending our time attacking each other rather than the adversary, which is obviously the Democrats and Hillary Clinton and Barack Obama,\" McCain told reporters."
        },
        {
            "id": 38,
            "text": "\"I hope the lesson to all of us is now, 'Let's stop fighting with each other and sit down together and work out our differences with a common agenda to elect the next president of the United States.'\""
        },
        {
            "id": 39,
            "text": "Advertisement\n\nConservative attendees were all over the board on whether they think McConnell is the right person to be leading the Senate."
        },
        {
            "id": 40,
            "text": ""
        },
        {
            "id": 41,
            "text": "\"He's more verbal than Boehner."
        },
        {
            "id": 42,
            "text": "Like more in his way of speaking, he's pressing issues."
        },
        {
            "id": 43,
            "text": "I like that better than Boehner,\" said Edith Hindle, an elderly woman from Smicksburg, Pennsylvania. \""
        },
        {
            "id": 44,
            "text": "Leave him where he is.\""
        },
        {
            "id": 45,
            "text": "\"He's too moderate for my taste,\" said Timothy O'Neill, a freshman at American University."
        },
        {
            "id": 46,
            "text": "\"He should step down, as long as someone comes in who is going to be a better conservative, someone who isn't going to roll over to the Obama White House."
        },
        {
            "id": 47,
            "text": "I think McConnell and Boehner both do that.\""
        },
        {
            "id": 48,
            "text": "He added, \"I really like Marco Rubio."
        },
        {
            "id": 49,
            "text": "Someone like that should be the leader.\""
        },
        {
            "id": 50,
            "text": "Roger and Nancy Wendt, both 73, were firmly on the anti-McConnell side."
        },
        {
            "id": 51,
            "text": "The Londonderry, New Hampshire, couple said they want Boehner and McConnell out because both are too focused on politics."
        },
        {
            "id": 52,
            "text": "\"I think [McConnell] should have dropped down a long time ago, too, because he is not for our country,\" said Nancy Wendt, a retired teacher."
        },
        {
            "id": 53,
            "text": "\"I don't think he is."
        },
        {
            "id": 54,
            "text": "He's too political.\""
        },
        {
            "id": 55,
            "text": ""
        },
        {
            "id": 56,
            "text": "\"He doesn't seem to have a clue what's important,\" added her husband, a retired engineer."
        }
    ]
}