{
    "title": "Schiff reveals new whistleblower complaint alleging suppression of Russian election interference intel reports",
    "text": [
        {
            "id": 0,
            "text": "The House Intelligence Committee received a whistleblower complaint claiming Trump administration officials at the White House and the Department of Homeland Security suppressed intelligence reports related to Russian election interference, Democratic Committee Chairman Adam Schiff said Wednesday."
        },
        {
            "id": 1,
            "text": "In a statement, Schiff said former Intelligence and Analysis Acting Under Secretary Brian Murphy filed the whistleblower reprisal complaint on Tuesday with the DHS Office of Inspector General."
        },
        {
            "id": 2,
            "text": "“We’ve received a whistleblower complaint alleging DHS suppressed intel reports on Russian election interference, altered intel to match false Trump claims and made false statements to Congress,” Schiff, D-Calif., tweeted Wednesday afternoon."
        },
        {
            "id": 3,
            "text": "“This puts our national security at risk.”"
        },
        {
            "id": 4,
            "text": "He added: “We will investigate.”"
        },
        {
            "id": 5,
            "text": "A spokesman for DHS fired back Wednesday: “The Department generally does not comment on the specifics of OIG referrals, but we flatly deny that there is any truth to the merits of Mr. Murphy’s claim,” the spokesman, Alexei Woltornist, said."
        },
        {
            "id": 6,
            "text": "“DHS looks forward to the results of any resulting investigation and we expect it will conclude that no retaliatory action was taken against Mr. Murphy.”"
        },
        {
            "id": 7,
            "text": "Schiff said that the investigation will come as part of the panel’s probe into alleged “grave” misconduct by White House and DHS officials, and the reprisal against Murphy for making protected disclosures."
        },
        {
            "id": 8,
            "text": "“The whistleblower retaliation complaint filed by former Acting Under Secretary for Intelligence and Analysis Brian Murphy outlines grave and disturbing allegations that senior White House and Department of Homeland Security officials improperly sought to politicize, manipulate, and censor intelligence in order to benefit President Trump politically,” Schiff said in a statement."
        },
        {
            "id": 9,
            "text": "“This puts our nation and its security at grave risk.”"
        },
        {
            "id": 10,
            "text": "Republicans swiftly pushed back against Schiff, who played a prominent role in promoting the account of a whistleblower at the heart of Trump's impeachment case."
        },
        {
            "id": 11,
            "text": "“Yet another whistleblower complaint pushed into the limelight by Schiff, this one coming shortly before a presidential election - anyone who takes this at face value is ignoring Schiff’s long record of perpetuating hoaxes that are extremely similar to this,” a House Republican source told Fox News."
        },
        {
            "id": 12,
            "text": "The committee, though, claims the whistleblower complaint includes a “disturbing pattern of misconduct” by senior Trump administration officials “relating to the activities of DHS’s I&A—an element of the U.S. Intelligence Community which Mr. Murphy led from May until August of this year, before he was reassigned to DHS’s Management Directorate, and where he previously served as Principal Deputy Under Secretary beginning in March 2018.”"
        },
        {
            "id": 13,
            "text": "\"The complaint alleges repeated violations of law and regulations, abuses of authority, attempted censorship of intelligence analysis, and improper administration of an intelligence program related to Russian efforts to influence the U.S. elections,” the committee said."
        },
        {
            "id": 14,
            "text": "Schiff went on to call Murphy’s allegations “serious,” saying they include senior administration officials allegedly “suppressing intelligence reports on Russia’s election interference and making false statements to Congress about terrorism threats at our southern border, to modifying intelligence assessments to match the president’s rhetoric on Antifa and minimizing the threat posed by white supremacists.”"
        },
        {
            "id": 15,
            "text": "\"We have requested Mr. Murphy’s testimony before the Committee, pursuant to subpoena if necessary, alongside other already scheduled interviews with other DHS officials,” Schiff said."
        },
        {
            "id": 16,
            "text": "INTEL COMMUNITY SAYS IRAN SEEKING TO 'UNDERMINE' TRUMP, RUSSIA WORKING TO 'DENIGRATE' BIDEN IN ELECTION"
        },
        {
            "id": 17,
            "text": "Schiff went on to slam the Trump administration for ending briefings to Congress about foreign election interference, claiming it was a “bid to prevent informing the American people and its elected representatives about Russian efforts to help President Trump and hurt Joe Biden.”"
        },
        {
            "id": 18,
            "text": "The Biden campaign, in a statement from spokesman Andrew Bates, said, “If true, these latest revelations cement a pattern of high ranking Trump administration officials not only keeping law enforcement officials and the American people in the dark about assaults on our democracy, but corrupting intelligence processes to benefit the president politically.”"
        },
        {
            "id": 19,
            "text": "The Office of the Director of National Intelligence announced last month that it would scale back in-person election security briefings to Congress in favor of written reports -- amid concerns about leaks of sensitive information."
        },
        {
            "id": 20,
            "text": "An ODNI official told Fox News the office is concerned about \"unauthorized disclosures of sensitive information following recent briefings.\""
        },
        {
            "id": 21,
            "text": "Schiff, though, claimed that the administration was blocking the American people from information that would “protect our national security.”"
        },
        {
            "id": 22,
            "text": "“We will get to the bottom of this, expose any and all misconduct or corruption to the American people, and put a stop to the politicization of intelligence,” Schiff said."
        },
        {
            "id": 23,
            "text": ""
        }
    ]
}