{
    "title": "Beau Biden honored by presidents Obama, Clinton",
    "text": [
        {
            "id": 0,
            "text": ""
        },
        {
            "id": 1,
            "text": "The last two Democratic presidents -- Barack Obama and Bill Clinton -- are praising Beau Biden in the wake of his death from brain cancer."
        },
        {
            "id": 2,
            "text": "Like his father -- Vice President Joe Biden -- Beau \"was a good, big-hearted, devoutly Catholic and deeply faithful man, who made a difference in the lives of all he touched -- and he lives on in their hearts,\" said a statement from President Obama."
        },
        {
            "id": 3,
            "text": "Former President Bill Clinton, along with 2016 presidential candidate Hillary Clinton, called Beau Biden \"a son to be proud of, a brother to cherish, a husband and father to love and be grateful for."
        },
        {
            "id": 4,
            "text": "The pain of his loss is so great because his life was so large and good.\""
        },
        {
            "id": 5,
            "text": "Beau Biden, 46, the twice-elected attorney general of Delaware, was planning a run for the governor's office when he suffered a recurrence of health problems he has had in recent years."
        },
        {
            "id": 6,
            "text": "In his statement, Obama said that \"for all that Beau Biden achieved in his life, nothing made him prouder -- nothing made him happier -- nothing claimed a fuller focus of his love and devotion than his family.\""
        },
        {
            "id": 7,
            "text": "The president and first lady Michelle Obama also praised the vice president and wife Jill."
        },
        {
            "id": 8,
            "text": "\"Joe is one of the strongest men we've ever known,\" the president said."
        },
        {
            "id": 9,
            "text": "\"He's as strong as they come, and nothing matters to him more than family."
        },
        {
            "id": 10,
            "text": "It's one of the things we love about him."
        },
        {
            "id": 11,
            "text": "And it is a testament to Joe and Jill -- to who they are -- that Beau lived a life that was full; a life that mattered; a life that reflected their reverence for family.\""
        },
        {
            "id": 12,
            "text": "Obama cited the Irish poet William Butler Yeats: \"I have believed the best of every man."
        },
        {
            "id": 13,
            "text": "And find that to believe it is enough to make a bad man show him at his best or even a good man swing his lantern higher.\""
        },
        {
            "id": 14,
            "text": "Said the president: \"Beau Biden believed the best of us all."
        },
        {
            "id": 15,
            "text": "For him, and for his family, we swing our lanterns higher.\""
        }
    ]
}