{
    "title": "Poll: Clinton's Lead Over Trump Slips After Florida Shooting ",
    "text": [
        {
            "id": 0,
            "text": "Donald Trump chipped away at Hillary Clinton's lead in the presidential race this week, according to a Reuters/Ipsos poll released on Friday, as the candidates clashed over how to respond to the worst mass shooting in modern U.S. history."
        },
        {
            "id": 1,
            "text": "The poll, conducted from Monday to Friday, showed Clinton, the presumptive Democratic nominee, with a 10.7 point lead among likely voters over Trump, her likely Republican rival in the November presidential election."
        },
        {
            "id": 2,
            "text": "That's down from a lead of 14.3 points for Clinton on Sunday, the day an American-born shooter who declared allegiance to militant group Islamic State killed 49 people at a gay nightclub in Orlando, Florida."
        },
        {
            "id": 3,
            "text": "Trump seized on the attack to sharpen his security proposals, saying he would block immigration to the United States from any country with a \"proven history of terrorism\" against America and its allies if elected."
        },
        {
            "id": 4,
            "text": "The pledge fine-tuned an earlier vow, made after the attacks last year in Paris and California, to ban the entry of all Muslims into the United States."
        },
        {
            "id": 5,
            "text": "He also called for measures to make it more difficult for suspected terrorists to obtain firearms, veering from the Republican Party's general opposition to gun control."
        },
        {
            "id": 6,
            "text": "While Trump's comments on both Muslims and guns dismayed some Republican elites, they may have cheered some voters."
        },
        {
            "id": 7,
            "text": "Some 45 percent of Americans said they supported Trump's idea to suspend Muslim immigration, up from 41.9 percent at the start of the month, according to the poll."
        },
        {
            "id": 8,
            "text": "Meanwhile, about 70 percent of Americans, including a majority of Democrats and Republicans, said they wanted to see at least moderate regulations and restrictions on guns, up from 60 percent in similar polls in 2013 and 2014."
        },
        {
            "id": 9,
            "text": "Clinton focused her response to the Orlando attack on the need to boost intelligence gathering and defeat Islamic State and what she called \"radical jihadist terrorism,\" while warning against demonizing Muslim-Americans."
        },
        {
            "id": 10,
            "text": "She also repeated her calls for tougher gun control measures, including a ban on assault weapons."
        },
        {
            "id": 11,
            "text": "As usual after a major attack, \"terrorism\" jumped to the top concern among all adults in the poll - rising above the economy, health care and other major issues."
        },
        {
            "id": 12,
            "text": "The poll's five-day average showed that 45.5 percent of likely American voters supported Clinton, while 34.8 percent supported Trump, and another 19.7 percent did not support either candidate."
        },
        {
            "id": 13,
            "text": "On Sunday, Clinton's support was at 46.6 percent, versus Trump's 32.3 percent."
        },
        {
            "id": 14,
            "text": "The Reuters/Ipsos poll was conducted online in English with adults living in the continental United States, Alaska and Hawaii."
        },
        {
            "id": 15,
            "text": "The political horserace poll included 1,133 likely voters and has a credibility interval, a measure of the poll's accuracy, of 3.4 percentage points."
        }
    ]
}