{
    "title": "Barack Obama to 2020 Graduates: Current Leaders ‘Aren’t Even Pretending to Be in Charge’",
    "text": [
        {
            "id": 0,
            "text": "Former President Barack Obama said in a commencement speech on Saturday that current leaders during the coronavirus crisis were failing 2020 graduates."
        },
        {
            "id": 1,
            "text": "“More than anything this pandemic has fully finally torn back the curtain on the idea that so many of the folks in charge know what they’re doing,” he said."
        },
        {
            "id": 2,
            "text": "“A lot of them aren’t even pretending to be in charge.”"
        },
        {
            "id": 3,
            "text": "The former president did not directly criticize Donald Trump, but he repeatedly referred to leaders currently in power."
        },
        {
            "id": 4,
            "text": "“Broad majorities agree on the ends,” he said, urging graduates to seek unity."
        },
        {
            "id": 5,
            "text": "“That’s why folks with power will keep trying to divide you over the means."
        },
        {
            "id": 6,
            "text": "That’s how nothing changes.”"
        },
        {
            "id": 7,
            "text": "The former president spoke online to recognize historic black college and university graduates on Saturday, offering a 2020 commencement speech for those who were unable to graduate due to the coronavirus."
        },
        {
            "id": 8,
            "text": "“Even though half of the semester was spent in Zoom university, you’ve earned this moment."
        },
        {
            "id": 9,
            "text": "You should be very proud,” he said."
        },
        {
            "id": 10,
            "text": "The president was joined by celebrities Kevin Hart, Steve Harvey, Chris Paul, Debbie Allen, Common the rapper, and Vivica Fox, as well as national politicians such as Sen. Kamala Harris and Sen. Tim Scott."
        },
        {
            "id": 11,
            "text": "Obama urged graduates to fight for “economic and environmental justice and health care for everyone” and to fight the “system that looks out for the rich and the powerful and nobody else.”"
        },
        {
            "id": 12,
            "text": "He said that the virus only enhanced the understanding that the black community continues to suffer inequality in the United States, but that they should reach out and find others who suffered the same struggle."
        },
        {
            "id": 13,
            "text": "“Meaningful change requires allies and common cause."
        },
        {
            "id": 14,
            "text": "As African Americans we are particularly attuned to injustice, inequality, and struggle but also that should make us more alive to other experiences of others,” he said."
        },
        {
            "id": 15,
            "text": "Obama urged graduates to stand up for immigrants, refugees, the rural poor, the LGTB community, low-income workers, and women."
        },
        {
            "id": 16,
            "text": "The president also referenced 25-year-old Ahmaud Arbery, noting that the injustice of “a black man goes for a jog and some folks think they can stop and question and shoot him if he does not submit to their questioning.”"
        },
        {
            "id": 17,
            "text": "He said the same struggles were not new in the United States and asked all graduates to do their part to fight."
        },
        {
            "id": 18,
            "text": "“What is new is that so much of your generation has woken up to the fact that the status quo needs fixing,” he said."
        }
    ]
}