{
    "title": "CPAC 2013: We will not be demonized, and we will not be silent, LaPierre says",
    "text": [
        {
            "id": 0,
            "text": "National Rifle Association Executive Vice President and CEO Wayne LaPierre struck a defiant tone during an address Friday morning at the Conservative Political Action Conference, saying that advocates of the Second Amendment will never back down, despite the “elitists” who constantly denigrate and mock them."
        },
        {
            "id": 1,
            "text": "“As you can imagine, I don’t get invited to many parties in this town,” he said."
        },
        {
            "id": 2,
            "text": "“I didn’t come here to be popular — I came here to stand for what I believe in.”"
        },
        {
            "id": 3,
            "text": "Mr. LaPierre slammed politicians and members of the media for denigrating gun-rights activists like members of the NRA."
        },
        {
            "id": 4,
            "text": "The Second Amendment, he said, is not just “some words on parchment,” but that “it lies at the heart of what this country was founded upon.”"
        },
        {
            "id": 5,
            "text": "“But they insult."
        },
        {
            "id": 6,
            "text": "They denigrate."
        },
        {
            "id": 7,
            "text": "They call us crazy for holding fast to that belief,” he said."
        },
        {
            "id": 8,
            "text": "“In their distorted view of the world, they’re smarter than we are."
        },
        {
            "id": 9,
            "text": "They’re special."
        },
        {
            "id": 10,
            "text": "They’re more worthy than we are."
        },
        {
            "id": 11,
            "text": "They know better than we do, and if we dare disagree, they’ll scorn us, they’ll demonize us, and they’ll try to shut us up.”"
        },
        {
            "id": 12,
            "text": "“We will not be demonized, and we will not be silent,” he said."
        },
        {
            "id": 13,
            "text": "Mr. LaPierre has become among the most prominent faces of opposition to President Obama’s push for gun-control measures in the wake of the December shooting deaths of 20 children and six adults at Sandy Hook Elementary School in Newtown, Conn."
        },
        {
            "id": 14,
            "text": "The group has advocated placing armed security in every school in the country — an idea Mr. LaPierre repeated Friday."
        },
        {
            "id": 15,
            "text": "“There’s not a mom or a dad anywhere who wouldn’t feel safer seeing a police car in the parking lot when they drop their kids off at school,” he said."
        },
        {
            "id": 16,
            "text": "“They call me crazy, but the people doing the finger-pointing are saying these things that are absolutely bizarre.”"
        },
        {
            "id": 17,
            "text": "The Senate Judiciary Committee this week sent the broadest gun legislation in decades — a ban on certain so-called assault weapons and high capacity magazines — to the full body for consideration."
        },
        {
            "id": 18,
            "text": "But Mr. LaPierre said members of the NRA and gun owners across the country “will not back down, ever."
        },
        {
            "id": 19,
            "text": "And I can promise you that.”"
        },
        {
            "id": 20,
            "text": "“No matter what the elitists who scorn you say, let them be damned,” he said."
        },
        {
            "id": 21,
            "text": "“Now and for the rest of your life, always stand and always fight for our American freedoms.”"
        }
    ]
}