{
    "title": "Donald Trump: Sonia Sotomayor and Ruth Bader Ginsburg Should Recuse from Trump-Related Supreme Court Cases",
    "text": [
        {
            "id": 0,
            "text": "President Donald Trump said Justices Sonia Sotomayor and Ruth Bader Ginsburg should recuse themselves from cases involving his administration, as a result of their past anti-Trump comments."
        },
        {
            "id": 1,
            "text": "“I just don’t know how they can not recuse themselves for anything having to do with Trump or Trump-related,” he said."
        },
        {
            "id": 2,
            "text": "Trump pointed to Justice Sotomayor for her comments criticizing his administration’s relationship with the Supreme Court."
        },
        {
            "id": 3,
            "text": "After the Supreme Court granted the Trump administration’s request to stay an injunction against the new public charge law, Sotomayor subtly criticized conservative justices on the court for siding with Trump in the majority of “emergency” immigration cases."
        },
        {
            "id": 4,
            "text": "“Perhaps most troublingly, the Court’s recent behavior on stay applications has benefited one litigant over all others,” she wrote."
        },
        {
            "id": 5,
            "text": "Trump said that her remarks were “terrible” and unfit for the Supreme Court."
        },
        {
            "id": 6,
            "text": "“A Supreme Court Justice is a different standard but at the same time I think it’s a higher standard in a certain sense,” Trump said."
        },
        {
            "id": 7,
            "text": "He criticized Sotomayor for trying to shame her fellow justices into ruling against his administration."
        },
        {
            "id": 8,
            "text": "“She’s trying to shame people with perhaps a different view into voting her way, and that’s so inappropriate,” he said."
        },
        {
            "id": 9,
            "text": "The president also referred to Justice Ginsberg’s comment he was a “faker” in 2016 after admitting afterward the comment was “ill-advised” and she would avoid commenting on a candidate for president in the future."
        },
        {
            "id": 10,
            "text": "Trump also spoke about the bias from the two justices on Twitter."
        }
    ]
}