{
    "title": "Trump adviser says former president will return to social media within months",
    "text": [
        {
            "id": 0,
            "text": "Former Trump administration senior adviser Jason Miller said Sunday that the former president plans to return to social media in the coming months with his “own platform.”"
        },
        {
            "id": 1,
            "text": "Miller told Fox News’s Mediabuzz that Trump was “returning to social media in two or three months” with “his own platform.”"
        },
        {
            "id": 2,
            "text": "Miller also added the platform would “completely redefine the game” and rake in “tens of millions” of users."
        },
        {
            "id": 3,
            "text": "The Hill has reached out to Trump’s representatives for comment."
        },
        {
            "id": 4,
            "text": ""
        },
        {
            "id": 5,
            "text": "The news comes months after Trump's Twitter account was permanently suspended following posts made in early January that the platform determined posed the risk of “incitement of violence” in the wake of the deadly insurrection at the U.S. Capitol."
        },
        {
            "id": 6,
            "text": "Trump, who had frequently posted on the platform before and during his presidency, had initially been temporarily suspended from Twitter after the social media platform determined that posts he made about the riot were determined to have violated the site’s guidelines."
        },
        {
            "id": 7,
            "text": "Droves of his supporters overran the Capitol as Congress worked to certify Electoral College votes that affirmed his defeat in the presidential election."
        },
        {
            "id": 8,
            "text": "During the insurrection, Trump tweeted asking his supporters to \"remain peaceful\" and support law enforcement who his supporters rushed past to break into the Capitol."
        },
        {
            "id": 9,
            "text": "A Capitol Police officer died as a result of the riot."
        },
        {
            "id": 10,
            "text": "The temporary suspension marked the first time that Twitter, which had been flagging certain posts Trump made containing misinformation in the weeks leading up to the January riot, locked the then-president out of his account."
        },
        {
            "id": 11,
            "text": "Not long after the temporary suspension, Twitter announced it would make the ban permanent, iting the “risk of further incitement of violence” posed by the then-president’s posts."
        },
        {
            "id": 12,
            "text": "In an interview last month, Twitter’s chief financial officer, Ned Segal, said the company’s ban on his account will remain even if he decides to run again for office."
        },
        {
            "id": 13,
            "text": "“The way our policies work, when you're removed from the platform, you're removed from the platform whether you're a commentator, you're a CFO or you are a former or current public official,” Segal said."
        },
        {
            "id": 14,
            "text": "Facebook and YouTube are also among the companies that placed suspensions on Trump’s accounts on their platforms after the Capitol riot."
        }
    ]
}