{
    "title": "10 Senators Say They Agree On Infrastructure 'Framework' — But There Are Few Details",
    "text": [
        {
            "id": 0,
            "text": "10 Senators Say They Agree On Infrastructure 'Framework' — But There Are Few Details\n\nEnlarge this image toggle caption Samuel Corum/Getty Images Samuel Corum/Getty Images"
        },
        {
            "id": 1,
            "text": "A bipartisan group of 10 U.S. senators says they agree on a \"framework\" for a deal on an infrastructure package, but the members did not release any details and top leaders from both parties have been mostly silent on the development."
        },
        {
            "id": 2,
            "text": "According to two sources familiar with the negotiations, the agreement is focused on \"core, physical infrastructure."
        },
        {
            "id": 3,
            "text": "\" The proposal would cost $1.2 trillion over eight years and include $579 billion in new spending."
        },
        {
            "id": 4,
            "text": "The plan would not have any tax hikes, and aides did not provide any further details on how the costs would be offset."
        },
        {
            "id": 5,
            "text": "In a short statement, the group of five Republicans and five Democrats didn't give any details on the size or scope of the proposal but said it would be \"fully paid for and not include tax increases.\""
        },
        {
            "id": 6,
            "text": "\"We are discussing our approach with our respective colleagues, and the White House, and remain optimistic that this can lay the groundwork to garner broad support from both parties and meet America's infrastructure needs,\" the statement said."
        },
        {
            "id": 7,
            "text": "In a statement, White House deputy press secretary Andrew Bates said that President Biden \"appreciates the Senators' work,\" but added that \"[q]uestions need to be addressed, particularly around the details of both policy and pay-fors, among other matters.\""
        },
        {
            "id": 8,
            "text": "The group's 10 senators are: Bill Cassidy, R-La., Susan Collins, R-Maine, Joe Manchin, D-W.Va., Lisa Murkowski, R-Alaska, Rob Portman, R-Ohio, Mitt Romney, R-Utah, Jeanne Shaheen, D-N.H., Kyrsten Sinema, D-Ariz., Jon Tester, D-Mont., and Mark Warner,"
        },
        {
            "id": 9,
            "text": "D-Va."
        },
        {
            "id": 10,
            "text": "Sinema launched the talks with Romney."
        },
        {
            "id": 11,
            "text": "Senators have wrapped up business for the weekend so it's unclear whether there will be any additional updates or new details until the framework is fleshed out."
        },
        {
            "id": 12,
            "text": "The group has not indicated whether their respective party leaders are on board with the proposal — a key factor in determining whether this scaled-back approach would have any momentum in the evenly divided Senate and House."
        },
        {
            "id": 13,
            "text": "Progressive Democrats have already complained about discussing a smaller package and are pushing for Democrats to move ahead on a plan without Republicans."
        },
        {
            "id": 14,
            "text": "The latest developments come two days after Biden ended his infrastructure talks with Senate Republicans led by West Virginia's Shelley Moore Capito."
        },
        {
            "id": 15,
            "text": "In explaining the decision, White House press secretary Jen Psaki said \"the latest offer from [Capito's] group did not, in his view, meet the essential needs of our country to restore our roads and bridges, prepare us for our clean energy future, and create jobs.\""
        },
        {
            "id": 16,
            "text": "Biden originally proposed a more than $2 trillion infrastructure and jobs plan, in addition to a separate proposal on education, child care and paid leave."
        }
    ]
}